{"doc_name": "doc_c_DefineCustomDocProps.pdf", "doc_path": "data/raw/RPD-en-US/doc_c_DefineCustomDocProps.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 8858, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Defining custom document properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Defining custom document properties\nDefining custom document properties\nYou use custom document properties to extract data from each document in a job. First you define the custom document properties in RICOH\nProcessDirector, and then you map data in the documents to the document properties. As a job goes through the workflow, the\nIdentifyPDFDocuments step (PDF files) or IdentifyDocuments step (AFP files) extracts the data.\nIdentify data that you want to extract from documents. If RICOH ProcessDirector supplies an appropriate document property, use it instead of\ndefining a custom document property.\nFor example, you want to extract account number, customer name, email address, and statement date from each document in a job. RICOH\nProcessDirector supplies a document property, Email address, for extracting email addresses. You define custom document properties for account\nnumber, customer name, and statement date.\nNote:\nIf you use custom document properties, starting with Version 3.11.2, you can create them on the Administration tab, using Objects ⇒\nCustom Properties.\nYou can choose the database name and the label that displays in property notebooks and column headings. You can also choose what\nkind of data to store in the property, and the default access that the different user groups have for the property, without adding them to\nthe docCustomDefinitions.xml file.\nFor more information, see the topics Custom properties and Creating and activating custom properties.\nIf you already have custom document properties defined in a docCustomDefinitions.xml file, you can continue to use them. Do\nnot re-create them from the Administration tab. Only use that tab to create new job or document properties.\nIf you want to use the new function made available in RICOH ProcessDirector in Version 3.11.2 to create a custom property:\nPlan the properties as mentioned in steps 1-5 mentioned below.\nContinue with the step defined in Creating and activating custom properties.\nTo define custom document properties:\n1. Choose the type of custom document property:\nDatabase property\nLimited property\nFor more information about each type of custom document property and how to define them, see the topic about the\ndocCustomDefinitions.xml file in the information center.\n2. Choose a database (internal) name for the custom document property.\nFor example, define a custom document property with the database name Doc.Custom.AccountNumber.\nNote:\nWe recommend that the database names of your custom document properties start with Doc.Custom. If you do not use this\nnaming convention, verify that none of your custom document properties have the same database name as a document property\nsupplied with RICOH ProcessDirector.\nDo not use a number immediately after the period (.) in the database name. For example, the database name\nDoc.3rdLineAddress is not valid.\nDo not delete custom document properties after you add them to the docCustomDefinitions.xml file.\nDo not change the name (database name), dataType, or dbType of a custom document property. The system lets you change\ncaption (user interface name), shortCaption, description, and access.\n3. Choose a user interface name (caption) for the custom document property.\nFor example, define a custom document property with the user interface name Account number.\nNote:\nWe recommend that you do not define a custom document property with the same user interface name as a document property\nsupplied by RICOH ProcessDirector.\n4. Choose a datatype (dataType) for the custom document property.\nExamples include String, Integer, IntegerNonNeg, and Timestamp.\n5. For database properties:\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:15 PM Defining custom document properties - Jenski - Test portal- RPD Linux\n1. Choose a database type (dbType).\nFor the String datatype, database types are char, varchar, and long varchar.\nFor the Integer datatype, database types are smallint, bigint, and integer.\nFor the Timestamp datatype, the database type is Timestamp.\n2. Choose the level of access that users have to the custom document property:\nattrWriteAdmin\nMembers of the Administrator security group have write access. Members of the Monitor, Operator, and Supervisor security groups\nhave read access.\nattrWriteAdminSuper\nSupervisors and Administrators have write access. Monitors and Operators have read access.\nattrWriteAdminSuperOper\nOperators, Supervisors, and Administrators have write access. Monitors have read access.\nIf you do not specify an access level, Administrators have write access. Monitors, Operators, and Supervisors have read access.\nNote:\nIf you created your own security groups, they receive the same access to custom document properties as the RICOH\nProcessDirector security groups that you copied to create your groups.\n3. Choose a short caption.\nThe short caption is displayed in table column headings.\nFor example, define a custom document property with the short caption Acct Nmbr.\n4. Choose a description.\nThe user interface displays the description as help for the custom document property.\nFor example, define a custom document property with the description Customer account number.\n6. Edit the document properties configuration file:\nThe first time that you define custom document properties, make a copy of the supplied sample file. Go to this directory:\n/aiw/aiw1/samples/config on Linux\nC:\\aiw\\aiw1\\samples\\config on Windows\nWhen you define more document properties, make a copy of the active file. Go to this directory:\n/aiw/aiw1/config on Linux\nC:\\aiw\\aiw1\\config on Windows\n7. Copy the docCustomDefinitions.xml file to a working directory, and edit the file.\nKeep a backup copy of the edited file for recovery purposes.\nFor example, these lines add two database document properties with the database names Doc.Custom.AccountNumber and\nDoc.Custom.StatementDate to the file:\n<docProperty name=\"Doc.Custom.AccountNumber\"\ndatatype=\"String\"\ndbType=\"varchar (32)\"\naccess=\"attrWriteAdmin\"\nshortCaption=\"Acount number\"\ncaption=\"Account number\"\ndescription=\"Customer account number\"/>\n<docProperty name=\"Doc.Custom.StatementDate\"\ndatatype=\"Timestamp\"\ndbType=\"Timestamp\"\naccess=\"attrWriteAdmin\"\nshortCaption=\"Statement date\"\ncaption=\"Statement date\"\ndescription=\"The date the statement was created\"/>\nNote:\nThe name line defines the database name. The caption line defines the user interface name.\nThese lines add two limited document properties with the internal names Doc.Custom.SSNumber and Doc.Custom.CheckAmt to the file:\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:15 PM Defining custom document properties - Jenski - Test portal- RPD Linux\n<limitedProperties>\n<docProperty name=\"Doc.Custom.SSNumber\"\ndatatype=\"String\"\ncaption=\"Social Security number\"/>\n<docProperty name=\"Doc.Custom.CheckAmt\"\ndatatype=\"String\"\ncaption=\"Check total\"/>\n</limitedProperties>\n8. Use an XML editor to validate your syntax.\n9. Copy the edited file to:\n/aiw/aiw1/config/docCustomDefinitions.xml (Linux)\nC:\\aiw\\aiw1\\config\\docCustomDefinitions.xml (Windows)\n10. To have any new document properties display correctly on the user interface, edit the docCustomDefinitions.properties file for one or\nmore languages. If you do not define labels for the new properties in this file, you will only see database names for the properties on the\nuser interface. See Naming custom document properties in more than one language for the steps to edit the file.\n11. Make the custom document properties that you have defined available to RICOH ProcessDirector:\n1. Run the docCustom utility.\nThe first time that you run the docCustom utility, it creates the Custom Document Properties feature and adds it to Feature Manager.\nWhen you run the utility again, it adds an updated Custom Document Properties feature to Feature Manager.\n2. Use Feature Manager to install or update the Custom Document Properties feature.\n12. Load the RICOH ProcessDirector updated custom document properties to the tool you use to configure document properties:\nIf you have the PDF Document Support feature, load RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in for\nAdobe Acrobat.\nFor more information, see the related topic in the information center.\nIf you have the AFP Support feature, use one of these methods to start RICOH Visual Workbench:\nStart RICOH Visual Workbench from the RICOH ProcessDirector server.\nReplace the RICOH Visual Workbench application on your desktop:\nDelete the VisualWorkbench.zip file and all of the unzipped files.\nDownload the VisualWorkbench.zip file from the RICOH ProcessDirector user interface.\nUnzip the file, and start the new RICOH Visual Workbench desktop application.\nThe document properties are loaded automatically.\nParent topic: Configuring document processing features\n3 of 3"}]}