{"doc_name": "aiw00c16.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c16.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3115, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM External steps - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / External steps\nExternal steps\nRICOH ProcessDirector lets you add steps that run a program outside of RICOH ProcessDirector. The external program can do special job-\nprocessing tasks and it can run on the same computer that has the RICOH ProcessDirector base product installed. It can also run on a Linux\nsystem that has a RICOH ProcessDirector secondary server feature installed, or on a Windows system that has an application server installed on it.\nBecause the processing is external to the processing that the RICOH ProcessDirector-provided steps do, this type of processing is called an\nexternal step.\nExternal steps can access files in the spool directory for the job. When RICOH ProcessDirector creates a job from an input file, it creates a unique\nspool directory. The spool directory contains a copy of the input file and other files that provide information about the job. External steps can call\nprograms that update existing files in the spool directory and write new files to the directory.\nThe default spool directory for a job is /aiw/aiw1/spool/default/JobNumber (JobNumber is the spool ID that RICOH ProcessDirector assigns to\nthe job).\nOn an application server, the spool directory is mounted on the drive that you chose when you installed the application server. The default is\nZ:\\aiw1\\spool\\default\\JobNumber.\nYou can also create additional spool directories. These spool directories have names in this format: /aiw/aiw1/spool/SpoolName/JobNumber\n(SpoolName is the subdirectory name that the authorized user defined).\nThe programs that the external steps call can also create child jobs. The spool directory contains a\n/aiw/aiw1/spool/default/JobNumber/children subdirectory or a /aiw/aiw1/spool/SpoolName/JobNumber/children directory that\nexternal program can use to write its child jobs and their associated files. After it detects the child jobs and files, RICOH ProcessDirector can\ncontinue to process them.\nIn this section:\nSetting up external programs\nBefore you start the configuration tasks for an external step, you need to set up the external program that the external step calls.\nSetting up step templates for external steps\nYou create a step template that contains the command that calls the external program. Then, you tune the step template so that it will run on\nthe Linux or Windows system on which the external program is installed.\nSetting up workflows for external steps\nAfter you create a step template to call an external program and tune the step template to run on the server that the external program is\ninstalled on, you add a step that is based on the step template to a workflow. You then assign the workflow to an input device, or use another\nmethod to assign the workflow to specific jobs.\nTesting external step processing\nAfter you set up step templates for external steps and add steps to workflows, configure the method of workflow assignment and run test jobs\nbefore you run any production jobs.\nParent topic: Preparing to use workflows\n1 of 1"}]}