{"doc_name": "ConfiguringJobTypesToProcessDocuments.pdf", "doc_path": "data/raw/RPD-en-US/ConfiguringJobTypesToProcessDocuments.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3022, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Workflow to print jobs created in the Documents table - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Workflow to print jobs created in the Documents table\nWorkflow to print jobs created in the Documents table\nTo print jobs that you create from documents in the Documents table, define a workflow that contains steps to create a job from the document,\nprint the job, and do any other processing steps required. You select the workflow in the Workflow field on the Create a Job page when you use\nthe Create Job action.\nNote:\nDocuments from different jobs cannot be combined to create a single new job. If you choose documents from three different jobs and\nuse the Create Job action, three new jobs are created.\nWorkflows that process jobs created in the documents table must contain certain step templates. Some of those step templates are included with\nthe base product and others are installed with document processing features. Instead of defining a new workflow, you can use one of the\nsupplied workflows that are installed by the document processing features, such as PrintInsert_1, PrintDocuments, and SortPDF. Compare the\nsteps included in those workflows to the required steps below. Add and change steps as needed to make sure that the workflow contains the\nrequired steps and the steps needed to process your jobs.\nThe steps that must be included in a workflow that processes jobs created from documents in the documents table are:\nSetJobPropsFromTextFile\nSets job properties using a text file that accompanies the input file. The value of the Input datastream property must be set correctly on this\nstep, so that it matches the data stream of the documents in the job.\nIn the Job name property, type text such as Reprint Job or ${Job.ID} to set the job name equal to the job number. Do not type\n${Job.InputFile} to set the job name equal to the name of the input file, because no input file exists for jobs created from the documents\ntable.\nBuildAFPFromDocuments (Required only for AFP jobs processed by RICOH ProcessDirector.)\nBuilds a job from documents. If you use the Enhance AFP function to create a control file, this step uses that control file to modify the\ndocuments.\nBuildPDFFromDocuments (Required only for PDF jobs.)\nBuilds a job from documents. If you use RICOH ProcessDirector Plug-in for Adobe Acrobat to create a control file, this step uses that control file\nto modify the documents.\nEnableRepositioning (Required only for AFP jobs processed by RICOH ProcessDirector.)\nMaps logical pages to physical sheets.\nCreatePageRanges\nPrepares the job so that parts of it can be reprinted instead of reprinting the entire job.\nPrintJobs\nSends the job to the printer.\nRemoveJobs\nRemoves the job from the system.\nYou can add other steps to the workflow as needed, including steps provided by the document processing features, such as:\nCreateReprints\nInsertJobs\nReadBarcodeData\nReconcile\nSortDocuments\n.\nParent topic: Preparing to use workflows\n1 of 1"}]}