{"doc_name": "mcc_c_PrepToSendStatus.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_PrepToSendStatus.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3768, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Preparing to send status to MarcomCentral - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral / Preparing to send status to MarcomCentral\nPreparing to send status to MarcomCentral\nTo send status to a store at the MarcomCentral website, copy the MarcomCloseoutOrders SOAP web service notification supplied with the\nMarcomCentral Connect feature. The Request URL and Request payload properties of the notification are set to call the Order Closeout\nMarcomCentral web service and send the ID of the completed order. Set other properties to values that work with your MarcomCentral store and\nRICOH ProcessDirector workflows.\nBefore you define the notification:\nPlan how to process the orders, including how to map XML elements in the orders to RICOH ProcessDirector job properties using an XSLT style\nsheet.\nPrepare to call MarcomCentral web services.\nDefine the workflow that processes MarcomCentral orders.\nFor more information, see the related tasks.\nNote:\nAnother way to send status is with a CallSOAPService step. For example, you can use a CallSOAPService step to call the Order Closeout\nweb service. Put the step in your order workflow after the WaitForRelatedJobs step. If you use a CallSOAPService step to send closeout\nstatus, do not copy and modify the MarcomCloseoutOrders notification.\nTo prepare to send status to MarcomCentral:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Notifications.\n3. Copy the MarcomCloseoutOrder notification and give it a new name.\n4. On the Request tab:\n1. Set the Use proxy property to the proxy server (if any) that you use to communicate with the web service.\n2. Set the SOAP request property to the CloseoutByOrder SOAP request that you imported.\nIf you prepended MyStore to the names of the SOAP requests when you imported them, set the property to MyStore-\nCloseoutByOrder.\n3. To send more closeout information to MarcomCentral, add the appropriate XML to the Request payload property.\nFor example, you can add XML for invoicing, packing slips, and settlements.\nNote:\nIf you change the payload, we recommend running a manual test using a browser plug-in, such as Boomerang for Google\nChrome. For more information, see the task for preparing to call MarcomCentral web services.\n4. Use the default values for all other properties on the Request tab.\n5. On the Authentication tab:\n1. Set the Static credential property to your MarcomCentral closeout token.\n2. Leave the values of all other properties blank.\n6. On the Event and Conditions tabs, specify the job property or combination of job properties to trigger the notification to MarcomCentral.\nFor example:\nYou added a ShipOrder step based on the ManualStepWithAutoStart step template to your order workflow. Your warehouse staff\ncompletes the step when the order reaches the shipping department.\nYou want the notification to monitor the Current step property for jobs in your order workflow.\nWhen the value of the Current step property for the order job changes to ShipOrder, you want the notification to call the Order Closeout\nMarcomCentral web service.\nOn the Event tab, set Property to Current step, Action to Changes to, and Value to ShipOrder.\nOn the Conditions tab, change the Value property to the name of your order workflow.\n7. When you finish editing the properties, click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Preparing to send status to MarcomCentral - Jenski - Test portal- RPD Linux\nAfter you set up an input device, workflows for orders and job tickets, and a notification, you can retrieve and process MarcomCentral orders.\nYou can notify your MarcomCentral store when the orders complete the process.\nParent topic: Setting up to process orders from MarcomCentral\n2 of 2"}]}