{"doc_name": "addingeditstep.pdf", "doc_path": "data/raw/RPD-en-US/addingeditstep.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4426, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Adding steps to edit AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Adding steps to edit AFP files\nAdding steps to edit AFP files\nAfter you create barcodes, text, or hidden areas in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more\nworkflows to create barcodes, text, or hidden areas in production AFP files that use the workflows. The step names the Visual Workbench\ncontrol file that contains the definitions for the barcodes, text, or hidden areas.\nYou can base the step on the EditAFP step template. When you configure the step, you can choose to first create any page groups and index\ntags that are defined in the same control file. The barcodes, text, and hidden areas can depend on the page groups or index tags defined in the\ncontrol file being created first.\nPosition the step relative to these steps if they are present:\nAfter a step that converts line data to AFP format (for example, after the ConvertLineDataJobIntoAFP step)\nAfter a step that converts Xerox data to AFP format\nBefore a step that transforms AFP files into another format (for example, before the TransformJobIntoPDF step)\nBefore the EnableRepositioning step if you configure the EditAFP step to create page groups and index tags\nBefore the PrintJobs step\nAfter a step based on the IndexAFP step template (unless using Index first)\nAfter a step that changes the property values in the barcode\nNote:\nIf you created fixed-length page groups with the IndexAFP step template, you can use the EditAFP step template to enhance AFP files\nthat the RICOH ProcessDirectorTransform Features create.\nTo add a step to edit AFP files:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\nIf you prefer to modify a copy of the workflow, right click it and choose Copy. Name the copy of the workflow, fill in or edit other values\nthat you need, and click Continue.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name. If you do not disable the workflow while you edit\nit, jobs that use this workflow continue to move through steps. When you save, the workflow is momentarily disabled then enabled again.\nJobs that are processing in the workflow could move into error.\n4. In the workflow editor, click Step Templates in the top right corner of the window.\n5. Select the EditAFP step template and drag it into the workflow editor. Place the step where you want it.\n6. Connect the EditAFP step to other steps.\n7. Right-click the step and select Properties.\n8. If necessary, change the General properties.\n9. Click AFP.\n10. In the Visual Workbench control file field, type the path and file name of the Visual Workbench control file that contains the definitions to\ncreate the page groups, index tags, barcodes, text, and hidden areas.\nNote:\nIf you want to use the same workflow for input files that require different control files, you can use symbolic notation for the name\nof the control file. For example, if you have two input files, abc.afp and xyz, with corresponding control files, abc.afp.ctl and\nxyz.ctl, and you want to use the same workflow for both files, you can use ${Job.InputFile}.ctl as the control file in the\nVisual Workbench control file field. ${Job.InputFile}.ctl causes RICOH ProcessDirector to set the value of the Visual\nWorkbench control file to the name of the input file plus the .ctl extension.\n11. If the control file contains definitions to create page groups and index tags, you might want to select Yes in the Index first field.\nNote:\nDo not select Index first if the IndexAFP step and the EditAFP step run in different phases. For example, if a barcode contains the\ndocument sequence and another step in the workflow sorts the documents in a different order, you might put the IndexAFP step in\nthe Prepare phase and then put the EditAFP step after the build step in the Assemble phase.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:10 PM Adding steps to edit AFP files - Jenski - Test portal- RPD Linux\n12. If you select Yes in the Index first field, remove any step from the workflow that is based on the IndexAFP step template because the Index\nfirst option and the IndexAFP step provide the same function. (It is more efficient to select Yes in the Index first field than to run an\nIndexAFP step.)\n13. Click OK.\n14. Save and enable the workflow.\nParent topic: Preparing to use workflows\n2 of 2"}]}