{"doc_name": "pdfw_c_plugin_statistic_rule.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_statistic_rule.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2900, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Using statistics in rules - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with rules / Using statistics in rules\nUsing statistics in rules\nYou can compare a statistic to a static value, such as a number or word, or to a dynamic value, such as a job property, document property, or\nstatistic.\nFor example, you want to create a barcode on the third page of every document. You select the Stat.CurrentPageInDocument statistic, select =\nas the mathematical symbol, and type 3 in the Text field. The fifth condition in the Figure Rule with multiple conditions specifies a statistic.\nThe table below describes the available statistics.\nStatistics options for rules\nKeyword Level Definition\nStat.TotalDocumentsInJob Print job The total number of documents in the current print job.\nStat.TotalSheetsInJob Print job The total number of sheets in the current print job.\nStat.TotalPagesInDocument Document The total count of pages in the current document.\nStat.TotalSheetsInDocument Document The total count of sheets in the current document.\nStat.CurrentDocumentInJob Document The number of the current document in its print job, starting\nat 1. For example, the value of Stat.CurrentDocumentInJob\nfor the third document is 3.\nStat.CurrentPageInDocument Page The number of the current page in its document, starting at\n1. For example, the value of Stat.CurrentPageInDocument\nfor the second page in a document is 2.\nStat.CurrentSheetInDocument Page The number of the current sheet in its document, starting at\n1.\nStat.CurrentPageInJob Page The number of the current page in its print file, starting at 1\nand always from the Start page of the job. For example, the\nvalue of Stat.CurrentPageInJob for the tenth page in the\nprint file is 10.\nStat.CurrentSheetInJob Page The number of the current sheet in its print file, starting at 1\nand always from the Start page of the job.\nStat.CurrentMedia Page The media specified for the current page in a print job when\nthe IdentifyPDFDocuments step was run. If no media is\nspecified for the page, Stat.CurrentMedia provides the\nmedia specified for the job. If no media is specified for the\npage or the job, Stat.CurrentMedia does not provide a\nvalue. For example, the value of Stat.CurrentMedia for the\nfirst page of a document is Letterhead.\nNote:\nStat_CurrentMedia does not provide media specified\nusing RICOH ProcessDirector Plug-in for Adobe\nAcrobat.\nYou cannot preview markup that is placed using a\nRICOH ProcessDirector Plug-in for Adobe Acrobat\nrule that evaluates Stat.CurrentMedia.\nNote: Although some statistics describe job-level values, RICOH ProcessDirector evaluates each page in a document when determining\nwhether or not to apply markup or extract the value of a document property.\nParent topic: Working with rules\n1 of 1"}]}