{"doc_name": "aiw_c_over_docprocfeat.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_over_docprocfeat.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4525, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Document processing features - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features\nDocument processing features\nDocument processing features expand the capabilities of a workflow from controlling and tracking jobs to controlling and tracking individual\ndocuments in a job.\nWithout changing the application that creates the job, you can change how the individual documents are processed, using business rules to\nindicate what processing to do. You can pull documents out of a workflow, attach documents to email, or reprint individual documents. The\ndocuments in the job can be split into multiple jobs, sorted based on document-specific information such as address data, or grouped into subset\njobs based on data in the document.\nTwo features add basic functions and objects for processing documents. You must install one or both of these features before you can install the\nother document processing features:\nPDF Document Support adds functions and objects for processing documents in PDF jobs. This no-charge feature is provided with the base\nproduct but is not installed by default.\nAFP Support adds functions and objects for processing documents in AFP jobs.\nPDF Document Support and AFP Support let you identify individual documents within a job and map data, such as customer names or postal\ncodes, in the documents to RICOH ProcessDirector document properties. RICOH ProcessDirector stores the document properties and their values\nin a document properties file.\nIn this section:\nArchive\nThe Archive feature lets you store jobs, documents, and job processing history in a repository and retrieve them by searching on job and\ndocument properties. For example, you might search for documents by job name, customer name, and account number. After you retrieve a job\nor document, you can view it, review the properties that were stored with it, check the production history, and submit the job or document to a\nworkflow for reprinting or other processing.\nElectronic Presentment\nThe Electronic Presentment feature provides a sample workflow that receives jobs from a sample input device and uses a sample history record\nnotification to capture the times when jobs are printed and mailed. The workflow stores jobs, documents, property values, and history\ninformation in a sample repository.\nAutomated Verification\nThe Automated Verification feature lets you add barcodes to the documents in a print job. Cameras or barcode scanners read the barcodes to\ndetect documents that fail to complete a step in their workflow. You choose whether RICOH ProcessDirector automatically reprints any missing\ndocuments or an operator specifies an action to take for each missing document.\nInserter and Quadient Inserter Express\nThe Inserter features help to automate the insertion of printed documents and extra inserts (such as marketing materials) into envelopes. RICOH\nProcessDirector supports two features that support inserters: the full Inserter feature and the Quadient Inserter Express feature.\nPostal Enablement\nThe Postal Enablement feature lets you extract mailing address data from the documents in a job and prepare the data for processing by external\npostal software. After the postal software verifies the addresses and improves their quality, the Postal Enablement feature can process results\nreceived from the postal software to update the documents in the job.\nPreference Management\nThe Preference Management feature lets you update document property values with values from an external preferences file. These values can\nbe used to change the content of selected documents or to change the processing of those documents.\nPreprinted Forms Replacement\nThe Preprinted Forms Replacement feature lets you print jobs on plain paper that previously required preprinted forms. You update the definition\nof each media object for the media requested by these jobs to include the electronic equivalent of the preprinted form data. The application that\nsubmits the print files to RICOH ProcessDirector can continue to specify the media for the jobs in the same way.\nUsage scenarios for processing documents\nIf you have the PDF Document Support or AFP Support feature, this topic provides links to usage scenarios. These scenarios show how document\nprocessing is used to improve your production processes and to offer new services to clients.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:21 PM Document processing features - Jenski - Test portal- RPD Linux\nParent topic: Features\n2 of 2"}]}