{"doc_name": "aiw00bannerjfont.pdf", "doc_path": "data/raw/RPD-en-US/aiw00bannerjfont.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2489, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Obtaining and using coded fonts for Japanese AFP banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / AFP banner pages / Obtaining and using coded fonts for Japanese AFP banner pages\nObtaining and using coded fonts for Japanese AFP banner pages\nRICOH ProcessDirector supports AFP banner pages that use double-byte character set (DBCS) characters in Japanese. You can install Japanese\nDBCS-coded fonts from CDs that RICOH ProcessDirector provides.\nTo use coded fonts for Japanese AFP banner pages:\n1. Install fonts from these CDs on the primary computer:\nAFP Outline Fonts (LCD4-5683)\nThese fonts can be used on Linux and Windows. They include fonts for Japanese, Korean, Simplified Chinese, and Traditional Chinese.\nWorldType Fonts (LCD4-5684)\nThese are OpenType and TrueType fonts in Microsoft Unicode format.\n2. Log in to the primary computer as the RICOH ProcessDirector system user ( aiw1 is the default).\n3. In the documentation for the fonts that you installed, find the installation location of the Japanese DBCS-coded font or fonts that you want\nto use. For example, find XZAE26F.\n4. Copy the DBCS-coded fonts to this directory on any RICOH ProcessDirector primary computer from which you will print banner pages that\ninclude Japanese characters: /usr/lpp/psf/reslib\n5. Navigate to /aiw/aiw1/control_files/banner_pages/.\n6. Open the banner_page_code_page_mapping.cfg file with a text editor. Map the coded fonts that you copied to their corresponding Java\ncode pages. Most of the Japanese DBCS-coded fonts map to the IBM930 or IBM939 code page. For example, add this mapping:\nXZE26F=IBM939\n7. Save the configuration file.\n8. Determine the control file or files that you want to update to support AFP banner pages with Japanese characters. Update any lines in the\nfiles for which you want to use Japanese DBCS-coded fonts. You also need to change the entry for the single-byte coded font in the\nprevious field. The single-byte coded font must use an EBCDIC code page that is a subset of the code page for the DBCS-coded font. For\nexample, change this line:\nField301 Class;JobTicketField;[Job.Class.NameAndValue];X0PCLR12;;4.50;3.34375;0\nto:\nField301 Class;JobTicketField;[Job.Class.NameAndValue];X0CR51;XZE26F;4.50;3.34375;0\n9. Save the configuration file. You can now print banner pages that include Japanese fonts.\nNote: The printer that prints the banner pages must support DBCS characters.\nParent topic: AFP banner pages\n1 of 1"}]}