{"doc_name": "pdfw_c_userprefs.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_userprefs.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4871, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Preferences - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Preferences\nPreferences\nYou can set preferences for RICOH ProcessDirector Plug-in for Adobe Acrobat to customize it for the way that you process PDF files.\nTo change your preferences, click Ricoh ⇒ Preferences.\nFonts tab\nUse the Fonts tab to select the font and size. This font is applied to the name of the markup boxes you draw in a PDF file. You use this option to\nchange the font of the characters in your preferred language.\nNote:\nSelections for style, effects, color, and type of script are not applied to the name of the markup boxes.\nPreview tab\nUse the Preview tab to set values for these properties:\nPages to Process\nThis value determines the maximum number of pages to process when you preview markup, export and view document properties, and use\nthe Page Group Navigator. The more pages you specify, the longer RICOH ProcessDirector Plug-in for Adobe Acrobat takes to preview\nmarkup and view document properties.\nProduction Intent\nThis value defines how RICOH ProcessDirector Plug-in for Adobe Acrobat interprets PDF files. For example, when the Production Intent is\nSimplex, Second Front Only page placement puts markup on the second page of each page group. When the Production Intent is Duplex,\nSecond Front Only page placement puts markup on the third page of each page group.\nShow electronic forms\nThis value determines whether Preview shows how sample files look when the data is combined with electronic forms defined for the media\nthat the files use.\nAddress tab\nUse the Address tab to set a value for the Default address block format property. The default value is displayed when you use the Define Address\nBlock function.\nLogging tab\nRICOH ProcessDirector Plug-in for Adobe Acrobat provides a log file in text format that you can customize to provide different levels of historical\ninformation. Use the Logging tab to define these properties:\nLogging Level\nThe types of messages saved in the log file. Trace saves all six types. Info saves four types: informational, warning, error, and fatal messages.\nFatal saves only fatal messages. Off turns off logging.\nLog Output Folder\nThe directory path for the plug-in and Java log files that the system creates. The directory path must exist when the system creates the first\nlog file. If a file does not exist, the system creates it.\nPlug-in Log File\nThe file name for the plug-in log file that the system creates.\nJava Log File\nThe file name for the Java log file that the system creates.\nMaximum File Size\nThe upper size limit for the log. The minimum file size is 1 MB; the maximum file size is 10 GB. When the file reaches the upper limit, the\nsystem closes the file, renames it to include a number at the end of the name. The system keeps the file until the value in the Number of Log\nFiles to Retain property is reached. For example, the log file name is Log.txt. Each renamed file is Log.n.txt, where n is a number from 1\nto the value in the Number of Log Files to Retain property. The most recent log remains Log.txt.\nNumber of Log Files to Retain\nThe number of log files that the system keeps in addition to the current log file. When this limit is reached, the system deletes the oldest log\nfile after it creates a log file. For example, you select 3. The system keeps the current log file plus the three most recent log files.\nAdvanced tab\nUse the Advanced tab to set values for these properties:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Preferences - Jenski - Test portal- RPD Linux\nPort\nThe internal port number for communication between RICOH ProcessDirector Plug-in for Adobe Acrobat and its background Java process.\nRestart Adobe Acrobat for this value to take effect. Edit this field if you have software that uses the default port.\nHeap Size (MB)\nThe number of megabytes for the desired minimum amount of memory in the Java Virtual Machine allocation pool. Restart Adobe Acrobat\nfor this value to take effect. Experiment with this value to tune it to the size and complexity of the PDF files you mark up. When you\nexperience delays while previewing, selecting text, using the Page Group Navigator, or extracting and exporting document properties, you\nmight improve performance by increasing the number of megabytes. If you set the heap size to a value that is greater than the available\nmemory, you might not be able to use RICOH ProcessDirector Plug-in for Adobe Acrobat. In that case, decrease the heap size value, restart\nAdobe Acrobat, and reactivate the plug-in.\nOther JVM Options\nIn addition to setting the minimum heap size, you can fine-tune other JVM memory settings. Edit this field only on the advice of your\nsupport representative.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n2 of 2"}]}