{"doc_name": "slapolicydeadline.pdf", "doc_path": "data/raw/RPD-en-US/slapolicydeadline.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2523, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM SLA deadline - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Service policies / SLA deadline\nSLA deadline\nThe SLA deadline represents your ultimate commitment to your clients. It is the time by which a job must complete the processing step that the\nSLA measures.\nMost jobs do not have to complete their workflows to meet the requirements of their SLA. For example, some jobs could meet the requirements\nof their SLA if RICOH ProcessDirector prints them by a certain time. The jobs could stay in the RetainJobs step for 72 hours after they have been\nprinted. The requirements of the SLA have been satisfied when the jobs finish printing.\nWhen you define a service policy, you include information that RICOH ProcessDirector uses to calculate the SLA deadline. RICOH ProcessDirector\nsupports these deadline calculation methods:\nElapsed time\nCalculates the deadline by adding the value of the SLA duration property to the checkpoint start time for the job. The checkpoint start time is\nwhen the job started processing for the purposes of the SLA.\nSpecific time\nCalculates the deadline using the Number of days and SLA target time properties. The SLA deadline is set at a specific time, regardless of the\ntime the job arrived in the system.\nNote:\nRICOH ProcessDirector calculates the SLA deadline only when you choose a deadline calculation method and enter values for the\ncorresponding properties.\nSLA deadline does not use estimated durations or the deadline set by the Change Deadline action or a SetDeadline step in the workflow\nthat processed the job.\nRICOH ProcessDirector lets you choose a step in a workflow to represent the end point of the SLA commitment. That step is the SLA target step.\nThe SLA target step could represent:\nWhen the job finishes printing.\nWhen the printed output is delivered to the inserter line.\nWhen the job has been inserted and is ready to be picked up.\nWhen a job completes the SLA target step, RICOH ProcessDirector records the time as the SLA target step time and compares it to the SLA\ndeadline to determine the SLA outcome:\nIf the job completes the target step before the SLA deadline, the SLA outcome is recorded as Met.\nIf the job does not complete the target step before the SLA deadline, the SLA outcome is recorded as Missed. RICOH ProcessDirector adds a\nblack dot to the Schedule risk column for the job in the Jobs table.\nYou cannot change the SLA outcome after is has been calculated.\nParent topic: Service policies\n1 of 1"}]}