{"doc_name": "aiw_emailjobs.pdf", "doc_path": "data/raw/RPD-en-US/aiw_emailjobs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2348, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Emailing files during job processing - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Email and progress updates / Emailing files during job processing\nEmailing files during job processing\nYou can use the SendEmail step template to email a job, a page range from a job, or any other file to one or more email addresses as part of the\njob's workflow. If you have the PDF Document Support feature installed, you can use the EmailDocuments step template to email documents\nfrom the job as part of the workflow.\nYou can add the SendEmail step to a workflow and configure it to send email with one or more attachments. When the job reaches that step,\nthe step retrieves the files requested, attaches them to an email, and sends the email to the specified addresses. If you set the Attach ZIP file\nproperty to Yes, the step packages all of the attachments in a ZIP file and attaches it to the email.\nYou can use this function in various situations:\nIf the workflow uses an external formatting program to reformat jobs, you can send pages from the reformatted job to your customer for\napproval.\nIf your customer wants to archive jobs in their own system, you can send jobs to them after they have printed.\nIf you have Service Level Agreements (SLAs) with your customers, you can send notifications to them (including sample pages from jobs) when\nkey steps complete.\nYou can use the EmailDocuments step to send individual PDF documents from the job as attachments to an email. For example, you can send\neach customer's statement to a separate email address by specifying the ${Doc.EmailAddress} property in the Recipient address field on the\nstep. Using individual customer email addresses is useful if the job produces output such as customer statements or insurance policy updates.\nTo use either the SendEmail or EmailDocuments step, you must configure your system to connect to an SMTP server. If you send some email from\none email server and some email from a different email server, you can configure a default SMTP server and an Alternate SMTP server for the\nsystem. When you add either step to a workflow, you can choose which SMTP server to use.\nNote:\nYou cannot use the Alternate SMTP server for email notifications. Notifications are sent through the default SMTP server.\nParent topic: Email and progress updates\n1 of 1"}]}