{"doc_name": "aiw00o35.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o35.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5281, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Printers - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Printers\nPrinters\nPrinter objects represent the printers in your environment that receive print jobs from RICOH ProcessDirector.\nA print job is one or more input files that have been submitted for printing.\nRICOH ProcessDirector can interact with printers represented by these printer object types:\nAFP\nAFP printer objects represent Intelligent Printer Data Stream (IPDS) printers. They print jobs in AFP format. You can use all RICOH\nProcessDirector actions with jobs submitted to AFP printers. This object type is available only when the AFP Support feature is installed.\nSome IPDS printers, such as the InfoPrint 5000, also print non-IPDS jobs. You can configure the AFP printer object to share the physical\nprinter. When shared, the physical printer can accept non-IPDS jobs from another input source, such as a hot folder.\nCustom PDF\nCustom PDF printer objects represent PostScript printers that are not on the list of supported Ricoh PDF printers. These printers include some\nRicoh PostScript printers and PostScript printers from other manufacturers. RICOH ProcessDirector uses a custom printer definition file to\nconvert PDF print files into PostScript commands supported by a Custom PDF printer. In response to customer requests, Ricoh creates the\ncustom printer definition files from PostScript Printer Description (PPD) files supplied by the manufacturers.\nThese printer objects can be defined on Linux primary and secondary servers and on Windows application servers.\nYou cannot use some of the RICOH ProcessDirector job actions (such as Jump to) with jobs submitted to Custom PDF printers.\nWhen you use the Stop job action:\nDepending on the control unit of the printer, the job stops printing.\nRICOH ProcessDirector stops sending segments of multiple-segment jobs to the printer.\nKodak PDF\nKodak PDF printer objects represent printers that can print PDF files. This object type is available only if the Cut Sheet Support for Kodak\nfeature is installed.\nPassthrough\nPassthrough printer objects represent printers that can print jobs in non-AFP formats such as PCL, PostScript, and PDF. You specify the\ncommand that sends the jobs to the printer. You cannot use some of the RICOH ProcessDirector job actions (such as Jump to and Stop) with\njobs that submitted to Passthrough printers.\nPCLOut\nPCLOut printer objects represent Printer Command Language (PCL) printers. They print jobs that are submitted in AFP format and converted\nto PCL format. You specify the command that sends the jobs to the printer. You cannot use some of the RICOH ProcessDirector job actions\n(such as Jump to and Continue) with jobs submitted to PCLOut printers. You can use the Stop action only on a job that is printing on a\nPCLOut printer. You must request the action while the job is being converted to PCL. This object type is available only if the AFP Support\nfeature is installed.\nRicoh PDF\nRicoh PDF printer objects represent printers that print PDF files. Depending on what data streams your printer supports, you can tell RICOH\nProcessDirector to send the printer PostScript, or JDF job tickets with the PDF files.\nThese printer objects can be defined on Linux primary and secondary servers and on Windows application servers.\nYou cannot use some of the RICOH ProcessDirector job actions (such as Jump to) with jobs submitted to Ricoh PDF printers.\nWhen you use the Stop job action:\nDepending on the control unit of the printer, the job stops printing.\nRICOH ProcessDirector stops sending segments of multiple-segment jobs to the printer.\nTASKalfa\nTASKalfa printer objects represent printers that print PDF files to Kyocera TASKalfa 15000c production printers with the EFI Printing System\n50 option (EFI Fiery DFE). This object type is available only if the Cut Sheet Support for TASKalfa feature is installed.\nThese printer objects can be defined on Linux primary and secondary servers and on Windows application servers.\nYou cannot use some of the RICOH ProcessDirector job actions (such as Jump to) with jobs submitted to a TASKalfa printer.\nWhen you use the Stop job action:\nDepending on the control unit of the printer, the job stops printing.\nRICOH ProcessDirector stops sending segments of multiple-segment jobs to the printer.\nRicoh TotalFlow\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:20 PM Printers - Jenski - Test portal- RPD Linux\nRicoh TotalFlow printer objects represent printers that use TotalFlow Print Server.\nWhen some models of Ricoh TotalFlow printers print a job, they send ink usage information to RICOH ProcessDirector. To determine whether\nyour printer supports this feature, consult the printer documentation.\nXerox PDF\nXerox PDF printer objects represent printers that can print PDF files. This object type is available only if the Cut Sheet Support for Xerox\nfeature is installed.\nYou can configure some printers to monitor a hot folder for non-IPDS files. You can use RICOH ProcessDirector to copy jobs to the hot folder for\nthe printer. In this case, you do not create a printer object.\nYou cannot use some of the RICOH ProcessDirector job actions (such as Print again and Jump to) with jobs submitted to the hot folder for a\nprinter.\nParent topic: System objects\n2 of 2"}]}