{"doc_name": "aiw00_cnonAFP2Passthru.pdf", "doc_path": "data/raw/RPD-en-US/aiw00_cnonAFP2Passthru.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1814, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Defining a workflow to print to a Passthrough Printer - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Workflows for printing / Defining a workflow to print to a Passthrough Printer\nDefining a workflow to print to a Passthrough Printer\nYou can define a workflow that accepts a print job in PDF or PostScript format and sends it to a Passthrough printer.\nTo define a workflow to print to a Passthrough printer:\n1. Click the Workflow tab.\n2. Right-click the PDF workflow and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. If the new workflow does not process PDF jobs, right-click the CreatePageRanges step, and select Delete.\nDo not delete this step if the new workflow processes PDF jobs. It is needed to reprint a range of pages in PDF jobs.\n5. Connect the RunExternalProgram step to the PrintJobs step.\n6. Right-click the PrintJobs step, and select Properties.\n7. In the Scheduling tab, change the values of the Binding, Fold options, Requested location, Media, Output bin, Punch, and Staple properties\nto match the scheduling properties of the Passthrough printer that you want to print on. If you have the AFP Support feature installed,\nchange the values of the Job class, Job form, and Job destination properties as well. Other scheduling properties may be defined in a\nconfiguration file.\n8. If the workflow processes PDF files and the value of the Create .zip file property for the hot folder that assigns jobs to this workflow is set\nto Yes, add a step based on the BuildPDFFromZIP step template to the workflow before the first step that expects PDF input (for example,\nCreatePageRanges or PrintJobs ).\n9. Click OK.\n10. Save the workflow.\nParent topic: Workflows for printing\n1 of 1"}]}