{"doc_name": "vwb_CreateBarCodes.pdf", "doc_path": "data/raw/RPD-en-US/vwb_CreateBarCodes.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 10535, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Creating barcodes with AFP Enhancer - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Creating barcodes with AFP Enhancer\nCreating barcodes with AFP Enhancer\nAFP Enhancer lets you create barcodes in AFP files.\nThe barcode must be a consistent size and in a consistent position on every page. If text, an image, or another barcode already exists in the area\nwhere you want to create a barcode, first hide the area so that the existing text, image, or barcode does not print.\nTo determine the exact origin and size of the barcode area, work from a copy of the sample AFP file printed on the production printer. Start at\nthe top-left corner of the page and measure the distance to the top-left corner of the barcode area. The horizontal distance is the X position; the\nvertical distance is the Y position. For BCOCA barcode objects, also measure the width and height of the area to determine where to place the\nbottom-right corner. The X position of the bottom-right corner is the X position of the top-left corner plus the width. The Y position of the\nbottom-left corner is the Y position of the top-left corner plus the height.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo create a barcode:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the file does not contain page groups or index tags for variable values (such as ZIP codes) that you want to use in barcode data, use AFP\nIndexer to create page groups and index tags.\n3. If you want the barcode to include data from a document property and an index tag is not mapped to the document property, use\nDocument Property Designer (DPD) to link the index tag to the document property.\n4. Click Mode ⇒ AFP Enhancer.\n5. Navigate to the page where you want to create the barcode:\nTo place a barcode on the same page in every page group, navigate to that page in any page group.\nTo place a barcode on multiple pages (for example, on even pages in every page group), navigate to one of the pages in any page group.\n6. Position your cursor at the top-left corner of the barcode area. While pressing the left mouse button, draw a box the approximate size of\nthe barcode area.\nIn a later step, you specify the exact position and size of the barcode area.\n7. Right-click anywhere in the AFP file and click Create barcode.\n8. On the Type tab, type a name for the barcode area.\n9. Select the barcode type.\nThe table shows the valid characters for each barcode type.\nValid characters for barcodes\nBarcode type Valid characters Total number of characters\nCode 39 0123456789 ABCDEFGHIJKLM 0 to 50 characters\nNOPQRSTUVWXYZ - . $ / + % space character\nInterleaved 2-of-5 0123456789 0 to 50 characters\nData Matrix Any one-byte character, or binary data 0 to 3116 characters\nPOSTNET 0123456789 The number of digits depends on the barcode\nproperty selected on the Type tab:\nZIP Code: 5 digits\nZIP Code + 4: 9 digits\nAdvanced Bar Code (ABC): 11 digits\nVariable-length barcode: 0 to n digits (barcode\nreceivers support at least 50 digits)\nQR Code Any one-byte character, or binary data 0 to 3116 characters\nIntelligent Mail barcode 0123456789 20 to 31 characters\n10. Select a generation method:\nBCOCA objects\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:19 PM Creating barcodes with AFP Enhancer - Jenski - Test portal- RPD Linux\nThis object follows the Bar Code Content Object Architecture (BCOCA).\nGeneric barcodes\nThis object guarantees compatibility on all IPDS printers.\nFont barcodes\nA Presentation Text Object Content Architecture (PTOCA) object with transparent text represents the content. The referenced font\nresource must be available when printing.\nDrawRule barcodes\nA PTOCA object uses rules to represent the content.\n11. Specify the content of the barcode using Content Expression Language (CEL).\nAFP Enhancer provides several CEL examples for you to select and modify. For more information, see the related reference topic on\nsupplied CEL examples in the RICOH ProcessDirector information center.\nNote:\nYou can type carriage return control characters in the Content area. The carriage returns are removed when you export your\nenhancements to an EnhanceAFP control file.\nYou can copy CEL expressions from other sources and paste them into the Content area.\nAFP Enhancer does not validate CEL syntax.\n12. Specify properties for the type of barcode you selected.\nThe table describes the properties for each barcode type.\nBarcode properties\nBarcode type Property and description\nCode 39 and Interleaved 2-of-5 Include check digit: A check digit ensures data integrity during the bar coding reading process. If you\nselect Yes, a check digit is included in the barcode symbol.\nData Matrix Number of rows: If you select Auto, an appropriate number of rows is used for the amount of data in\nthe barcode symbol.\nRow size: If you select Auto, an appropriate row size is used for the amount of data in the barcode\nsymbol.\nPOSTNET ZIP Code barcode: The barcode symbol consists of a leading frame bar, the encoded ZIP Code data, a\ncorrection digit, and a trailing frame bar. The ZIP Code data is a 5-digit number.\nZIP Code+4 barcode: The barcode symbol consists of a leading frame bar, the encoded ZIP+4 data, a\ncorrection digit, and a trailing frame bar. The ZIP+4 data is a 9-digit number.\nAdvanced Bar Code (ABC): The barcode symbol consists of a leading frame bar, the encoded ABC\ndata, a correction digit, and a trailing frame bar. The ABC data is an 11-digit number.\nVariable-length barcode: The barcode symbol consists of a leading frame bar, the encoded data, a\ncorrection digit, and a trailing frame bar. The encoded data is variable length.\nQR Code Size: The size of the barcode symbol, represented by the number of modules in each row and\ncolumn. The values are 21x21 to 177x177, or “smallest”, which indicates the smallest size that can\ninclude all data.\nIntelligent Mail barcode None\n13. Click the Location tab.\n14. Specify the location of the barcode area:\nIn the Location fields, specify the X and Y positions of the top-left corner.\nIn the Right Location fields, specify the X and Y positions of the top-left corner on right-hand pages.\nNote:\nIf you do not specify values for the Right Location fields, AFP Enhancer uses the values in the Location fields for all pages.\nUse values in both the Location and Right Location fields if 2–up is enabled and the Page Placement value is All Fronts Left And\nRight.\nAFP Enhancer lets you specify decimal values for the X and Y positions or use CEL expressions. For example, a CEL statement can position a\nbarcode to the right of indexed data that varies in each document.\nNote: To specify an orientation of 90, 180, or 270 degrees, you edit the EnhanceAFP control file manually after you save the barcode\nin the Visual Workbench control file. Then you export the EnhanceAFP control file.\n15. Specify the pages on which to place the barcode in each page group.\n16. Optional: Specify a trigger using a CEL expression.\nExamples:\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:19 PM Creating barcodes with AFP Enhancer - Jenski - Test portal- RPD Linux\nYou want to place a barcode on every document with two or more pages. Use this expression:\ntotal_pages_in_mp != 1\nYou want to place a barcode on each document sent to California that has yes as the value of the Doc.Custom.PolicyDiscount document\nproperty. Use this expression:\nand(Doc.State == CA, Doc.Custom.PolicyDiscount == yes)\n17. Click the Preview tab.\nThe Origin of area values show the X and Y positions of the upper-left corner of the barcode area you drew. The Size of area values show\nthe width and height of the barcode area.\nNote: The values on the Preview tab are used to display the barcode in RICOH Visual Workbench. They do not change when you\nchange the values on the Location tab. The values on both tabs are saved in the Visual Workbench control file. Only the values on\nthe Location tab are exported to the EnhanceAFP control file and used to place the barcode on the documents in the AFP file.\n18. Type sample barcode data in the Sample Text field.\nIf you leave the field blank, the barcode symbol does not display in RICOH Visual Workbench.\nNote: Intelligent Mail barcodes are an exception. They display even when the Sample Text field is blank.\n19. Click OK.\nYou see the barcode symbol in the AFP file.\nNote:\nPreview displays the barcode on the same relative page in each page group. If you drew the barcode area on page 1 of one\ndocument, Preview displays the barcode on page 1 of all the documents. The page placement and trigger values on the Location\ntab specify barcode placement on the pages of the documents in jobs in the workflow.\nIf you created a text IMB but do not see the barcode symbol, identify the resource directory that contains the AFP IMB font to\nRICOH Visual Workbench (Resources ⇒ Specify Resource Directories). The AFP IMB font is installed in the\naiw/aiw1/plugins/EditAFP (Linux) or C:\\aiw\\aiw1\\plugins\\EditAFP (Windows) directory.\n20. Click File ⇒ Save Control File to save the barcode in the Visual Workbench control file.\n21. When you are ready to use the enhancements in the Visual Workbench control file (including the new barcode) in your workflow, click\nTools ⇒ Export EnhanceAFP Control File and choose a directory for the exported file.\n22. To specify an orientation of 90, 180, or 270 degrees, add this line to the EnhanceAFP control file with a text editor:\n#Afp.barcode_type.Orientation[barcode_name]=Degrees90\nwhere barcode_type is the type of barcode in the EnhanceAFP control file and barcode_name is the name that identifies a barcode, text\ninsertion, or hidden area.\nFor example:#Afp.LinearBarcode.Orientation[IMB-Verify]=Degrees90\nNote: When you edit an EnhanceAFP control file manually, the edits are not saved in the Visual Workbench control file. If you make\nadditional enhancements and save them in the Visual Workbench control file, you must export the EnhanceAFP control file to make\nthe new enhancements available to the workflow. Then you must manually edit the new EnhanceAFP control file to add the edits\nthat you made in the original EnhanceAFP control file.\nThis figure shows four barcode areas with different orientations (0, 90, 180, 270 degrees) of the barcode symbol.\nBarcode areas with four orientations of barcode symbol\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:19 PM Creating barcodes with AFP Enhancer - Jenski - Test portal- RPD Linux\nParent topic: Working with sample AFP files\n4 of 4"}]}