{"doc_name": "editingafpfiles.pdf", "doc_path": "data/raw/RPD-en-US/editingafpfiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2245, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Editing AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files\nEditing AFP files\nThe AFP Enhancer mode of RICOH Visual Workbench and the AFP Editor plug-in to RICOH Visual Workbench let you create barcodes and text,\nand hide areas that contain unwanted content (such as obsolete barcodes) in AFP files.\nIn this section:\nCreating barcodes\nAFP Editor lets you create barcodes in AFP files.\nReplacing POSTNET barcodes with IMBs\nYou can replace POSTNET barcodes in AFP files with Intelligent Mail barcodes (IMBs). When you replace POSTNET barcodes, AFP Editor deletes\nthe POSTNET barcodes and creates IMBs that contain the same routing codes as the POSTNET barcodes.\nCreating IMB serial number files\nIf you want Intelligent Mail barcodes (IMBs) to contain a sequential serial number that identifies each mailpiece, you must create a serial number\nfile.\nCreating conditions between barcode definitions\nWhen you define more than one barcode, you can create a condition between two barcodes that AFP Editor uses to determine which barcode is\ncreated in the AFP file.\nCreating hidden areas\nYou can hide areas in AFP files that you do not want RICOH ProcessDirector to display or print. For example, you might hide an area that contains\na barcode before you create a new barcode in the same place.\nCreating text with AFP Editor\nYou can create a string of text on a specified page of each page group in an AFP file and specify its color, font, and size.\nModifying or deleting AFP Editor definitions\nAfter you create barcodes, text, hidden areas, or definition conditions, you can modify or delete any of them. You can also create and modify\nconditions if you have defined at least two barcodes.\nAdding steps to edit AFP files\nAfter you create barcodes, text, or hidden areas in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more\nworkflows to create barcodes, text, or hidden areas in production AFP files that use the workflows. The step names the Visual Workbench\ncontrol file that contains the definitions for the barcodes, text, or hidden areas.\nParent topic: Working with sample AFP files\n1 of 1"}]}