{"doc_name": "modifyingimages.pdf", "doc_path": "data/raw/RPD-en-US/modifyingimages.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2055, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying content images - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Adding content to white space in AFP files\n/ Assigning content to white space / Modifying content images\nModifying content images\nYou can modify the images you have defined for white space content.\nNote:\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo modify images you have defined in content:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the white space definitions.\n2. Click Mode ⇒ Whitespace Manager.\n3. Click Tools ⇒ Manage Campaigns.\nYou see the Manage Campaigns window.\n4. Select a rule from the list in the top pane of the window.\n5. Select image content from the drop-down list.\n6. Click Edit in the Content section.\nYou see the Modify Image window.\n7. Optional: On the Image tab, you can do these:\nChange the file type in the Type drop-down list. If the file type is JPEG or GIF, you must specify the size of the image in these fields:\nWidth\nAny positive decimal value, such as 0.75, for the horizontal width (in inches or millimeters) of the image. The default width is 0.5\ninches or 12.7 millimeters.\nHeight\nAny positive decimal value, such as 0.75, for the vertical height (in inches or millimeters) of the image. The default height is 0.5\ninches or 12.7 millimeters.\nType a file name in the Image file name field, or click Browse to select a file.\nClick Add image inline to add the image to the resource group in the AFP file.\n8. Optional: On the Position tab, change the origin (top-left corner) of the image. Specify the origin in inches or millimeters. Decimal values\n(such as 2.5) are allowed.\n9. Click OK.\n10. Optional: Click Preview to view how the image you specified is displayed in the defined white space.\nTo close the window, click the X in the upper right corner.\nParent topic: Assigning content to white space\n1 of 1"}]}