{"doc_name": "pdfw_t_plugin_addpagegroups.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addpagegroups.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7619, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Defining a page group - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Defining a page group\nDefining a page group\nA page group defines the pages ranges for each document in your PDF file. You save one page group definition to the control file that you\nspecify in a RICOH ProcessDirector IdentifyPDFDocuments step. We recommend that you define a page group before you add markup.\nNote: You can define more than one control file per PDF file, but only the control file you identify in the Identify PDF control file property\nof the step based on the IdentifyPDFDocuments step template creates page groups. If you want to use RICOH ProcessDirector Plug-in for\nAdobe Acrobat preview mode to verify the correct placement of other markup, you might need to define a page group in the control files\nyou use to generate such markup. You can, for example, add a control file that contains page group definitions to a\nBuildPDFFromDocuments step. However, because a BuildPDFFromDocuments step receives page grouping information from the previous\nIdentifyPDFDocuments step, a BuildPDFFromDocuments step ignores any page group definitions in its control files. See the information\ncenter topic on previewing markup for more information about best practices.\nTo define a page group:\n1. Open a PDF file in Adobe Acrobat Professional and click Ricoh ⇒ Select to make the plug-in the active tool.\n2. To define a text-based page group, draw a box around the target text. Otherwise, draw a box anywhere on the page.\n3. Click Define Page Group.\n4. Either accept or change the default page group name. We recommend that you use the default name, so that anyone working on the PDF\nfile can easily see where the page group boundary is defined. If you do change the name, do not use spaces or special characters (such @,\n#, $, and %). You can use periods and underscores.\n5. For text-based page groups, you can alter the location and size of the enclosing box by entering values for Horizontal and Vertical\ncoordinates, Width, and Height. The position and size of the box are adjusted after you click OK.\n6. From the Page Groups list, select one of these options:\nTreat entire PDF as a single page group: Creates a single page group that includes all processed pages.\nCreate fixed-length page groups: Creates page groups of specific lengths based on the value of the Page Group Length property. Page\ngrouping starts on page 1 of the PDF file.\nFor example, select 5 to create page groups for pages 1–5, 6–10, 11–15, and 16–18 in an 18–page PDF file.\nBegin page group when the selected text is found: Creates page groups based on text that you select. Any page with the selected text\ninside the box you drew becomes the first page of a new page group.\nFor example, select Page 1 of to create a new page group each time that RICOH ProcessDirector Plug-in for Adobe Acrobat finds the text\nPage 1 of inside the box you drew.\nNote: Characters in a PDF file have white space enclosing them. Make sure that the Selected Text field does not include characters\n— such as white-space characters — that you do not want. If it does, cancel the page group definition and redraw the box around\nthe text.\nBegin page group when the specified text is found: Creates page groups based on text that you specify. Any page with the specified text\ninside the box you drew becomes the first page of a new page group. The text does not need to be on the same page as the box you\ndrew.\nFrom the Match method list, select one of these options:\nMatch text exactly: Matches the exact text that you specify.\nMatch text containing: Matches the text that you specify to a portion of the text in the box you drew. The text that you specify does not\nneed to be in the same location on each page.\nFor example, use this option to create a new page group each time that RICOH ProcessDirector Plug-in for Adobe Acrobat finds the text\nPage 1 of anywhere inside the box you drew. The box can contain other text. Page 1 of 4 and This is Page 1 of 4 found in the box both\nmatch the specified text Page 1 of.\nMatch text using wildcards [* or ?]: Matches the text that you specify, which includes wildcard characters, by interpreting the wildcard\ncharacters as any characters. The asterisk (*) matches zero or more characters. The question mark (?) matches a single character.\nFor example, the first page of each mail piece has an account number that starts with A followed by seven digits. The position of the\naccount number varies on each statement. You draw a box large enough to include the account number on all the statements and type\nA??????? as the value of the Specify text to match property. RICOH ProcessDirector Plug-in for Adobe Acrobat starts a new page\ngroup on each page with an account number like A1265581 or A6428229.\nNote: If you typed A??????* as the value of the Specify text to match property, RICOH ProcessDirector Plug-in for Adobe\nAcrobat would start a new page group when it finds account numbers with six or more digits.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Defining a page group - Jenski - Test portal- RPD Linux\nMatch text using a Java regular expression: Matches the Java regular expression that you specify.\nFor example, each mail piece is in one of two languages: English or Spanish. You type (Page 1 of).*|(Página 1 de).* as the\nvalue of the Specify text to match property. RICOH ProcessDirector Plug-in for Adobe Acrobat starts a new page group when the text\nfound is Page 1 of followed by any number of characters or Página 1 de followed by any number of characters. Examples: Page\n1 of, Page 1 of 6, Página 1 de 2, or Página 1 de 10.\nNote: For more information, see the Java documentation for the java.util.regex.Pattern class.\nBegin page group when text in selected area changes: Creates page groups when text inside the box you drew changes. The page with\nthe changed text becomes the first page of a new page group.\nFor example, you draw a box around an account name. RICOH ProcessDirector Plug-in for Adobe Acrobat creates a page group each time\na new account name appears in the box you drew.\nImportant: When you draw the box for this type of page group, make sure that the location of the box on every page\nencompasses only the text to evaluate or white space (no text). If other text appears in the box, unwanted page groups are\nidentified. Pages that contain white space, in the location of the box, do not start a new page group.\nBegin page group when text or drawn objects are detected: Creates page groups when either a graphic object or text is enclosed in the\nbox you drew. If the box you drew does not contain the text or entire graphic, then the page is not the start of a new page group.\nNote: Not all marks are graphics. Some marks are image data.\n7. Click OK.\n8. Click Ricoh ⇒ View Page Group Navigator and verify that the page groups begin on the correct pages.\nIf text-based page groups do not begin on the correct pages, the box you drew might not be the correct size for the text you selected or\nspecified. Inspect the page groups to see if you can find the problem. Then redraw the box, change the text, or both.\n9. Edit the page group definition by double-clicking the box representing the page group, or by clicking Ricoh ⇒ View Page Group Navigator\nand then double-clicking the page group name.\n10. When you are ready to save all your enhancements to the PDF file, including the new page group definition, click Ricoh ⇒ Save Control\nFile.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n2 of 2"}]}