{"doc_name": "tt_o_runsamplewf_quadient.pdf", "doc_path": "data/raw/RPD-en-US/tt_o_runsamplewf_quadient.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2892, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Running the QuadientInserterSample workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Running the QuadientInserterSample workflow\nRunning the QuadientInserterSample workflow\nThe Quadient Inserter feature provides a sample workflow that you can examine and run to understand how the feature works. The sample\nincludes two input devices, QuadientInserterSimulator and QuadientInserterFolder, an inserter controller sample, and two workflows,\nQuadientInserterSample and QuadientInserterSimulator.\nThe sample objects used in this workflow are:\nInserter controller: QuadientSample\nInput device: QuadientInserterSimulator\nInput device: QuadientInserterFolder\nWorkflow: QuadientInserterSample\nWorkflow: QuadientInserterSimulator\nYou can review the properties for each object before you start the procedure to see how they interact.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Printers portlet, right-click the Sample printer and select Enable.\n3. In the Inserters controllers portlet, right-click the QuadientSample inserter controller and select Enable.\n4. In the Input Devices portlet, right-click the QuadientInserterFolder input device and select Enable and Connect.\nThe first time you try this procedure, RICOH ProcessDirector immediately submits the QuadientInserter.pdf job to the\nQuadientInserterSample workflow. When the job is initially submitted, it moves through the main steps of the workflow until it reaches the\nReconcile step.\n5. When the job enters the Waiting to reconcile state, right-click the job and select Reconcile.\n6. On the Reconcile job dialog, click on the number in the Need action box at the top of the dialog.\n7. Select all of the documents in the table and select Reprint.\nYou see Reprint in the Requested action column in the Documents table.\n8. Click OK to complete reconciliation.\n9. On the Complete Reconcile Action dialog, select the Sample printer and click OK.\nRICOH ProcessDirector creates a child job that contains the documents to be reprinted. The job number of the child job is the original job\nnumber with a numeric suffix (for example, 10000001.1). The child job starts processing from the first step in the QuadientInserterSample\nworkflow. Because the child job has already been processed into documents, it follows the Reprints path through the workflow and returns\nto the Reconcile step.\n10. When the child job enters the Waiting to reconcile state, right-click the child job and select Reconcile.\n11. On the Reconcile job dialog, note that the Need Action box contains no documents. Click OK to complete reconciliation.\nIf you want to run the example again, you must copy the sample file to the hot folder again. The path for the QuadientInserter.pdf sample file is\naiw/aiw1/testfiles directory.\nParent topic: Configuring the system to use inserters\n1 of 1"}]}