{"doc_name": "dt_o_scen_expectedwork.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_scen_expectedwork.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3002, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Setting up to monitor for expected work - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker / Usage scenarios for Deadline Tracker\n/ Setting up to monitor for expected work\nSetting up to monitor for expected work\nWhen you have recurring jobs, you can use the expected work function to check that the jobs have arrived on time at the correct input device.\nTo monitor for expected work, the administrator creates an Expected work object and then associates the object with one or more input devices.\nFor example, you have a customer who sends you three jobs on the first day of every month. Their SLA states that if the jobs arrive by 8:00 AM\non the first day of the month, they must be printed by 4:00 PM. You create an expected work object that instructs an input device to check the\nstatus at 8:00 AM on the first day of the month. Then you associate the expected work object with the appropriate input device. At 8:00 AM on\nthe first day of the month, the input device checks to see how many jobs have arrived:\nIf all three jobs have arrived, processing continues as usual.\nIf one or more of the jobs has not arrived, the Expected work status property of the input device is set to Late. An alert ( ) icon appears to the\nright of the input device.\nTo define an expected work object that represents three print jobs that arrive by 8:00 AM on the first day of every month, the administrator:\nNavigates to the Objects section of the Administration tab and selects Expected work.\nAdds an Expected work object.\nNames the expected work object by typing Monthly Statements in the Expected work name field.\nAdds a description of the object in the Description field.\nAdds a Start date and time to specify the date and time when the input device begins monitoring for the jobs. The time is set to 8:00 AM.\nSpecifies that three jobs are expected by typing 3 in the Number of jobs expected field. Optionally specifies a File pattern that the input device\nuses to identify which input files to count, such as .*pdf$ for PDF files.\nIndicates that the jobs arrive on the first day of every month by specifying the Day in the Expected work interval field and First day of every\nmonth for the Frequency field.\nEdits the properties of one or more input devices to monitor to specify Monthly Statement as the value for the Associated expected work\nproperty.\nAfter the expected work start date and time, the input device monitors for the three jobs on the first day of every month. If the three jobs do not\narrive as expected, an alert ( ) icon appears to the right of the input device.\nNote:\nYou can set up a notification object to send an email when expected work for an input device is late.\nIf you have the Web Service Enablement feature, you can set up a notification object to issue a SOAP or REST web service call when\nexpected work for an input device is late.\nParent topic: Usage scenarios for Deadline Tracker\n1 of 1"}]}