{"doc_name": "UsingSuppliedTransferScripts.pdf", "doc_path": "data/raw/RPD-en-US/UsingSuppliedTransferScripts.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 9836, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Using scripts to send inserter control files and receive results files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Using scripts to send inserter control files and receive results files\nUsing scripts to send inserter control files and receive results files\nRICOH ProcessDirector provides scripts that you can use to send inserter control files to the inserter controller, and to receive inserter results files\nfrom the inserter controller.\nNote:\nYou can use your own script instead of one of the scripts that RICOH ProcessDirector provides. However, the script that you use must\naccept the same parameters as the RICOH ProcessDirector scripts. For information about all the parameters that the scripts accept, see\nthe prologs of the scripts in directory /aiw/aiw1/bin.\nWhen you create an inserter controller object, you specify the script and its parameters in these properties:\nControl File tab: Send command\nSecond Control File tab: Send command\nResults File tab: Receive command\nResults File tab: Polling command\nYou can specify different scripts in each property.\nScripts to transfer inserter files in /aiw/aiw1/bin lists the supplied scripts in directory /aiw/aiw1/bin.\nScripts to transfer inserter files in /aiw/aiw1/bin\nScript Description\ncopy_file.sh (Linux) Copies the inserter control file from the RICOH ProcessDirector spool directory to another directory on the same\ncomputer.\ncopy_file.pl (Windows)\nCopies the inserter results file or files from a directory on the primary computer to a staging directory.\nmove_file.sh (Linux) Moves the inserter control file from the RICOH ProcessDirector spool directory to another directory on the same\ncomputer.\nmove_file.pl (Windows)\nMoves the inserter results file or files from a directory on the primary computer to a staging directory.\nftp_file.sh (supported on Uses the File Transfer Protocol (FTP) to send the inserter control file from the RICOH ProcessDirector spool\nLinux only) directory to a directory on a separate computer.\nUses the File Transfer Protocol (FTP) to receive the inserter results file (or files) from a directory on a separate\ncomputer and store the file in a staging directory on the primary computer.\nNote:\nTo use this script, the FTP command must be installed. To check if the command is installed, enter which\nftp on the UNIX or Linux command line.\nscp_file.sh (supported on Uses the Secure Copy Protocol (SCP) to send the inserter control file from the RICOH ProcessDirector spool\nLinux only) directory to a directory on a separate computer.\nUses the Secure Copy Protocol (SCP) to receive the inserter results file (or files) from a directory on a separate\ncomputer and store the file in a staging directory on the primary computer.\nNote:\nTo use this script, the Secure Shell and SCP commands must be installed. To check if the commands are\ninstalled, enter which ssh and which scp on the UNIX or Linux command line.\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:19 PM Using scripts to send inserter control files and receive results files - Jenski - Test portal- RPD Linux\nScript Description\nsftp_file.sh (supported on Uses the Secure File Transfer Protocol (SFTP) to send the inserter control file from the RICOH ProcessDirector\nLinux only) spool directory to a directory on a separate computer.\nUses the Secure File Transfer Protocol (SFTP) to receive the inserter results file (or files) from a directory on a\nseparate computer and store the file in a staging directory on the primary computer.\nNote:\nTo use this script, the Secure Shell and SFTP commands must be installed. To check if the commands are\ninstalled, enter which ssh and which sftp on the UNIX or Linux command line.\nParameters to send inserter control files to the inserter controller lists the parameters that you can specify on the supplied scripts to send\ninserter control files from RICOH ProcessDirector to the inserter controller. Brackets indicate optional parameters.\nParameters to send inserter control files to the inserter controller\nScript Parameters to send inserter control files to the inserter controller (Send command)\ncopy_file.sh (Linux) -d destination_directory/filename\n[-p file_permissions]\ncopy_file.pl (Windows) [-v]\nftp_file.sh (supported -d destination_directory/filename\non Linux only) -h host\n[-p file_permissions]\n-u user_id\n[-v]\n-w password\n-x put\nscp_file.sh (supported -d destination_directory/filename\non Linux only) -h host\n[-p file_permissions]\n-u user_id\n[-v]\n-x put\nsftp_file.sh (supported -d destination_directory/filename\non Linux only) -h host\n[-p file_permissions]\n-u user_id\n[-v]\n-x put\nNote:\nDo not specify any parameters in addition to the ones shown in this table. For example, do not specify the -s parameter to identify the\nsource directory and filename.\n-d destination_directory/filename\nSpecifies the destination directory and file name of the inserter control file. In the file name, you can use a RICOH ProcessDirector symbol to\ninclude the value of a RICOH ProcessDirector property in the file name. For example, the ${Job.Inserter.JobID} symbol obtains the value of\nthe Inserter job name property.\n-h host\nSpecifies the host name of the separate computer.\n-u user_id\nSpecifies the login name on the separate computer.\n-v\nSpecifies the verbose mode to help troubleshoot problems. This parameter is optional.\n-w password\nSpecifies the login password on the separate computer.\n-p file_permissions\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:19 PM Using scripts to send inserter control files and receive results files - Jenski - Test portal- RPD Linux\nSpecifies the permissions, in octal format, to set (using the UNIX chmod command) on the inserter control file in the destination directory.\nThis parameter is optional. If it is omitted, the script does not set any permissions.\n-x put\nIndicates that the inserter control file is to be sent from RICOH ProcessDirector to another system.\nParameters to receive inserter results files to RICOH ProcessDirector lists the parameters that you can specify on the supplied scripts to\nreceive inserter results files from the inserter controller to RICOH ProcessDirector. Brackets indicate optional parameters.\nParameters to receive inserter results files to RICOH ProcessDirector\nParameters to receive inserter results files Parameters to receive all inserter results files in a directory\nScript (Receive command) (Polling command)\ncopy_file.sh (Linux) -s source_directory/filename -s “source_directory/*”\ncopy_file.pl (Windows)\nftp_file.sh (supported -h host -h host\non Linux only) -s source_directory/filename -s “source_directory/*”\n-u user_id -u user_id\n[-v] [-v]\n-w password -w password\n-x get -x get\nscp_file.sh (supported -h host -h host\non Linux only) -s source_directory/filename -s “source_directory/*”\n-u user_id -u user_id\n[-v] [-v]\n-x get -x get\nsftp_file.sh (supported -h host -h host\non Linux only) -s source_directory/filename -s “source_directory/*”\n-u user_id -u user_id\n[-v] [-v]\n-x get -x get\nNote:\nDo not specify any parameters in addition to the ones shown in this table. For example, do not specify the -d parameter to identify the\ndestination directory.\n-h host\nSpecifies the host name of the separate computer.\n-u user_id\nSpecifies the login name on the separate computer.\n-v\nSpecifies the verbose mode to help troubleshoot problems. This parameter is optional.\n-w password\nSpecifies the login password on the separate computer.\n-s source_directory/filename\nSpecifies the source directory and file name of the inserter results file. The file name can use a RICOH ProcessDirector symbol to include the\nvalue of a RICOH ProcessDirector property in the file name. For example, the ${Job.Inserter.JobID} symbol obtains the value of the Inserter\njob name property.\n-s “source_directory/*”\nSpecifies the source directory that contains the inserter results files. The asterisk (*) in the file name specifies all files in the directory. Enclose\nthe entire parameter value in quotation marks.\n-x get\nIndicates that RICOH ProcessDirector is to receive the inserter results file or files from another computer.\nExamples\nThese examples show the scripts that you can specify in the Send command property of the inserter controller to send the inserter control file for\na job from RICOH ProcessDirector to the inserter controller.\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:19 PM Using scripts to send inserter control files and receive results files - Jenski - Test portal- RPD Linux\ncopy_file.sh -d /inserter/input/${Job.Inserter.JobID}.icf -p 644ftp_file.sh -x put -h sys1 -u user1 -w\npass1 -d /inserter/input/${Job.Inserter.JobID}.icf -p 644scp_file.sh -x put -h sys1 -u user1 -w pass1 -\nd /inserter/input/${Job.Inserter.JobID}.icf -p 644sftp_file.sh -x put -h sys1 -u user1 -d\n/inserter/input/${Job.Inserter.JobID}.icf -p 644\nThese examples show commands that you can specify in the Receive command property of the inserter controller to receive the inserter results\nfile for a job from the inserter controller to RICOH ProcessDirector:\ncopy_file.sh -s /inserter/output/${Job.Inserter.JobID}.icfftp_file.sh -x get -h sys1 -u user1 -w pass1\n-s /inserter/output/${Job.Inserter.JobID}.icfscp_file.sh -x get -h sys1 -u user1 -w pass1 -s\n/inserter/output/${Job.Inserter.JobID}.icfsftp_file.sh -x get -h sys1 -u user1 -s\n/inserter/output/${Job.Inserter.JobID}.icf\nThese examples show commands that you can specify in the Polling command property of the inserter controller to receive all the inserter results\nfile in a directory from the inserter controller to RICOH ProcessDirector:\ncopy_file.sh -s \"/inserter/output/*.icf\"ftp_file.sh -x get -h sys1 -u user1 -w pass1 -s\n\"/inserter/output/*.icf\"scp_file.sh -x get -h sys1 -u user1 -w pass1 -s\n\"/inserter/output/*.icf\"sftp_file.sh -x get -h sys1 -u user1 -s \"/inserter/output/*.icf\"\nParent topic: Configuring the system to use inserters\n4 of 4"}]}