{"doc_name": "dt_o_scen_deadlinetimeofday.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_scen_deadlinetimeofday.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2144, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Time of day deadline in a workflow scenario - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker / Usage scenarios for Deadline Tracker\n/ Time of day deadline in a workflow scenario\nTime of day deadline in a workflow scenario\nIn this scenario, all of the jobs in a linear PDF workflow must be printed by 5:00 pm on the day after they are received.\nYou place one SetDeadline step in the workflow. You specify PrintJobs as the value of the Deadline step property. You specify Tomorrow as the\nvalue of the Deadline date property. You specify 5:00 PM as the value of the Deadline time property.\nLinear PDF workflow\nSetJobPropsFromTextFile\nDetectInputDataStream\nCountPages\nSetDeadline: makes PrintJobs the deadline step; sets tomorrow at 5:00 pm for the deadline time\nPrintSetup: lets the operator verify that the requested paper is loaded in the trays\nCreatePageRanges\nPrintJobs\nRetainCompletedJobs\nRemoveJobs\nWith this workflow, you can see whether a job meets or misses its 5:00 pm deadline. If a job misses its deadline, RICOH ProcessDirector adds a\nred dot to the Schedule risk column for the job in the Jobs table.\nA new customer asks if you can turn around jobs that arrive before noon on the same day, with later jobs finishing the next day. To accomplish\nthis, you can use time of day deadlines in a conditional workflow. For example, you have a workflow with two branches.\nThe connector to the first step in branch A has a rule with two conditions:\nCurrent day = Today\nCurrent time < 12:00 PM\nYou specify that All of the conditions apply.\nWhen these conditions are met, the job is sent down branch A. The SetDeadline step sets the value of the Deadline time to Today at 5:00 PM.\nThe connector to the first step in branch B has a rule with two conditions:\nCurrent day = Today\nCurrent time => 12:00 PM\nYou specify that All of the conditions apply.\nWhen these conditions are met, the job is sent down branch B. The SetDeadline step sets the value of the Deadline time to Tomorrow at 5:00\nPM.\nParent topic: Usage scenarios for Deadline Tracker\n1 of 1"}]}