{"doc_name": "ppfrsample_c_ModifyAFPwfForForms.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_c_ModifyAFPwfForForms.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7000, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Modifying a workflow to use electronic forms with AFP jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to use electronic forms / Modifying a workflow to use electronic forms with AFP jobs\nModifying a workflow to use electronic forms with AFP jobs\nYou can add a step based on the CombineAFPWithForm step template to a workflow to combine an electronic form with data for AFP jobs.\nThe step adds PDF pages as medium overlays to medium maps and creates an inline form definition containing those medium maps.\nNote:\nThe CombineAFPWithForm step template is available when the Preprinted Forms Replacement, PDF Document Support, and AFP Support\nfeatures are installed.\nThe step ignores any values set for the Media and PLE Media job properties.\nYou cannot add an electronic form to a side of a sheet when the side already has eight medium overlays.\nBefore you add the step to the workflow:\nReview the printers used to print jobs that the workflow processes. The output of the step can be printed only on AFP printers that support PDF\nobject containers in AFP data.\nReview the preprinted forms used to print jobs that the workflow processes. Add electronic forms to the media objects for the preprinted forms\nthat you want to print on plain paper. You do not have to define electronic forms for all the preprinted forms used by the workflow. You can\ndefine electronic forms only for the preprinted forms that you want to replace.\nReview the medium maps used to print jobs that the workflow processes. If the medium maps specify tray numbers, define a tray mapping file\nthat replaces tray numbers with media names.\nTo create the file, use an editor that saves text in UTF-8 format:\nMap each tray to a RICOH ProcessDirector media name on a separate line.\nStart each line with traytomedia, a space, the tray number, and a colon (:).\nAfter the colon, put the RICOH ProcessDirector media name enclosed in quotation marks.\nWhite space on either side of the colon is optional.\nThis example maps two trays to RICOH ProcessDirector media names:\ntraytomedia 1 : \"Letter Preprinted\"\ntraytomedia 2 : \"A3\"\nMake sure that the case of the RICOH ProcessDirector media name matches the case of the media name in the medium map. Letter Blue\nand LETTER BLUE do not match.\nIf you specify a media name that is not a RICOH ProcessDirector media object, the step ignores the media name. The tray number remains in\nthe medium map.\nSave the mapping in a text file in UTF-8 format.\nFor example, you could give the file a CFG extension and save it in a subdirectory of the /aiw/aiw1/control_files directory (Linux) or the\nC:\\aiw\\aiw1\\control_files directory (Windows).\nTo modify a workflow to use electronic forms with AFP jobs:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Review the steps in the workflow and decide where you want to add the CombineAFPWithForm step.\nIf your workflow has an afpnorm command in a step based on the RunExternalProgram step template, put the CombineAFPWithForm step\nafter the RunExternalProgram step. You can use the afpnorm command to insert IMM structured fields before the first page of every\ndocument in an AFP file.\nTo modify a simple workflow that processes AFP jobs, you could put a CombineAFPWithForm step after the UseInlineFormDefinition step (if\nit exists) and before the EnableRepositioning step.\nTo modify a workflow that processes AFP jobs that contain documents, you could put a CombineAFPWithForm step after the\nBuildAFPFromDocuments step and before the EnableRepositioning step.\n5. Add the CombineAFPWithForm step to the workflow in the appropriate place.\n6. Set the properties for the step:\nUnless you have special processing requirements, use the default value for the Combined AFP file property.\nIf you specify another value, the combined AFP file does not become the current print file used by subsequent steps.\nIf you defined a tray mapping file, set the value of the Tray mapping file property to the full path and name of the file.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Modifying a workflow to use electronic forms with AFP jobs - Jenski - Test portal- RPD Linux\nYou can use RICOH ProcessDirector symbol notation for the name of the file. See the example at the end of this procedure.\n7. Optional: Add a branch that bypasses the CombineAFPWithForm step to process jobs that are not ready to use electronic forms. Jobs print\non preprinted forms when they go through that branch. When you add the branch, the same workflow can process the jobs that are ready\nto use electronic forms and the jobs that are not ready.\nTo send the jobs to different branches based on whether they use electronic forms, set a rule on one of the branches. For example, if you\nwant jobs with a Customer name of Acme or Pinnacle to use electronic forms, you could set this rule on the branch with the\nCombineAFPWithForm step:\nJob.CustomerName = 'Acme' OR Job.CustomerName = 'Pinnacle'\nJobs with a Customer name of Bank10 or Standard bypass the CombineAFPWithForm step and continue to print on preprinted forms.\n8. Save the workflow.\n9. Enable the workflow and test it to make sure that it works properly.\nCheck the jobs that the CombineAFPWithForm step processes to make sure that they print on the media specified by the Media name for\nprinting property of the media object.\nThe CombineAFPWithForm step can process AFP jobs that use an inline form definition or an external form definition. The step creates a\ncombined AFP file that uses an inline form definition. If the AFP job uses an external form definition, the step embeds the changed form\ndefinition with new medium maps inline in the combined AFP file.\nWhen a media object includes an electronic form for the back side, and the medium map specifies simplex printing, the CombineAFPWithForm\nstep modifies the medium map:\nIt converts simplex to duplex.\nIt turns on the Constant Back flag.\nIt wraps the PDF file for the requested electronic form in an overlay and assigns the overlay to the back of the media.\nUsing a different tray mapping file for each printer\nIn this example, you want to use a different tray mapping file for each printer that can be requested for AFP jobs.\nName each file with the value of the Requested printer property (database name Job.RequestedPrinter) and a CFG extension.\nStore the files in the tray_mapping subdirectory of the control_files directory.\nSet this value for the Tray mapping file property:\n/aiw/aiw1/control_files/tray_mapping/${Job.RequestedPrinter}.cfg on Linux\nC:\\aiw\\aiw1\\control_files\\tray_mapping\\${Job.RequestedPrinter}.cfg on Windows\nParent topic: Setting up to use electronic forms\n2 of 2"}]}