{"doc_name": "dt_o_scen_deadlineconditionwf.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_scen_deadlineconditionwf.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2713, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Three deadlines in a conditional workflow scenario - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker / Usage scenarios for Deadline Tracker\n/ Three deadlines in a conditional workflow scenario\nThree deadlines in a conditional workflow scenario\nIn this scenario, a conditional workflow has separate processing paths for PDF jobs, AFP jobs, and other jobs (PostScript and PCL). PDF jobs go\nthrough a time-consuming preflight step performed with the PitStop Connect Feature. AFP jobs go through a time-consuming accounting step\nthat runs an external program. Other jobs do not go through the time-consuming preflight or accounting steps. You want to set a different\ndeadline for each path: two hours for PDF jobs, 90 minutes for AFP jobs, and 30 minutes for other jobs. You place a SetDeadline step at the start\nof each path.\nConditional workflow: shared steps\nSetJobPropsFromTextFile\nDetectInputDataStream\nPath for PDF jobs\nSetDeadline: makes PrintJobs the deadline step; sets two hours for the deadline time (Deadline date = Relative to property value;\nProperty = Time submitted; Plus or minus = 2 hours).\nPreflight (step based on RunPitStopOnJob step template)\nCountPages\nPrintSetup (step based on AssignJobValues step template): assigns print properties to PDF jobs.\nCreatePageRanges\nPath for AFP jobs\nSetDeadline: makes PrintJobs the deadline step; sets 90 minutes for the deadline time (Deadline date = Relative to property value;\nProperty = Time submitted; Plus or minus = 90 minutes).\nCountPages\nAccounting (step based on RunExternalProgram step template): runs a program for the accounting department.\nPrintSetup (step based on AssignJobValues step template): assigns print properties to AFP jobs.\nCreatePageRanges\nPath for other jobs\nSetDeadline: makes PrintJobs the deadline step; sets 30 minutes for the deadline time (Deadline date = Relative to property value;\nProperty = Time submitted; Plus or minus = 30 minutes).\nPrintSetup (step based on AssignJobValues step template): assigns print properties to other jobs.\nShared steps\nPrintJobs\nRetainCompletedJobs\nRemoveJobs\nWith this workflow, you can see whether a job meets or misses its deadline to complete printing. If a job misses its deadline, RICOH\nProcessDirector adds a red dot to the Schedule risk column for the job in the Jobs table. Red dots are added for each type of job after print\ncompletion deadlines of different lengths are missed. Red dots are added for PDF jobs after two hours. Red dots are added for AFP jobs after 90\nminutes. Red dots are added for other jobs after 30 minutes.\nParent topic: Usage scenarios for Deadline Tracker\n1 of 1"}]}