{"doc_name": "creatingcontent.pdf", "doc_path": "data/raw/RPD-en-US/creatingcontent.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4470, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating rules for assigning content - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Adding content to white space in AFP files\n/ Assigning content to white space / Creating rules for assigning content\nCreating rules for assigning content\nYou create one or more rules for assigning content to white space so you can target the content for specific customers or for the best use of\navailable space.\nYou must create one or more white space definitions before you can assign content. Also, index tags you want to use as conditions in rules must\nexist in page groups. You can use AFP Indexer to create index tags.\nNote:\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo create rules for assigning content to white space:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains white space definitions.\n2. Click Mode ⇒ Whitespace Manager.\n3. Click Tools ⇒ Manage Campaigns.\nYou see the Manage Campaigns window.\n4. Select a white space definition from the list in the top pane of the window.\n5. Click Create rules/content.\nThe default rule Always is displayed and highlighted below the white space definition. Always means that the content is assigned to the\nwhite space with no restrictions.\n6. Optional: Specify one or more conditions if you want a rule other than Always:\n1. Click Create in the Conditions section.\nYou see the Create Condition window.\n2. Select an index tag and operator from the drop-down lists, type a value, and then click OK.\nThe Always rule is replaced with the condition you created.\n3. Optional: Click Create to create another condition for the rule.\nYou see the Create Condition window.\n1. Select an index tag and operator from the drop-down lists, type a value, and then click OK. The condition you created is added\nto the rule with the And operator between conditions.\n2. Optional: Click Or in the Combine conditions section to change the operator from the default And. The rule is displayed with\nOr as the operator between conditions.\n7. Specify the content that is assigned when the rule is true:\n1. Click Insert text to assign text. You see the Insert Text window.\n1. Define the text string data and the text color on the Text tab.\n2. Optional: Change the text font on the Font tab.\n3. Optional: Adjust the text position in the white space area on the Position tab.\n4. Click OK.\n5. Optional: Repeat the steps to add more text.\n2. Click Insert image to assign an image. You see the Insert Image window.\n1. On the Image tab, specify the image type, file name, and whether the image is added inline. If the file type is JPEG or GIF,\nspecify the width and height of the image.\n2. Optional: Adjust the image position in the white space area on the Position tab.\n3. Click OK.\n4. Optional: Repeat the steps to add another image.\n3. Click Preview to view how the text and images you created are displayed in the defined white space.\nYou see the If Content Preview window. To close the window, click the X in the upper right corner.\n8. Optional: Specify the content that is assigned when the rule is false.\nThis section is not available when the rule is Always.\n1. Click Insert text to assign text. You see the Insert Text window.\n1. Define the text string data and the text color on the Text tab.\n2. Optional: Change the text font on the Font tab.\n3. Optional: Adjust the text position in the white space area on the Position tab.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating rules for assigning content - Jenski - Test portal- RPD Linux\n4. Click OK.\n5. Optional: Repeat the steps to add more text.\n2. Click Insert image to assign an image. You see the Insert Image window.\n1. On the Image tab, specify the image type, file name, and whether the image is added inline. If the file type is JPEG or GIF,\nspecify the width and height of the image.\n2. Optional: Adjust the image position in the white space area on the Position tab.\n3. Click OK.\n4. Optional: Repeat the steps to add another image.\n3. Click Preview to view how the text and images you specified are displayed in the defined white space.\nYou see the Else Content Preview window. To close the window, click the X in the upper right corner.\n9. Optional: To create another rule, go to Step 4 and repeat the steps.\n10. Click OK.\nParent topic: Assigning content to white space\n2 of 2"}]}