{"doc_name": "rep_c_EnhancePDF.pdf", "doc_path": "data/raw/RPD-en-US/rep_c_EnhancePDF.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4640, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Enhancing PDF files for Archive - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Archive feature / Enhancing PDF files for Archive\nEnhancing PDF files for Archive\nUse the RICOH ProcessDirector Plug-in for Adobe Acrobat to enhance sample PDF files so that you can store the documents or historical\ninformation about them in a repository.\nThe files must have a page group, which identifies documents, as well as the document properties required to search for documents in the\nrepository. Use the RICOH ProcessDirector Plug-in for Adobe Acrobat to identify the page groups. For detailed information about the RICOH\nProcessDirector Plug-in for Adobe Acrobat functions that you use in this procedure, such as Define Document Property, see the online help for\nthe RICOH ProcessDirector Plug-in for Adobe Acrobat.\nTo enhance PDF files for use with the Archive feature:\n1. Open a PDF file in Adobe Acrobat Professional and click Ricoh ⇒ Select to make RICOH ProcessDirector Plug-in for Adobe Acrobat the\nactive tool.\n2. Draw a box around the text you want to use to define text-based page groups, or draw a box anywhere to define page groups that are not\nbased on text. Click Define Page Group.\n1. From the Page Groups drop-down menu, select Create fixed-length page groups or Begin page group when the selected text is\nfound.\nYou can define a page group based on a fixed number of pages or based on text that appears repeatedly throughout the PDF file. For\nexample, if Page 1 appears on the first page of each document, you can use that text to define page groups.\nNote:\nIf you use text to define the beginning of the page group, this text should appear in the same location on the first page of\nevery document.\nIf you are using a sample PDF file to define page groups, make sure that the content and location of the text you select are\nconsistent among the production PDF files.\n2. Click OK.\n3. Click Ricoh ⇒ View Page Group Navigator and verify that the documents in the PDF file have been defined correctly.\n4. Define the first document property that you want to use to search for documents in a repository:\n1. Left-click just above the top left corner of the data that you want to capture. Drag the mouse to draw a box around the data.\nMake the box big enough to capture the longest occurrence of the data in your PDF files. Some characters in a PDF file have a larger\nwhite space buffer than other characters. You can see the captured data in the Selected Text area of the dialog.\n2. Select Define Document Property from the popup menu.\n3. Select a RICOH ProcessDirector document property from the drop-down list.\nIf you need document properties that are not on the drop-down list, you must define those custom document properties in the\ndocCustomDefinitions.xml file. Then you run the docCustom utility to update configuration files and add those properties to the\ndatabase. After you load the new document properties, they are available in RICOH ProcessDirector Plug-in for Adobe Acrobat\nwherever you define document properties. For more information about editing the docCustomDefinitions.xml file, running the\ndocCustom utility, and loading RICOH ProcessDirector document properties, see RICOH ProcessDirector: Installing Document\nProcessing Features.\n4. Use the Placement Conditions section to specify the pages to extract the document property data from.\nIf you want to extract the document property data from the first page of each document, select Pages based on a rule, and then\nselect All Front Pages.\n5. Click OK to create the document property.\n6. Click Ricoh ⇒ View Document Property Values and scroll through several page groups in your PDF file to verify that RICOH\nProcessDirector Plug-in for Adobe Acrobat is extracting the correct document property values for each page group.\n5. Repeat the steps above to define each document property that you want to use to search for documents in a repository.\n6. When you are ready to save your page group definition and document properties, click Ricoh ⇒ Save Control File.\n7. Give the control file a name or accept the default value. Click Save. You see a confirmation message. Click OK.\n8. Send the control file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access to.\nNote: When you create your Archive workflow, specify the name and location of the control file in each step based on the\nIdentifyPDFDocuments or BuildPDFFromDocuments step template.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Enhancing PDF files for Archive - Jenski - Test portal- RPD Linux\nParent topic: Setting up the Archive feature\n2 of 2"}]}