{"doc_name": "aiw_media_detection.pdf", "doc_path": "data/raw/RPD-en-US/aiw_media_detection.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3941, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Media detection - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring media / Media detection\nMedia detection\nMedia detection refers to two actions that RICOH ProcessDirector must take when it sends jobs to cut sheet printers: determining what media a\njob should be printed on and determining what media is loaded in a printer. When RICOH ProcessDirector establishes that information, it can\nschedule jobs correctly.\nRICOH ProcessDirector uses media objects to detect and match media. Like printer objects, media objects are representations of physical objects\noutside of the system. Each media object represents a type of paper, transparency, or other substance that your printers can print on. You can\ndefine media objects for each type of media that you use in your environment. RICOH ProcessDirector uses those media objects to map the\nmedia requested by a job with the physical media that is loaded in the printer.\nRICOH ProcessDirector has two types of media object:\nSystem media\nRepresents media that is specified for jobs and that can be used for all printers.\nPrinter media\nRepresents the media that is used with a specific printer.\nSystem media and printer media might have different names for the same physical media. If the media names are different, you can create a\nmedia mapping to indicate that they represent the same physical media. For most printer types, you set the Media to use property to specify\nwhich media names to send to that printer with jobs.\nWhen a job is submitted with a job ticket, the job ticket usually includes information about the media that the job should be printed on. That\ninformation can include the name of the requested media, as well as properties of the media, such as size and color. The media detection\nmethod determines how the system interprets that information to set the Media property for the job.\nThe media detection method also affects how the Media ready property for a printer is set. If a printer supports SNMP or JMF, it can send\ninformation about the media loaded in its trays to RICOH ProcessDirector. The system compares that information with existing media objects to\nfind one that matches. When it finds a match, the name of the matching media object is used for the value of the Media ready property. If none\nof the existing media objects match, RICOH ProcessDirector creates a new one with the specified values and uses its name as the value of the\nMedia ready property. If the Media to use property is set to Printer, RICOH ProcessDirector creates printer media; if it is set to System, RICOH\nProcessDirector creates system media\nRICOH ProcessDirector provides two methods of media detection:\nAutomated\nThis option uses one or more media properties specified in the job ticket to determine the value of the Media property for the job. RICOH\nProcessDirector evaluates the property values in the job ticket and finds a media object with the same values. The name of the matching media\nobject is stored as the value of the Media property.\nIf more than one media object matches the specified properties, RICOH ProcessDirector uses additional logic to choose the most appropriate\nvalue.\nIn addition, this option lets RICOH ProcessDirector use SNMP or JMF to set the Media ready property for printers based on the properties of the\nmedia, and create media objects if needed.\nManual\nThis option uses the name of the media specified in the job ticket as the value of the Media property for a job, without checking any other\nmedia properties.\nYou must use the Show Trays action on the printer object to specify the media loaded in the printer.\nIf your printers do not support SNMP or JMF, you must use the manual method.\nWhen the Media property for a job and the Media ready property for printers are set, RICOH ProcessDirector can use its regular scheduling\nprocess to send a job to the appropriate printer.\nParent topic: Configuring media\n1 of 1"}]}