{"doc_name": "mcc_c_RetrieveAndProcessOrders.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_RetrieveAndProcessOrders.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4456, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Retrieving and processing orders from your MarcomCentral store - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral / Retrieving and processing orders from your MarcomCentral store\nRetrieving and processing orders from your MarcomCentral store\nAfter you set up an input device, order property mapping object, workflows, and a notification, do these steps to retrieve and process orders\nfrom your MarcomCentral store.\nTo retrieve and process orders from your MarcomCentral store:\n1. Enable your new workflows for processing MarcomCentral orders and job tickets:\n1. Click the Workflow tab.\n2. Right-click the workflow for processing orders and select Enable.\n3. Right-click the workflow for processing job tickets and select Enable.\n2. Enable your new notification:\n1. Click the Administration tab.\n2. In the left pane, click System ⇒ Notifications.\n3. Right-click the notification and select Enable.\n3. Enable your new input device:\n1. In the left pane, click Devices ⇒ Input Devices.\n2. Right-click the input device and select Enable and Connect.\n4. Log in to your store at the MarcomCentral website and create an order.\nAs an alternative, reorder selected items.\n5. Check to see if the order job appears on the jobs table and in the order table.\n6. If the order does not appear:\n1. Disable and disconnect the input device.\n2. Check the messages in the log for the input device.\n3. If the web service returned a 500 error, display the properties for the input device. Click the Authentication tab, and reenter your\norder token in the Static credential property.\n4. If a message states that nothing in the response matched the value of the response pattern, click the Request tab. Check the value of\nthe Time zone offset property.\nMake sure that the value is the offset in hours between Coordinated Universal Time (UTC) and the time zone used by the\nMarcomCentral web service.\nFor example, if the MarcomCentral web service uses Pacific Standard Time, make sure that the value is -8.\n5. Enable and connect the input device.\n7. After the order appears in the orders table, check to see if jobs appear under it and in the jobs table.\n8. If jobs do not appear:\n1. Disable the workflow.\n2. Check the state of the order job and the messages in its job log.\n3. Save and enable the workflow.\n4. Right-click the job and select Process Again. Process the job from the first step in the workflow.\n9. If a child job goes into the Error state in the CallSOAPService step in the job ticket workflow:\n1. Check the messages in the job log.\n2. Display the properties for the step.\n3. If a message in the job log states that the web service returned a 500 error, reenter your order token in the Password field.\nOther problems, such as an incorrect SOAP request, can cause the web service to return a 500 error.\n4. If a message in the job log states that the web service returned a 400 error, check the payload.\nOther problems can cause the web service to return a 400 error.\n10. If a child job is sent to the FailWithMessage step in the job ticket workflow, display the properties for the Wait step. Increase the value of\nthe Wait for property.\n11. To solve other problems with job processing, check the messages in the job log.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Retrieving and processing orders from your MarcomCentral store - Jenski - Test portal- RPD Linux\n12. When the state of all the jobs in the order changes to Retained, the notification calls the CloseoutByOrder operation in the Order\nCloseout web service.\nMarcomCentral changes the value in the Order Status column for each item in the order to Shipped. The ship date for the item is the date\nwhen MarcomCentral received the notification. Depending on how you set up your store, other values can change. For example,\nMarcomCentral can assign an invoice number and date and a packing slip number.\n13. Log in to your MarcomCentral store and verify that the status of all the items in the order is Shipped.\n14. If the status remains Work in Progress:\n1. Check the messages in the log for the notification.\n2. If the web service returned a 500 error, display the properties for the notification. Click the Authentication tab, and re-enter your\ncloseout token in the Static credential property.\n3. At your MarcomCentral store, verify that the status of all the items in the order is Shipped.\nParent topic: Setting up to process orders from MarcomCentral\n2 of 2"}]}