{"doc_name": "avanti_c_configSlingshot.pdf", "doc_path": "data/raw/RPD-en-US/avanti_c_configSlingshot.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3914, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Configuring Slingshot to submit jobs to RICOH ProcessDirector - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Configuring Slingshot to submit jobs to RICOH ProcessDirector\nConfiguring Slingshot to submit jobs to RICOH ProcessDirector\nAvanti Slingshot uses JDF Types to submit jobs to RICOH ProcessDirector. You create a JDF Type and assign it to each printer device that prints\nRICOH ProcessDirector jobs.\nIf your Avanti support representative created the JDF Types required to submit Slingshot jobs to RICOH ProcessDirector, you can use these\ninstructions to create more JDF Types.\nRICOH ProcessDirector can receive one or more PDF files with each JDF job ticket. When RICOH ProcessDirector receives multiple PDF files, it\ncreates a separate job for each of them.\nSlingshot can submit PDF files to RICOH ProcessDirector by including them in the MIME package or putting a link to them in the JDF job ticket.\nWe recommend configuring Slingshot to submit PDF files to RICOH ProcessDirector in the MIME package.\nIf Slingshot puts a link to PDF files in the JDF job ticket, make sure that the RICOH ProcessDirector system user has authority to read them. The\ndefault system user is aiw1.\nWhen receiving jobs from Slingshot, RICOH ProcessDirector checks whether the MIME package includes PDF files. If the package does not include\nany PDF files, RICOH ProcessDirector checks the JDF job ticket for a link to the files.\nRICOH ProcessDirector requires JDF that does not contain any nested JDF nodes.\nNote:\nFor a typical implementation of Slingshot, you do these steps to exchange information with RICOH ProcessDirector. Your implementation\nof Slingshot can have steps that differ from these steps.\nTo configure Slingshot to submit jobs:\n1. Create a JDF Type.\n1. Log in to the Avanti Slingshot client.\n2. Navigate to System Setup ⇒ General and double-click JDF Type.\n3. Click New ( ).\n4. In the JDF Type Code field, type a name such as RPD Sender. Fill in other values as needed.\n5. On the JDF/JMF Options tab, specify these JDF Output Options:\nClick the PDF check box for File Types to Send.\nIf Slingshot sends PDF files to RICOH ProcessDirector in the MIME package, click the Copy to hot folder check box for Attached\nFiles.\nIf Slingshot sends a link to PDF files in the JDF job ticket, make sure that Copy to hot folder is not checked.\nClick the check box for Use Combined JDF Format.\nMake sure that Include All Job Sections is not checked.\nNote:\nThe settings for Use Combined JDF Format and Include All Job Sections produce JDF that does not contain any nested JDF\nnodes.\nClick the check box for Send JDF via MIME.\n6. For JMF Messages, click the check boxes for all the options.\n7. On the Connection Options tab:\nFor JMF HTTP URL, enter this URL:\nhttp://yourserver:15080/aiwservices/v1/jmf\nReplace yourserver with the IP address or host name of your RICOH ProcessDirector server.\nFor JMF Return HTTP URL, enter the value provided by your Avanti support representative.\n8. Click Save Record ( ).\nIf you want to send jobs to different RICOH ProcessDirector servers, you can create multiple JDF Types.\n2. Attach the JDF Type to the estimating standard for each printer device that prints RICOH ProcessDirector jobs.\n1. Navigate to System Setup ⇒ Estimating and double-click My Estimating Standards.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Configuring Slingshot to submit jobs to RICOH ProcessDirector - Jenski - Test portal- RPD Linux\n2. In Table View, find the printer device that you want to attach the JDF Type to.\nThe name of the device is in the Description column.\n3. Display Detail View by clicking the arrow to the left of the device.\n4. Click Edit ( ).\n5. Select the JDF Type on the JDF Type list.\n6. Click Save Record ( ).\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n2 of 2"}]}