{"doc_name": "pdfw_t_plugin_addomr.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addomr.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7224, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Adding OMR marks to a PDF file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Adding markup to a PDF file\n/ Adding OMR marks to a PDF file\nAdding OMR marks to a PDF file\nYou can add a variety of OMR marks of different height, width, and pitch to a PDF file. You can limit the placement of OMR marks to specific\npages in each page group by specifying a rule or typing page numbers.\nNote:\nIf your brand of inserters or other machinery requires specific OMR marks, you must use the specifications from your supplier.\nTo add OMR marks:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains a page group definition or define a page group.\n2. Use the left mouse button to draw a box where you want the OMR marks to print. You do not need to draw the box to the exact size of\nthe OMR marks.\nThe OMR marks are not resized to fit within the box. If you draw a box to the approximate size of the OMR marks, you can see their\nposition relative to all the markup you add to the PDF file.\n3. Select Add OMR.\n4. Type a Name for the OMR marks. Do not use spaces or special characters (such as @, #, $, or %). You can use periods and underscores.\n5. Optional: Use the Location section of the definition window to change the placement of the OMR marks by entering new Horizontal and\nVertical coordinates. These coordinates specify the distance between the top left corner of the page and the top left corner of the OMR\nmarks. If your manufacturing equipment has a specification for the location of the OMR marks, use these coordinates to set a precise\nlocation.\nNote: Width and Height change the size of the markup box but do not affect the location or size of the OMR mark.\n6. Use the Placement Conditions section to specify the pages to place the OMR marks on. Do either of these:\nSelect Pages based on a rule, and then select a rule from the drop-down list. The default rule is All Pages. You can also:\nClick the icon to define a new rule.\nClick the icon to go to the Rules Manager.\nSelect Specify pages and type the pages in each page group that you want. You can:\nUse a hyphen to separate the first and last pages in a page range.\nUse a comma to separate page selections.\nType n to specify the last page.\nExample: a PDF file has two page groups. The first has four pages, and the second has seven pages. Specifying pages 3–n places\nmarkup on pages 3–4 in the first page group, and pages 3–7 in the second.\n7. Use the Physical Configuration section to define the OMR content and form. If the OMR Content drop-down list has the name of the\nconfiguration you need, select it from the list. OMR configuration files have a .omr extension and are saved by default in the RICOH\nProcessDirector Plug-in for Adobe Acrobat application data directory. If you need a different configuration than the one that is selected,\nclick the Manage Content button.\nTip:\nYou can view the application data directory location for the current user by typing %appdata% in Windows Run command line and\nclicking OK.\n1. If you do not want to modify the selected OMR configuration file, click New or Copy.\n2. Use the Add and Remove buttons to manage the OMR content in the Chosen Marks box. Use the Move Up, Move Down, and\nReverse buttons to specify the order in which the marks are printed.\nThe Table Available OMR marks describes the marks you can add to your OMR definition.\nAvailable OMR marks\nOMR mark name Description\nBlank Leaves a space equal to the OMR pitch value plus the OMR height value.\nCollate Indicates that the current group of pages need to be enveloped. This mark normally\nappears only on the first or last sheet of a page group.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Adding OMR marks to a PDF file - Jenski - Test portal- RPD Linux\nOMR mark name Description\nFeeder Defines the location for a feeder station mark. There can be multiple occurrences of this\nmark.\nGate Sometimes used to mark the start of an OMR set. If requested, this mark is always\npresent.\nParity Used to bring the total number of bars up to the required parity, either even or odd.\nSafety Sometimes used to mark the end of an OMR set. If requested, this mark is always\npresent.\nSequence Displays a sequence using from one to three bars or from one to four bars.\nVoid Leaves a space equal to the OMR Pitch value.\n3. In the OMR Configuration section of the Add OMR window, first select your Units of measure. Enter numeric values into the Height\nand Length fields to define the height and width of each OMR mark. Enter a numeric value into the Pitch field to define the distance\nbetween each OMR mark.\n4. In the Parity section, select whether your inserter uses Odd or Even parity checking.\n5. Select First Page or Last Page collation.\n6. If you select a sequence bar type, use the Sequence Range section to specify 1 through 7 for three bars or 1 through 15 for four bars.\n7. If you select a sequence bar type, use the Sequence section to define the bit order of the sequence bars. Select Up to print the bars in\na 1, 2, 4 order (three bars) or in 1, 2, 4, 8 order (four bars). Select Down to print the bars in 4, 2, 1 order or in 8, 4, 2, 1 order.\nIf the sequence is Up, a bar in the first position represents 1, a bar in the second position represents 2, bars in the first and second\npositions represent three, a bar in the fourth position represents 4, bars in the first and fourth positions represent 5, and so on.\n8. After you have defined the OMR content and structure definition click Save and then click Cancel to return to the main OMR\nconfiguration window.\n8. Use the Inserts field to select a fixed set of inserts for an entire job. You enter either a 0 or a 1 to tell the inserter which inserts to pull for\nevery document in a job. For example, on a six station inserter with stations numbered from one to six, if you want to add the inserts from\nstations two and four, you enter the value 010100 into the Inserts field.\n9. Click Ricoh ⇒ Preview to verify the OMR has the structure and page placement you intended.\n10. Optional: You can edit the OMR definition by double clicking the OMR box or by right-clicking the box and selecting Edit.\n11. When you are ready to save all your enhancements to the PDF file, including the new OMR marks definition, click Ricoh ⇒ Save Control\nFile.\nTip:\nWhen you save an OMR configuration, the OMR definition is saved to an OMR configuration file in the InfoPrint directory in your\napplication data directory. When you mark up a PDF file, add OMR marks, and save a control file, the OMR configuration is also\nsaved into the control file. You specify that control file in a BuildPDFFromDocuments step. You do not need to move the OMR\nconfiguration file to a directory accessible by RICOH ProcessDirector, but you can move the OMR configuration file to another\ncomputer used by RICOH ProcessDirector Plug-in for Adobe Acrobat if you want to share the configuration with someone else.\n12. In the RICOH ProcessDirector BuildPDFFromDocuments step, specify the name and location of the control file that contains the OMR marks\ndefinition.\nParent topic: Adding markup to a PDF file\n2 of 2"}]}