{"doc_name": "cac_HTandTTC.pdf", "doc_path": "data/raw/RPD-en-US/cac_HTandTTC.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2962, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Halftones and Tone Transfer Curves - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / Color Printing Concepts / Halftones and Tone Transfer Curves\nHalftones and Tone Transfer Curves\nHalftones are used to convert images (such as photographs, drawings, logos, or charts) from the continuous tones that you see on a monitor into\na pattern of dots that a printer can put on paper. Tone transfer curves are used to modify the values of a particular color component and thus\nadjust the look and feel of some of the colors. For example, you can apply a tone transfer curve to emphasize the brightest parts of an image.\nHalftones and tone transfer curves are used with both color and grayscale print jobs.\nThere are several different kinds of halftones, including clustered-dot, stochastic, and error diffusion. For simplicity, this discussion only covers\nclustered-dot halftones.\nClustered-dot halftones are generally characterized by:\nLine screen frequency\nLine screen frequency is a measure of the resolution of a halftone, expressed in lines per inch (lpi). A low line screen frequency, such as 80 lpi,\ncreates coarser images because they use larger halftone dots. A high line screen frequency, such as 150 lpi, can produce higher quality images\nby using smaller halftone dots.\nHalftone pattern\nHalftone dots are printed in various shapes and patterns. For example, dots can generally be round, elliptical, or square, and they can be\narranged in slightly different orientations. The halftone pattern also describes how the size of the dot is increased to cover a larger percentage\nof the total area and yield darker colors. Different patterns might produce better results for some print jobs.\nRotation\nLines of halftone dots do not run parallel with the top or side of the paper because that could cause unintended patterns to emerge, resulting\nin lower quality output.\nIn addition, the dots for each of the four colors in a CMYK printer cannot all be printed at the same angle because they would overlap\nincorrectly and the colors would not appear as intended. Instead, the lines of dots are printed on the page at specific angles so your eye blends\nthem appropriately.\nFor example, the black layer of an image might be printed so the lines of dots run across the page at a 45 degree angle to the top of the paper,\nwhile the cyan layer is printed so that its lines of dots are at a 105 degree angle to the top of the paper.\nTone transfer curves are most often used to offset the effects of dot gain. Dot gain is the tendency for printed dots to be larger than intended,\noften because of the way ink reacts with paper. If the ink soaks into the paper and spreads out, the resulting dot is much larger (and possibly\nmuch lighter in color) than the printer intended it to be. Tone transfer curves can increase or reduce the amount of ink used in proportion to the\ndot gain.\nParent topic: Color Printing Concepts\n1 of 1"}]}