{"doc_name": "UsingSuppliedInserterControllers.pdf", "doc_path": "data/raw/RPD-en-US/UsingSuppliedInserterControllers.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3116, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Using supplied inserter controller objects - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Defining inserter controller objects / Using supplied inserter controller objects\nUsing supplied inserter controller objects\nRICOH ProcessDirector provides inserter controller objects for several inserter manufacturers. You copy the sample inserter controller object for\nyour inserters and modify its properties.\nSupplied inserter controller objects lists the inserter controller objects that RICOH ProcessDirector provides.\nSupplied inserter controller objects\nInserter manufacturer Inserter controller name\nBowe BoweSample\nBowe with JetVision camera systems JetVisionSample\nBowe Bell & Howell BoweBellHowellSample\nGunther GuntherSample\nInserters with Ironsides camera systems IronsidesSample\nKern KernSample\nPitney Bowes PitneySample\nQuadient QuadientSample\nTo use a supplied inserter controller object:\n1. Click the Administration tab.\n2. Click Devices ⇒ Inserter Controllers.\n3. Right-click the inserter controller that you want to copy and select Copy.\nCopy the supplied object so that you can change the name of the object and also refer to the original sample object if necessary.\n4. On all the tabs, fill in the required properties and any optional properties.\nNote:\nIf the inserter controller is file-based (that is, the inserter controller uses control files), specify the properties on the Control File tab.\nIf the inserter controller uses two control files for each job, also specify the properties on the Second Control File tab.\nIf the inserter controller is not file-based, clear the default values in the properties on the Control File tab.\nIf the inserter controller writes results files:\nSpecify the properties on the Results File tab.\nIf the inserter results files are job-specific, specify a Receive command on the Results File tab.\nIf the inserter results files are not job-specific (such as Gunther results files), specify a Polling command on the Results File tab.\nAlso, in the Completion method property on the General tab, select Manual because RICOH ProcessDirector cannot automatically\ndetermine when a job has finished insertion.\nSpecify the rules files on the Results File tab.\nIf the results file for a job identifies only the documents that need to be reprinted:\nIn the Default insert status property on the General tab, select OK because documents that are not identified in the results file do\nnot need to be reprinted.\nIf the inserter controller does not write results files:\nClear the default values in the properties on the Results File tab.\nIn the Completion method property on the General tab, select Manual because RICOH ProcessDirector cannot automatically\ndetermine when a job has finished insertion.\nIn the Default insert status property on the General tab, select OK so that on the Reconcile Job page, the operator needs to mark\nonly the documents that need to be reprinted.\n5. Click OK.\n6. To use the new inserter controller, select it and click Enable.\nParent topic: Defining inserter controller objects\n1 of 1"}]}