{"doc_name": "doc_c_emailingdocs.pdf", "doc_path": "data/raw/RPD-en-US/doc_c_emailingdocs.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6478, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Emailing documents during job processing - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Email and progress updates / Emailing documents during job processing\nEmailing documents during job processing\nYou can email PDF documents by adding a step based on the EmailDocuments step template to a workflow.\nYou must provide an email address for each document and store the email address in a document property. You can use the Doc.EmailAddress\ndocument property, or you can define a custom document property in the docCustomDefinitions.xml file. After you define a custom\ndocument property, run the docCustom utility and update the Custom Document Properties feature.\nIf each document contains the email address of the document recipient, you can use the Define Document Property function in RICOH\nProcessDirector Plug-in for Adobe Acrobat to specify the email address data that you want to extract from each document in a job.\nIf you have the Preference Management feature installed, you can map email addresses in an external file to the document property for each\ndocument in the job.\nYou must have an SMTP server installed and configured to let RICOH ProcessDirector send email. RICOH ProcessDirector lets you connect to two\nSMTP servers. You might use the default SMTP server properties to connect to an internal SMTP server and the alternate SMTP server properties\nto connect to an email service provider.\nTo configure RICOH ProcessDirector to email documents during job processing:\n1. Make a copy of an existing workflow or create a new workflow.\n2. Add a step based on the EmailDocuments step template to the workflow after the BuildPDFFromDocuments step and before any step that\nreorders documents at the job level, such as ReversePDFPageOrder or PreparePDFOutputForFinishing.\nYou can place the EmailDocuments step after steps that reorder documents at the document level, such as GroupDocuments,\nSortDocuments, and SplitDocuments.\nFor jobs that email and print documents, a typical step order is:\nIdentifyPDFDocuments\nSortDocuments\nBuildPDFFromDocuments\nEmailDocuments\nPreparePDFOutputForFinishing\nPrintJobs\nIf you add a step to keep a copy of the job file in the spool directory to use for extracting documents to email, you can place the\nEmailDocuments step after a step that reorders documents at the job level. For example, you can place a step based on the SnapshotJobFile\nstep template after the BuildPDFFromDocuments step and before the step that reorders documents:\nIdentifyPDFDocuments\nSortDocuments\nBuildPDFFromDocuments\nSnapshotJobFile\nPreparePDFOutputForFinishing\nPrintJobs\nEmailDocuments\nImportant:\nIf you do not follow these recommendations for step placement, the EmailDocuments step could send a document to the incorrect\nemail address without recording an error.\n3. Connect the step to the other steps in the workflow.\nIf you want to print some documents and email others, add conditional processing to the workflow or create child workflows.\nFor example, you can:\nAdd conditional processing for parent and child jobs at the start of the workflow (for example, after a SetJobPropsFromTextFile step).\nDefine a rule for the branch that receives the parent jobs: Job number Unlike *.*. Child jobs, which have a decimal point in their job\nnumber, go to the branch for child jobs.\nDefine a Doc.Custom.EmailPreference document property with values of Yes and No.\nUse a step based on the GroupDocuments step template to group the documents based on the value of the Doc.Custom.EmailPreference\ndocument property.\nUse a step based on the CreateJobsFromDocuments step template to create a separate child job for each group.\nUse a step based on the SetDocPropsFromConditions step template at the start of the branch for child jobs. The step assigns a value to a\njob property based on the value of the Doc.Custom.EmailPreference document property.\nThe property conditions file might set the value of the Custom 1 job property (database property name Job.Info.Attr1) to email or\nprint:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Emailing documents during job processing - Jenski - Test portal- RPD Linux\nDoc.Custom.EmailPreference,Job.Info.Attr1\n=Yes,email\n=No,print\nSend the child jobs to separate email and print branches of the branch for child jobs by defining rules on the branches:\nCustom 1 = email for the branch with the EmailDocuments step.\nCustom 1 = print for the branch with the PrintJobs step.\n4. Specify property values for the EmailDocuments step:\n1. Set a value for the Recipient address property.\nFor example, you want to email each document to the email address in the Doc.EmailAddress document property. Set the value to\n${Doc.EmailAddress}.\n2. Set a value for the SMTP server type property.\nFor example, you want to send documents to an external SMTP server that has been configured with the Alternate SMTP server\nproperties. Set the value to Alternate.\n3. Set the Attach document property to Yes.\n4. Set a value for the Source file for attachment property.\nExamples:\nYou want to attach a document from the current PDF file in the job's spool directory. Use the default value:\n${getFileName(print,pdf,read)}.\nYou want to attach a document from a PDF file that you saved with a SnapshotJobFile step. If you set the value of the Snapshot file\ndescriptor property on the SnapshotJobFile step to email, use this value: ${getFileName(email,pdf,read)}.\n5. Set a value for the Subject property, the Message property, or both.\nFor example, you extracted the customer name from each document by defining a Doc.Custom.CustomerName document property.\nYou can set the value of either property to Statement for ${Doc.Custom.CustomerName}.\n6. Fill in or edit values for any other optional properties that you plan to use.\n5. After you save and enable your workflow, test the workflow to make sure that it is working properly:\n1. Create a test job with a small number of documents. They should have valid email addresses that you want to test with.\n2. Send the job through the workflow and make sure that the correct document is sent to each email address.\nWhen the EmailDocuments step sends a document to the SMTP server, it sets the Email created property value to Yes in the document property\nfile. If the step does not send a document, it sets the property value to No.\nNote:\nRICOH ProcessDirector does not receive information from the SMTP server about sending email or successful delivery to recipients.\nParent topic: Email and progress updates\n2 of 2"}]}