{"doc_name": "dt_c_setup_deadlinetracker.pdf", "doc_path": "data/raw/RPD-en-US/dt_c_setup_deadlinetracker.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1963, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Setting up Deadline Tracker - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up Deadline Tracker\nSetting up Deadline Tracker\nAfter you read the Deadline Tracker overview topics, set up Deadline Tracker by doing the configuration tasks described in this section.\nAfter the initial configuration is complete, test your Deadline Tracker workflows to make sure they work as you expect them to.\nIn this section:\nDefining expected work\nExpected work represents jobs that are expected to arrive before a specific time or during a particular interval. You set up expected work objects\nand associate them with input devices so the input devices can monitor for the work that is supposed to arrive and warn you when that work is\nlate.\nSetting deadlines for jobs\nYou can set a deadline for each job that enters a workflow. To create a deadline, you add a step based on the SetDeadline step template to a\nworkflow, specify a deadline date and time (or an offset from another date and time), and select the step that the job must complete to meet\nthe deadline.\nSetting estimated durations for steps in a workflow\nYou can set the estimated durations for each step in a workflow and use these values to track the progress of jobs through the workflow. Using\nthe estimated durations, the system provides a predicted completion time. The system also provides a predicted path of the job.\nSetting up service policies\nService policies define checkpoints and a deadline for jobs. Checkpoints help you see if jobs are on schedule to meet the performance\ncommitments in a service level agreement (SLA); the SLA deadline represents the ultimate goal of the SLA.\nSetting up no-service periods\nNo-service periods define the periods of time when your installation does not provide services (for example, holidays and weekends). Each service\npolicy specifies whether all the no-service periods apply to the service policy.\nParent topic: Configuring\n1 of 1"}]}