{"doc_name": "aiw_jobtype_pdfbanners.pdf", "doc_path": "data/raw/RPD-en-US/aiw_jobtype_pdfbanners.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3660, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Setting up workflows to print PDF banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / PDF banner pages / Setting up workflows to print PDF banner pages\nSetting up workflows to print PDF banner pages\nYou can update existing workflows to print PDF banner pages or create new ones.\nTo set up a workflow to print PDF banner pages:\n1. Click the Workflow tab.\n2. Right-click an existing workflow that processes PDF jobs and select Copy. Name the copy of the workflow, fill in or edit other values that\nyou need, and click Continue. If none of your existing workflows are appropriate, do this:\n1. Right-click the PDF workflow, and select Copy.\n2. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n3. If the new workflow does not process PDF jobs, right-click the CountPages step, and select Delete. Connect the\nDetectInputDataStream step to the RunExternalProgram step. Right-click the CreatePageRanges step, and select Delete. Connect the\nRunExternalProgram step to the PrintJobs step.\nDo not delete these steps if the new workflow processes PDF jobs. These steps are needed to reprint a range of pages in PDF jobs.\n4. If the new workflow processes PDF jobs and the value of the Create .zip file property for the hot folder that assigns jobs to this\nworkflow is set to Yes, add a step based on the BuildPDFFromZIP step template to the workflow before the first step that expects PDF\ninput (for example, EnableRepositioning, CreatePageRanges, or PrintJobs ). Update the properties.\n3. Right-click the PrintJobs step and select Properties.\n4. Change the values of the Binding, Fold options, Job class, Job form, Job destination, Requested location, Media, Output bin, Punch, and\nStaple properties to match the scheduling properties of the printer that you want to print on.\n5. Change the values of these banner page copies properties as needed.\nHeader copies\nSet this value to 1 or greater to print one or more header pages before a job or to 0 to omit the header page.\nTrailer copies\nSet this value to 1 or greater to print one or more trailer pages after a job or to 0 to omit the header page.\nSeparator copies\nThis value is ignored. Printers that are defined on application servers or primary servers do not support printing separator pages.\n6. Change the values of the banner page configuration file properties as needed. The default values for the Header page configuration file\nand Trailer page configuration file properties refer to configuration files for PDF banner pages.\nTo use the supplied configuration files for header and trailer pages on a printer defined on the application server, you must specify the drive\nletter of the application server that the printer is running on and the file path to the header and trainer configuration files. For example, the\napplication server uses Z: to connect to the primary computer’s /aiw directory, and the file paths to the configuration files on the primary\ncomputer are /aiw/aiw1/control_files/banner_pages/header.jrxml and\n/aiw/aiw1/control_files/banner_pages/trailer.jrxml. Change the values to:\nHeader page configuration file: Z:\\aiw1\\control_files\\banner_pages\\header.jrxml\nTrailer page configuration file: Z:\\aiw1\\control_files\\banner_pages\\trailer.jrxml\nTo use the supplied configuration files for header and trailer pages on a Passthrough printer, change the values to:\nHeader page configuration file: /aiw/aiw1/control_files/banner_pages/header.jrxml\nTrailer page configuration file: /aiw/aiw1/control_files/banner_pages/trailer.jrxml\n7. Click OK.\n8. Save the workflow.\nParent topic: PDF banner pages\n1 of 1"}]}