{"doc_name": "cac_ReplaceInserts.pdf", "doc_path": "data/raw/RPD-en-US/cac_ReplaceInserts.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3333, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Eliminating physical inserts - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP color solution scenarios / Eliminating physical inserts\nEliminating physical inserts\nA print service bureau wants to reduce the number of physical inserts that they have to add to envelopes by printing full color electronic inserts\nin blank areas on credit card statements.\nThe print service bureau prints statements and one-to-one advertising brochures for a variety of customers. The customers send their resources\nand print job data to the service bureau. The pre-press staff uses a document composition tool to create AFP jobs. The AFP print jobs are\nsubmitted to RICOH ProcessDirector, which sends them to ten duplex InfoPrint 4100 systems. After the jobs are printed, they go to post-\nprocessing to be folded, inserted, and mailed.\nThe service bureau asks all their customers to submit required resources with every print job; they do not store resources indefinitely. Many of\ntheir customers (such as credit card companies) include inserts in the envelope with their statements. Some problems with this arrangement are:\nInserters often ruin mailpieces, so they frequently have to reprint individual statements. Reprinting adds time and cost to the process.\nCustomers tend to ignore the inserts, separating them from the statement immediately after opening the envelope and discarding them.\nThe service bureau would like expand its offerings to include full-color variable-data printed using an AFP color solution. They also think that they\ncan save time, money, and paper by reducing the complexity of the tasks that their inserters do. If the inserter only has to fold each statement\nand put it in an envelope (instead of adding two more sheets of paper, folding, and inserting), it has fewer opportunities for ruining mailpieces.\nThe solution\nThe service bureau works with the Ricoh team to create a solution based on its existing process and environment that will help their customers\nmove away from using physical inserts for advertising and toward electronic inserts. They hope to eliminate one of their inserters by printing full\ncolor ads directly in blank areas or on sides of customer statements.\nIf a credit card company can identify data and rules that determine the characteristics of each customer, the electronic inserts can be targeted for\neach statement. For example, the bill could show an ad for a minivan, a sports car, or a motorcycle depending on the demographics of the\ncustomer.\nImplementation\nTo take advantage of this new color capability, the service bureau makes a few changes to their workflow:\nThey add a duplex InfoPrint 5000 system and configure RICOH ProcessDirector to submit print jobs to it.\nThey give guidelines to their customers so that it includes guidelines for using color images and logos in addition to fonts and graphics.\nThey train the pre-press department is trained to use a graphics application for color profile management and image normalization.\nThey add a step to their process to make sure that their customers have followed the guidelines. If they have not, the pre-press staff adjusts the\nresolution and input color profiles to conform to the guidelines before they submit the print job.\nParent topic: AFP color solution scenarios\n1 of 1"}]}