{"doc_name": "mcc_c_configformcc.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_configformcc.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4388, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Setting up to process orders from MarcomCentral - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral\nSetting up to process orders from MarcomCentral\nAfter you read the MarcomCentral Connect overview topic, run the sample workflows for processing orders retrieved from MarcomCentral. After\nyou understand how the sample SOAP web service input device, sample workflows, and sample SOAP web service notification work, you can do\nthe configuration tasks.\nAfter the initial configuration is complete, test your MarcomCentral workflows to make sure that they work as you expect them to.\nIn this section:\nRunning the sample workflows for processing orders retrieved from MarcomCentral\nThe MarcomProcessOrders and MarcomProcessJobTicket workflows show how to process orders retrieved from a sample store at the\nMarcomCentral website. The sample store serves as a test environment for the RICOH ProcessDirector web services interface to MarcomCentral.\nA SOAP web service input device, a CallSOAPService step, and a SOAP web service notification communicate with the MarcomCentral website.\nThe workflows also include examples of these steps: ApplyXSLTransform, CreateOrdersFromFile, and DownloadFile\nPlanning how to process orders from your MarcomCentral store\nIn this procedure, you map MarcomCentral XML elements for orders and job tickets to RICOH ProcessDirector order and job properties. You\ndecide how to supply the information required for RICOH ProcessDirector to process the items in an order. You also decide what criteria to use to\nreport status to MarcomCentral.\nPreparing to call MarcomCentral web services\nIn this procedure, you import WSDL files and install a security certificate. If your environment requires a proxy server to communicate with\nMarcomCentral, set up the system to use it. You decide whether you want to call operations in MarcomCentral web services in addition to those\noperations called by the sample input device, workflows, and notification. If you do, you learn the requirements of the operations and manually\ntest the web services.\nPreparing to retrieve orders from MarcomCentral\nTo retrieve orders from a store at the MarcomCentral website, copy the MarcomReceiveOrders SOAP web service input device supplied with the\nMarcomCentral Connect feature. The Request URL and Request payload properties of the input device are set to call the Order MarcomCentral\nweb service and retrieve orders by date. Set other properties to values that work with your MarcomCentral store and RICOH ProcessDirector\nworkflows.\nDefining a workflow to process MarcomCentral orders\nTo process orders retrieved from a store at the MarcomCentral website, copy the MarcomProcessOrders workflow supplied with the\nMarcomCentral Connect feature. The CallSOAPService step calls the Job Ticket MarcomCentral web service and retrieves job tickets by order\nnumber. Modify that step and others in the workflow by setting the step properties to values that work with your MarcomCentral store and\nRICOH ProcessDirector workflows.\nDefining a workflow to process MarcomCentral job tickets\nTo process job tickets retrieved from a store at the MarcomCentral website, copy the MarcomProcessJobTicket workflow supplied with the\nMarcomCentral Connect feature. The CallSOAPService step (inside the MarcomDownloadPrintFile step chain) calls the Job Ticket MarcomCentral\nweb service and retrieves job tickets by order number. Modify that step and others in the workflow by setting their properties to values that work\nwith your MarcomCentral store and RICOH ProcessDirector workflows.\nPreparing to send status to MarcomCentral\nTo send status to a store at the MarcomCentral website, copy the MarcomCloseoutOrders SOAP web service notification supplied with the\nMarcomCentral Connect feature. The Request URL and Request payload properties of the notification are set to call the Order Closeout\nMarcomCentral web service and send the ID of the completed order. Set other properties to values that work with your MarcomCentral store and\nRICOH ProcessDirector workflows.\nRetrieving and processing orders from your MarcomCentral store\nAfter you set up an input device, order property mapping object, workflows, and a notification, do these steps to retrieve and process orders\nfrom your MarcomCentral store.\nParent topic: Configuring\n1 of 1"}]}