{"doc_name": "pdfw_over_plugin_mediafinishing.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_over_plugin_mediafinishing.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2384, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Media and finishing - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Media and finishing\nMedia and finishing\nYou can specify media and finishing options for your sample PDF file and apply them as page exceptions to the job-level media and finishing\noptions specified for RICOH ProcessDirector jobs.\nYou can apply media and finishing options to a range of pages or to the documents (page groups) within a PDF file. When applying media and\nfinishing options to documents, you can use pre-defined rules or custom rules. For example, you can use a pre-defined rule to print the first page\nof each document on blue paper. You can define a custom rule so that each page with the words Premier Member in the upper right corner\nprints on gold paper.\nMedia and finishing options that you specify with RICOH ProcessDirector Plug-in for Adobe Acrobat override the options that RICOH\nProcessDirector specifies for jobs.\nNote:\nRICOH ProcessDirector Plug-in for Adobe Acrobat supports RICOH ProcessDirector media with electronic forms. The Show electronic\nforms preference determines whether Preview shows how sample files look when the data is combined with electronic forms defined for\nthe media that the files use.\nYou can preview the PDF file as you add media and finishing options to verify that they have been applied to the intended pages.\nYour media and finishing definitions are saved in the RICOH ProcessDirector Plug-in for Adobe Acrobat control file. RICOH ProcessDirector uses\nthe control file to apply the definitions to print jobs automatically.\nIn this section:\nManaging media and finishing options\nThe Media and Finishing dialog shows information about your media and finishing options for a PDF file. You can edit and delete options, select\nnew media and finishing options, and set the order in which RICOH ProcessDirector applies the options to a PDF file.\nSelecting media and finishing options\nYou can select media and finishing options for specific pages in each page group by specifying a rule or typing page numbers. For example, you\ncan specify that pages 1–4 of each page group are stapled. You can also specify that the first page of each page group prints on gold paper.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}