{"doc_name": "aiw0osysobj.pdf", "doc_path": "data/raw/RPD-en-US/aiw0osysobj.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7435, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM System objects - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects\nSystem objects\nA RICOH ProcessDirector system is made up of several objects.\nIn this section:\nPrimary server\nThe RICOH ProcessDirector base product is made up of the primary server, the user interface, and the information center. The primary server\nincludes the RICOH ProcessDirector database, the PSF print driver, and other components. The primary server can interact with application servers\nand secondary servers. The number of application and secondary servers required depends on the needs of your environment. The primary\ncomputer is the computer that the primary server, along with the rest of the base product and most features, is installed on.\nSecondary servers\nSecondary servers let you distribute processing, so that your RICOH ProcessDirector system runs more efficiently.\nApplication server\nAn application server is a Windows system configured to communicate with RICOH ProcessDirector. If your workflows require processing by\napplications that run on Windows, you can access those applications by installing RICOH ProcessDirector application server code on a Windows\ncomputer.\nWorkflows\nA workflow defines a set of steps that a job follows through the system. A printing process can contain one or more workflows, depending on\nthe type of processing required and the configuration of your system.\nStep templates, steps, and step chains\nStep templates are the basic building blocks for processing on the RICOH ProcessDirector system. A step template contains the code that does a\nspecific action, such as creating or removing a job. It can also define default job property values. When you add a step to a workflow, you select\na step template to use as the basis for the step.\nInput device types\nInput devices receive input files, create jobs, and submit them to the RICOH ProcessDirector system for processing.\nPrinters\nPrinter objects represent the printers in your environment that receive print jobs from RICOH ProcessDirector.\nLocations\nA location is an object that you create to represent a geographical or physical location, such as a name of a city or a room number in a building.\nYou can also create locations to reflect limited-access spaces, such as a secure print area where sensitive jobs are produced. After you create\nlocations, you can use them to restrict access to objects. Many objects have a Location property, including printers and jobs.\nMedia objects\nMedia objects represent the paper, forms, or envelopes that jobs are printed on. RICOH ProcessDirector uses them to determine the media that\njobs request and to schedule jobs to printers.\nNotifications\nNotification objects define the events that cause the system to generate notifications. You can define any number of notification objects based\non the needs of your shop.\nUsers and groups\nAll RICOH ProcessDirector users must have a unique RICOH ProcessDirector user name and password and must belong to at least one RICOH\nProcessDirector group.\nSystem user and group\nWhen you install RICOH ProcessDirector on an UNIX-based system, the installation program creates a RICOH ProcessDirector system user as a\nmember of the RICOH ProcessDirector group. You use the system user to log in to the system that RICOH ProcessDirector runs on.\nCredentials\nA credential object specifies the user authentication information required to access an SFTP server or another application. You can use credentials\nwith input devices, steps, and data transmitters that need access to other servers or applications.\nStep resources\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:20 PM System objects - Jenski - Test portal- RPD Linux\nA step resource identifies a file that is used by a workflow step for its processing. Some step templates allow you to specify a file for the step to\nuse when processing jobs. Some of these files might be created on your workstation but need to be available to the workflow when it processes\njobs. You can view, retrieve, and replace the file by editing the step resource object.\nCustom properties\nCustom properties are properties that are unique to your implementation of RICOH ProcessDirector. You create them when the standard job,\ndocument, and order properties do not meet your needs.\nOrder\nThe Order Management feature adds a new object named Order.\nLog\nYou can use the system log to view messages and other information about the primary RICOH ProcessDirector system.\nBarcode format objects\nBarcode format objects help RICOH ProcessDirector interpret barcodes that you scan while jobs are processing. When your barcode format\nobjects are configured correctly, you can scan a barcode and use the information in it to find a document in RICOH ProcessDirector.\nBarcode readers\nBarcode readers represent the cameras and barcode scanners in your Automated Verification installation that read barcodes on documents in a\nprint job to verify that each document has been processed.\nData Collectors\nData collector objects capture property values during job processing and store them in a PostgreSQL database created by the Reports feature.\nYou can access that data and use it as input to your business intelligence software.\nData Transmitters\nData transmitter objects let you configure what data in the PostgreSQL database created by the Reports feature to send to another application.\nDocuments\nA document is the smallest unit that can be tracked by a workflow. For example, a document can be a set of pages that make up one bill, one\nstatement, or one mailpiece.\nInserter controller objects\nInserter controller objects represent the inserter controllers in your installation. An inserter controller is software that runs on another computer\n(such as a Windows computer) and can manage several inserter devices that insert printed documents and additional inserts (such as marketing\nmaterials) into envelopes.\nRepositories\nRepository objects hold job and document data that you want to store so you can retrieve it later. When you retrieve the job or document\ninformation, you can view the job, submit it again, or review detailed information about the job or document and its processing history. You can\ncreate multiple repositories, each with a unique retention period.\nService policies\nA service policy defines job checkpoints and the service level agreement (SLA) deadline. Checkpoints let you track the progress of jobs as they\nflow through the system; the SLA deadline represents the time that the job must complete a specific processing step to meet your commitments\nto your clients.\nNo-service periods\nA no-service period defines a period of time when an installation does not provide services (for example, a holiday). No-service periods work\ntogether with service policies but are not considered for deadlines set by the SetDeadline step or the Change Deadline action.\nExpected work\nExpected work objects represent jobs that are scheduled to arrive at specific intervals. You can associate expected work objects with input devices\nso the input devices can monitor for those jobs to arrive. If they do not arrive when they are expected, the system alerts you.\nProperty mapping\nProperty mappings are used by steps to transfer values provided in a structured file to RICOH ProcessDirector properties. The Preferences\nManagement and Order Management features add distinct types of property mapping objects.\nParent topic: Product overview\n2 of 2"}]}