{"doc_name": "tt_c_CustomVerifyRecipPDF.pdf", "doc_path": "data/raw/RPD-en-US/tt_c_CustomVerifyRecipPDF.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2965, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Customizing the Verification recipient document property for PDF files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature / Customizing the Verification recipient document property for PDF files\nCustomizing the Verification recipient document property for PDF files\nYou can customize the Verification recipient document property for PDF files that you process at your installation. Operators can then use the\nVerification recipient property to identify documents that need to be reprinted during manual reconciliation.\nFor example, if you customize the Verification recipient property to capture customer name data, the operator can use the Verification recipient\nproperty to find a document with the customer name that is displayed in the address window of the envelope of a damaged mailpiece.\nNote:\nYou see the values of the Verification recipient property in the Recipient column of the Documents table on the Reconcile Job dialog. The\ndatabase name of the property is Doc.Verification.Recipient.\nTo customize the Verification recipient document property:\n1. Open a PDF file in Adobe Acrobat Professional and load the control file that you created to enhance PDF files for Automated Verification.\n2. Left-click just above the top left corner of the data that you want to capture. Drag the mouse to draw a box around the data.\nMake the box big enough to capture the longest occurrence of the data in your PDF files. Some characters in a PDF file have a larger white\nspace buffer than other characters. You can see the captured data in the Selected Text area of the dialog.\nIf you are capturing customer name data, draw a box around the customer name.\n3. Select Define Document Property from the popup menu.\n4. Select Doc.Verification.Recipient from the drop-down list.\n5. Use the Placement Conditions section to specify the pages to extract the document property data from.\nIf you want to extract the document property data from the first page of each document, select Pages based on a rule, and then select All\nFront Pages.\n6. Click OK to create the document property.\n7. Click Ricoh ⇒ View Document Property Values and scroll through several page groups in your PDF file to verify that RICOH ProcessDirector\nPlug-in for Adobe Acrobat is extracting the correct document property values for each page group.\n8. When you are ready to save your new document property definition, click Ricoh ⇒ Save Control File, the click Save. You see two\nconfirmation messages. Click Yes and then OK.\n9. When you configure your Automated Verification workflow, specify the name and location of the control file in the step based on the\nBuildPDFFromDocuments step template.\nFor more information about working with document properties, see the plug-in help system or RICOH ProcessDirector: Using RICOH\nProcessDirector Plug-in for Adobe Acrobat.\nParent topic: Setting up the Automated Verification feature\n1 of 1"}]}