{"doc_name": "AssociatingInserterControllersWithJobs.pdf", "doc_path": "data/raw/RPD-en-US/AssociatingInserterControllersWithJobs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2108, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Associating inserter controller objects with jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Defining inserter controller objects / Associating inserter controller objects with jobs\nAssociating inserter controller objects with jobs\nYou can associate an inserter controller object with jobs. Each job can have one associated inserter controller object.\nRICOH ProcessDirector uses the inserter controller object for the job to:\nWrite the inserter control file for the job and send it to the inserter controller.\nReceive the inserter results file for the job from the inserter controller and interpret it.\nTo associate an inserter controller object with jobs, you specify the name of the inserter controller object in the Inserter controller job property.\nYou can specify this property in a step based on the WriteInserterControlFile or InsertJobs step template.\nIf you change the Inserter controller property for a job that is already in the system, use the Process Again action to reprocess the job starting at\nthe step based on the WriteInserterControlFile step template (if one exists) or from the step based on the InsertJobs step template.\nTo associate an inserter controller object with jobs:\n1. Click the Workflow tab.\n2. Click the name of the workflow that the jobs use.\nThe workflow must contain a step based on the WriteInserterControlFile or InsertJobs step template.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Right-click the step based on the WriteInserterControlFile or InsertJobs step template, and select Properties.\n5. On the Insert tab, select the inserter controller object for the Inserter controller property.\n6. Click OK.\n7. Save and enable the workflow.\nParent topic: Defining inserter controller objects\n1 of 1"}]}