{"doc_name": "aiw_sdk_fileloc.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_fileloc.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4810, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Locating files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Configuring to use JDF job tickets / Locating files\nLocating files\nApplications that submit jobs with JDF job tickets can either send the files along with the job ticket, or leave the files in another location on the\nnetwork. The job ticket is not required to list the files that the job contains. However, if the job ticket does list the files, it can use either relative\npath names or absolute path names.\nRegardless of how RICOH ProcessDirector finds the files, it copies them into the location specified in the Folder location property of the hot\nfolder input device (if they are not there already) and starts to process the job. RICOH ProcessDirector does not automatically delete all the files\nthat are used in jobs that are submitted with JDF job tickets. It only deletes the files in the Folder location. It does not delete files that are in\nsubfolders of the Folder location or that are on other file systems. You must plan to delete the files that are left in the those locations as part of\nyour system maintenance.\nNot listing files in JDF\nIf the job ticket does not list the files, RICOH ProcessDirector expects to receive the job ticket and all the files in the location specified in the\nFolder location property of the hot folder input device. If any of the files are missing, RICOH ProcessDirector continues to wait for them.\nIn this case, you must use the List batching method and submit a list file with the job.\nListing files using relative path names\nIf the job ticket lists the files using relative path names, RICOH ProcessDirector expects to find all the files in subfolders of the Folder location;\nthey cannot be in parallel folders or on any other file systems. For example, if the job ticket includes the file path printfiles/test.pdf, the hot\nfolder expects to find the file in: [folder location]/printfiles/test.pdf.\nYou can use these formats for a relative path name:\ndir/filename\nfilename\nThese formats are supported but not recommended:\nfile://dir/filename\nfile://dir\\filename\ndir\\filename\nfile://./dir/filename\nfile://.\\dir\\filename\n./dir/filename\n.\\dir\\filename\nIn RICOH ProcessDirectorfile:// is equivalent to file:///. RICOH ProcessDirector does not permit a host name or an IP address after the\nsecond forward slash (/).\nListing files using absolute path names\nIf the job ticket lists the files using absolute path names, the files can be anywhere on your network that is accessible from the RICOH\nProcessDirector primary server. RICOH ProcessDirector uses the absolute path statements in conjunction with a mapping file to find the files. A\nmapping file is a file that matches the file paths in the job ticket to file paths on mounted file systems. The mapping file is stored on the primary\nserver. Only one mapping file is needed for a primary server; it can list as many file paths as needed.\nWhen RICOH ProcessDirector looks for the files listed in the job ticket with absolute paths, it looks in each location listed in the mapping file until\nit finds them. If it reaches the end of the mapping file without finding the files, it looks for files received in the Folder location. If it still does not\nfind the files, it waits and checks again at the next poll interval.\nYou can use these formats for an absolute path name:\nfile://hostname/drive:/dir/filename\nOmit drive: for files on systems that do not use drive letters.\nThese formats are supported but not recommended:\nfile:///drive:\\dir\\filename\nfile://drive:/dir/filename\nfile://drive:\\dir\\filename\ndrive:\\dir\\filename\ndrive:/dir/filename\nIn RICOH ProcessDirectorfile:// is equivalent to file:///. RICOH ProcessDirector does not permit a host name or an IP address after the\nsecond forward slash (/).\nThese formats are not supported:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Locating files - Jenski - Test portal- RPD Linux\nfile://IP_address/drive:/dir/filename\nfile://localhost/drive:/dir/filename\nNote:\nYou need a file system mapping file if the file paths include identical directory names but have different formats. For example, if the job\nticket specifies file:\\\\\\C:\\myfiles\\testfiles\\test1.pdf and the actual file path is /myfiles/testfiles/test1.pdf, you must\ncreate a file system mapping file to convert the file path from Windows to Linux format.\nYou need a file system mapping file if the file paths include identical directory names but have different drives. For example, if the job\nticket specifies file:\\\\\\D:\\myfiles\\testfiles\\test1.pdf and the actual file path is file:\\\\\\C:\\myfiles\\testfiles\\test1.pdf,\nyou must create a file system mapping file to convert the file path from the D drive to the C drive. The mapping looks like this:\nD:\\;C:\\\nParent topic: Configuring to use JDF job tickets\n2 of 2"}]}