{"doc_name": "pdfw_over_plugin_docprops.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_over_plugin_docprops.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7912, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Working with document properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with document properties\nWorking with document properties\nYou can define document properties from data in your PDF file that you want to use for later print processing. When RICOH ProcessDirector\nprocesses PDF files with document property definitions, it extracts, or mines, values from each page group in a PDF file. For example, you can\ncreate document properties to extract data in each page group in a PDF file and define that data as the content of a barcode that prints on a\npage in the same page group.\nWhen you define a document property, you specify data in the PDF file. You can apply conditional processing rules to tell RICOH ProcessDirector\nPlug-in for Adobe Acrobat and RICOH ProcessDirector where to extract the data from and when to extract it. For example, you want to apply\nconditional processing rules that extract an account number from the first page of every page group when an account is overdue. First you create\na conditional trigger on text that indicates the account is overdue. Then you define a rule with two conditions. One condition specifies that the\n“overdue” text is present. The other condition specifies the pre-defined rule First Front Only. You choose to apply the new rule when all of its\nconditions are met. Finally you define the account number as a document property and select the new rule in the Placement Conditions section.\nRICOH ProcessDirector Plug-in for Adobe Acrobat and RICOH ProcessDirector extract the account number from the first front page of each page\ngroup when the “overdue” text is present.\nWhen you define a document property in RICOH ProcessDirector Plug-in for Adobe Acrobat, you select a RICOH ProcessDirector document\nproperty from a list or define your own document property name. If you define your own document property name instead of selecting a RICOH\nProcessDirector document property, that document property cannot be integrated into RICOH ProcessDirector functions that save the properties\nto the database. You cannot use that document property for functions in RICOH ProcessDirector document processing features, or for markup\ncontent in barcodes or text. You should choose to create your own document property in RICOH ProcessDirector Plug-in for Adobe Acrobat only\nif you are going to extract your document properties to a file or if you know the document property will exist in RICOH ProcessDirector when\nyour PDF files are processed. If you need to use a document property with RICOH ProcessDirector, create it in RICOH ProcessDirector and then\nselect the document property from the list in RICOH ProcessDirector Plug-in for Adobe Acrobat.\nNote:\nYou see the database or system names for document properties in the lists in RICOH ProcessDirector Plug-in for Adobe Acrobat and the\ndocument properties list in the RICOH ProcessDirector viewer. In those lists you do not see custom or translated document property\nnames.\nViewing document property values\nAfter you define one or more document properties, you click Ricoh ⇒ View Document Property Values to see the values of the document\nproperties in the active PDF file. You can verify that the conditional processing rules and the text selected for each document property are correct.\nUse the document property view to verify that none of the document property values are longer than the text selection box you drew. RICOH\nProcessDirector Plug-in for Adobe Acrobat truncates any text that extends beyond the text selection box.\nNote:\nThe Document Property window is a useful tool for you to keep open as you define document properties. After you create your first\ndocument property and view its values, you can click the Update Table button in the Document Property window at any time to update\nthe table with changes that you made to the document properties.\nSaving document property values\nIf you need to use document property values outside the product, click Save while viewing document property values. RICOH ProcessDirector\nPlug-in for Adobe Acrobat saves the values to a tab-delimited text file.\nUsing document properties in RICOH ProcessDirector\nYou define how document properties are used in different RICOH ProcessDirector print processing steps. For example, you define how RICOH\nProcessDirector uses document properties in its barcode creation function. You can also use document property values to search for a specific\ncustomer account from a PDF print job if you need to reprint a mailpiece of that one customer.\nCreating new document properties in RICOH ProcessDirector\nAfter you install your document processing feature, you define all of the custom document properties you need in the\ndocCustomDefinitions.xml file. When you run the docCustom utility to update configuration files, those properties are added to the database.\nIf you need to create additional custom document properties, you edit the docCustomDefinitions.xml file and rerun the docCustom utility.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Working with document properties - Jenski - Test portal- RPD Linux\nNote:\nIf you use custom document properties, starting with Version 3.11.2, you can create them on the Administration tab, using Objects ⇒\nCustom Properties.\nYou can choose the database name and the label that displays in property notebooks and column headings. You can also choose what\nkind of data to store in the property, and the default access that the different user groups have for the property, without adding them to\nthe docCustomDefinitions.xml file.\nIf you already have custom document properties defined in a docCustomDefinitions.xml file, you can continue to use them. Do\nnot re-create them from the Administration tab. Only use that tab to create new job or document properties.\nAfter you load the new document properties values, they are available to you in the plug-in wherever you define document properties. For more\ninformation about editing the docCustomDefinitions.xml file and running the docCustom utility, see RICOH ProcessDirector: Installing\nDocument Processing Features.\nNote:\nWhen you define document properties you can define a document property as a limited document property. Limited document\nproperties do not need database table space; however, they occupy space for each document in each document properties file that\ncontains the property.\nIn this section:\nDefining a document property\nDocument processing features can store document property values in the RICOH ProcessDirector database. The features rely upon document\nproperties for later downstream processing of PDF files in RICOH ProcessDirector.\nDefining multiple document properties\nYou can define multiple document properties in a block of data in a PDF file. A block of data can be text, DataMatrix barcodes encoded as\nimages, or both.\nDefining an address block\nYou can define document properties in an address block in each document in a PDF file. After you define the document properties, you can\nextract and view them or save them in a text file.\nViewing document property values\nAfter you create a document property in a sample PDF file, you can view the data values for that property. You view document property values to\nverify that you have selected the right location for the property and defined the correct conditional extraction rules. You can click a document\nproperty value to go to the first page of the page group that contains the value.\nSaving document property values\nAfter you create document properties in a sample PDF file, you can save the data values for those properties. For example, you can save the\naccount numbers in a PDF file that you plan on printing for an audit or printed in the past for an audit.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n2 of 2"}]}