{"doc_name": "definingheadertrailers.pdf", "doc_path": "data/raw/RPD-en-US/definingheadertrailers.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1997, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Defining header and trailer pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating page groups\n/ Defining header and trailer pages\nDefining header and trailer pages\nAfter you create fixed-length page groups or page groups with triggers, you can define header and trailer pages and decide if the pages are kept\nin the final output for viewing and printing.\nWhen you define header pages, AFP Indexer skips the defined number of header pages at the beginning of the AFP file before creating the first\npage group.\nNote: The header and trailer pages are supplemental pages, so you can index any text in those pages.\nTo define header and trailer pages:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. If the AFP file does not contain page groups, create page groups.\n3. Click Tools ⇒ Header and Trailer Pages.\nYou see the Header and Trailer Pages window.\n4. If the page groups are created with triggers, do one of these:\nClick All pages before the first page group to define all pages before the first page group as header pages.\nClick Fixed length header to define a certain number of pages as header pages.\n5. If displayed, select the number of header pages in Pages in header.\n6. If displayed, select the number of trailer pages in Pages in trailer.\n7. Clear the boxes if you do not want to keep the header or trailer pages in the output. The pages will not be viewable or printable in RICOH\nProcessDirector.\n8. Click OK.\nIf you defined header and trailer pages and decided to keep the pages in the output, you see header pages preceding the page groups in\nthe left pane and trailer pages following the page groups; if you want, you can create index tags on those pages. If you decided not to\nkeep the header and trailer pages in the output, you do not see those pages in the left pane.\nParent topic: Creating page groups\n1 of 1"}]}