{"doc_name": "aiw_o_mediaov.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_mediaov.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1856, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Media - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Media\nMedia\nRICOH ProcessDirector uses media objects to represent physical media. Like printer objects, media objects are representations of physical objects\noutside of the system. Each media object represents a type of paper, envelope or other material that your printers can print on.\nYou can define media objects for each type of media that you use in your environment. RICOH ProcessDirector uses those media objects to map\nthe media requested by a job with the physical media that is loaded in the printer.\nRICOH ProcessDirector has two types of media object:\nSystem media\nRepresents media that is specified for jobs and that can be used for all printers.\nPrinter media\nRepresents the media that is used with a specific printer.\nSystem media and printer media might have different names for the same physical media. If the media names are different, you can create a\nmedia mapping to indicate that they represent the same physical media. For most printer types, you set the Media to use property to specify\nwhich media names to send to that printer with jobs.\nBy defining media objects with enough information about the properties of the media that distinguish them from one another in your operation,\nRICOH ProcessDirector can send the right information to the printer to select the correct media.\nIn this section:\nMedia matching\nWhen RICOH ProcessDirector sends jobs to cut sheet printers, it must determine two things: what media a job should be printed on and what\nmedia is loaded in a printer. When RICOH ProcessDirector establishes that information, it can schedule jobs correctly.\nMedia substitution\nYou can use media mapping to change the media that a job requests. Media mappings are specific for each printer.\nParent topic: Product overview\n1 of 1"}]}