{"doc_name": "vwb_EnhancerOverview.pdf", "doc_path": "data/raw/RPD-en-US/vwb_EnhancerOverview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3131, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM AFP Enhancer overview - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP support for documents / RICOH Visual Workbench / AFP Enhancer\nAFP Enhancer\nAFP Enhancer mode of RICOH Visual Workbench lets you create barcodes, text, and hidden areas in documents.\nBarcodes and text are used for a variety of purposes, such as routing and tracking mail and adding page numbers to documents. If you hide\nareas in documents, no one using an AFP viewer sees the data in the area, and the data does not print. You make these enhancements in sample\nAFP files that represent your production AFP files.\nAFP Enhancer creates these types of barcodes:\nCode 39\nData Matrix\nInterleaved 2–of-5\nIntelligent Mail (IMB)\nPOSTNET\nQuick Response (QR) Code\nAFP Enhancer lets you hide existing barcodes and replace them with new barcodes.\nTo define a barcode or text, you use the Content Expression Language (CEL). Components of CEL expressions include index values, document\nproperties, job properties, keywords, and static text. Several CEL examples are provided.\nAFP Enhancer lets you limit the placement of barcodes, text, and hidden areas to specific pages in each document. For example, AFP Enhancer\nlets you place a barcode on the first page of each document or text on all the even-numbered pages. AFP Enhancer also lets you limit placement\nbased on conditional processing. For example, you create a CEL expression to place text on the first page of a document when the value of the\nState document property is California or New York.\nControl files used with AFP Enhancer\nYou save your AFP Enhancer work in a Visual Workbench control file.\nWhen you are ready to use the barcodes, text, and hidden areas in a workflow, you use the Export EnhanceAFP Control File function to save an\nEnhanceAFP control file to a directory on the primary computer that RICOH ProcessDirector has access to.\nNote: AFP Enhancer lets you use a graphical user interface to create the information in the EnhanceAFP control file. Another way to create\nor modify an EnhanceAFP control file is with a text editor. If you edit the file, that information is not available to AFP Enhancer.\nStep templates used with AFP Enhancer\nThese step templates use the EnhanceAFP control file to change the content of AFP files:\nBuildAFPFromDocuments\nA step based on this step template creates an AFP file for a job. If you define barcodes, text, and hidden areas in an EnhanceAFP control file,\nthis step applies them. The AFP file produced by this step becomes the AFP file for the subsequent steps in the workflow.\nCreateAFPJobsFromDocuments\nA step based on this step template generates one or more child AFP jobs. If you define barcodes, text, and hidden areas in an EnhanceAFP\ncontrol file, this step applies them.\nBuildEnhanceAFPFile (for Advanced Document Pool only)\nIf you have the Document Pool extended feature, a step based on this step template creates a control file that manages enhancements so that\nsome documents have different enhancements than other documents.\nParent topic: RICOH Visual Workbench\n1 of 1"}]}