{"doc_name": "aiwi0_enhancefeat.pdf", "doc_path": "data/raw/RPD-en-US/aiwi0_enhancefeat.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1909, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM No-charge product enhancement features - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features\nNo-charge product enhancement features\nThese features provide support for adding languages, stronger security, and some frequently added job properties to your system. They also add\nthe ability to work with the individual PDF documents inside a job and collect data about your system for reporting purposes.\nThese features are provided with the base product, but are not installed by default. They do not require an additional license.\nIn this section:\nCommon Properties\nThe Common Properties feature adds job and document properties that are useful for transaction processing and tracking purposes.\nCut Sheet support for TASKalfa feature\nThe Cut Sheet support for TASKalfa feature provides support for Kyocera TASKalfa 15000c production printers with the EFI Printing System 50\noption (EFI Fiery DFE).\nLanguage packs\nLanguage packs include translations for the user interface and help system. Each language pack includes the translated files for one language.\nPDF Document Support\nThe PDF Document Support feature adds functions and objects that let you process individual documents in PDF jobs. The feature includes\nRICOH ProcessDirector Plug-in for Adobe Acrobat.\nReports\nThe Reports feature lets you capture printer status changes, user actions, order status changes, and job and document property values in a\nPostgreSQL database. You can extract and analyze the data from the database using a business intelligence tool such as Tableau. You can also\ntransmit selected tables from the database to an application of your choice using a REST web service.\nSecurity feature\nThe Security feature provides advanced functions, including password requirements, that increase the security of user accounts.\nParent topic: Features\n1 of 1"}]}