{"doc_name": "aiwj_inlineresources.pdf", "doc_path": "data/raw/RPD-en-US/aiwj_inlineresources.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2300, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Configuring to use inline resources with line data jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up datastream transforms / Transforming line data to AFP / Configuring to use inline resources with line data jobs\nConfiguring to use inline resources with line data jobs\nIf you submit line data jobs with inline resources to a workflow that uses the ConvertLineDataJobIntoAFP step, most inline resources are ignored.\nTo recognize and use other inline resources, you must update the ConvertLineDataJobIntoAFP step.\nThe inline resources are ignored because the value of the Resource type property for the ConvertLineDataJobIntoAFP step of the workflow\ncontains these values: Form definition, Fonts, Inline. The value Inline indicates that RICOH ProcessDirector keeps all inline form definitions and\nfonts (the other values in the list) and does not write any other inline resources from the data stream to the output file. As a result, even if AFP\nDownload Plus or Download for z/OS includes page definitions or other resources inline with the job, RICOH ProcessDirector does not write them\nto the output file. To keep additional inline resources, you must update the value of the Resource type property for the\nConvertLineDataJobIntoAFP step in the workflow.\nTo configure to use inline resources with a line data print job:\n1. Click the Workflow tab.\n2. Click the name of the workflow that you want to edit, for example, DownloadLineData.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Right-click the ConvertLineDataJobIntoAFP step and select Properties.\n5. Click AFP.\nIn the Resource type field, you see a list of resources with Inline and Form definition selected.\n6. Add other types of inline resources to the Resource type by holding the Ctrl key and selecting the types of resources in the list.\n7. Click OK.\n8. To save and enable the workflow, change , the Save & Enable/Disable switch, to the On position.\nParent topic: Transforming line data to AFP\n1 of 1"}]}