{"doc_name": "rep_o_scen_ReprintJob.pdf", "doc_path": "data/raw/RPD-en-US/rep_o_scen_ReprintJob.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3094, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Usage scenario for storing jobs up to one year - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Archive / Usage scenarios for Archive / Usage scenario for storing jobs up to one year\nUsage scenario for storing jobs up to one year\nIn this scenario, a print shop wants to store jobs for one year because customers sometimes ask for jobs to be rerun with updated data.\nCurrently the print shop runs 200 jobs a day and uses a RetainCompletedJobs step in their workflow to retain jobs for one month. Jobs are\ndifficult to find because the Jobs table has 6,000 jobs. One job out of 100 is reprinted with updates. With the Archive feature, the print shop can\nstore jobs in a repository for one year and retain jobs in the Jobs table for only two days. The Jobs table now has only 400 jobs. The print shop\ncan find stored jobs faster by searching the repository for them instead of looking through the Job properties of 6,000 jobs.\nAn administrator at the print shop creates a repository with a retention period of one year. The administrator adds a step based on the\nStoreInRepository step template after the PrintJobs step in the PDF print workflow, but before the RetainCompletedJobs step. The administrator\nspecifies six job properties in the StoreInRepository step: Assigned to printer (the date and time when the printer received the job), Customer\nname, Custom 2 (which stores the cycle date), Input file name, Requested location, and Workflow. The print shop staff can search for and\nretrieve jobs based on the six job properties.\nThe pre-press department uses RICOH ProcessDirector Plug-in for Adobe Acrobat to identify individual documents in a PDF file. The pre-press\nstaff then submits the job to the PDF workflow.\nWhen the job completes the StoreInRepository step, the job and its six job properties are stored in the repository. Two days after the job is\nprinted, it completes the RetainCompletedJobs step and is deleted from the Jobs table.\nIn June 2014, several months after a postcard job is run for a real estate company, the print shop receives a request to reprint the postcards with\na new contact name. The print shop supervisor searches the repository for a Customer name value of Metro Real Estate and an Assigned to\nprinter value greater than 1/1/14 12:00:00 AM. The search results table lists jobs that match the Metro Real Estate Customer name. All 12 jobs\nprinted for the customer in 2014 are shown. The supervisor looks at the dates in the Assigned to printer column of the Result table to find the\njob that should be reprinted with a new contact name.\nThe supervisor views the job to verify that it is the right one and then submits the job to a short workflow that emails the PDF file as an\nattachment to the pre-press department. The pre-press staff uses RICOH ProcessDirector Plug-in for Adobe Acrobat to update the contact name\non all the documents in the PDF file. The updated PDF file is then submitted to a PDF workflow for reprinting.\nParent topic: Usage scenarios for Archive\n1 of 1"}]}