{"doc_name": "vwb_CreateText.pdf", "doc_path": "data/raw/RPD-en-US/vwb_CreateText.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7789, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Creating text with AFP Enhancer - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Creating text with AFP Enhancer\nCreating text with AFP Enhancer\nYou can create text on a specified page of each page group in an AFP file and specify its font and size. For example, you can add page numbers\nor you can add text so that the information in a barcode is also printed as readable text.\nTo determine the position of the new text, work from a copy of the sample AFP file printed on the production printer. Measure where you want\nto place the top-left corner of the text area (X and Y positions) on the printed page from the top-left corner of the logical page.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo create text:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the file does not contain page groups, use AFP Indexer to create page groups.\n3. Click Mode ⇒ AFP Enhancer.\n4. Navigate to the page where you want to create the text:\nTo place text on the same page in every page group, navigate to that page in any page group.\nTo place text on multiple pages (for example, on even pages in every page group), navigate to one of the pages in any page group.\n5. Position your cursor at the top-left corner of the text area. While pressing the left mouse button, draw a box the approximate size of the\ntext area.\nIn a later step, you specify the exact position and size of the text area.\n6. Right-click anywhere in the AFP file and click Create Text.\n7. On the Text tab, type a name for the text.\n8. Specify the text using Content Expression Language (CEL).\nAFP Enhancer provides several CEL examples for you to select and modify. For more information, see the related reference topic on\nsupplied CEL examples in the RICOH ProcessDirector information center.\nNote:\nYou can type carriage return control characters in the Content area. The carriage returns are removed when you export your\nenhancements to an EnhanceAFP control file.\nYou can copy CEL expressions from other sources and paste them into the Content area.\nAFP Enhancer does not validate CEL syntax.\n9. Click the Font tab and select the type of font:\nInline Fonts\nFor Select Character set and Code Page, select a character set and code page from the drop-down lists.\nFor Coded Font, select an option from the drop-down list.\nCore Fonts\nFrom the drop-down lists, select the character set and code page, and, if the font is an outline font, the point size in the Font\nInformation section.\nExternal Fonts\nType a character set and code page pair, a coded font name, or all three. For double-byte character set (DBCS) fonts, use the coded\nfont name only.\nNote: If you enter a code page that is part of a DBCS-coded font, you see an error message that suggests you use the coded font\nname instead.\nYou see the Character Set Description and Font Resource fields change for the font you selected. Font Resource is \"Outline\" for core fonts\nand \"Raster\" for external fonts.\nNote: If the character names do not match between a character set and code page, the job goes into an error state in RICOH\nProcessDirector and the printer issues an error. To correct the error, change the character set and code page to a valid pair and\nprocess the job again.\n10. Click the Location tab.\n11. Specify the location of the text:\nIn the Location fields, specify the X and Y positions of the top-left corner.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Creating text with AFP Enhancer - Jenski - Test portal- RPD Linux\nX\nThe horizontal distance of the left side of the text measured from the left side of the logical page (not the physical sheet of paper).\nDecimal values (such as 2.5) are allowed. The X position cannot be greater than the width of the page.\nY\nThe vertical distance of the top of the text measured from the top of the logical page (not the physical sheet of paper). Decimal\nvalues (such as 2.5) are allowed. The Y position cannot be greater than the height of the page.\nThe initial values of these fields are the X and Y distances of the top-left corner of the box that you drew.\nIn the Right Location fields, specify the X and Y positions of the top-left corner on right-hand pages.\nNote:\nIf you do not specify values for the Right Location fields, AFP Enhancer uses the values in the Location fields for all pages.\nUse values in both the Location and Right Location fields if 2–up is enabled and the Page Placement value is All Fronts Left And\nRight.\nAFP Enhancer lets you specify decimal values for the X and Y positions or use CEL expressions. For example, a CEL statement can position\ntext to the right of indexed data that varies in each document.\nNote: To specify an orientation of 90, 180, or 270 degrees, you edit the EnhanceAFP control file manually after you save the text in\nthe Visual Workbench control file. Then you export the EnhanceAFP control file.\n12. Specify the pages on which to place the text in each page group.\n13. Optional: Specify a trigger using a CEL expression.\nExamples:\nYou want to place text on every document with two or more pages. Use this expression:\ntotal_pages_in_mp != 1\nYou want to place text on each document sent to California that has yes as the value of the Doc.Custom.PolicyDiscount document\nproperty. Use this expression:\nand(Doc.State == CA, Doc.Custom.PolicyDiscount == yes)\n14. Click the Preview tab and type text in the Sample Text field.\nThe text you type on the Preview tab is used to display the text in RICOH Visual Workbench. The text is saved in the Visual Workbench\ncontrol file. Only the information in the Content (CEL) field is exported to the EnhanceAFP control file and used to place the text on the\ndocuments in the AFP file.\n15. Optional: Change the X position and Y position values.\nThe Origin of area values show the X and Y positions of the upper-left corner of the text area you drew.\nNote: The values on the Preview tab are used to display the text in RICOH Visual Workbench. They do not change when you change\nthe values on the Location tab. The values on both tabs are saved in the Visual Workbench control file. Only the values on the\nLocation tab are exported to the EnhanceAFP control file and used to place the text on the documents in the AFP file.\n16. Click OK.\nPreview displays the text on the same relative page in each page group. If you drew the text area on page 1 of one document, Preview\ndisplays the text on page 1 of all the documents. The page placement and trigger values on the Location tab specify text placement on the\npages of the documents in jobs in the workflow.\n17. Click File ⇒ Save Control File to save the text in the Visual Workbench control file.\n18. When you are ready to use the enhancements in the Visual Workbench control file (including the new text) in your workflow, click Tools ⇒\nExport EnhanceAFP Control File and choose a directory for the exported file.\n19. To specify an orientation of 90, 180, or 270 degrees, add this line to the EnhanceAFP control file with a text editor:\n#Afp.InsertText.Orientation[text_name]=Degrees90\nwhere text_name is the name that identifies a text insertion.\nFor example:#Afp.InsertText.Orientation[Sample-Text]=Degrees90\nNote: When you edit an EnhanceAFP control file manually, the edits are not saved in the Visual Workbench control file. If you make\nadditional enhancements and save them in the Visual Workbench control file, you must export the EnhanceAFP control file to make\nthe new enhancements available to the workflow. Then you must manually edit the new EnhanceAFP control file to add the edits\nthat you made in the original EnhanceAFP control file.\nParent topic: Working with sample AFP files\n2 of 2"}]}