{"doc_name": "modifyingtextstrings.pdf", "doc_path": "data/raw/RPD-en-US/modifyingtextstrings.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3464, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying text strings - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Modifying or deleting AFP Editor definitions\n/ Modifying text strings\nModifying text strings\nYou can modify a string of text that was created with AFP Editor. You cannot modify text in the AFP file itself.\nNote:\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo modify a text string:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the definitions for text strings.\n2. Click Mode ⇒ AFP Editor.\n3. Click Tools ⇒ Modify Definitions.\n4. Do one of these:\nSelect the text definition that you want to modify and then click Modify.\nDouble-click the text definition that you want to modify.\nYou see the Modify Text String window.\n5. Optional: On the Text tab, type a new name for the text area in the Text definition name field, change data in the Text string data section,\nor change the color in the Color drop-down list.\nTo edit the text string, select a line of data and use Up or Down to change the order of the line or Remove to delete the line. You can also\nadd new values. Remember to add blank characters between words if you need to. For example, to change the text string from \"Page 1 of\n10\" to \"Page 1 for John Doe\":\n1. Press and hold the CTRL key, and then select of and Page Count.\n2. Click Remove.\n3. Type for in the Text field and click Add.\n4. Select a customer index tag from the Index tag drop-down list and click Add.\nYou see the edited text string value in the field below the data fields.\n6. Optional: On the Font tab, select one of these:\nCore Fonts\nFrom the drop-down lists, select the character set and code page, and, if the font is an outline font, the point size in the Font\nInformation section.\nExternal Fonts\nType a character set and code page pair, a coded font name, or all three. For double-byte character set (DBCS) fonts, use the coded\nfont name only.\nNote:\nIf you enter a code page that is part of a DBCS-coded font, you see an error message that suggests you use the coded font\nname instead.\nYou see the Character Set Description and Font Resource fields change for the font you selected. Font Resource is \"Outline\" for core fonts\nand \"Raster\" for external fonts.\nNote:\nOn your workstation, if the font size does not exist for the color you selected, your display defaults to 12 black, even though the\nfinal AFP file will have the correct font and color.\nIf the character names do not match between a character set and code page, the job goes into an error state in RICOH\nProcessDirector and the printer issues an error. To correct the error, change the character set and code page to a valid pair and\nprocess the job again.\n7. Optional: On the Position tab, change the origin (top-left corner), size, and orientation of the text area. Specify the origin and size in inches\nor millimeters. Decimal values (such as 2.5) are allowed.\nNote:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Modifying text strings - Jenski - Test portal- RPD Linux\nIf you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the logical page in the unrotated view.\n8. Click OK.\nYou see the edited text in the AFP file.\nParent topic: Modifying or deleting AFP Editor definitions\n2 of 2"}]}