{"doc_name": "aiwdoc_i_t_editdocproptemplate.pdf", "doc_path": "data/raw/RPD-en-US/aiwdoc_i_t_editdocproptemplate.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4114, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Maximizing the performance of document properties files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Maximizing the performance of document properties files\nMaximizing the performance of document properties files\nTo maximize the performance of document properties files, you edit the document properties template file. The template file determines which\nproperties go into the document properties file for a job. The template file lets you control the number of document properties to be used, as\nwell as the order of the columns in the document properties file. If you need to maximize performance on your system by assigning only a subset\nof document properties, make sure that any properties needed by your workflow steps are listed in the document properties template file.\nThe document properties template file contains the database names of document properties. Steps based on the ReadDocumentsFromDatabase\nstep template use the content of the document properties template file to create the document properties file.\nUsing a document properties template file is optional, but recommended if you need to maximize performance. If you do not use it, all\ndocument properties are included in the generated document properties file.\nThe document properties template file must include all the properties needed by steps that process the document properties file. In addition, the\ndocument properties template file must include certain properties, depending on the step that is using the template file. These properties are\nrequired by CreateAFPJobsFromDocuments, BuildAFPFromDocuments, and BuildPDFFromDocuments:\nDoc.ChildJobID (*)\nDoc.OriginalJobID (*)\nDoc.OriginalSequence (*)\nDoc.SequenceInChild (*)\nDoc.OriginalSheets\nDoc.DataOffset (for AFP jobs only)\nDoc.DataLen (for AFP jobs only)\nYou do not need to define the Doc.ID property or the properties marked with an asterisk (*) in the document property template; the system\nautomatically includes them in the document properties file. Steps based on the WriteDocumentsToDatabase step template define Doc.ID;\nIdentifyDocuments and IdentifyPDFDocuments define the others.\nIf you have the Inserter feature and you edit the sample document properties template file, include these Inserter document properties in the\ntemplate if they are relevant to your workflow:\nDoc.Insert.BinTriggers\nDoc.Insert.DivertBin\nDoc.Insert.RecipientName\nDoc.Insert.OriginalBarCode\nYou can use more than one document properties template file in one RICOH ProcessDirector system.\nTo edit a document properties template file:\n1. The sample document properties template file named docPropTemplate.txt is in the /path/extensions/doc/samples directory. For\nexample, on Linux, the path is /opt/infoprint/ippd. On Windows, the path is C:\\Program Files\\Ricoh\\ProcessDirector. Copy the\nsample file to the location where you want to store it. You specify the path to this file in the ReadDocumentsFromDatabase step.\n2. Edit the file to contain the properties that you want to use for step processing by a specific workflow.\nKeep these tips in mind:\nAdd the custom document properties that are important for the job. For example, if the workflow will sort the documents in postal code\norder, make sure the Postal Code document property is included in the template file.\nInclude only the necessary properties. Limiting the number of properties improves performance and reduces the amount of storage space\nneeded to store the document property data.\nYou can include all entries on a single line with a space or a tab character between each property, or you can place each entry on a\nseparate line.\nYou can include job properties in the document properties template file.\n3. Optional: Create additional document properties template files.\nFor example, if you copy the PrintDocuments workflow multiple times and want to manipulate a different set of document properties for\neach of the new workflows, create a document properties template file for each new workflow.\nParent topic: Configuring document processing features\n1 of 1"}]}