{"doc_name": "aiwi_copyconfigurationfiles.pdf", "doc_path": "data/raw/RPD-en-US/aiwi_copyconfigurationfiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3377, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Replacing your control files with the sample files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Replacing your control files with the sample files\nReplacing your control files with the sample files\nWhen you install a new version of RICOH ProcessDirector, the installer automatically adds new sample control files to the /aiw/aiw1/samples\ndirectory and copies them to your control files directory, /aiw/aiw1/control_files. It does not overwrite any of your customized control files\nin /aiw/aiw1/control_files. You can use the copyConfigurationFiles script to install the default control files or to overwrite your customized\ncontrol files.\nReplacing your control files requires Perl to run. Before replacing your control files, make sure a Perl interpreter is installed.\nTo replace your control files with the sample files:\n1. Log in to the primary computer as the RICOH ProcessDirector system user ( aiw1 is the default).\n2. On the command line, enter this command:\n/opt/infoprint/ippd/bin/copyConfigurationFiles.pl\nYou can add these optional parameters to the copyConfigurationFiles command:\n[-r [-b]] [-w forceReplaceFile] [samplesDirectoryconfigurationFilesDirectory] [[-o differencesOutputFile] [-c]] [-v] [-help]\n-r\nThe script overwrites existing files in the /aiw/aiw1/control_files directory.\n-b\nThe script backs up each file it replaces. The backup files are called replaced_file.bak. It does not back up files unless they are being\nreplaced by a different version of that file.\n-w forceReplaceFile\nThe script overwrites a specific set of files. List the file paths to overwrite in the forceReplaceFile file.\nsamplesDirectory\nThe directory where the sample files are located. The default is /aiw/aiw1/samples.\nconfigurationFilesDirectory\nThe directory where the control files are located. The default is /aiw/aiw1/control_files.\n-o differencesOutputFile\nThe script writes any file names where there are different versions of a file in the samples and control_files directories. The different\nversion file names are written to the differencesOutputFile file.\n-c\nThe script compares the files in the /aiw/aiw1/samples and /aiw/aiw1/control_files directories and prints a list of which files are\nin both directories but have different content. Running the script with this parameter does not do the normal copying and replacing.\n-v\nThe script displays additional file information while copying files.\n-help\nThe script displays help and syntax information.\nNew versions of RICOH ProcessDirector might add new functions that require updated control files. To move your customized content from the\nold control files to the new control files:\n1. Generate a list of which files have new versions. Enter this command:\ncopyConfigurationFiles.pl -o /tmp/differencesOutputFile\n2. Copy the new control files. Enter this command:\ncopyConfigurationFiles.pl -r -b -w /tmp/differencesOutputFile\nSpecifying the -b causes the script to back up files before overwriting them.\n3. Copy your customized content from the replaced_file.bak backup files to the corresponding control file.\nImportant:\nWe recommend using the Migration Assistant when upgrading to a different computer to copy objects from one system to another. For\nadditional information see Using the Migration Assistant.\nParent topic: Preparing to use workflows\n1 of 1"}]}