{"doc_name": "dt_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_featov.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 7860, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Deadline Tracker - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker\nDeadline Tracker\nThe Deadline Tracker feature lets you manage your progress toward meeting your delivery deadlines. By using deadlines and Service Level\nAgreement (SLA) job checkpoints, you can make sure that your print jobs are on schedule to be completed on time. You can see when jobs are\nbehind schedule or might miss their deadlines. This information helps operators prioritize work and take actions to bring jobs back on track for\non-time delivery.\nThe feature has these major parts:\nThree system objects\nA step template\nWith this feature, you can track jobs to a deadline, to a schedule, to both a schedule and a deadline, or to a checkpoint. You can track jobs\nbased on completion of a phase in the workflow or a step in a phase. You can also be notified when work does not arrive in the RICOH\nProcessDirector system as expected.\nThe Deadline Tracker feature adds a Deadlines portlet to the Main page. The portlet contains dots that show the number of jobs that have\nmissed or are close to missing a deadline or checkpoint.\nWhen you hover over a dot, you see a legend that lists the statuses represented by the dot. Click View all jobs in this state to open a table of all\nthe jobs in that state.\nIf no jobs are late, the Deadlines portlet shows a green checkmark.\nThe feature adds the Schedule risk column to the right of the column of check boxes in the Jobs table. The column heading is blank. You can see\nthe name of the column by hovering over the heading area. When a job is behind schedule or might miss its deadline, a colored dot appears in\nthe Schedule risk column. To sort jobs by schedule risk, with jobs that have the most risk at the top of the column, you can click the column\nheading.\nSystem Objects\nThis feature adds these system objects:\nService policies\nService policies define job checkpoints at the end of each processing phase. For example, a service policy defines job checkpoints for jobs\nthat need to be printed 4 hours after they arrive in the system. The administrator creates one service policy for each performance\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:23 PM Deadline Tracker - Jenski - Test portal- RPD Linux\ncommitment and associates each service policy with the appropriate workflows.\nNo-service periods\nNo-service periods define the periods of time when no services are provided (for example, holidays and weekends). The administrator creates\nno-service periods and indicates in each service policy whether the no-service periods apply to that policy.\nExpected work\nExpected work objects define print jobs that you expect to receive at set intervals.\nStep Template\nThis feature adds the SetDeadline step template to the list of supplied step templates. When you add the step template to a workflow, you\nspecify a Deadline step and set a deadline date and time. Each job in the workflow must complete the step by the specified date and time to\nmeet its deadline. If a job misses its deadline, a red dot appears in the Deadlines portlet and in the Schedule risk column for the job in the Jobs\ntable.\nTracking to a deadline\nYou can set job deadlines so you can see whether a job meets or misses its deadline.\nWhen you set a deadline for completing a step in a workflow, the Deadline tab on the job properties notebook shows you values for the\nDeadline, Deadline step, and Deadline outcome properties. You can add these properties as columns on the Jobs table to make deadline\ninformation available to your operators.\nYou can set up an email notification that watches for the Deadline outcome property for a job to change to Missed and sends an email to one or\nmore users to alert them of the missed deadline.\nTracking to a schedule\nYou can set estimated durations for steps in a workflow so you can track the progress of jobs as they move through the system and see when\njobs are behind schedule.\nThis feature adds the Estimated durations action to the Workflow Editor portlet. Using this action, you can quickly set the estimated duration for\nall the steps in a workflow.\nWhen you set estimated durations for the steps in a workflow, the Deadline tab on the job properties notebook shows you values for these\nproperties:\nPercent complete: how much of the estimated duration for the job has completed.\nTracking status: whether the job is on schedule or behind schedule.\nPredicted completion time: a date and time computed by adding up the estimated durations of all steps in the predicted path of the job\nthrough the workflow.\nYou can add these properties as columns on the Jobs table to make information about whether a job is on schedule or behind schedule available\nto your operators. If a job is behind schedule, a yellow dot appears in the Deadlines portlet and in the Schedule risk column for the job in the\nJobs table.\nFor a job in a conditional workflow, RICOH ProcessDirector uses only the estimated durations for the steps on the branch of the workflow that\nthe job is likely to follow.\nYou can set up an email notification that watches for the Tracking status property for a job to change to Behind schedule and sends an email to\none or more users to alert them that a job is in danger of missing its schedule.\nTracking to a schedule and a deadline\nYou can set job deadlines and estimated durations so you can track the progress of jobs as they move through the system and you can see when\na job has missed, or is in danger of missing, its deadline.\nWhen you set both a deadline for completing a step and estimated durations for the steps in a workflow, the Deadline tab on the job properties\nnotebook shows you values for all the properties for tracking to a deadline and tracking to a schedule. The notebook also shows you a value for\nan additional property: Predicted outcome. The three predicted outcomes are OK, May miss, and Cannot determine.\nRICOH ProcessDirector calculates the predicted outcome for a job by using the estimated durations, the current date and time, and the deadline\nfor the job. When a predicted outcome is May miss, an orange dot appears in the Deadlines portlet and in the Schedule risk column for the job\nin the Jobs table. After the deadline step runs and the deadline outcome is set, RICOH ProcessDirector does not change the predicted outcome.\nYou can set up an email notification that watches for the Predicted outcome property for a job to change to May miss and sends an email to one\nor more users to alert them that a job is in danger of missing its deadline.\nTracking to checkpoints\nYou can set job checkpoints to track the progress of jobs as they move through the phases in a workflow. Instead of setting estimated durations\nfor each step, you set an amount of time for each phase to complete. If the phase does not complete in the allocated time, the job is late. A\nyellow dot appears in the Deadlines portlet and in the Schedule risk column for the job in the Jobs table. However, if the job moves through the\nnext phase more rapidly than expected and finishes before the next checkpoint, the checkpoint status of the job changes from Late to OK. The\nyellow dot is removed.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:23 PM Deadline Tracker - Jenski - Test portal- RPD Linux\nMonitoring for expected jobs\nYou can configure RICOH ProcessDirector to let you know if the scheduled number of jobs do not arrive in an input device by the time that you\nexpected them. If some of the expected work does not arrive in an input device, an alert ( ) icon appears to the right of the input device. The\noperator can then respond by tracking down the missing jobs.\nIn this section:\nUsage scenarios for Deadline Tracker\nThese scenarios show how to set deadlines, estimated durations, or both for a Deadline Tracker workflow.\nParent topic: Advanced workflow features\n3 of 3"}]}