{"doc_name": "aiwcAFPresext.pdf", "doc_path": "data/raw/RPD-en-US/aiwcAFPresext.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 6585, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Search order for AFP resource extensions - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / AFP resources in RICOH ProcessDirector / Search order for AFP resource extensions\nSearch order for AFP resource extensions\nPrint files refer to AFP resources by their names, without including a file type extension. However, resource files often have extensions added to\nthem. When a component of RICOH ProcessDirector requests a resource, it uses the inline resource if the job includes one. Otherwise, it first\nlooks for a file that matches the resource name without an extension. If it cannot find one, it adds one extension after another to the file name\nand searches for the resource using the new name.\nExtensions are added to resource file names in a specific order based on the type of resource that is requested. Sometimes, different components\nadd extensions in different orders.\nThese components in RICOH ProcessDirector request AFP resources: the AFP viewer, the printer driver (PSF), and the line data to AFP transform.\nAFP viewer\nThe configuration file for the AFP viewer, /opt/infoprint/ippd/afpviewer/a2pxopts.cfg (Linux)C:\\Program\nFiles\\Ricoh\\afpviewer\\a2pxopts.cfg (Windows), lets you specify file extensions for page segments, overlays, form definitions, JPEG files,\nGIF files, TIFF files, character sets, code pages, and coded fonts. The viewer searches for files in the order that you specify the extensions.\nNote: On Linux file extensions are case-sensitive.\nThe configuration file that is installed with RICOH ProcessDirector contains these statements that set extensions for resources:\nPageSegExt=*.,*.psg,*.PSG\nOverlayExt=*.,*.oly,*.OLY\nFormDefExt=*.,*.fde,*.FDE\nJFIFEXT=*.,*.DOR,*.png, *.png,*.jfif,*.jpeg\nGIFEXT=*.,*.DOR,*.png,*.png\nTIFFEXT=*.,*.DOR,*.tif,*.TIF,*.tiff,*.TIFF\nCHARSETEXT =*.,*.240,*.300,*.OLN,*.oln,*.Oln,*.fnt\nCODEPAGEEXT =*.,*.fnt\nCODEDFONTEXT =*.,*.fnt\nFor example, the configuration file sets the extensions for page segments to no extension (*.), .psg, and .PSG. To use different extensions, you\ncan add other values by separating them with commas. For example, you can specify that no extension, .psg, .PSG, .300, and .600 should be\nsearched as page segment extensions in that order if you change the page segment line to PageSegExt=*.,*.psg,*.PSG,*.300,*.600.\nTo comment out a line, insert the # character at the beginning of the line.\nIf there is no entry in the configuration file for a resource type, the AFP viewer looks for files with these extensions:\n.jfif for JPEG files\n.png for GIF files\n.tif for TIFF files\nNo extension for other resource types\nPrinter driver and line data transform\nFor most types of resources, the printer driver and the line data transform use the same list of file extensions for each type of resource and they\nsearch in the same order. However, they use slightly different methods to search for data object resources and for most font resources. The line\ndata transform uses the same list of extensions for all font-related resources that it works with except TrueType and OpenType fonts.\nThis table lists the file extensions that these components associate with each type of resource and the order in which they apply them.\nNote: On Linux all file extensions must be in uppercase.\nWhen you install Color Management Resources (CMRs), data objects, True Type fonts, and Open Type fonts using InfoPrint AFP Resource Installer,\nyou give each object a name. Jobs refer to those types of objects using that name. To find the object, RICOH ProcessDirector searches the\ndirectories specified in the AFP resource path to find a directory that contains a resource access table (RAT). Then RICOH ProcessDirector searches\nthe RAT to find the fully qualified file name and directory location for the resource. If the name is not listed in the RAT, RICOH ProcessDirector\nmoves to the next location listed in the AFP resource path.\nFile extensions that the printer driver and the line data transform add to resource names, listed by resource type\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:11 PM Search order for AFP resource extensions - Jenski - Test portal- RPD Linux\nFile extensions that the line data transform\nAFP resource type File extensions that the printer driver adds adds\nBCOCA objects (barcodes) No file extension No file extension\nCode pages 1. ECP 1. ECP\n2. No file extension 2. No file extension\n3. FONT3820 3. 240\n4. FONT38PP 4. 300\n5. CDP 5. FONT300\n6. FONT300 6. FONT3820\n7. FONT38PP\n8. CDP\n9. CFT\n10. OLN\n11. FONTOLN\n12. FIL\nCoded fonts 1. No file extension 1. No file extension\n2. FONT3820 2. 240\n3. FONT38PP 3. 300\n4. CFT 4. FONT300\n5. FONT300 5. FONT3820\n6. FONT38PP\n7. CDP\n8. CFT\n9. OLN\n10. FONTOLN\n11. FIL\nColor mapping table 1. No file extension 1. No file extension\n2. SETUP 2. SETUP\n3. SET 3. SET\nFont character sets, 240-pel resolution 1. No file extension 1. No file extension\n2. 240 2. 240\n3. FONT3820 3. 300\n4. FONT38PP 4. FONT300\n5. FIL 5. FONT3820\n6. FONT38PP\n7. CDP\n8. CFT\n9. OLN\n10. FONTOLN\n11. FIL\nFont character sets, 300-pel resolution 1. 300 1. No file extension\n2. FONT300 2. 240\n3. No file extension 3. 300\n4. FONT300\n5. FONT3820\n6. FONT38PP\n7. CDP\n8. CFT\n9. OLN\n10. FONTOLN\n11. FIL\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:11 PM Search order for AFP resource extensions - Jenski - Test portal- RPD Linux\nFile extensions that the line data transform\nAFP resource type File extensions that the printer driver adds adds\nFonts, outline 1. OLN 1. No file extension\n2. FONTOLN 2. 240\n3. 300\n4. FONT300\n5. FONT3820\n6. FONT38PP\n7. CDP\n8. CFT\n9. OLN\n10. FONTOLN\n11. FIL\nForm definitions 1. No file extension 1. No file extension\n2. FDEF3820 2. FDEF3820\n3. FDEF38PP 3. FDEF38PP\n4. FDE 4. FDE\n5. FIL 5. FIL\nGOCA objects (graphics) No file extension No file extension\nIOCA objects (IO images) No file extension No file extension\nMO:DCA objects 1. No file extension 1. No file extension\n2. OBJ 2. OBJ\n3. OBJECT 3. OBJECT\nOverlays 1. No file extension 1. No file extension\n2. OVLY3820 2. OVLY3820\n3. OVLY38PP 3. OVLY38PP\n4. OVL 4. OVL\n5. OLY 5. OLY\n6. OVR 6. OVR\nPage definitions Not applicable 1. No file extension\n2. PDEF3820\n3. PDEF38PP\n4. PDE\nPage segments 1. No file extension 1. No file extension\n2. PSEG3820 2. PSEG3820\n3. PSEG38PP 3. PSEG38PP\n4. PSG 4. PSG\n5. PSE 5. PSE\nSetup data 1. No file extension 1. No file extension\n2. SETUP 2. SETUP\n3. SET 3. SET\n4. COMSETUP 4. COMSETUP\nOther topics in this section:\nIdentifying AFP resource directories to RICOH ProcessDirector\nJob properties and AFP form definitions\nColor mapping table source and output files\nParent topic: AFP resources in RICOH ProcessDirector\n3 of 3"}]}