{"doc_name": "aiwBatchAllNow.pdf", "doc_path": "data/raw/RPD-en-US/aiwBatchAllNow.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2255, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Batching all input files - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Input files / Batching all input files\nBatching all input files\nYou can group the input files that are submitted to a hot folder or an SFTP input device and submit them together. The Batching method for\neach input device determines how many jobs are created from each input device.\nYou can only batch jobs for hot folder and SFTP input devices.\nAll input files are submitted using the existing settings on the input device, though some values are overridden. For example, an input device uses\nthe Number batching method. That input device waits until it receives 5000 input files and submits them as a job. When you use Batch all, the\ninput device collects all the input files that are waiting and submits them immediately, even if there are fewer than 5000 files.\nTo batch all input files from one or more input devices:\n1. Select the input devices that you want to batch all the files for.\n2. Right-click one of the input devices and select Batch all.\n3. In the confirmation dialog, click OK.\nNote:\nDo not use the Batch all action with input devices that use the JDF or Pattern batching method.\nFor the List batching method, only files matching the contents of the list file are submitted as jobs. If a file specified in the list file is\nmissing, the job for that list file is not submitted.\nFor the Number and Pages batching methods, the specified amount to include in a batch is used. For example, if the Number of files to\nbatch property value is 500 and there are 600 files present in the input device waiting for the polling interval to end. Two jobs are\nsubmitted with the Batch all action - one with 500 files and one with 100 files.\nFor the Number of sets and Pages in sets batching methods, the specified patterns to match and amount to include in a set are used.\nFor the Time and Sets by time batching methods, the specified patterns to match are used. After the jobs are submitted, the Batching\ninterval is not reset.\nOther topics in this section:\nDisplaying submitted input files\nManually assigning a workflow to an input file\nSubmitting a batch of input files manually\nDeleting input files\nParent topic: Input files\n1 of 1"}]}