{"doc_name": "slapolicycheckpointtimes.pdf", "doc_path": "data/raw/RPD-en-US/slapolicycheckpointtimes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2544, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Checkpoint times - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Service policies / Checkpoint times\nCheckpoint times\nFor each job that has an associated service policy, RICOH ProcessDirector records planned checkpoint times. In addition, it records actual\ncheckpoint times for all jobs, even for jobs that do not have an associated service policy.\nThe checkpoint times are:\nPlanned checkpoint time: The date and time when the job is expected to complete a phase. RICOH ProcessDirector calculates each planned\ncheckpoint time by adding the time interval for the phase to the checkpoint start time. If the checkpoint start time changes, the planned\ncheckpoint times change accordingly.\nActual checkpoint time: The date and time when the job actually completed the phase.\nRICOH ProcessDirector displays these checkpoint times in the property notebook for each job that is in the system. After a job is removed from\nthe system, the audit file for the job (jobnumber.yy-mm-dd_hh-mm-ss.positional_attributes.csv) contains the checkpoint times.\nThis example shows sample planned and actual checkpoint times for a job that has completed the Print phase and is currently in the Complete\nphase.\nCheckpoint Planned checkpoint time Actual checkpoint time\nReceive: 1/8/07 09:20:22\nPrepare: 1/8/07 12:00:00 1/8/07 10:00:30\nPrint: 1/8/07 14:00:00 1/8/07 12:00:59\nComplete:\nSometimes, checkpoint times are blank:\nPlanned checkpoint time: The service policy does not define a checkpoint for a phase. In this example, the Receive and Complete checkpoint\ntimes are blank because the service policy does not define a Receive or Complete checkpoint.\nActual checkpoint time: A job has not completed a phase, or a job does not flow through a phase. The actual checkpoint time for the\nComplete phase is usually blank when the job is still in the system.\nRICOH ProcessDirector can update the planned and actual checkpoint times when you reprocess a job:\nPlanned checkpoint times: If you use the Process Again action to reprocess a job from the first step and the properties of the service policy or\nno-service periods have changed, RICOH ProcessDirector calculates new planned checkpoint times for the job.\nActual checkpoint times: If you use the Print Again or Process Again action to reprocess a job and the service policy specifies Yes in the Reset on\nreprocess property, RICOH ProcessDirector records new actual checkpoints for the phases that the job completes again.\nParent topic: Service policies\n1 of 1"}]}