{"doc_name": "dt_o_scen_durationworkflow.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_scen_durationworkflow.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2544, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Estimated durations for steps in a linear workflow scenario - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker / Usage scenarios for Deadline Tracker\n/ Estimated durations for steps in a linear workflow scenario\nEstimated durations for steps in a linear workflow scenario\nIn this scenario, a linear workflow has nine steps. You want to track whether a job is on time or behind schedule from the time that the job\nenters the workflow until it completes the PrintJobs step. The first two steps process a job immediately. Four steps each take five minutes to\nprocess a job. One step takes ten minutes to process a job. You set estimated durations for those seven steps. You do not set estimated durations\nfor the two steps that follow the PrintJobs step.\nLinear PDF workflow\nSetJobPropsFromTextFile: 1 second\nDetectInputDataStream: 1 second\nCountPages: 5 minutes\nRunExternalProgram (runs a program for the accounting department): 5 minutes\nPrintSetup (lets the operator verify that the requested paper is loaded in the trays): 5 minutes\nCreatePageRanges: 5 minutes\nPrintJobs: 10 minutes\nRetainCompletedJobs: no estimated duration\nRemoveJobs: no estimated duration\nWith this workflow, you can see the percent complete, the tracking status (On schedule or Behind schedule), and the predicted completion time.\nWhen a job completes the PrintSetup step, the job is 50 percent complete because three five-minute steps have run of the 30-minute total.\nBased on the two remaining steps with estimated durations, RICOH ProcessDirector sets the Predicted completion time property to 15 minutes\nfrom the time when the job completes the PrintSetup step.\nIf the job completes the CountPages step within five minutes and two seconds after starting the SetJobPropsFromTextFile step, the Tracking\nstatus of the job is On schedule. If the job completes the RunExternalProgram step within ten minutes and two seconds after starting the\nSetJobPropsFromTextFile step, the Tracking status of the job continues to be On schedule.\nIf the job does not complete the PrintSetup step within 15 minutes and two seconds of starting the SetJobPropsFromTextFile step, RICOH\nProcessDirector sets the Tracking status of the job to Behind schedule. If the Tracking status of a job is Behind schedule, RICOH ProcessDirector\nadds a yellow dot in the Deadlines portlet and in the Schedule risk column for the job in the Jobs table.\nParent topic: Usage scenarios for Deadline Tracker\n1 of 1"}]}