{"doc_name": "aiw_workflownotifications.pdf", "doc_path": "data/raw/RPD-en-US/aiw_workflownotifications.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2529, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Progress updates - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Email and progress updates / Progress updates\nProgress updates\nYou can use the SendEmail step template or a notification object to send updates about the progress of jobs as they move through their\nworkflows.\nIf you configure the system settings so the primary server can connect with an SMTP server, you can add the SendEmail step to workflows or\ncreate a notification object and configure it to send an email to one or more email addresses. When the job reaches that step or a specific job or\nprinter event occurs, an email is sent to the specified email addresses.\nWhen you add the step to a workflow, you can specify the subject line and the message text to include in the email. You can use symbol\nformulas in both the title and the message, so you can include job property values specific to the job in those fields.\nFor example, you can add the SendEmail step immediately after the PrintJobs step and send an email to the supervisor of the finishing line or\nbindery, so they know that the job is ready for them.\nIf you have service level agreements (SLAs) with your customers, you can add several SendEmail steps to a workflow for a particular customer.\nEach step can email the customer so they know when the job was ready to print, when it finished printing, and when it finished inserting.\nWhen you add a notification object, you can specify the subject line, the message text to include in the email, the event that causes the system\nto send the notification, and the conditions that determine when the notification email is sent.\nFor example, you can set up one notification object to monitor when a printer enters the Needs attention state and send a notification email to\none group if the printer problem occurs between 8:00 and 12:00. You can define a different notification object to send the same email to a\ndifferent user if the printer problem occurs after 12:00.\nNote:\nThe SendEmail step only sends an email when the job reaches the step. If the job stops processing because of an error, notifications are\nnot sent.\nA notification object only sends an email when a specific event occurs and any conditions defined for the notification are met.\nYou can use an alternate SMTP server if the Alternate SMTP properties are set and the SMTP server type property is set to Alternate for\nthe SendEmail step. All notifications, however, are sent through the default SMTP server.\nParent topic: Email and progress updates\n1 of 1"}]}