{"doc_name": "dt_c_settingdeadlines.pdf", "doc_path": "data/raw/RPD-en-US/dt_c_settingdeadlines.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5762, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Setting deadlines for jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up Deadline Tracker / Setting deadlines for jobs\nSetting deadlines for jobs\nYou can set a deadline for each job that enters a workflow. To create a deadline, you add a step based on the SetDeadline step template to a\nworkflow, specify a deadline date and time (or an offset from another date and time), and select the step that the job must complete to meet\nthe deadline.\nSetting a deadline for a job is different from setting an SLA target step. If the SLA target step does not complete in the specified time, the SLA\noutcome is changed to Missed and cannot be reset for the job. Deadlines are used to track the progress of a job and report outcomes. If you\nwant to monitor progress at different point in a workflow, you can set multiple deadlines for the same job. The Deadline outcome reflects the\nresult of the most recent deadline and is reset whenever a new deadline is set. For example, you set a deadline of 3:00 to finish the print step\nand 5:00 to finish an insertion step. At some point, a job misses the print deadline by 5 minutes, but it still meets the insertion deadline. The final\nvalue of the Deadline outcome property is Met even though a previous deadline (for print) was missed.\nIf you choose to set both an SLA target step and a deadline set by a SetDeadline step in the same workflow, we recommend that you select the\nsame step for the SLA target step and the last Deadline step. With that configuration, you can track to the deadline step to give operators time\nto recover if the job falls behind, but also record the final SLA outcome for the job.\nYou must decide how many SetDeadline steps you need and where to place them in your workflow. A workflow can have multiple deadlines,\nbut only one deadline is active for a job at any time as the job moves through the workflow.\nNo-service periods are not included when calculating predicted completion times but they are used when setting SLA outcome.\nNote:\nThe Change Deadline action lets you set or change a deadline for a job, even if the workflow does not include a SetDeadline step.\nTo set a deadline for each job that enters a workflow:\n1. Click the Workflow tab.\n2. Click the name of the workflow.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. In the workflow editor, click the side panel in the top right corner of the window.\n5. Go to Steps and expand the TRACKING group.\n6. Select the SetDeadline step template and drag it into the workflow editor. Place the step where you want it.\nKeep these considerations in mind:\nIf you want to set a deadline as soon as a job enters the workflow, place the step near the beginning of the workflow, for example, after\nthe DetectInputDataStream step.\nIf you want to set a deadline that starts when a step processes a job, place the SetDeadline step before the step that processes the job.\nMake the deadline relative to the Current time property.\nIf the workflow processes child jobs and you want them to inherit the deadline from the parent job, make sure that all the child jobs are\nprocessed by the SetDeadline step that sets the value of the Inherit deadline from parent job property to Yes.\nFor conditional workflows, you can create connectors with conditional processing rules that compare the Deadline, Deadline step,\nDeadline outcome, and Predicted outcome properties to specified values. If you want RICOH ProcessDirector to evaluate these conditions\nfor the jobs in the workflow, the jobs must complete a SetDeadline step before they reach the connectors.\n7. Right-click the new SetDeadline step and select Properties.\n8. Click Deadline. Do these steps:\n1. Set the Deadline step property by selecting the step that a job must complete to meet its deadline.\nFor example, if the job must be printed by a certain time to meet its deadline, select the PrintJobs step.\n2. Set the Deadline date property, which specifies the settings used to set the date for the deadline.\nIf you select Relative to property value, you can select any property that has a timestamp for a value. Specify an offset to the\ntimestamp to set the deadline time. The property that you select should have a timestamp value set when the SetDeadline step runs.\nUntil a timestamp value is set for the property, RICOH ProcessDirector cannot tell you if a job is on schedule to make its deadline.\nImportant:\nDo not select the Deadline property.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Setting deadlines for jobs - Jenski - Test portal- RPD Linux\n3. Set the properties that specify the deadline time.\n4. Set the Inherit deadline from parent job property to specify whether a child job inherits a deadline from its parent job.\n5. If a workflow has two or more SetDeadline steps, set the Override existing deadline property.\nIf you set this property to Yes, the deadline set by this step overrides an existing deadline set by another SetDeadline step. If you set\nthe property to No, the workflow does not set this deadline if another deadline is active.\nNote:\nSetting this property to No is useful in a conditional workflow when steps from one branch arrive at the SetDeadline step\nwith a deadline already set and steps from another branch arrive at the SetDeadline step without a deadline.\n6. When you finish, click OK.\n9. Repeat these steps for each SetDeadline step that you place in the workflow.\n10. Save and enable the workflow.\nParent topic: Setting up Deadline Tracker\n2 of 2"}]}