{"doc_name": "modifyingindexesinaddressarea.pdf", "doc_path": "data/raw/RPD-en-US/modifyingindexesinaddressarea.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4782, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying index tags in address areas - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Modifying or deleting AFP Indexer definitions\n/ Modifying index tags in address areas\nModifying index tags in address areas\nYou can modify the index tags that you created for page group or supplemental page address areas.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo modify index tags in an address area:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the definitions for the index tags. Then click Mode ⇒\nAFP Indexer.\n2. Click Tools ⇒ Modify Definitions.\nYou see the Modify and Delete Definitions window with address indexes.\n3. Select the address index that you want to modify.\n4. Click Modify, or double-click.\nYou see the Modify Index Tags in an Address Area window.\n5. To change the characters that separate the text blocks, specify the new character or characters in the Character between text blocks field.\nThe default character that separates text blocks is one blank. If you want to concatenate the text in multiple text blocks, delete the blank\nfrom the field.\nIn the Index tags for intermediate lines field you see the text with the character that you specified (if any) shown between the text blocks.\n6. To add an index tag for a specific line in the address area:\n1. Click Add.\nYou see the Create Index Tag window.\n2. Use the default code page encoding or select an encoding from the drop-down list if the text displays incorrectly.\n3. Type a descriptive name for the index tag.\n4. Select the line that contains the text you want to index:\nTo select the first line or a line relative to the first line, click First line. Then use the drop-down list for this field to select a relative\nline. For example, select First line plus 1.\nTo select the last line or a line relative to the last line, click Last line. Then use the drop-down list for this field to select a relative line.\nFor example, select Last line minus 1.\n5. Decide whether you want to use the entire text value to create the index tag or only part of the text. To select part of the text as the\nindex tag, click Edit index value. Edit the index value in the Edit Value window and click OK.\nYou see the value of the index tag in the Edited value field.\n6. Clear the Create tag for an empty value field if you do not want AFP Indexer to create index tags with null values.\nOtherwise, an index tag contains the value “null” if the text that you indexed does not exist in a particular page group or\nsupplemental page. For example, if a page group has an address that does not contain a country name, the index tag for country\nname is “null” for that page group.\n7. Click OK.\nYou see the index tag and the index tag value in the Index tags for specific lines field.\n7. To change or delete an existing index tag for a specific line in the address area, click the index tag in the Index tags for specific lines section\n(use the CTRL key to select more than one index tag) and do one of these:\nClick Modify. Make changes to the index tag on the Modify Index Tag window and then click OK.\nClick Delete to remove all index tags you selected.\n8. Do one of these to specify whether lines in the Index tags for intermediate lines field are indexed:\nClick Index intermediate lines and specify an index tag name to create index tags for intermediate lines.\nClear Index intermediate lines to delete the index tags for intermediate lines.\n9. To specify whether an index tag is created for a ZIP Code in the U.S. Postal Service format (nnnnn or nnnnn-nnnn), click the ZIP Code tab\nand do one of these:\nType an index tag name or update the existing name to create an index for the ZIP Code. Clear the Create tag for an empty value field if\nyou do not want AFP Indexer to create an index tag with a “null” value.\nDelete the name of the index tag in the Name field to delete the ZIP Code index.\n10. Click the Position tab to adjust the origin and size of the address area. Decimal values (such as 2.5) are allowed. Specify the values in inches\nor millimeters.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Modifying index tags in address areas - Jenski - Test portal- RPD Linux\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the logical page in the unrotated view.\n11. Click OK. You see the index tags listed in the bottom pane for each page group.\n12. To close the Modify and Delete Definitions window, click X in the upper right corner.\nParent topic: Modifying or deleting AFP Indexer definitions\n2 of 2"}]}