{"doc_name": "aiw_c_hintssupervisorconnect.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_hintssupervisorconnect.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5370, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Hints for using RICOH ProcessDirector data in RICOH Predictive Insight - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to send data to RICOH Predictive Insight / Hints for using RICOH ProcessDirector data in RICOH Predictive Insight\nHints for using RICOH ProcessDirector data in RICOH Predictive Insight\nAfter you configure data collectors and data transmitters, your challenge is to create dashboards and widgets in RICOH Predictive Insight to use\nthat data. Here are some suggestions to make that process easier.\nFamiliarize yourself with the data that is sent to RICOH Predictive Insight\nBefore you start to work with RICOH ProcessDirector data in RICOH Predictive Insight dashboards, we recommend downloading the RICOH\nProcessDirector CSV files that are sent to RICOH Predictive Insight and analyze the data that is collected. In the CSV files, you can see the column\nheaders and data contained in the columns, how many entries are recorded, and how the data is collected overall. Download and open a CSV\nfile for each type of data collector that you enable.\nDuplicate and invalid entries\nIn the CSV files that you downloaded, you probably noticed that some values are recorded in each row of the table without changing. In other\ncases, some cells are empty for the early steps in a workflow, but filled in later. Both of these situations might require you to use formulas and\nfilters in your widgets in RICOH Predictive Insight.\nFor example, the Job Step Progress data collector records data in the job_history table at the beginning and end of each step in the workflow.\nProperties do not always change from step to step, so many of those property values are identical from row to row. Look at the CSV file for the\nJob Step Progress data collector and follow how each column changes from row to row.\nBy default, the Job Step Progress data collector records values for Cumulative pages stacked and Cumulative sheets stacked. Those properties do\nnot have values until after the PrintJobs step. But, for every step after the PrintJobs step, the values are recorded again without changing. The\nvalue only changes if the job passes through the PrintJobs step again, for example, if you have to reprint part of the job.\nTo include one of those values in a widget, be sure that you do not include the values from mulitple steps. RICOH Predictive Insight will add the\nvalues together and therefore provide incorrect results. Use a formula or filter to be sure that you only include values from one row in the\ndatabase table.\nIf there are invalid entries, the rows might contain N\\A. You can apply a widget filter to filter out these N\\A rows to make the widget more easily\nreadable and understandable.\nFor example, to create a report that shows how many jobs meet their SLA and how many miss their SLA each week, we can consider two factors\nin this report. The first factor is that not all jobs have an SLA. The second factor is that several data records are available for jobs before the SLA\noutcome is determined.\nIf you notice N\\A values in the chart, you can add a widget filter to filter out the N\\A values. Adding a widget filter results in a more meaningful\nchart that is easier to read and understand.\nRICOH Predictive Insight dashboard filters only apply to a set of widgets\nYou can apply dashboard filters only to the widgets that were not configured as independent widgets. The widgets that have the Dashboard\nFilters option turned off are not affected by the filters applied to a dashboard. These independent widgets can be configured to use their own\nfilter.\nTime reported for collecting\nThe time displayed under the Data as of ... field at the top of the RICOH Predictive Insight dashboard is the time of the last update recorded from\nthe internal database. It is not the latest update of the data collected by the RICOH ProcessDirector data collectors. The data collected by the\nRICOH ProcessDirector data collectors is updated based on the RICOH ProcessDirector transmission schedule. The RICOH ProcessDirector\ntransmission date is always older than the time reported in RICOH Predictive Insight under Data as of .... To get the transmission data as\ntransmitted by RICOH ProcessDirector, go to RICOH Predictive Insight ⇒ Data Collectors ⇒ Software Connectors and select the data transmitter\nfrom the list.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Hints for using RICOH ProcessDirector data in RICOH Predictive Insight - Jenski - Test portal- RPD Linux\nDifferent time zone\nIf you are using RICOH Predictive Insight in a different time zone than the RICOH ProcessDirector primary server, use Convert times to time zone\nfrom RICOH ProcessDirector. To access and change the values of the current time zone, log in to RICOH ProcessDirector, then go to\nAdministration ⇒ Settings ⇒ RICOH Predictive Insight ⇒ Settings ⇒ Convert times to time zone.\nSending jobs containing PDF and PostScript files to an InfoPrint 5000 printer\nWhen RICOH ProcessDirector sends a job containing a PDF or PostScript file to an InfoPrint 5000 printer, the information received from the\nprinter regarding the printing process might be different than the actual data on the printer. The data displayed in RICOH Predictive Insight might\nbe different than what is reported on the actual printer.\nParent topic: Setting up to send data to RICOH Predictive Insight\n2 of 2"}]}