{"doc_name": "doc_o_scen_email_docs.pdf", "doc_path": "data/raw/RPD-en-US/doc_o_scen_email_docs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3134, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Usage scenario for emailing documents to customers - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Usage scenarios for processing documents\n/ Usage scenario for emailing documents to customers\nUsage scenario for emailing documents to customers\nIn this scenario, a print shop wants to show customers who are receiving print statements that they can receive their statements as PDF files. The\nprint shop changes the PDF workflow that prints customer statements so that, in addition to printing the statements, it sends all of them as PDF\nfiles to an email service provider. The service provider emails the statements to the customers.\nThe print shop uses RICOH ProcessDirector Plug-in for Adobe Acrobat to identify the statements as individual documents in the production PDF\nfile for each job. The data in each statement includes the customer name and email address.\nTo change the workflow so that it both prints and emails statements, an administrator at the print shop configures RICOH ProcessDirector to\nsupport the new process.\nThe administrator:\nConfigures RICOH ProcessDirector to send documents to an external SMTP server at the email service provider. The configuration involves\nsetting values for the Alternate SMTP server properties.\nDefines a custom document property, Doc.Custom.CustomerName, in the docCustomDefinitions.xml file, runs the docCustom utility, and\nupgrades the Custom Document Properties feature.\nLoads the updated RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in for Adobe Acrobat.\nUses the Define Document Property function in the plug-in to specify the data that two document properties extract from each document in\nthe PDF file for the job:\nDoc.EmailAddress extracts the email address of the customer.\nDoc.Custom.CustomerName extracts the customer name.\nSaves the two document property definitions in the control file that identifies the statements as individual documents.\nAdds the EmailDocuments step to the workflow and sets values for the step properties:\nThe value of Recipient address is ${Doc.EmailAddress}.\nThe value of Subject line is Statement for ${Doc.Custom.CustomerName}.\nThe value of Message is Save trees by receiving your statements electronically!\nThe value of Attach document is Yes.\nThe value of Name of attachment is ${Doc.Custom.CustomerName}.pdf.\nWhen the administrator enables the workflow and submits a job to it, RICOH ProcessDirector:\nSends the email service provider a PDF file for each customer statement in the job.\nPrints a statement for each customer.\nThe service provider emails each customer their statement. A customer named Anita Doe receives this email:\nTo: Anita.Doe@mymail.comSubject: Statement for Anita Doe\nAttachment: Anita Doe.pdf\n__________________________________________________\nSave trees by receiving your statements electronically!\nAfter receiving a print statement by mail and a PDF statement by email, each customer can decide whether to receive future statements by mail\nor email.\nParent topic: Usage scenarios for processing documents\n1 of 1"}]}