{"doc_name": "aiw00oSystemUserGrp.pdf", "doc_path": "data/raw/RPD-en-US/aiw00oSystemUserGrp.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2294, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM System user and group - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / System user and group\nSystem user and group\nWhen you install RICOH ProcessDirector on an UNIX-based system, the installation program creates a RICOH ProcessDirector system user as a\nmember of the RICOH ProcessDirector group. You use the system user to log in to the system that RICOH ProcessDirector runs on.\nDuring installation on an UNIX-based system, you can use the default names that RICOH ProcessDirector assigns for the system user, aiw1, and\nthe RICOH ProcessDirector group, aiwgrp1. On a Windows system, RICOH ProcessDirector does not assign a default RICOH ProcessDirector\nsystem user name and group. Instead, the installation program prompts you for the system user and group names.\nIf you need to follow your company's naming requirements, you can do one of these:\nCreate your own RICOH ProcessDirector group and system user before the RICOH ProcessDirector installation and then specify them when\nprompted during the installation. You must create the RICOH ProcessDirector group first so the system user is created as a member of the\ngroup.\nSpecify your own RICOH ProcessDirector group and system user when prompted during the installation.\nThe RICOH ProcessDirector system user and group you specify will have the same authorities as the default aiw1 system user and aiwgrp1 group.\nNote: You cannot create a user ID that includes international characters (such as á, É, î, ñ, ô, ß) or double-byte characters.\nTo create your own RICOH ProcessDirector group and system user before installation:\n1. Log in as the root user.\n2. Enter this command to create a group on a Linux computer:\ngroupadd group_name\n3. Enter this command on a Linux computer, to create a system user that is a member of the group you just created:\nuseradd -g group_name -d home_dir user_name\nNote: The system user is put in the /home/user_name directory. Specifying the home directory, home_dir, is optional. If it is not\nspecified, the commands use for Linux the default home directory that is set in /etc/default/useradd.\n4. Install RICOH ProcessDirector. When prompted during the installation, enter the group and system user names you created.\nParent topic: System objects\n1 of 1"}]}