{"doc_name": "ws-inputdevice_c_PrepForRESTInput.pdf", "doc_path": "data/raw/RPD-en-US/ws-inputdevice_c_PrepForRESTInput.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 8444, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Preparing to retrieve REST web services input - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to retrieve REST web services input\nPreparing to retrieve REST web services input\nTo retrieve input from a REST web service for an application, identify the parameters used to call the REST web service. Test the exchange of data between RICOH\nProcessDirector and the application. Then define and configure a REST web service input device.\nTo prepare to retrieve REST web services input:\n1. Learn the requirements for communication with the REST web service for the application:\nThe values for authenticating with the application\nThe values for requesting data from the REST web service\nThe format of the data provided in the response\nRefer to the documentation for the application or consult with the company that hosts the application.\n2. To prepare RICOH ProcessDirector to communicate with the application, do these tasks:\nIf the application requires a security certificate, install the certificate on the RICOH ProcessDirector primary computer.\nIf your environment requires a proxy server to communicate with web services, set up the system to use it.\nFor more information, see the related tasks.\n3. Run a manual test that authenticates with the application and requests a response from the REST web service. Verify that the web service returns the\nresponse that you want.\nMany browsers have plug-ins, such as Boomerang for Google Chrome, that test web service calls to REST clients.\n4. Decide how you want the REST web service input device to create jobs from the data in the response returned by the web service.\nEvery time the input device receives a response, it can create a job containing all XML or JSON data in the response.\nThe input device can examine the response using an XPath or JSONPath expression.\nIf the input device finds XML elements or JSON objects specified by the expression, it creates a job for each matching element or object. Each job contains\nthe matching element or object and all the elements or objects nested within it. If the input device finds two or more elements or objects, it can create\nindependent jobs or child jobs.\nIf the input device does not find matching elements, it does not create a job.\n5. Define a REST web service input device:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Input Devices.\n3. Click Add ⇒ REST web service.\nAs an alternative, you can copy the supplied RestfulWebServiceSample REST web service input device.\n6. On the General tab:\nType a name for the input device.\nSet the Polling interval property to the time that you want the input device to wait between web service calls.\nAfter you define a workflow to process the XML or JSON jobs, set the Child workflow property to the name of that workflow.\nEnter values for other properties that you want to set.\n7. On the Request tab:\n1. Set the Request URL property to the URL of the web service that returns data that RICOH ProcessDirector uses to create one or more jobs.\n2. Set the Request method and Request content type properties to the values required by the web service.\n3. For the value of the Request payload property, specify the body of the web services request that the input device submits to the application.\nTo specify a credential or token and a time range that matches the value of the Polling interval property, use symbols for these properties:\nUser interface\nDatabase name of property name of Remarks\nproperty\nWebService.Credential None RICOH ProcessDirector stores the web service credential or token in this property.\nWebService.CurrentRequestTime None RICOH ProcessDirector sets the value of this property at the start of the polling interval.\nStatus tab: Time When the input device successfully communicates with the application, RICOH\nof last ProcessDirector sets the value of this property to match the value of the\nWebService.LastSuccessRequestTime\nsuccessful WebService.CurrentRequestTime property. A successful communication results in a response\nrequest code 200, even if no data is received that RICOH ProcessDirector can use to create jobs.\nNote:\nThese three job properties are used as example XML values for the Request payload property and as example JSON values for the Request\nparameters property. The requirements of the web service determine which properties you use to submit these and other values.\nIn this XML example, the payload includes these elements: <Token>, <TimeRange>, <Start>, and <End>. The values of three elements are\nsymbols:\n<Token>${WebService.Credential}</Token><TimeRange> <Start>${WebService.LastSuccessRequestTime}</Start>\n<End>${WebService.CurrentRequestTime}</End></TimeRange>\nThe input device resolves the symbols when it polls for input.\n4. Set the values for the Request header and Request parameters properties, as required.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Preparing to retrieve REST web services input - Jenski - Test portal- RPD Linux\nEach header field or parameter is a keyword/value pair. Each pair must appear on a separate line and must be separated using a colon (:) or equals\nsign (=).\nThe keyword and value can be multiple words. RICOH ProcessDirector uses the first colon or equals sign on each line to split the words into the\nkeyword/value pair.\nThis example contains three parameters: token, start, and end. The value of each keyword is a RICOH ProcessDirector symbol. Each symbol\ncontains one of these properties: WebService.Credential, WebService.LastSuccessRequestTime, and WebService.CurrentRequestTime.\ntoken:${WebService.Credential}start:${WebService.LastSuccessRequestTime}end:${WebService.CurrentRequestTime}\nThe input device resolves the symbols when it polls for input.\n5. Select a value for the Create job from response property to specify how the input device creates jobs from the input:\nTo create a job every time the input device receives a response, select Always.\nTo examine the XML or JSON in the response and create a job each time that an XML element or JSON object is found, select Only when response\npattern matches.\n6. If you selected Only when response pattern matches:\nSet the Response pattern to match property to the XPath expression that identifies the XML element or to the JSONPath expression that identifies\nthe JSON object.\nSet the Create child jobs property to Yes if you want to create child jobs when the input device finds two or more matches. The input device also\ncreates a parent job without any data. If the input device finds one match, it creates an independent job.\nSet the Create child jobs property to No if you want to create independent jobs regardless of how many matches the input device finds.\n7. If your environment requires a proxy server to communicate with web services, set the Use proxy property to the correct proxy server.\n8. Set the Time zone offset property to the offset in hours between Coordinated Universal Time (UTC) and the time zone used by the web service.\nFor example, if the web service uses Pacific Standard Time, set the property to -8.\nNote:\nMake sure that you change this property when a location that hosts the web service changes between standard and daylight savings time.\nOtherwise, during the lost or gained hour, you can lose the data that RICOH ProcessDirector uses to create jobs.\nIf the web service uses UTC, enter 0 or leave the field blank.\n8. On the Authentication tab, specify the values required to authenticate with the application.\nFor more information, see the related task about authenticating with a REST web service.\nIf the application does not require authentication, leave all the Authentication properties blank.\n9. Optional: On the Advanced tab, specify any optional properties for your environment.\n10. When you finish, click OK.\nWhen you finish setting up your input devices, notifications, and workflows, test the exchange of data between RICOH ProcessDirector and the application.\nExample\nExamine the supplied RestfulWebServiceSample REST web service input device.\nIn this section:\nUsing a REST web service to authenticate with an application\nREST web service input device and notification objects can use a REST web service to authenticate with an application. RICOH ProcessDirector supports both API\nkey and session authentication. Input device objects authenticate when they poll for input. Notification objects authenticate when they send status to the\napplication.\nParent topic: Configuring\n2 of 2"}]}