{"doc_name": "mail_o_RunningPrintAndMailJobWorkflow.pdf", "doc_path": "data/raw/RPD-en-US/mail_o_RunningPrintAndMailJobWorkflow.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5330, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Running the PrintAndMailJob sample workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Postal Enablement feature / Running the PrintAndMailJob sample workflow\nRunning the PrintAndMailJob sample workflow\nThe PrintAndMailJob sample workflow submits a PDF or AFP file for processing by Ricoh ProcessDirector and the Postal Enablement feature. The\nworkflow simulates sending the job to postal processing software to update addresses as needed and to replace a PostNet barcode with a\nDatamatrix barcode that identifies the job number and document number that can be used to track the progress of the document through other\nsteps in the workflow.\nYou can review the sample workflow and run a sample job to understand how the feature works.\nThe sample files provided for use with this workflow are summarized in the table below.\nFilename File Location Specified in Used by Step Description\nproperty\nPostalPDFReplaceAddr.ctl /aiw/aiw1/co Build PDF BuildPDFFromDocuments Builds a PDF file with the\nntrol_files/ control file 1 PostNet barcode replaced by a\npostal Datamatrix barcode that\nidentifies the job number and\ndocument number. Updates\naddresses as indicated by the\npostal software.\nPostalPDF.ctl /aiw/aiw1/co Identify PDF IdentifyPDFDocuments Identifies the page groups in the\nntrol_files/ control file sample PDF print file and\npostal defines the data to be extracted\nin document properties.\npostal_doc_print_only.csv /aiw/aiw1/co Property SetDocPropsFromConditions Sets the Postal code property\nntrol_files/ conditions file based on the Address\npostal processing return code from the\npostal software so that\ndocuments that have\nreplacement addresses available\ncan be identified when the print\nfile is generated.\nPostal.pdf /aiw/aiw1/te Job name The sample PDF print file.\nstfiles\nPostal.afp /aiw/aiw1/te Job name The sample AFP print file.\nstfiles\njobid.print_and_mail.csv /aiw/aiw1/te Retrieval RunHotFolderAppplication A sample external results file\nstfiles pattern from MailPreparer based on\nprocessing of the sample print\nfile. Can be used to move the\nsample job through the\nRunHotFolderApplication step\nto simulate the response from\npostal software.\nPostalAFPReplaceAddr.cfg /aiw/aiw1/co Enhance AFP BuildAFPFromDocuments Builds an AFP file with the\nntrol_files/ control file PostNet barcode replaced by a\npostal Datamatrix barcode that\nidentifies the job number and\ndocument number. Updates\naddresses as indicated by the\npostal software.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Running the PrintAndMailJob sample workflow - Jenski - Test portal- RPD Linux\nFilename File Location Specified in Used by Step Description\nproperty\nPostalAFP.ctl /aiw/aiw1/co Visual IdentifyDocuments Identifies the page groups in the\nntrol_files/ Workbench sample AFP print file and links\npostal control file the index tags in the AFP file\nwith the corresponding\ndocument properties.\nYou can review the properties for each object before you start the procedure to see how they interact.\nTo run the sample workflow:\n1. Log in to RICOH ProcessDirector.\n2. Copy the PostalFolder input device to create a new hot folder input device.\n1. Click the Administrator tab.\n2. In the left pane, click Devices → Input Devices.\n3. Select the PostalFolder input device and click Actions → Copy.\n4. In the Input device name property, type a name for the hot folder.\n5. In the Child workflow property, select PrintAndMailJob.\n6. In the Folder Location property, update the folder location to a unique filepath.\n7. In the Staging Location property, update the staging location to a unique filepath.\n8. Click OK.\n3. In the Printers portlet, select the Sample printer and click Actions ⇒ Enable.\n4. In the Input Devices portlet on the Main page, select the newly created hot folder and click Actions → Enable and Connect.\n5. Copy the sample file into the hot folder you created in Step 2. Navigate to /aiw/aiw1/testfiles, and copy Postal.pdf into the directory\nthat you specified in the Folder location property of the input device.\nThe system starts processing the job through the PrintAndMailJob workflow. When the job reaches the RunHotFolderApplication step, it\nwaits for results to come from the postal software. The job state changes to Waiting.\n6. Navigate to/aiw/aiw1/testfiles.\n7. Copy jobid.print_and_mail.csv into /aiw/aiw1/postal/receive.\n8. Navigate to /aiw/aiw1/postal/receive and rename jobid.print_and_mail.csv, replacing jobid with the value of the Job Number\nproperty for the sample job. For example, if the Job number for the sample job is 10000067, rename the file to\n10000067.print_and_mail.csv.\nThe RunHotFolderApplication step picks up the file and the job continues to process through the remaining steps in the workflow.\n9. When the job finishes processing, the State column of the Jobs table changes to Complete.\n10. The job is retained for three days and is deleted.\nNote: The sample workflow uses a sample printer that does not print any data. However, the job file can be viewed as it moves\nthrough the workflow, so the barcode updates can be observed. For example, you can view the job while it is waiting in the\nRunHotFolderApplication step to see the PostNet barcode, then view it in the RetainCompletedJob step to see the Datamatrix\nbarcode.\nParent topic: Setting up the Postal Enablement feature\n2 of 2"}]}