{"doc_name": "aiw00_ccopyhotfolder.pdf", "doc_path": "data/raw/RPD-en-US/aiw00_ccopyhotfolder.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2349, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Defining a workflow to copy a file to a printer hot folder - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Workflows for printing / Defining a workflow to copy a file to a printer hot folder\nDefining a workflow to copy a file to a printer hot folder\nYou can define a workflow that accepts a print job in a format such as PDF or PostScript or a JDF job ticket and copies it to a hot folder that is\nassociated with a printer.\nTo define a workflow to copy a file to a printer hot folder:\n1. Click the Workflow tab.\n2. Right-click the PDF workflow and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Right-click the PrintJobs step and select Delete.\n5. If you plan to send PostScript jobs to this workflow, delete the CountPages and CreatePageRanges steps.\n6. Add a CopyToFolder step to the Print phase\n7. Connect the CopyToFolder step to the RetainCompletedJobs step.\n1. Hover over the edge of the CopyToFolder step. Click and hold a highlighted section ( ) to make the connector appear.\n2. Drag the connector onto the RetainCompletedJobs step.\n8. Connect the CopyToFolder step to the step on its left ( CreatePageRanges for PDF workflows or RunExternalProgram for PostScript).\n9. Right-click the CopyToFolder step and select Properties.\n10. Click External.\n11. Delete the contents of the External Command property and replace it with one of these commands.\nTo copy a print file:\ncp ${getCurrentFile(${Job.InputDatastream})} destinationHotFolder/${Job.ID}\nTo copy a JDF job ticket:\ncp ${getFileName(overrides,jdf,read)} destinationHotFolder/${Job.ID}\nIn this text, replace destinationHotFolder with the name of the directory that the printer uses as a hot folder.\n12. Click OK.\n13. Save the workflow.\nIf you also define an AFP printer device to represent the same physical printer, set these properties for the AFP printer device:\nSet the Share printer connection property to Yes.\nSet the IPDS printer connection timer property to a lesser value than the Inactivity timer property. If the IPDS printer connection timer property is\ngreater than the Inactivity timer property, RICOH ProcessDirector drops the connection to the printer before it can share the printer with the hot\nfolder.\nParent topic: Workflows for printing\n1 of 1"}]}