{"doc_name": "avanti_ConfigSlingshot.pdf", "doc_path": "data/raw/RPD-en-US/avanti_ConfigSlingshot.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2777, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Configuring to send job color information to Slingshot - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Configuring to send job color information to Slingshot\nConfiguring to send job color information to Slingshot\nYou can send information about the color of the ink or toner used to print a job from RICOH ProcessDirector to Slingshot.\nThe ink or toner information that you can send to Slingshot varies based on the type of RICOH ProcessDirector printer object you define:\nFor Ricoh TotalFlow printer objects: RICOH ProcessDirector retrieves the values for number of full color and single-color pages printed in a job\nfrom RICOH TotalFlow Print server.\nFor other printer objects: RICOH ProcessDirector reports that all pages of the job were printed in black or in full color.\nTo configure to send job color information to Slingshot:\nFor Ricoh TotalFlow printer objects:\n1. Open the property notebook for the printer and click the Avanti Slingshot tab.\n2. Make sure the Job color to report value is set to From job.\nFor all other printer objects:\nThe recommended method is to create two printer objects that represent the printer. One object prints jobs that are printed in full process color\nand the other prints jobs that use only black ink or toner. Then, modify your workflows to send jobs through the correct printer object.\n1. Define two printer objects to represent the printer. Use the same property values for both except for Name and Job color to report.\n2. Edit any workflows that might process jobs containing either color or black pages to send color jobs to the printer object with Job color to\nreport set to Color and send jobs with only black pages to the printer object with Job color to report set to Black.\nUse a custom job property, such as Custom 1, to assign jobs a value of Black or Color.\nFor example, you can use a SetJobPropsFromTextFile step or an AssignJobValues step to set the value of the Custom 1 job property.\nTo set the value for the Requested printer job property, make a branch in the workflow before the PrintJobs step.\nOn one branch, add a rule that says when the value of Custom 1 is Black, use an AssignJobValues step to set the value of Requested\nprinter to the printer object whose Job color to report property is set to Black.\nOn the other branch, add a rule that says when the value of Custom 1 is Color, use an AssignJobValues step to set the value of\nRequested printer to the printer object whose Job color to report property is set to Color.\nNote: You cannot use the Job color to report property to schedule jobs to printers.\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n1 of 1"}]}