{"doc_name": "pdfw_c_modifyobjects.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_modifyobjects.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4492, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying markup definitions - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Modifying markup definitions\nModifying markup definitions\nAfter you add markup to a PDF file, you might need to delete the markup, move it to a new location, or modify its properties. RICOH\nProcessDirector Plug-in for Adobe Acrobat provides several ways to edit and delete markup, document properties, and a page group definition.\nThe most common methods to edit markup are to double-click the box you drew to display the markup definition window or to click a box and\nmove it to a new location. But you may have layered markup under other markup, such as having several barcodes in the same area because you\nwant to print only one based on RICOH ProcessDirector conditional processing. You could also place a hidden area over an image and place a\nsmaller image over the hidden area. To edit markup layered under other markup, you can use the Markup Navigator to select the markup you\nneed to edit.\nTip: Keep in mind that changes you make to markup in the active PDF file must be saved to the control file to which you previously saved\nthe markup definition. For example, if you added a barcode to a PDF file and saved that definition to a control file, and you delete the\nbarcode from the active PDF file, you must save that change to the existing control file. After you save markup changes to a control file,\nyou must make the new version of the control file accessible to a RICOH ProcessDirector server for those changes to be applied to your\nproduction PDF files.\nYou can use any of the following methods to edit markup.\nMethods to modify markup\nMethod Description\nDouble-click a Displays the property definition window for the markup box.\nmarkup box\nRight-click a markup Displays a popup menu with options to edit the definition of the markup box or to delete it.\nbox\nClick and drag to Click any box for markup, document properties, or a page group definition. Resizing handles appear on the corners of\nresize or move a box the box. Click and drag a corner to change the size of the box.\nClick and drag the middle of a box to move it to a new location.\nNote:\nIf the markup is layered underneath other markup, click Ricoh ⇒ View Markup Navigator to isolate the markup\nyou want to resize. Remove the checkmark from the boxes in front of markup that blocks your access to the\nmarkup you want to edit.\nYou can use the horizontal and vertical coordinates, width, and height in the markup definition window to\nchange the location and size of the markup box.\nIf you click, resize, or move either a page group definition or a conditional trigger, make sure it is on the page\nthat contains the data you are looking for. These three actions resample the data for a page group definition\nor a conditional trigger. If you do one of the actions on the wrong page, RICOH ProcessDirector Plug-in for\nAdobe Acrobat asks whether it should accept your change. If you click OK, the data changes to an incorrect\nvalue.\nLeft-click in the To highlight a markup box:\nMarkup Navigator 1. Click Ricoh ⇒ View Markup Navigator.\n2. Click the markup you want to highlight.\nTip: You can keep the Markup Navigator window open as you add, modify, and delete markup. The window\nautomatically updates with your changes.\nDouble-click in the To edit markup, document properties, or a page group definition:\nMarkup Navigator 1. Click Ricoh ⇒ View Markup Navigator.\n2. Double click the markup you want to edit.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Modifying markup definitions - Jenski - Test portal- RPD Linux\nMethod Description\nHide markup using To hide markup, document properties, or a page group definition so you can access other markup:\nthe Markup Navigator 1. Click Ricoh ⇒ View Markup Navigator.\n2. Toggle the check box on and off to show and hide:\nA box that you drew for markup, document properties, or a page group definition.\nA group of markup. For example, remove the check from the Image check box to hide all image markup boxes.\nNote: When you use the Markup Navigator to hide markup, you are only hiding it from your view of the active\nPDF file. If you have a control file that contains hidden markup and you save a control file, the hidden markup is\nsaved to the control file, and any definitions in it are processed by RICOH ProcessDirector.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n2 of 2"}]}