{"doc_name": "mcc_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/mcc_o_featov.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4151, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM MarcomCentral Connect - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Integration features / MarcomCentral Connect\nMarcomCentral Connect\nThe MarcomCentral Connect feature illustrates how you can integrate the online-storefront and web-to-print functions of MarcomCentral® into\nyour production workflows. A SOAP web service input device retrieves orders for print, digital, and other items from MarcomCentral. RICOH\nProcessDirector creates an order for each MarcomCentral order and a job for each order detail. RICOH ProcessDirector downloads files for print\nitems and notifies MarcomCentral to close out the order when all the items complete their processing.\nA working simulation with sample objects and workflows\nThe MarcomCentral Connect feature includes a complete simulation that demonstrates how to exchange information using objects added by the\nOrder Management feature, MarcomCentral-specific sample objects, and calls to MarcomCentral web services. The web services connect RICOH\nProcessDirector objects and workflows to a sample store at the MarcomCentral website. The sample store serves as a test environment for the\nRICOH ProcessDirector web services interface to MarcomCentral.\nThe simulation has these objects and workflows:\nThe MarcomReceiveOrders sample SOAP web service input device simulates a call to the MarcomCentral web service that returns orders by\ndate. The input device retrieves sample orders, turns them into jobs, and assigns them to the MarcomProcessOrders workflow.\nThe MarcomOrderSample order property mapping object is used by a step in the MarcomProcessOrders workflow. The property mapping object\nreads and interprets the order XML file to identify the order and the jobs contained in it. The property mapping also sets order and job\nproperties based on the values in the XML file.\nThe MarcomProcessOrders sample workflow processes MarcomCentral orders. It converts MarcomCentral order information into RICOH\nProcessDirector order and job properties using the MarcomOrderSample order property mapping object. Then it creates an order and child jobs\nfor each order detail. The workflow submits the jobs to the MarcomProcessJobTicket workflow.\nThe MarcomProcessJobTicket sample workflow processes the jobs created in MarcomProcessOrders and retrieves MarcomCentral job tickets.\nThe workflow sends each printable item through a branch that downloads a file and prints it, and each non-printable item through a branch\nthat holds the job until the warehouse confirms that the item has been added to the order.\nWhen all items in the order have completed processing, the MarcomCloseoutOrders sample SOAP web service notification simulates a call to\nthe web service that closes the order. If the notification actually called the web service, the web service would close the order in the sample\nstore. The status of each item in the order in the sample store would change to Shipped.\nAfter you run the simulation and examine how it works, you can modify the samples and connect them to your store at the MarcomCentral\nwebsite. For example, you can add steps to access an external data source with the information required to process items ordered at your store.\nYou can replace the printing steps in the MarcomProcessJobTicket workflow with the steps in your production workflow or send child jobs to\nmultiple production workflows. You can add notifications to send additional information to MarcomCentral. For more information, see the\nrelated tasks.\nJob properties and sample files for converting information\nThe MarcomCentral Connect feature includes job properties and sample XSLT style sheets:\nThe MarcomCentral order ID, MarcomCentral order number, MarcomCentral job ticket ID, and MarcomCentral product type job properties\nreceive values converted from XML elements in MarcomCentral orders and job tickets.\nOne XSLT style sheet shows you how to convert XML elements into job properties for each ticket job.\nPrerequisites\nThe MarcomCentral Connect feature requires the Web Services Enablement and Order Management features.\nParent topic: Integration features\n1 of 1"}]}