{"doc_name": "aiw_gmc_overview.pdf", "doc_path": "data/raw/RPD-en-US/aiw_gmc_overview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2393, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Quadient Inspire Connect - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Integration features / Quadient Inspire Connect\nQuadient Inspire Connect\nThe Quadient Inspire Connect feature extends RICOH ProcessDirector to make it easier to interact with Quadient Inspire Designer v8 and higher.\nThe feature adds system objects tailored to work with files created by Quadient Inspire Designer so they can be submitted to the processing\nengine to generate print jobs as part of a print workflow.\nAfter you create an application in Quadient Inspire Designer, you can:\nSubmit raw, unprocessed formatting, configuration, and data files to a hot folder and send them to Quadient Inspire Designer to create an AFP\njob or PDF job as part of a workflow.\nIf you want to generate AFP or PDF output as part of job processing, you can submit the WFD file and JOB file from Quadient Inspire Designer\nalong with variable data files (in any format that Quadient Inspire Designer supports) to a hot folder that uses the List batching method.\nUse Quadient Inspire Designer to modify an existing AFP or PDF file as part of a workflow.\nIf you have an existing AFP or PDF application that you want to continue to use, you can submit a WFD file to a hot folder as a print job. RICOH\nProcessDirector invokes Quadient Inspire Designer, which locates the existing AFP or PDF file and uses the information in the WFD file to\nrecreate the AFP or PDF file.\nWhen generating or modifying a file, the hot folder assigns the job to a workflow that contains a step based on the ComposeAFP or\nComposePDF step template to send the files to Quadient Inspire Designer. The step waits until the AFP or PDF file is returned to continue\nprocessing.\nNew Step Templates\nThe feature adds step templates to send jobs to Quadient Inspire Designer.\nComposePDF\nA step based on this step template uses Quadient Inspire Designer to generate a new PDF file from a WFD file and one or more raw data files.\nThe step waits for the new file to be returned.\nComposeAFP\nA step based on this step template uses Quadient Inspire Designer to generate a new AFP file from a WFD file and one or more raw data files.\nThe step waits for the new file to be returned. ComposeAFP is only available when the Quadient Inspire Connect and AFP Support features are\ninstalled.\nParent topic: Integration features\n1 of 1"}]}