{"doc_name": "enablingobjectselection.pdf", "doc_path": "data/raw/RPD-en-US/enablingobjectselection.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2828, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Enabling object selection in sample AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Enabling object selection in sample AFP files\nEnabling object selection in sample AFP files\nYou can change which AFP objects (text, overlays, page segments, barcodes, images) are selectable in the sample AFP file that is currently open.\nWhen you click an object that is selectable in the sample AFP file, you see a red box around it. Then you can see the properties of the object and,\ndepending on the mode you selected, act on it.\nBy default, each mode lets you select only the types of objects that you can act on. For example, the AFP Indexer mode lets you select text\nobjects, but not overlays, page segments, barcodes, or images. The default for each mode is suitable for most purposes. However, you might\nwant to temporarily make other types of AFP objects selectable so that you can see the properties of other AFP objects in the AFP file. In that\ncase, you should use the enabling object selection function.\nNote:\n1. If you change the mode or open a new sample AFP file after you change the types of object you can select, your changes are lost\nand the default selections for the current mode are used.\n2. You cannot select AFP objects that are defined in a form definition, even if the objects are listed as a resource in the file-structure\npane or you have enabled their selection.\nTo choose which objects are selectable in this AFP file:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. Click Mode and a feature.\n3. Click Resources ⇒ Enable Object Selection.\n4. Indicate which objects you want to select in this AFP file:\nClick individual objects you want to select:\nText to select text blocks and to select barcodes that were created using fonts.\nBarcodes (BCOCA) and images (IOCA) to select barcodes that were created using Bar Code Object Content Architecture (BCOCA) and to\nselect images created using Image Object Content Architecture (IOCA).\nPage segments to select page segments.\nOverlays to select overlays.\nClick All objects to select all objects.\nClick No objects to clear all objects.\n5. Click OK.\n6. In the AFP file, you can now select an object that you made selectable and see its properties:\n1. Click an object.\nIf you select an area that contains overlapping selectable AFP objects (for example, an area might contain both a BCOCA barcode\nand text), you see the Select an Object window so you can indicate which object you want to select.\n2. Right-click anywhere in the AFP file to see the properties of the object.\n7. Optional: To revert to the default object-selection settings for the current mode, click Mode and then click the current mode.\nParent topic: Working with sample AFP files\n1 of 1"}]}