{"doc_name": "create_edit_notes.pdf", "doc_path": "data/raw/RPD-en-US/create_edit_notes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2260, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Creating and editing notes - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Creating and editing notes\nCreating and editing notes\nYou can create, edit, and delete messages in RICOH ProcessDirector to communicate status across shifts, announce system maintenance, or any\nother messages you need to post in the application. Your coworkers can respond with reactions and replies to facilitate dynamic conversations.\nTo open and close the Notes panel, click from the banner at the top of the page.\nA red bullet on the icon indicates unread notes.\nA red bullet with an @ symbol indicates unread notes where you are mentioned.\nTo post a note:\n1. Click Add a note and enter your message.\nTo mention a coworker, type @ followed by their User name or Display name.\nTo mention an object, type # followed by its name.\n2. Click Post note to submit your message.\nTo edit your note:\n1. Hover over the note and click Edit.\n2. Make the changes and click OK to save.\nTo reply to a note:\n1. Hover over the note and click Reply.\n2. Enter your response and click Post note to submit.\nTo narrow down the notes, use the filter option to quickly retrieve specific past communications.\nYou can also narrow down results by selecting a mention (@user_name) or an object to view only the messages related to that person or object.\nTo remove a note or a reply:\n1. Hover over the note and click Remove.\n2. On the confirmation dialog, click OK.\nTo remove multiple notes:\n1. Click the three dots at the top of the panel and select Remove all displayed notes.\n2. On the confirmation dialog, click OK.\nNote:\nOnly the notes currently visible in the Notes panel are deleted. You cannot manually select multiple notes for selective deletion;\nthis action removes all visible notes at once.\nNote:\nTo maintain a clean and organized system, notes are automatically deleted after a predefined expiration period to make sure only relevant\ncontent is retained.\nRICOH ProcessDirector creates a record of the removed notes in the audit files.\nNotes are accessible exclusively within the RICOH ProcessDirector interface and are not distributed through external channels such as\nemail or third-party messaging systems.\nParent topic: Managing system objects\n1 of 1"}]}