{"doc_name": "pref_o_scen_markup.pdf", "doc_path": "data/raw/RPD-en-US/pref_o_scen_markup.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6846, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Usage scenario for applying document markup based on a preferences file - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Preference Management\n/ Usage scenario for applying document markup based on a preferences file\nUsage scenario for applying document markup based on a preferences file\nIn this scenario, a company changes their PDF print process to add a marketing offer to customer statements in a composed PDF file before\nprinting the statements. One of two different marketing offers can be added. The choice for each statement is based on the award level that a\ncustomer has attained. Because the award level is not part of the data on the statement, the company exports award levels from their customer\ndatabase into a text file that contains headers. That text file is used as a preferences file. The values in the file determine the offer applied to each\nstatement.\nThe preferences file contains customer account numbers and award levels. Customers at the Platinum award level receive one offer, and\ncustomers at the Gold award level receive another offer. Customers who have not attained an award level do not receive an offer.\nBefore changing their process, the company prints all their statements using the EnhancePDFDocuments supplied workflow. The value of the\nIdentify PDF control file property on the IdentifyPDFDocuments step is /aiw/aiw1/control_files/EnhancePDFdocs.ctl. The value of\nthe Build PDF control file 1 property on the BuildPDFFromDocuments step also is /aiw/aiw1/control_files/EnhancePDFdocs.ctl.\nThe company uses the HotFolderPDF supplied input device with the Child workflow property set to EnhancePDFDocuments.\nThey use RICOH ProcessDirector Plug-in for Adobe Acrobat to identify the statements as individual documents in the production PDF file for each\njob. The data in each statement includes the account number.\nTo support the new process, the administrator:\nSets up custom document properties and adds markup for the offers.\nCreates a document property mapping object.\nMakes the preferences file available to RICOH ProcessDirector.\nAdds the ApplyPreferences step to the EnhancePDFDocuments workflow.\nSetting up custom document properties and adding markup\nTo set up custom document properties and add markup, the administrator:\nDefines and activates two custom document properties on the Administration ⇒ Objects ⇒ Custom properties page:\nDoc.Custom.AccountNumber, with Account number for the Field name\nDoc.Custom.AwardLevel, with Award level for the Field name\nLoads the updated RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in for Adobe Acrobat.\nUses the Define Document Property function in the plug-in to map account number data in the documents to the Account number document\nproperty (database name Doc.Custom.AccountNumber).\nDuring processing, the IdentifyPDFDocuments step in the workflow extracts the data for the Account number document property from each\ndocument in the PDF file for the job.\nNote:\nThe Define Document Property function cannot be used to map data to the Award level document property (database name\nDoc.Custom.AwardLevel) because the documents do not have that data. During processing, the ApplyPreferences step in the workflow\nuses the preferences file to populate the property values.\nUses the Manage Rules function in the plug-in to define two rules:\nThe Award_level_platinum rule has these rule conditions: Doc.Custom.AwardLevel = Platinum\nThe Award_level_gold rule has these rule conditions: Doc.Custom.AwardLevel = Gold\nUses the Add Image function in the plug-in to add two images:\nThe first image is placed on documents that meet the conditions in the Award_level_platinum rule.\nThe second image is placed on documents that meet the conditions in the Award_level_gold rule.\nUses the Save control file function in the plug-in to save the document property definition and the markup for the two images in the\nEnhancePDFdocs.ctl control file.\nSends the control file to the RICOH ProcessDirector server.\nCreating a document property mapping object\nThe administrator creates a CustomerPreferences document property mapping object with these values:\nIn the General section, the value of File type is CSV.\nIn the Property Mapping section the values are:\nHeading Document propertyUsage\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM Usage scenario for applying document markup based on a preferences file - Jenski - Test portal- RPD Linux\nAccount Number Account number Identify document\nAwards Award level Update property\nMaking the preferences file available to RICOH ProcessDirector\nTo make the preferences file available to RICOH ProcessDirector, the administrator:\nCreates an /aiw/aiw1/preferences directory for preferences files.\nAsks the department that provides the preferences file to name it EnhancePDFprefs.csv and write it to the /aiw/aiw1/preferences\ndirectory.\nMakes sure that the preferences file is ready for RICOH ProcessDirector to process:\nThe file must be in comma-separated values (CSV) format or tab-delimited format.\nThe columns of data must have the headings specified in the document property mapping object: Account Number and Awards.\nThis example shows a portion of the file:\nAccount Number,Awards\n2000144372,Gold\n2001144678,None\n2001154898,Platinum\n2004187456,None\n2007192007,None\n2010197554,Gold\n2010223114,Gold\n2012234096,Platinum\n2231547625,None\nModifying the workflow\nTo modify the EnhancePDFDocuments workflow that the company uses to print statements, the administrator adds an ApplyPreferences step\nafter the IdentifyPDFDocuments step and sets values for the step properties:\nThe value of Preferences file is /aiw/aiw1/preferences/EnhancePDFprefs.csv.\nThe value of Property mapping is CustomerPreferences.\nProcessing jobs through the workflow\nAfter setting up the workflow and testing it, the administrator places the workflow in production.\nThe HotFolderPDF supplied input device receives a PDF job with statement documents and submits it to the EnhancePDFDocuments workflow.\nThe job moves to the IdentifyPDFDocuments step. RICOH ProcessDirector identifies the documents in the PDF file and determines the value of the\nDoc.Custom.AccountNumber property for each document. RICOH ProcessDirector writes the values of the property to the document properties\nfile for the job.\nThe job moves to the ApplyPreferences step. RICOH ProcessDirector reads the information in the EnhancePDFprefs.csv file and creates one\ncolumn of data in the document properties file. The column contains values for the Doc.Custom.AwardLevel property.\nThe job moves to the BuildPDFFromDocuments step. RICOH ProcessDirector applies images to the documents by using the values for the\nDoc.Custom.AwardLevel property in the document properties file.\nParent topic: Preference Management\n2 of 2"}]}