{"doc_name": "ws-inputdevice_c_AuthenticateRESTws.pdf", "doc_path": "data/raw/RPD-en-US/ws-inputdevice_c_AuthenticateRESTws.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6297, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Using a REST web service to authenticate with an application - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to retrieve REST web services input / Using a REST web service to authenticate with an application\nUsing a REST web service to authenticate with an application\nREST web service input device and notification objects can use a REST web service to authenticate with an application. RICOH ProcessDirector\nsupports both API key and session authentication. Input device objects authenticate when they poll for input. Notification objects authenticate\nwhen they send status to the application.\nFor API key authentication, you put an authorization code in a Static credential property or define an HTTP user ID and password. The input\ndevice or notification passes the authorization code or the HTTP user ID and password to the web service that exchanges data. The web service\nthen authenticates with the application and returns a response.\nFor session authentication, you put authentication credentials (user ID and password) and other values in a set of authentication request\nproperties. The input device or notification first calls a REST web service to authenticate with the application. After a successful authentication,\nthe web service returns a token to the input device or notification. The input device or notification then transmits the token in the call to the web\nservice that exchanges data.\nIf the application allows one session per user, set up your input devices and notifications to call the web services with different user IDs and\npasswords.\nSession authentication occurs with every web service call and logging out is not required. Make sure that the length of the session for each set\nof credentials is shorter than the time between calls to the web service. For example, the session for an input device expires after 10 minutes.\nWhen you configure the input device, specify a polling interval greater than 10 minutes.\nTo get an API key or authentication credentials for an application, contact the company that hosts the application. For format and syntax\nrequirements, refer to the documentation of the application.\nTo use a REST web service to authenticate:\n1. Click the Authentication tab on the REST web service input device or notification.\n2. Follow the instructions for the type of authentication that the application requires:\nFor API key authentication, specify the authentication code as the value of the Static credential property.\nLeave all the other properties blank. You have completed this procedure.\nFor session authentication, leave the Static credential property blank. Go to the next step and specify the other properties.\n3. Set the Authentication request URL property to the URL that RICOH ProcessDirector uses to authenticate with the application.\n4. Specify the authentication credentials by entering values required by the application in one or more of these properties: Authentication\nrequest payload, Authentication request header, and Authentication request parameters.\nFor the value of the Request payload property, specify the body (if any) of the authorization request that is submitted to the application.\nIn these examples, the payload includes three XML elements: <Credentials>, <Name>, and <Password>. The value of the\n<Password> element is a symbol that uses the Authentication request password property.\nThis example uses the Authentication request password property for input devices:\n<Credentials> <Name>myname</Name> <Password>${WebService.AuthRequestPwd}</Password></Credentials>\nThis example uses the Authentication request password property for notifications:\n<Credentials> <Name>myname</Name> <Password>${WSNotification.WebService.AuthRequestPwd}</Password>\n</Credentials>\nThe input device or notification resolves the symbol when it sends the authentication request.\nSet the values for the Request header and Request parameters properties, as required.\nEach header field or parameter is a keyword/value pair. Each pair must appear on a separate line and must be separated using a colon (:)\nor equals sign (=).\nThe keyword and value can be multiple words. RICOH ProcessDirector uses the first colon or equals sign on each line to split the words\ninto the keyword/value pair.\nThese examples contain two parameters: name and pwd. The value of the pwd keyword is a symbol that uses the Authentication request\npassword property.\nThis example uses the Authentication request password property for input devices:\nname:mynamepwd:${WebService.AuthRequestPwd}\nThis example uses the Authentication request password property for notifications:\nname:mynamepwd:${WSNotification.WebService.AuthRequestPwd}\nThe symbol is resolved when the authentication request is sent.\n5. Set the Request method and Request content type properties to the values required by the web service.\n6. Set the Authentication response attribute property to the XPath expression that identifies the credential for the session in the response\nfrom the web service.\n7. Set the Authentication request password property to the password for your account with the application.\nThe password is encrypted when it is stored in RICOH ProcessDirector.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Using a REST web service to authenticate with an application - Jenski - Test portal- RPD Linux\nFor both API key and session authentication, RICOH ProcessDirector stores the static credential or token returned from the application in a\nproperty.\nFor input devices, the property is WebService.Credential.\nFor notifications, the property is WSNotification.WebService.Credential.\nWhen you specify values on the Request tab for a web service input device or notification, you specify the WebService.Credential or\nWSNotification.WebService.Credential property as a symbol.\nRICOH ProcessDirector substitutes the value of the static credential or token for the symbol when it transmits the request to a web service.\nNow that you have specified the values required to authenticate with the application, complete the steps for defining and configuring the input\ndevice or notification. Return to one of these topics:\nPreparing to retrieve REST web services input.\nPreparing to send status to a REST web service.\nParent topic: Preparing to retrieve REST web services input\n2 of 2"}]}