{"doc_name": "aiw00o33.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o33.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2153, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Users and groups - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Users and groups\nUsers and groups\nAll RICOH ProcessDirector users must have a unique RICOH ProcessDirector user name and password and must belong to at least one RICOH\nProcessDirector group.\nThe group controls which tasks and actions the user can access and do. RICOH ProcessDirector provides these groups:\nAdministrator\nAdministrators can access all functions and interfaces. They can create and configure all RICOH ProcessDirector objects, such as input devices\nand printers. They can also create and modify the workflows that control the processing that RICOH ProcessDirector does for all jobs.\nSupervisor\nSupervisors can access the Administration page of the RICOH ProcessDirector user interface, but they cannot create RICOH ProcessDirector\nobjects or edit the properties of all the objects that they can see. They can disable and enable printers and change printer properties. They\ncan also change all job properties.\nOperator\nOperators cannot access the Administration page of the user interface. They can change a subset of job properties, such as the requested\nprinter, and do actions on printers, such as enabling, disabling, and changing scheduling properties. They can also do most of the available\njob and input device actions.\nMonitor\nMonitors have view-only access to the RICOH ProcessDirector system. They can see job properties and input files, see the candidate jobs for\na printer, and change their own passwords, but they cannot do any other actions. They cannot see the contents of jobs or access the\nAdministration page.\nYou can be a member of more than one user group. If you are a member of more than one user group, you are granted the highest level of\nauthority from the groups you belong to. For example, if you are a member of both the Supervisor and Operator user groups, you retain all the\naccess privileges of the Supervisor user group. Which means that you can do actions that a typical member of the Operator group cannot do.\nYou can also create your own groups.\nParent topic: System objects\n1 of 1"}]}