{"doc_name": "aiw00c30.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c30.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2353, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Preparing for FTP or SCP clients - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing for FTP or SCP clients\nPreparing for FTP or SCP clients\nTo get a job into a workflow, an application can copy or send the input file into a hot folder using a variety of methods, including File Transfer\nProtocol (FTP), Secure Copy Protocol (SCP), and RICOH ProcessDirector web services.\nFor security reasons, many administrators disable FTP on their Linux systems. For file transfers, they use SCP instead. Some makers of FTP\nsoftware are aware of this practice and have added functions to their FTP clients to let them try to use FTP first. If FTP fails, the software tries\nother methods, including SCP.\nFor RICOH ProcessDirector, it does not matter which protocol you use to transfer the data files to the input device directory. The most important\nthing, regardless of the mechanism you use, is to make sure that the job is submitted using a user ID and password that have the correct\npermissions to let RICOH ProcessDirector access the file.\nDuring installation, RICOH ProcessDirector creates a RICOH ProcessDirector group ( aiwgrp1 is the default) and gives the RICOH ProcessDirector\nsystem user ( aiw1 is the default) authority to this group. You can assign the group and system user names or use the defaults. Any user who is\nin the RICOH ProcessDirector group can access files that RICOH ProcessDirector creates. If you have users with user IDs on the primary computer\nwho need to work directly with RICOH ProcessDirector files (such as users who submit jobs using FTP or SCP), you must add their user IDs to the\nRICOH ProcessDirector group. Be sure to use the RICOH ProcessDirector group name as an additional group for your users, not as their default\ngroup.\nWhen you explain how to submit jobs using FTP (if you have FTP enabled on your system) or an FTP client that uses SCP, tell your job submitters\nthat they must be logged in with a user ID that is a member of the RICOH ProcessDirector group. If they use any other user ID, RICOH\nProcessDirector does not have the correct access permissions set on the input file and cannot process the job. The job stays in Error state in the\nReceive phase until it is deleted and resubmitted correctly.\nParent topic: Preparing for job submission\n1 of 1"}]}