{"doc_name": "cac_CMRs.pdf", "doc_path": "data/raw/RPD-en-US/cac_CMRs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3521, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Color Management Resources - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Color Management Resources\nColor Management Resources\nColor management resources (CMRs) are the foundation of color management in AFP print systems. They are AFP resources that provide all the\ncolor management information, such as ICC profiles and halftones, that an AFP system needs to process a print job and maintain consistent color\nfrom one device to another.\nCMRs share some characteristics with other AFP resources, but are different in some important ways.\nCMRs are similar to other AFP resources in these ways:\nCMRs can be associated with elements of a print job at various levels of the hierarchy.\nTypical hierarchy rules apply, so CMRs specified at lower levels override those at the higher level. For example, a CMR set on a data object\noverrides a default CMR set on a print file.\nCMRs can be included in a print job in an inline resource group and referenced in a form definition, page environment, object environment, or\nan include Object (IOB) structured field.\nNote:\nCMRs can vary in size from several hundred bytes to several megabytes. If your print job uses relatively few CMRs, including them in the\nprint file might not have an impact on the performance of your system. However, if your print job uses more than 10 CMRs, the size of\nthe print job can increase so much that file transfer rates and network traffic are affected.\nCMRs can be stored centrally in a resource library, so you do not need to include them in every print job.\nYou can configure all your print servers so they can access the CMRs.\nFor the print server to find CMRs, the resource library must be listed in the AFP resource search path on the print server.\nCMRs are different from other AFP resources in these ways:\nYou cannot copy CMRs into a resource library as you can other AFP resources.\nTo store CMRs in a central resource library, you must install them by using an application such as RICOH AFP Resource Installer.\nCMRs and data objects must be stored in resource libraries that have resource access tables (RATs).\nAFP Resource Installer creates the RAT when CMRs and data objects are installed. We recommend that CMRs and data objects be installed in\nseparate resource libraries and that you store resources that do not require RATs (such as form definitions, page definitions, and overlays) in\nother resource libraries.\nCMRs installed in a resource library can have names longer than 8 characters, and you can use the names in the print data stream.\nThese names are created when you install the CMR by using AFP Resource Installer and are UTF-16BE encoded.\nIn this section:\nTypes of CMRs\nDifferent situations call for different types of CMRs. Some CMRs are created by product manufacturers so you can download and use them,\nwhile others are created by your printer or other color management software. If you have the appropriate information, you can also create CMRs\nyourself.\nCMR Processing Modes\nCMR processing modes tell the print system how to apply a CMR to the print data it is associated with. You specify a CMR processing mode\nwhenever you specify a CMR, although not all modes are valid for all CMR types.\nCMR Creation and Installation\nDevice manufacturers and groups that support AFP color standards create CMRs that you can use in your color printing systems. You can also\ncreate CMRs yourself, based on your needs.\nParent topic: AFP Color Management\n1 of 1"}]}