{"doc_name": "not_c_CreateNotif.pdf", "doc_path": "data/raw/RPD-en-US/not_c_CreateNotif.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3714, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Creating email notifications - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Notifications / Email / Creating email notifications\nCreating email notifications\nYou can use notifications to send emails to selected users when specific input device, job or printer events occur. You can create one email\nnotification for each combination of event and recipients. For example, you can create one notification to send emails to the first shift operators\nwhen a printer enters an error state and another notification to send a slightly different email message to the second shift operators when the\nsame printer event occurs.\nTo create an email notification:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Notifications.\n3. Click Add ⇒ Email.\n4. Enter a name for the notification.\n5. Select the type of object to be monitored.\nYou can only use one type of Event type for each notification.\n6. In the Recipient address field, enter the email addresses or the name of a RICOH ProcessDirector group of users you want to receive this\nnotification mail.\n7. In the Subject line field, enter the subject for the notification message.\n8. In the Message field, enter the message that is sent to the users.\nNote:\nIn the Subject line and Message fields, you can have variable information inserted in the text using symbolic notation such as\n${Printer.ID}.\n9. Optional: Specify the maximum number of messages that are sent in the time period that you specify.\n10. Optional: Specify that you want to attach the input device, printer or job log.\n11. In the Event tab:\n1. Select the property, the action, and the value to monitor.\n2. To define an additional event, click + to the right of any event.\n3. To delete an event, click - to the right of the event you want to delete.\n12. In the Conditions tab:\n1. Select the property and the value that must be satisfied before any notifications are sent.\n2. To define an additional condition, click + to the right of any event.\nSelect Any, All, or Custom to specify how the conditions are combined.\n3. To delete a condition, click - to the right of the condition you want to delete.\n13. Click OK.\nExample\nA notification that notifies members of the Supervisor group when a job goes into an error state in the PDF or Billing workflow\nFor the General tab:\nThe Event type is Job.\nThe Recipient address is Supervisor.\nThe Subject line is Problem with job.\nThe Attach log is Yes to send the job log.\nThe Message is Job ${Job.Name} in workflow ${Job.JobType} has encountered an error.\nNote:\nIn the email message, the two symbolic references are filled in with the job name and the workflow for the job with the error.\nFor the Event tab:\nThe property is Job state.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Creating email notifications - Jenski - Test portal- RPD Linux\nThe action is Changes to.\nThe value is Error.\nFor the Conditions tab:\nAny is selected.\nThe first property is Child job type.\nThe comparison is =.\nValue is PDF.\nThe second property is Child job type.\nThe comparison is =.\nThe value is Billing.\nTo understand the difference of where the parentheses are placed, consider this example:\n1. Input data stream = PDF\n2. Input data stream = PostScript\n3. Requested printer = Ricoh901C\nIf you specify ( 1 OR 2 ) AND 3 for the combination rules, the condition are met when:\nThe input data stream is PDF and the requested printer is Ricoh 901C.\nThe input data stream is Postscript and the requested printer is Ricoh 901C.\nIf you specify 1 OR ( 2 AND 3 ), the conditions are met when:\nThe input data stream is PDF. Any printer can be requested.\nThe input data stream is Postscript and the requested printer is Ricoh 901C.\nParent topic: Email notifications\n2 of 2"}]}