{"doc_name": "aiw_jobtype_for_printing.pdf", "doc_path": "data/raw/RPD-en-US/aiw_jobtype_for_printing.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3134, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Workflows for printing - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Workflows for printing\nWorkflows for printing\nYou can define a workflow that lets you track a job that contains PDF data through the system.\nThe primary function of a PDF workflow depends upon the target printer.\nIf the target printer is a Ricoh PDF printer or a TASKalfa printer, the workflow can send a job and a job ticket to the printer. The printer uses the\ninformation contained in the JDF job ticket to complete the job, which lets the user view real-time status and job progress.\nIf the target printer supports LPD or another protocol, the workflow can use the PrintJobs step to send a job to a printer that uses that protocol.\nThe PrintJobs step uses job properties to schedule the job to an appropriate printer. If more than one printer can print the job, the PrintJobs step\nbalances printer loads.\nIf the target printer receives jobs or JDF job tickets through hot folders, the workflow can send the job to a Passthrough printer device. The\nprinter device has a Printer command property that copies the job into a hot folder that is associated with the printer.\nIf the target printer is a Kodak printer, the PrintJobs step can send the PDF file, with inserted KDK commands, to the printer. The Cut Sheet\nSupport for Kodak feature is required.\nIf the target printer is a Xerox printer, the PrintJobs step can send the PDF file, with inserted XRX or XPIF commands, to the printer. The Cut\nSheet Support for Xerox feature is required.\nIf the target printer is a custom PDF printer, the PrintJobs step converts the PDF file to PostScript and sends a PostScript data stream to the\nprinter. The data stream can contain device-specific PostScript commands.\nAnother function of the workflow can be to combine small PDF files into one larger file. Adding the BuildPDFFromZIP step to a PDF workflow lets\nyou concatenate PDF files contained in a .zip file into a larger PDF file. The smaller files are added to the new file in the order they are in the\n.zip file. The hot folder input device that processed the input file can create the .zip file. Alternatively, you can package the files as a .zip file\nbefore they are submitted.\nIn this section:\nDefining a workflow to print a job\nTo print a job on a printer, you must create a workflow that uses the PrintJobs step.\nDefining a workflow to copy a file to a printer hot folder\nYou can define a workflow that accepts a print job in a format such as PDF or PostScript or a JDF job ticket and copies it to a hot folder that is\nassociated with a printer.\nDefining a workflow to print to a Passthrough Printer\nYou can define a workflow that accepts a print job in PDF or PostScript format and sends it to a Passthrough printer.\nPrinting PDF and PostScript files on the InfoPrint 5000 printer Models AS1 and AD1/2\nTo send PDF and PostScript files to the hot folders on the InfoPrint 5000 printer Models AS1 and AD1/2 with RICOH ProcessDirector for Linux,\nyou can set up a workflow that uses the CopyToFolder step.\nParent topic: Preparing to use workflows\n1 of 1"}]}