{"doc_name": "pdfw_c_scen_concepts.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_scen_concepts.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4376, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Processing PDF files that contain documents - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / PDF Document Support / Processing PDF files that contain documents\nProcessing PDF files that contain documents\nThe PDF Document Support feature lets you manipulate the individual documents in a PDF file. For example, you can rearrange their output\norder or group them according to different envelope size requirements. You can find a specific document by searching for a document property\nin the PDF file.\nYou use RICOH ProcessDirector Plug-in for Adobe Acrobat to define page groups, document properties, markup, media, and finishing for a\nsample PDF file. You save those definitions in a control file.\nSteps in a workflow extract information about the documents in a PDF file and store that information in a document properties file, which is\nstructured like a table. The document properties file lets RICOH ProcessDirector do operations on individual documents rather than only on the\njob as a whole.\nWhen you create a workflow to receive PDF files, you include a step based on the IdentifyPDFDocuments step template. You specify the RICOH\nProcessDirector Plug-in for Adobe Acrobat control file that contains the page group definition and any document properties. This step builds a\ndocument properties file that represents an inventory of all the documents in the job.\nTo process individual documents, you can add steps to the Assemble phase of the workflow based on these step templates:\nGroupDocuments lets you classify all the documents into groups based on up to six document properties. For example, if you had a file of 5000\ninsurance policy addenda documents, you could group all of them into all the combinations of policy type (auto or home) and state.\nSortDocuments lets you sort documents by up to six document properties. For example, you could alphabetize the policy addenda within each\ngroup so you would have all the auto policies in states A-Z followed by all the home policies in states A-Z.\nSplitDocuments lets you divide a large job into several smaller jobs based on the number of documents or the number of sheets in the smaller\njob.\nEach of these steps adds or changes information in the document properties file without changing the contents of the original PDF job. The\ndocument properties file that was created initially to identify all of the documents has more information added to it, such as the location of each\ndocument in the rearranged PDF file.\nAfter you define steps to manipulate the documents into the new grouping and order that you want, you include a step in the Assemble phase\nof the workflow that builds a new PDF file with the individual documents organized according to that ordering. You use a step based on the\nBuildPDFFromDocuments step template if you want to create a single output job based on the newly ordered documents. However, if you want\nto create separate output jobs because you used the SplitDocuments step or you want to print each group of documents created by the\nGroupDocuments step separately, you also add a step based on the CreateJobsFromDocuments step template.\nTo allow for more complicated manipulation of the documents, you can add multiple RICOH ProcessDirector Plug-in for Adobe Acrobat control\nfiles that define different markup to be added to each document. You specify the name of the control files containing these definitions when you\ncreate the BuildPDFFromDocuments step in the Assemble phase of a workflow.\nThe remainder of the workflow that processes PDF jobs looks the same as if you did not have PDF Document Support installed-steps can enable\nrepositioning of the print job in case you need to recover from a paper jam or reprint selected documents, and a step based on the PrintJobs step\ntemplate manages the print processing. Steps in the Complete phase let you retain the job in RICOH ProcessDirector for an interval you specify,\nand then the job is deleted from the system when that interval expires.\nIf you want to view the values of document properties in the user interface or to search for a document based on a property value, include a\nWriteDocumentsToDatabase step in your workflow. This step saves document property values to the document database.\nParent topic: PDF Document Support\n1 of 1"}]}