{"doc_name": "aiw_sdk_listfiles.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_listfiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2626, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM List files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / List files\nList files\nYou can use list files to process multiple files with or without a JDF job ticket or to process overrides files with files.\nThe limitations of using a list file with a job ticket include:\nThe files must be submitted with the job ticket; they cannot be located on another system and accessed using a mapping file.\nAll the files must be submitted directly to the Folder location, not to a subfolder.\nIf you use a list file, you must use the List batching method.\nYou can use list files in these ways:\nIf the job ticket does not include the names of all the input files, the list file can include them along with the name of the job ticket file. When\nall the files are present, the job is submitted.\nYou can create a generic job ticket, which uses placeholder file names instead of real file names, so you can reuse the ticket with different jobs.\nThe list file contains the names of the specific files that are used for the job. The order of the file names in the list file must correspond to the\nplaceholder file names in the job ticket; the first file listed in the list file must correspond to the first placeholder file listed in the job ticket.\nFor example, if your application prints various booklets that all contain four files (a front cover, a fly leaf, the body of the booklet, and a back\ncover), you can create a job ticket that includes four files in the order that they should print:\nfrontcover.pdf\nflyleaf.pdf\nbookletbody.pdf\nbackcover.pdf\nNote: In this case, the job ticket must include only file names without any path information.\nFor each booklet, you can then create a list file that lists the specific files in the same order:\nBooklet 1 list file contains:\nbooklet1fc.pdf\nbooklet1fl.pdf\nbooklet1body.pdf\nbooklet1bc.pdf\nBooklet 2 list file contains:\nbooklet2fc.pdf\nbooklet2fl.pdf\nbooklet2body.pdf\nbooklet2bc.pdf\nYou can create a list file that contains the name of the input file or files and the overrides files that are associated with them. The name of the\noverrides file must appear immediately after the input file that it is associated with in the list. The names of the input files and overrides files are\ncase-sensitive and each file name must be on a separate line. Do not include directory information with the file name. For example, the list file\nmight contain this information:\ninput1.pdf\nprop1.oth\ninput2.pdf\nprop.oth\ninput3.pdf\nduplex.oth\ninput4.pdf\ninputfiles.oth\nParent topic: Batching methods\n1 of 1"}]}