{"doc_name": "aiw00c9.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c9.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5489, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Identifying AFP resource directories to RICOH ProcessDirector - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / AFP resources in RICOH ProcessDirector / Identifying AFP resource directories to RICOH ProcessDirector\nIdentifying AFP resource directories to RICOH ProcessDirector\nIf any of your AFP resources (such as fonts, form definitions, page segments, and overlays) are neither sent inline with the job nor in the default\nresource directory, you must configure your workflows so that RICOH ProcessDirector knows where to find those resources during processing. In\naddition, you might want to add those directories to existing step templates and printers.\nYou can identify locations of your AFP resources to RICOH ProcessDirector using the AFP resource path property of a job or a printer. The AFP\nresource path property is set to the directory path that identifies the location of your AFP resources. If you have more than one directory path to\nlist, type a colon (:) between them.\nNote:\nOn a Windows machine, if you store data or resources on a mapped network drive, contact Software support for help configuring your\nsystem to find and use them. For information about mapping network drives on a Windows computer, see the RICOH ProcessDirector\nInformation Center.\nWhen one of the components needs a resource, RICOH ProcessDirector searches for it in these locations, in order:\n1. Inline in the job.\n2. In the paths listed in the AFP resource path property of the job. This property can be set in the workflow or as a default job property on a\nstep template. RICOH ProcessDirector looks at the directories in the order that you list them in the property value.\n3. If the print step requests the resource, in the paths listed in the AFP resource path property of the printer. RICOH ProcessDirector looks at\nthe directories in the order that you list them in the property value.\n4. In the /aiw/aiw1/resources or /usr/lpp/psf/reslib\nTo identify AFP resource directories to RICOH ProcessDirector:\n1. Edit your existing workflows so that RICOH ProcessDirector can find the AFP resources that your jobs require:\n1. Click the Workflow tab.\n2. Click the name of the workflow that you want to edit.\n3. Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. In the workflow editor, click the side panel in the top right corner of the window.\n5. Go to Steps and expand the TRANSFORM group.\n6. Select one of these step templates:\nConvertLineDataJobIntoAFP\nEnableRepositioning\nPrintJobs\nAFP resource path is one of the default job properties on all these steps.\n1. Right-click the step, and select Properties.\n2. Click AFP.\n3. Find the AFP resource path property and type the path to the directory (or directories) where you copied your AFP resources.\nNote:\nChanging this property in one of the steps that specify it changes it in all the steps for this workflow.\n4. Click OK.\n5. Save the workflow.\n6. Repeat this step for all the workflows that process AFP jobs and for any of the supplied workflows that you might copy to create new\nworkflows in the future.\n2. Optional: Set the AFP resource path property on any existing step templates that you might use in the future to create new workflows.\nThe only supplied step templates that have AFP resource path as a default job property are ConvertLineDataJobIntoAFP,\nEnableRepositioning, and PrintJobs. Do these steps on each of those step templates and any copies of them that you have created:\n1. In the workflow editor, click the side panel in the top right corner of the window.\n2. Go to Steps and right-click the step template that you want to edit and select Properties.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Identifying AFP resource directories to RICOH ProcessDirector - Jenski - Test portal- RPD Linux\n3. Click AFP.\n4. Find the AFP resource path property and type the path to the directory (or directories) that you copied your AFP resources into.\n5. Click OK.\n6. Repeat this step for all the step templates that you want to edit.\n3. Optional: Set the AFP resource path property on any printers that you have created.\nIf you set this property on a printer, it is only used when the job is printed, not when it is viewed or converted, and it is only used after\nRICOH ProcessDirector has already searched the resource paths that are set on the workflow.\nIf your AFP resources include special MICR fonts or secure page segments (such as signatures) that are stored separately from other AFP\nresources, you might want to specify those directories only on the AFP resource path property for the printer or printers that might print\njobs that use those resources.\n1. In the left pane, click Devices ⇒ Printers.\n2. Select the printer that you want to edit.\n3. Click Disable.\n4. Select the printer again and click Properties.\n5. Click AFP.\n6. Find the AFP resource path property and type the path to the directory (or directories) that you copied your AFP resources into.\n7. Click OK.\n8. Repeat this step for all the printers that you want to edit.\nOther topics in this section:\nSearch order for AFP resource extensions\nJob properties and AFP form definitions\nColor mapping table source and output files\nParent topic: AFP resources in RICOH ProcessDirector\n2 of 2"}]}