{"doc_name": "aiw00c_Define_PCLOut.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c_Define_PCLOut.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4939, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Defining PCLOut printer devices - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Defining PCLOut printer devices\nDefining PCLOut printer devices\nPCLOut printer devices represent Printer Command Language (PCL) printers. They print jobs that are submitted in AFP format and converted to\nPCL format.\nYou cannot use the RICOH ProcessDirector actions Jump and Continue with jobs that are submitted to PCLOut printers. You can only use the\nStop action on a job that is printing on a PCLOut printer if you request the action while the Print Services Facility (PSF) printer driver is\ntransforming the job to PCL.\nTo define a PCLOut printer device:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Printers.\n3. Click Add ⇒ PCLOut Printer.\n4. On the General tab, fill in values for all the required fields.\n5. On the Scheduling tab, set values for the properties that you want to use to schedule jobs to this printer. If you leave values blank, they\nmatch any value that is set in the corresponding job scheduling properties.\nFor example, set these properties to schedule jobs based on media, output bins, and punching and stapling functions of the printer:\nMedia supported\nIf you choose specific media, only jobs that use that media can be scheduled to this printer. If you choose Ready media objects, only jobs\nthat require the media that is currently loaded in the printer can be scheduled to the printer. If you choose All media, all jobs can be\nscheduled to the printer, regardless of what media is actually loaded.\nOutput bins available\nAny output bin that can be installed on the printer is considered available, although on some printers you cannot install all the output\nbins at the same time.\nPunch capable\nStaple capable\n6. On the SNMP tab, make sure that the Use SNMP and Get tray information from printer properties are set to Yes.\n7. On the remaining tabs, fill in values for any of the optional fields:\n1. The default is that the printer driver reports status information in the language that you selected when you installed the RICOH\nProcessDirector server. To receive messages from this printer in a different language, set the Printer language property appropriately.\n2. If you want the printer to print duplex jobs, set the Duplex property to Yes. PCLOut printers do not honor duplex settings specified in\nthe Duplex job property.\n8. Click OK.\n9. Configure the media settings for the printer.\n1. From the Printers panel, select the new printer.\n2. Click Actions ⇒ Show Trays.\n3. Select each tray individually and click Set tray media. Choose the media loaded in that tray and click OK.\nIf the Media does not exist, you can create it.\n10. Create a print queue with the same name as the PCLOut printer.\nOn a Red Hat-derived operating system:\nNote:\nMake sure you meet these pre-requisites:\nYou have configured CUPS.\nYou have permissions in CUPS to manage printers.\n1. Log in as the root user.\n2. Use a browser and access https://hostname:631/admin/, where hostname is the host name or IP address.\n3. Click Add printer.\n4. Go to Other Network Printers and select LPD/LPR Host or Printer.\n5. In the connection field, type the hostname or IP address of the system where the LPD input device is defined. For example:\nlpd://hostname/queue\nwhere hostname is the host name or IP address and queue is the queue name.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Defining PCLOut printer devices - Jenski - Test portal- RPD Linux\n6. Click Continue.\n7. In the Add Printer dialog, enter the name, description, and location of the printer.\n8. Click Continue to select the printer make and model.\n9. Click Add Printer.\n10. Set the default options in the next dialog and click Set Default Options.\nOn a Linux SLES 12.0 system:\n1. Log in to the operating system as the root user.\n2. Start YaST.\n3. Click Hardware ⇒ Printer. With Printer Configurations highlighted, click Add. Click Connection Wizard, and then select Line Printer\nDaemon (LPD) Protocol.\n4. In the IP Address or Host Name field, type the host name or IP address of the physical printer.\n5. Type PASS in the Queue Name field. Select the printer manufacturer, and click OK.\n6. In the Set Arbitrary Name field, type the name of the PCLOut printer. This name must be unique on this Linux system. Although\nprinter names are case-sensitive, Linux does not allow you to define multiple printer names that are alike except for case. For\nexample, you cannot define one printer device called OfficePrinter and another called officeprinter.\n7. Select a printer driver, then click OK.\nExamples of the Printer command property\nYou can set the Printer command property of a PCLOut printer called officeprinter to either of these commands.\nlpr -P officeprinter\nlprafp -pofficeprinter\nNote:\nPCLOut printers do not support RICOH ProcessDirector symbols such as ${Job.Name} in the PCLOut printer command.\nParent topic: Defining printer objects\n2 of 2"}]}