{"doc_name": "tt_o_runsamplewf.pdf", "doc_path": "data/raw/RPD-en-US/tt_o_runsamplewf.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3324, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Running the Automated Verification sample workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature / Running the Automated Verification sample workflow\nRunning the Automated Verification sample workflow\nThe Automated Verification feature provides a sample workflow that you can examine and run to understand how the feature works. The\nsample includes a barcode format, a barcode reader, a hot folder input device with a pre-submitted PDF file, and a workflow that includes the\nReadBarcodeData step.\nThe sample objects used in this workflow are:\nBarcode reader: SampleReader\nBarcode format: SampleFormat\nHot folder input device: VerificationFolder\nSample print job: Verify.pdf\nWorkflow: VerifySample\nYou can review the properties for each object before you start the procedure to see how they interact.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Printers portlet, right-click the Sample printer and select Enable.\n3. In the Input Devices portlet, right-click the VerificationFolder hot folder input device and select Enable and Connect.\nThe first time you try this procedure RICOH ProcessDirector immediately submits the Verify.pdf job to the VerifySample workflow. The\njob stops when it enters the Reading Barcodes state. Because there is no camera or barcode reader connected to the system, no barcodes\nare read.\nMake sure that the job is in the Reading Barcodes state before moving to the next step.\n4. In the Jobs table, right-click the job and select Complete barcode step. You can see that the results report zero barcodes read. Click OK.\n5. When the job enters the Waiting to reconcile state, right-click the job and select Reconcile.\n6. In the Documents table, review the Action column for each document. The Action column shows Reprint for all the documents and\nAttention for the Status 1 property because no barcodes were read. To change the action for a document, select the document:\nTo print the document again, click Reprint.\nTo mark the document OK without printing it again, click Mark OK.\nTo mark the document pulled from the job without printing it again, click Pull.\nYou see the action that you requested in the Requested action column, and the counts in the Current column of the summary table\nchange.\n7. When you finish, click OK.\n8. If you chose to reprint some documents, select a printer, review your selections, and then click Yes.\nRICOH ProcessDirector creates a child job that contains the documents to be reprinted. The job number of the child job is the original job\nnumber with a numeric suffix (for example, 10000001.1).\nThe child job starts processing from the first step in the VerifySample workflow. Because the child job has already been processed into\ndocuments, it follows the PDF Reprints path through the workflow and returns to the ReadBarcodeData step.\nAfter the child job is created, the original job moves to the next step in the workflow.\n9. If all the documents in the child job have a status of OK or Pulled, the child job moves to the next step in the workflow.\nIf you want to run the example again, you must copy the sample file to the hot folder again. The sample file, Verify.pdf, is in\naiw/aiw1/testfiles directory.\nParent topic: Setting up the Automated Verification feature\n1 of 1"}]}