{"doc_name": "aiw00c20f.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c20f.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2237, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Configuring for the RICOH Transform features - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up datastream transforms / Configuring for the RICOH Transform features\nConfiguring for the RICOH Transform features\nIf you have installed one or more of the RICOH Transform features, you can configure RICOH ProcessDirector to use these features.\nThe AFP Support feature must be installed before you can perform this procedure.\nNote:\nThis procedure is for use with the RICOH Transform features, such as RICOH PostScript/PDF to AFP, RICOH SAP to AFP, RICOH PCL to AFP,\nand RICOH AFP to PDF, not the Advanced Transform feature.\nYou can install the RICOH Transform features on the primary computer or on another computer. The Secondary Server feature is not required if\nyou install the RICOH Transform featurese on a computer other than the primary computer.\nAfter you have identified the Transform Features to RICOH ProcessDirector, you can define an input device that receives jobs to be transformed\nand a workflow that sends jobs to be converted.\nTo configure for the RICOH Transform features:\n1. Log in to the InfoPrint Manager Transform Feature user interface.\n2. Record the IP address or host name and port number of the transform server you want RICOH ProcessDirector to use.\nThe Transform Features can be configured to run on multiple servers. Only the primary transform server is added to RICOH ProcessDirector.\n3. Log in to RICOH ProcessDirector.\n4. Click the Administration tab.\n5. In the left pane, click Settings ⇒ System.\n6. Make sure that the Transform server IP address or host name property is the IP address or host name of the computer where the transform\nfeature is installed.\nIf the with the transform feature has two network cards, it has two IP addresses, but RICOH ProcessDirector uses only one. Make sure that\nthe property is set to the correct IP address.\n7. Make sure that the Transform server port number property matches the port number that is configured for the computer where the\ntransform feature is installed.\n8. Click SAVE.\n9. Edit the TransformJobIntoAFP or TransformJobIntoPDF step template to set job property defaults.\nParent topic: Setting up datastream transforms\n1 of 1"}]}