{"doc_name": "doc_c_SetUpManualReconciliation.pdf", "doc_path": "data/raw/RPD-en-US/doc_c_SetUpManualReconciliation.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 8231, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Setting up to reconcile jobs manually - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to reconcile jobs manually\nSetting up to reconcile jobs manually\nYou can reconcile the documents in a job manually, accounting for all documents that processed successfully and reprinting all damaged\ndocuments. You also can account for all documents that are pulled from the job.\nNote:\nThe Automated Verification and Inserter features support equipment that can scan barcodes to track documents through mechanical\nsteps, such as insertion or sealing. Those features support both automatic and manual reconciliation. If you have Automated Verification,\nfollow the instructions in the help system for setting up to verify documents in jobs automatically. If you have Inserter, follow the\ninstructions in the help system for configuring the system to use inserters.\nTo find the documents that you want to reconcile, you can use any of these three methods:\nYou can enter the values of one or more document properties that identify each document in a job. The document properties can be supplied\nby RICOH ProcessDirector (for example, Document number, Original sequence, or Insert sequence) or defined as custom document properties\n(for example, Customer account number).\nThe document properties that you use must be database properties, not limited properties.\nYou can enter a range of values for the Insert sequence document property.\nYou can scan a barcode on a document with a hand-held scanner attached to your computer. To use this method, you must define a barcode\nformat that includes the document property that identifies each document in a job.\nBefore you can use the values of document properties or barcodes to reconcile documents, you must set up to use documents in jobs. For more\ninformation, see the help system.\nTo set up to reconcile jobs manually:\n1. Optional: If you want to use barcodes to reconcile documents, create a barcode format.\nThe barcode format identifies the values of job and document properties in the barcode. For more information, see the related task for\ncreating barcode formats.\n2. Click the Workflow tab.\n3. Click the name of the workflow you want to modify.\nIf you modify the sample EnhancePDFDocuments workflow, the workflow at the end of this procedure shows the results.\n4. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n5. Add a step based on the CreateReprints step template after the Reconcile step. For the Reprint workflow property:\nSelect Not set if you want the child job created for reprints to start over in the same workflow.\nSelect the name of a different workflow if you want the child job created for reprints to move to the first step in that workflow.\n6. To make sure that the original job stays in the system until all the reprint jobs have completed, add a step based on the WaitForRelatedJobs\nstep template. Place the step before the RetainCompletedJobs step.\nThe retention period does not start for any of the jobs until all documents from the original job have been accounted for in the\nreconciliation process.\n7. If the workflow does not have a step based on the WriteDocumentsToDatabase step template:\nIn a workflow that processes PDF files, add that step after the IdentifyPDFDocuments step and before the BuildPDFFromDocuments step.\nIn a workflow that processes AFP files, add that step after the IdentifyDocuments step and before the BuildAFPFromDocuments step.\n8. Add a step based on the SetPropertiesForReconcile step template after the WriteDocumentsToDatabase step and after any step that\nchanges the position of the documents in the job. Add the step before the BuildPDFFromDocuments or BuildAFPFromDocuments step.\nThe SetPropertiesForReconcile step sets the Insert sequence property for each document in a job. After the value is set, the operator can\nuse it on the Reconcile Job dialog to find documents to reconcile when the job reaches the Reconcile step.\nFor example, the operator can select By range on the Reconcile Job dialog and specify a range of Insert sequence values. The operator also\ncan select By properties and specify an Insert sequence value.\n9. Optional: Add a step based on the SetDocPropsFromConditions step template before the WriteDocumentsToDatabase and Reconcile steps.\nSet the Property conditions file property to the directory path and name of a comma-separated values (CSV) file that you create with a text\neditor. For example, set the value of the property to /aiw/aiw1/testfiles/ReconcileProperties.csv on Linux or to\nC:\\aiw\\aiw1\\testfiles\\ReconcileProperties.csv on Windows.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Setting up to reconcile jobs manually - Jenski - Test portal- RPD Linux\nBy default, the Action value for every document in a job is Not set. The operator must assign each document a Requested action value (\nOK, Reprint, or Pull) to complete the manual reconciliation process. For a job with thousands of documents, the operator must set the\nRequested action for each document that printed successfully to OK. The fastest way for an operator to reconcile the job is to set the\nRequested action for all documents to OK. The operator then resets the Requested action for specific documents to Reprint or Pull. To save\nthe operator the time required to set the Requested action for all documents to OK manually, you can use a SetDocPropsFromConditions\nstep to set the Action value to OK automatically. Then the operator can immediately set the Requested action for specific documents to\nReprint or Pull.\nThis example shows the contents of a property conditions file that sets the value of the Action property for all the documents in the job to\nOK:\nDoc.OriginalSequence,Doc.Insert.Disposition>=1,OK\n10. Optional: If you want to send the child jobs for reprints to a print-only workflow, specify that workflow as the Reprint workflow on the\nCreateReprints step.\nIf you want to process the child jobs for reprints in this workflow, add a branch:\n1. Start the new branch with a step based on the BuildPDFFromDocuments or BuildAFPFromDocuments step template.\n2. Add a connector from the SetDocPropsFromTextFile step to the new BuildPDFFromDocuments or BuildAFPFromDocuments step.\n3. Define this rule on the connector:\nRule name: Reprint\nOrder of execution: 1\nApply any or all of the following conditions: AND\nCondition 1: Document count >0\nCondition 2: Created Document Count <1\nSummary: Job.Doc.DocumentCount > ‘0’ AND Job.Doc.CreatedDocumentCount < ‘1’\n4. Add a step based on the SetDocPropsFromConditions step template after the BuildPDFFromDocuments or BuildAFPFromDocuments\nstep.\n5. Add a step based on the UpdateDocumentsInDatabase step template after the SetDocPropsFromConditions step.\n6. Add a step based on the SetPropertiesForReconcile step template after the UpdateDocumentsInDatabase step.\n7. Connect the SetPropertiesForReconcile step to the step after the BuildPDFFromDocuments or BuildAFPFromDocuments step in the\noriginal branch.\nFor example, connect the SetPropertiesForReconcile step to the CountPages step.\n11. Save the workflow and enable it.\n12. Test the workflow.\nWhen a job enters the workflow, the job is processed normally until it reaches the Reconcile step, where it goes into the Waiting to reconcile\nstate. The operator then right-clicks the job in the jobs table and selects Reconcile. The Action value of all the documents in the job is not set\nunless a SetDocPropsFromConditions step sets the Action to another value, such as OK.\nThe operator finds all the documents to be reprinted and sets their Requested action value to Reprint. When all the documents have a Requested\naction value, the operator clicks OK.\nThe job moves to the CreateReprints step. That step creates a child job containing all the documents to be reprinted and sends the job to the\nworkflow specified for reprinting.\nThe illustrations below show the sample workflow as a series of phases.\nParent topic: Configuring\n2 of 2"}]}