{"doc_name": "aiw_o_xml_JobsWith.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_xml_JobsWith.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1930, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Jobs with XML files - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Jobs with XML files\nJobs with XML files\nRICOH ProcessDirector can process jobs submitted as XML files. You can submit XML files to a hot folder input device or place an XML file at a\nlocation from which the RICOH ProcessDirector server retrieves it.\nIf you place an XML file at a location from which it is retrieved, RICOH ProcessDirector processes the file as jobs move through the workflow. You\nsubmit another type of file to the hot folder to initiate the process. For example, you can submit a print file or a trigger file, such as a file with job\noverrides or with no content.\nNote: The Web Services Enablement feature lets you use SOAP or REST web service protocols to receive XML data from and exchange it\nwith other applications.\nTwo step templates manipulate XML:\nA step based on the CreateJobsFromXML step template creates jobs from elements in an XML file that match an XPath expression.\nA step based on the ApplyXSLTransform step template transforms XML into a file that specifies the values of RICOH ProcessDirector job or\ndocument properties. The step also transforms XML into another XML format.\nIf an element in the XML files specifies a URL to download a file, you can use the ApplyXSLTransform step to assign the URL to the value of a job\nproperty. Then you can use a step based on the DownloadFile step template to download the file.\nThis usage scenario shows how to process orders in an XML file by setting RICOH ProcessDirector job properties.\nIn this section:\nUsage scenario for processing orders in an XML file\nIn this scenario, a printing company wants to process orders in XML files received from web-to-print sellers. Each XML file contains multiple\norders, and each order can include both print and promotional items, such as coffee mugs and baseball caps.\nParent topic: Product overview\n1 of 1"}]}