{"doc_name": "aiw_c_configforpdpr.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_configforpdpr.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2777, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Configuring to use the pdpr command - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Configuring to use the pdpr command\nConfiguring to use the pdpr command\nIf you are migrating from InfoPrint Manager to RICOH ProcessDirector and you use the pdpr command to submit jobs, you can configure RICOH\nProcessDirector to continue receiving jobs from the same pdpr command.\nThe pdpr command in RICOH ProcessDirector is a script that is packaged in a self-extracting Perl script. The script must be installed on all client\ncomputers that submit jobs with pdpr. Before you configure the primary server, follow the instructions to install the script on your client\ncomputers and configure them correctly, including making updates to the pdpr.cfg file.\nThe pdpr script in RICOH ProcessDirector creates an lprafp command to submit jobs, adding flags to send supported job property values to the\nprimary server. As a result, the configuration on the primary server is similar to the configuration steps for configuring to use the LPD protocol.\nTo configure to use the pdpr command:\n1. If any LPD daemons or processes that do not belong to RICOH ProcessDirector (for example, the Common UNIX Printing System [CUPS] LPD\ndaemon) are running on the primary computer (or on a secondary computer that is the parent server of LPD input devices), stop them:\nOn SUSE Linux, start YaST, then click System ⇒ Network Services to find the LPD services.\nOn Red Hat or a Red Hat-derived operating system, access Terminal and use this command: systemctl list-units --type\nservice --all.\nTo stop an LPD service, use this command: systemctl stop <LPD_service>.\nImportant:\nDo not uninstall CUPS.\n2. Open RICOH ProcessDirector.\n3. Click the Administration tab.\n4. In the left pane, click Settings ⇒ System.\n5. Make sure that all the computers that you installed the pdpr script on are listed in the Hosts allowed to submit LPD jobs property.\n6. Create LPD input devices to receive jobs from the pdpr script. Make sure the name of the input devices match the names that you used in\nthe rules you created in the pdpr.cfg file.\nWhen you submit a job using pdpr, the pdpr options are converted to options on the lprafp command. The LPD input device uses the file\nlisted in the Child workflow parsing rules property to map options on the lprafp command to RICOH ProcessDirector properties.\nThe default value for the Child workflow parsing rules property is the path to the sample receive_lpd_jobtype.cfg or\nreceive_lpd_pdf_jobtype.cfg file. This file contains mappings for most of the lprafp command options that RICOH ProcessDirector\nsupports. You can update or copy the file to add more mappings if needed.\nParent topic: Preparing for job submission\n1 of 1"}]}