{"doc_name": "pdfw_i_c_create_jt_splitdocprop.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_i_c_create_jt_splitdocprop.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2066, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Workflow to split PDF jobs by document property - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Configuring the PDF Document Support feature / Workflow to split PDF jobs by document property\nWorkflow to split PDF jobs by document property\nInstead of splitting a PDF job into several jobs using job size as the criterion, you might want to use the value of a document property, such as\ncountry or sales region. In this scenario, you use a step based on the GroupDocuments step template instead of on the SplitDocuments step\ntemplate. Each group of documents becomes a separate child job.\nYou can use a step based on the GroupDocuments step template to gather all the documents of one group into a single child job. You can use\nup to six grouping criteria to create child jobs. Each child job contains only the members of a group, such as all statements for each of five cities\nin each of 10 countries. For the parent workflow, you can copy the SortSplitPDF workflow that is installed by PDF Document Support. Remember\nto delete any steps you are not using, for example the SplitDocuments step. For the child workflow, make a copy of the AssemblePDF workflow.\nThis table summarizes the recommended workflow configuration using a step based on the CreateJobsFromDocuments step template.\nNote:\nIf you have customized phase names in your system, the phase names in the table might not match the names in your system.\nSplitting PDF jobs by document property using CreateJobsFromDocuments\nParent/child Phase Step\nParent Receive SetJobPropsFromTextFile\nIn the Input data stream field, select PDF.\nPrepare CountPages\nIdentifyPDFDocuments\nAssemble GroupDocuments\nCreateJobsFromDocuments\nComplete WaitForRelatedJobs\nRetainCompletedJobs\nRemoveJobs\nChild Receive SetJobPropsFromTextFile\nDetectInputDataStream\nAssemble BuildPDFFromDocuments\nPrint CountPages\nCreatePageRanges\nPrintJobs\nComplete WaitForRelatedJobs\nRetainCompletedJobs\nRemoveJobs\nParent topic: Configuring the PDF Document Support feature\n1 of 1"}]}