{"doc_name": "aiw00o14.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o14.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5980, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Properties - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Properties\nProperties\nRICOH ProcessDirector uses properties to define the characteristics of all its objects, such as input devices, workflows, and jobs. It stores the\nproperties and their corresponding values in database tables.\nThe RICOH ProcessDirector user interface provides a complete description for each property. The description supplies information about the valid\nvalues and meaning of each property.\nThe properties are:\nSystem properties\nSystem properties define certain high-level characteristics of the RICOH ProcessDirector system and the RICOH ProcessDirector objects. For\nexample, system properties control how often users must change their passwords.\nAdministrators typically set any system properties that the installation requires when they initially configure the system. Administrators can\nalso access system properties through the Administration page of the RICOH ProcessDirector user interface, so they can later set or change a\nsystem property.\nApplication/secondary server properties\nApplication/secondary server properties define certain characteristics of application and secondary servers.\nAdministrators typically set server properties when they create a server. For example, they can determine how many steps a server is capable\nof running at the same time. Administrators can also access server properties through the Administration page of the RICOH ProcessDirector\nuser interface, so they can later set or change a server property.\nInput file properties\nInput file properties define certain characteristics of the files that RICOH ProcessDirector receives through its input devices.\nRICOH ProcessDirector supplies the values for input file properties and can display them in a table. Users can review the property values, but\ncannot edit them. For example, a user can verify that the correct workflow was applied to a specific input file. RICOH ProcessDirector uses\nan input device property to record the time when it received an input file. Operators might find this useful if they need to verify that a\ncertain file arrived at a specified time, such as for an audit.\nInput device properties\nInput device properties define the characteristics of input devices.\nAdministrators typically set input device properties when they create an input device. For example, they can use an input device property to\ncontrol the maximum number of communication errors that can occur before RICOH ProcessDirector shuts down the input device. They can\nalso assign a workflow to an input device so that the device applies a specific set of steps and job property values to all the input files that it\nreceives.\nStep template properties\nRICOH ProcessDirector provides step templates that administrators use to create the individual steps within the workflows for the RICOH\nProcessDirector system.\nStep template properties define the characteristics of a step, such as what default values to set for the job properties.\nStep properties\nStep properties define the characteristics of the processing steps within the phases. Administrators typically set the step properties when\nthey initially configure the workflow. Steps reside within workflows.\nJob properties\nJob properties define the characteristics of jobs, which RICOH ProcessDirector input devices create from the input files that they receive.\nJob properties are the largest group of properties in RICOH ProcessDirector. They control all aspects of job processing. For example, you can\nuse job properties to:\nSpecify the media required for the job.\nSpecify whether header or trailer pages are printed with the job.\nRetain the job for a set period of time after all job processing completes.\nJob properties are set through a variety of methods. The most common method is to create a workflow to set the job properties when the\njob enters the RICOH ProcessDirector system. Administrators can assign the workflow to an input device, and the input device can then\napply the values for job properties to every job that it receives. RICOH ProcessDirector also lets users change or override values for job\nproperties on a job-by-job basis.\nIf you install document processing features, you use document properties to define characteristics of documents inside each job. Document\nproperties are particularly useful for variable data jobs, You can use document properties to track data that changes from document to\ndocument, such as:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:20 PM Properties - Jenski - Test portal- RPD Linux\nAccount numbers\nCustomer names and addresses\nDelivery preferences\nDocument properties\nRICOH ProcessDirector provides a general set of document properties that you can use, or you can define your own. Document property\nvalues are usually extracted from jobs based on specifications you provide using RICOH ProcessDirector for Adobe Acrobat or RICOH Visual\nWorkbench.\nWorkflow properties\nWorkflow properties include steps and the job properties that the steps set.\nPrinter properties\nPrinter properties define the network location and scheduling characteristics of the printer devices.\nUser properties\nUser properties define the characteristics of users who have been authorized to use the system.\nRICOH ProcessDirector provides a predefined set of groups. You can also define your own groups. Administrators assign groups to users\nduring initial configuration. Groups control the functions and areas of the RICOH ProcessDirector interface that users can access.\nCustom properties\nCustom properties are job, document, and order properties that are unique to your installation. If none of the provided properties meet your\nrequirements, you can define your own. You can configure the characteristics of a custom property from a database name to levels of access\nfor different user groups. Once activated, custom properties can be used as any other job, document, or order property.\nParent topic: Product overview\n2 of 2"}]}