{"doc_name": "avanti_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/avanti_o_featov.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5681, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Avanti Slingshot Connect - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Integration features / Avanti Slingshot Connect\nAvanti Slingshot Connect\nThe Avanti Slingshot Connect feature lets you exchange information with the Avanti Slingshot Management Information System (MIS) software.\nAfter creating orders, Avanti Slingshot can send PDF print jobs with JDF job tickets to RICOH ProcessDirector. Alternatively, RICOH ProcessDirector\ncan send Avanti Slingshot the information required to create orders for jobs in RICOH ProcessDirector workflows.\nAfter RICOH ProcessDirector receives jobs from Avanti Slingshot or sends order information to Avanti Slingshot, the feature automates the\nreporting of job processing time to Avanti Slingshot cost centers. When a job finishes printing, the feature reports this information:\nThe amount of time the job spent on the printer.\nThe total pages or sheets printed on specific media by name and by product ID when that property is defined.\nWhether the job was printed with CMYK ink or toner or only with black ink or toner.\nRICOH ProcessDirector and Avanti Slingshot exchange information over an HTTP connection.\nTo configure your Avanti Slingshot system so that it sends jobs to RICOH ProcessDirector or receives order information from RICOH\nProcessDirector, contact your Avanti support representative.\nIf Avanti Slingshot sends PDF files with JDF job tickets, RICOH ProcessDirector receives them in a hot folder input device that uses the JDF\nBatching method. The hot folder has the same name as the line item on the sales order. RICOH ProcessDirector acknowledges receipt of each job\nand reports status to Avanti Slingshot as the jobs move through the workflow.\nIf Avanti Slingshot receives order information from RICOH ProcessDirector, Avanti Slingshot acknowledges receipt of the information for each job.\nRICOH ProcessDirector reports status to Avanti Slingshot as the jobs move through the workflow.\nAvanti Slingshot Connect does not provide the Avanti Slingshot software. You must purchase and install Avanti Slingshot with the JDF Integration\nadd-on.\nCollecting ink usage data\nWhen you define a Ricoh continuous forms printer as a Ricoh TotalFlow Printer, you can specify the ink and protector coat that is loaded using\nthe ink names set in Avanti Slingshot.\nEvery time RICOH ProcessDirector sends a job to the defined Ricoh TotalFlow printer, the printer tracks the amount of each type of ink or\nprotector coat that is used. The collected ink amount is sent back to RICOH ProcessDirector when the job finishes printing or is canceled.\nIf any part of the job is reprinted, the ink used for the reprints is reported to RICOH ProcessDirector as well. RICOH ProcessDirector stores the\ntotal volume of ink used for each job in the cumulative ink usage properties.\nThe job information sent to Avanti Slingshot from RICOH ProcessDirector includes the values of the cumulative ink properties and the ink names.\nThus, you can determine the amount of a certain ink the job used.\nStep template\nAvanti Slingshot Connect provides the CreateOrderInSlingshot step template. A step based on this step template lets you call an Avanti Slingshot\nweb service that creates an order for a job received from RICOH ProcessDirector.\nNote: The feature also includes these templates: CallRESTService and CallSOAPService. They are not required to communicate with Avanti\nSlingshot.\nProperties and reporting\nAvanti Slingshot Connect adds two properties to all steps in a workflow: Slingshot cost center and Slingshot milestone status. You can associate\none or more steps with a single cost center to identify all the time spent on processing by the cost center.\nYou define the Avanti Slingshot cost centers used by RICOH ProcessDirector in an avanti.cfg control file.\nRICOH ProcessDirector reports the time when a job enters the first step associated with an Avanti Slingshot cost center. RICOH ProcessDirector\nalso reports the time when a job completes the last step associated with the cost center.\nAvanti Slingshot Connect adds these properties to the property notebook for each RICOH ProcessDirector printer:\nSlingshot cost center\nRICOH ProcessDirector reports the time spent printing the job to this Avanti Slingshot cost center.\nJob color to report\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:21 PM Avanti Slingshot Connect - Jenski - Test portal- RPD Linux\nRICOH ProcessDirector uses this property when it reports the total pages printed in a job. The property specifies whether all the pages in the job\nwere printed with CMYK ink or toner or only with black ink or toner.\nPrint unit to report\nRICOH ProcessDirector reports the print volume to Avanti Slingshot in pages or sheets.\nCyan ink\nSpecifies the cyan ink name defined in Avanti Slingshot.\nMagenta ink\nSpecifies the magenta ink name defined in Avanti Slingshot.\nYellow ink\nSpecifies the yellow ink name defined in Avanti Slingshot.\nBlack ink\nSpecifies the black ink name defined in Avanti Slingshot.\nProtector coat\nSpecifies the protector coat ink name defined in Avanti Slingshot.\nMICR ink\nSpecifies the MICR ink name defined in Avanti Slingshot.\nHighlight ink\nSpecifies the highlight ink name defined in Avanti Slingshot.\nRICOH ProcessDirector automatically reports the total pages printed on specific media.\nIn this section:\nUsage scenario for receiving jobs from Avanti Slingshot\nIn this scenario, a print shop creates a sales order with two jobs in Avanti Slingshot and sends the jobs to RICOH ProcessDirector for processing.\nRICOH ProcessDirector sends Avanti Slingshot the time required for preflight operations and printing.\nParent topic: Integration features\n2 of 2"}]}