{"doc_name": "SettingUpInserters.pdf", "doc_path": "data/raw/RPD-en-US/SettingUpInserters.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5000, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Configuring the system to use inserters - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters\nConfiguring the system to use inserters\nInserters are devices that insert printed documents and additional inserts (such as marketing materials) into envelopes. You can create workflows\nthat can help you automate the insertion of documents. The system can write and send an inserter control file for each job to the inserter\ncontroller, read the inserter results file for each job, and automatically (or with operator control) reprint any documents that were damaged\nduring insertion.\nConfiguration tasks for inserters include:\nConfiguring inserter controllers\nCreating rules that describe the inserter control files and inserter results files\nUsing scripts to transfer inserter control files and results files\nDefining inserter controller objects\nCreating barcode format objects\nConfiguring workflows\nCustomizing inserter document properties\nEnhancing your print files\nIn this section:\nConfiguring access to files on the computer that runs the inserter controller\nTo access the file system of an inserter controller, which resides on a computer other than the one where RICOH ProcessDirector is installed, you\ngive RICOH ProcessDirector access to a directory on that computer by mapping the directory as a network drive. Every time RICOH\nProcessDirector starts, it needs to connect to the mapped drive.\nConfiguring inserter controllers\nYou must configure the inserter controllers in your installation to communicate with RICOH ProcessDirector.\nUsing inserter document properties in workflows\nThe inserter features provide several document properties that you can use.\nEnhancing files for insertion\nMost files that contain documents need to be enhanced before they can be processed for insertion. The files must contain page groups that\nidentify the documents (mailpieces). In addition, the barcodes that control insertion must contain specific information that identifies the\ndocuments, such as the document number or the insert sequence number of the document.\nCreating rules for inserter control files\nRICOH ProcessDirector can create an inserter control file for each job and send it to the inserter controller before the job is inserted. Because the\nformat and content of inserter control files vary for each inserter manufacturer, you create rules files that tell RICOH ProcessDirector how to\ncreate the inserter control file.\nCreating rules for inserter results files\nInserter results files contain the results of insertion. You configure RICOH ProcessDirector to read the inserter results file for each job and use the\ninformation in it to determine the status of documents after insertion and which documents need to be reprinted. Because the format and\ncontent of inserter results files can vary, you create rules files that tell RICOH ProcessDirector how to parse (analyze) the fields in each record and\nhow to map the information in the fields to RICOH ProcessDirector job and document property values.\nUsing scripts to send inserter control files and receive results files\nRICOH ProcessDirector provides scripts that you can use to send inserter control files to the inserter controller, and to receive inserter results files\nfrom the inserter controller.\nDefining inserter controller objects\nInserter controller objects are the RICOH ProcessDirector objects that represent the inserter controllers in your installation. The inserter controller\nruns on another computer (for example, a Windows computer) and can manage one or more inserter devices.\nRunning the QuadientInserterSample workflow\nThe Quadient Inserter feature provides a sample workflow that you can examine and run to understand how the feature works. The sample\nincludes two input devices, QuadientInserterSimulator and QuadientInserterFolder, an inserter controller sample, and two workflows,\nQuadientInserterSample and QuadientInserterSimulator.\nPDF workflows for the Inserter feature\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Configuring the system to use inserters - Jenski - Test portal- RPD Linux\nThe full Inserter feature provides sample workflows that contain the steps required to receive and prepare jobs for insertion, print them, send\ninserter control files to the inserter controller, read inserter results files, and reconcile jobs after they have completed insertion. You copy and edit\nthese workflows for your environment, or you add the steps in the sample workflows to your existing workflows.\nAFP workflows for the Inserter feature\nThe full Inserter feature provides sample workflows that contain the steps required to receive and prepare jobs for insertion, print them, send\ninserter control files to the inserter controller, read inserter results files, and reconcile jobs after they have completed insertion. You copy and edit\nthese workflows for your environment. Or, you add the steps in the workflows to your existing workflows.\nParent topic: Configuring\n2 of 2"}]}