{"doc_name": "doc_i_c_config_docproc.pdf", "doc_path": "data/raw/RPD-en-US/doc_i_c_config_docproc.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4366, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Configuring document processing features - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features\nConfiguring document processing features\nTo configure document processing features, you define the custom document properties you need and then update them to make them\navailable to the system. Using RICOH ProcessDirector Plug-in for Adobe Acrobat for PDF files or RICOH Visual Workbench for AFP files, you set up\nto use documents in your PDF or AFP jobs. You configure your PDF or AFP workflows to process documents. Finally, you make adjustments to\nmaximize document processing performance on your system.\nThe workflow configuration topics in this section apply to the PDF Document Support and AFP Support features, which add basic document\nprocessing functions. To configure workflows for specialized needs, such as archiving document information in a repository, see the\nconfiguration information for the feature that adds the specialized functions and objects. Examples of these document processing features are:\nArchive\nAutomated Verification\nInserter\nPostal Enablement\nPreference Management\nIf you get unexpected results when you process a PDF 2.0 file with a step based on the IdentifyPDFDocuments step, do one of these:\nUse the version of the RICOH ProcessDirector Plug-in for Adobe Acrobat supplied with RICOH ProcessDirector version 3.6 and above to update\nthe control file. Remember to copy the control file to the correct location for RICOH ProcessDirector to use it.\nPlace a step based on the OptimizePDF step template in the workflow before the IdentifyPDFDocuments step.\nIn this section:\nDefining custom document properties\nYou use custom document properties to extract data from each document in a job. First you define the custom document properties in RICOH\nProcessDirector, and then you map data in the documents to the document properties. As a job goes through the workflow, the\nIdentifyPDFDocuments step (PDF files) or IdentifyDocuments step (AFP files) extracts the data.\nNaming custom document properties in more than one language\nTo define user interface names and descriptive information for your custom document properties in more than one language, you edit a\nlanguage-specific version of the docCustomDefinitions.properties file for each language. After you update your custom document\nproperties, RICOH ProcessDirector displays the user interface names and descriptive information for the custom document properties in each\nlanguage.\nUpdating custom document properties\nWhenever you define new custom document properties or name custom document properties in more than one language, you update custom\ndocument properties to make your changes available to RICOH ProcessDirector.\nMaximizing the performance of document properties files\nTo maximize the performance of document properties files, you edit the document properties template file. The template file determines which\nproperties go into the document properties file for a job. The template file lets you control the number of document properties to be used, as\nwell as the order of the columns in the document properties file. If you need to maximize performance on your system by assigning only a subset\nof document properties, make sure that any properties needed by your workflow steps are listed in the document properties template file.\nConfiguring AFP Support for documents\nTo configure the AFP Support feature for documents, you set up to use documents in AFP jobs, and you configure your AFP workflows to process\ndocuments.\nWorking with sample AFP files\nYou can use RICOH Visual Workbench to enhance a sample AFP file.\nUsing RICOH ProcessDirector Plug-in for Adobe Acrobat\nYou use this software to enhance a PDF file by adding markup, such as barcodes, and by defining document properties using data in the PDF file.\nConfiguring the PDF Document Support feature\nTo configure the PDF Document Support feature, you set up to use documents in PDF jobs, and you configure your PDF workflows to process\ndocuments.\nSetting a maximum for document search results\nYou can set a limit on how many documents are returned when searching in the Documents portlet. The limit applies to all users.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Configuring document processing features - Jenski - Test portal- RPD Linux\nParent topic: Configuring\n2 of 2"}]}