{"doc_name": "insertingtext.pdf", "doc_path": "data/raw/RPD-en-US/insertingtext.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3975, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Inserting content text - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Adding content to white space in AFP files\n/ Assigning content to white space / Inserting content text\nInserting content text\nYou can define the text you want inserted as white space content.\nNote:\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo define the text you want inserted as content:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the white space definitions.\n2. Click Mode ⇒ Whitespace Manager.\n3. Click Tools ⇒ Manage Campaigns.\nYou see the Manage Campaigns window.\n4. Do one of these:\nSelect an existing rule from the list in the top pane of the window.\nSelect a white space definition from the list in the top pane of the window and then click Create rules/content to create a new rule.\n5. Click Insert text in the Content section.\nYou see the Insert Text window.\n6. On the Text tab, create a text string.\nRemember to add blank characters between words if you need to. For example, to add the page number, such as \"Page 1 of 10\", to the\nfirst page of each page group:\n1. Type Page and a space in the Text field and click Add.\n2. Select Page in Page Group from the Property drop-down list and click Add. Page in Page Group is the number of the page in the\npage group.\n3. Type a space, of, and another space in the Text field and click Add.\n4. Select Page Group Page Count from the Property drop-down list and click Add. Page Group Page Count is the total number of pages\nin the page group.\nYou see the text string value in the field below the data fields.\n7. Optional: To edit the text string, select a line of data and use Up or Down to change the order of the line or Remove to delete the line.\nRemember to add blank characters between words if you need to.\n8. Optional: Select a color for the text from the Color drop-down list.\n9. Optional: On the Font tab, select one of these:\nCore Fonts\nFrom the drop-down lists, select the character set and code page, and, if the font is an outline font, the point size in the Font\nInformation section.\nExternal Fonts\nType a character set and code page pair, a coded font name, or all three. For double-byte character set (DBCS) fonts, use the coded\nfont name only.\nNote:\nIf you enter a code page that is part of a DBCS-coded font, you see an error message that suggests you use the coded font\nname instead.\nYou see the Character Set Description and Font Resource fields change for the font you selected. Font Resource is \"Outline\" for core fonts\nand \"Raster\" for external fonts.\nNote:\nOn your workstation, if the font size does not exist for the color you selected, your display defaults to 12 black, even though the\nfinal AFP file will have the correct font and color.\nIf the character names do not match between a character set and code page, the job goes into an error state in RICOH\nProcessDirector and the printer issues an error. To correct the error, change the character set and code page to a valid pair and\nprocess the job again.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Inserting content text - Jenski - Test portal- RPD Linux\n10. Optional: On the Position tab, change the origin (top-left corner) of the text area. Specify the origin in inches or millimeters. Decimal values\n(such as 2.5) are allowed. The fields are:\nX position\nThe horizontal distance of the left side of the area measured from the left side of the text area.\nY position\nThe vertical distance of the top of the area measured from the top of the text area.\n11. Click OK.\nThe text is added to the rule and the list in the drop-down box.\n12. Optional: Click Preview to view how the text you specified is displayed in the defined white space.\nTo close the window, click the X in the upper right corner.\nParent topic: Assigning content to white space\n2 of 2"}]}