{"doc_name": "slasettinguppolicies.pdf", "doc_path": "data/raw/RPD-en-US/slasettinguppolicies.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2243, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Setting up service policies - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up Deadline Tracker / Setting up service policies\nSetting up service policies\nService policies define checkpoints and a deadline for jobs. Checkpoints help you see if jobs are on schedule to meet the performance\ncommitments in a service level agreement (SLA); the SLA deadline represents the ultimate goal of the SLA.\nRICOH ProcessDirector provides sample service policies that you can use. You can also create your own service policies.\nTo set up service policies:\n1. Create one or more service policies.\n2. If a service policy specifies that RICOH ProcessDirector is to adjust job checkpoints for no-service periods, create one or more no-service\nperiods.\n3. Associate each service policy with one or more workflows.\nIn this section:\nUsing supplied service policies\nRICOH ProcessDirector provides these predefined service policies: 3-day cutoff and 24 hour. You can change the properties of the supplied\nservice policies and use them in your installation. Or, you can delete them if they are not useful.\nCreating service policies\nYou can create service policies to define job checkpoints. Job checkpoints let you track the progress of jobs as they flow through the system to\nsee if the jobs are on schedule to meet the performance commitments in a service level agreement (SLA). Service policies are not used when\ntracking to a schedule based on estimated durations or to a deadline set by a SetDeadline step or the Change Deadline action.\nCopying service policies\nYou can copy a service policy so you can use it as a template for creating another service policy. Copying service policies can save you time,\nespecially if you need to create several service policies with similar properties.\nAssociating service policies with workflows\nYou can associate a service policy with one or more workflows. The service policy calculates the planned checkpoints and the SLA deadline for all\njobs that use the workflow. Each workflow can have one associated service policy. To measure the performance of jobs using an SLA deadline,\nyou must also identify an SLA target step for the workflow.\nParent topic: Setting up Deadline Tracker\n1 of 1"}]}