{"doc_name": "indextags_overview.pdf", "doc_path": "data/raw/RPD-en-US/indextags_overview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3891, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Index tags - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP support for documents / RICOH Visual Workbench / AFP Indexer / Index tags\nIndex tags\nThe AFP Indexer mode of RICOH Visual Workbench lets you index data values that are consistently present in the same location in each page\ngroup or on a supplemental page. Index tags define the data values on a page. (Index tags are called Tag Logical Elements (TLEs) in the AFP\narchitecture.)\nYou can create index tags in these ways:\nYou can create an index tag for a block of text that occurs in a consistent location on the same page in every page group, on a supplemental\npage, or on an individual page in a page group. For example, you can create an index tag for a block of text that contains a customer name or\nan account number. You can edit the text value to remove unwanted text such as blanks or special characters.\nYou can create an index area that occurs in a consistent location on the same page in every page group or supplemental page and create index\ntags within the area. Within an index area, you can create index tags that span multiple text blocks on the same line. For example, if one text\nblock on a line contains the first half of an account number and the next text block on the line contains the second half of the account number,\nyou can concatenate the values in the text blocks and create one index tag that spans both blocks of text.\nYou can create index tags for an address area in a page group or supplemental page. An address area is useful when you want to index mailing\naddresses that can contain a different number of lines in each page group. For example, the address in one page group might contain four\nlines, while the address in another page group might contain five lines. Within an address area, you can do specialized functions that apply to\naddresses. For example, you can create an index tag for a ZIP Code in the U.S. Postal Service format (nnnnn or nnnnn-nnnn) that occurs on the\nlast line of the address area (or on a line relative to the last line).\nYou can create index tags for No Operation (NOP) records. A NOP record causes an application to move to the next instruction for processing\nwithout taking any other action. NOP records can be found anywhere in a page group–either on a page in the page group or outside the\nlogical AFP pages. NOP records in the AFP file are not viewable or printable, but you can create index tags from the data contained in them.\nYou can create index tags for NOP records that are in the same position in all page groups, but outside a page, or you can create index tags for\nspecific NOP records that are in any location in the page groups–on a page or outside a page.\nFor example, a bank-statement application produces a file with hundreds of individual customer statements. Each statement has the same\ngeneral format, although statements might vary in size or number of pages. Each statement contains the page number, an account number, a\ndate, and the customer's address. After you use AFP Indexer mode to create page groups and define supplemental pages, you create an index\ntag for the account number and another index tag for the date so that when you view production AFP files, you can display a particular\nstatement based on the account number or date. You might create additional index tags for values in the customer address, such as the ZIP\nCode, so that you can sort statements (documents) according to ZIP Code before printing. If you installed AFP Editor, you can create barcodes\nthat contain the ZIP Code.\nIf the AFP file is already indexed, you can add new index tags to use with the existing page groups and supplemental pages. You can also update\nan existing control file for an AFP file and add new index tags to the existing ones.\nParent topic: AFP Indexer\n1 of 1"}]}