{"doc_name": "pdfw_c_SetInputForPDFWorkflow.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_SetInputForPDFWorkflow.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 9107, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Setting up to process sets of files containing PDF documents and data - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Configuring the PDF Document Support feature\n/ Setting up to process sets of files containing PDF documents and data\nSetting up to process sets of files containing PDF documents and data\nTo process sets of files containing one or more documents in a PDF file and additional data in an auxiliary input file, you set up an input device\nthat uses one of the batching methods for sets: Number of sets, Pages in sets, or Sets by time. Then, you set up a PDF workflow. When the\nIdentifyPDFDocuments step runs, it produces a single PDF job that contains all the individual documents. The step includes the additional data in\nthe document properties file (DPF) for use by other steps in the workflow.\nThe step uses two properties to identify the additional data:\nThe value of the Auxiliary input file extension property identifies the file that contains the data.\nThe value of the Headers file property identifies the file that specifies which data in the auxiliary input file to add to the DPF.\nThis procedure uses an example to show how to process sets of files containing PDF documents and data.\nIn the example, an insurance company uses an application to produce letters to customers. Each letter is in a separate PDF file. The letters\nproduced by the application do not contain the name, phone number, and email address of the agent for the customer.\nA separate application produces comma-separated (CSV) files with the agent information and other data that helps the company compose and\nroute the letters. The two applications output 100 pairs of files at the same time.\nTo optimize the processing of the letters and to add the contact information for the agents, the company batches 50 letters into a single PDF\njob with the 50 CSV files required to read the agent data into the DPF that the other steps in the workflow use.\nBefore you set up a workflow and an input device:\nMake sure that the auxiliary input file meets these requirements:\nThe header line contains the database names of document properties, separated by commas, for each data value that you want to add to the\ndocument properties file.\nThe file has one data line for each document in the associated PDF file.\nOn each data line, the values for the document properties are separated by commas.\nFor example, this auxiliary input file is associated with a PDF file that contains one document. The file contains a header line and one data line\nwith five data values:\nDoc.Custom.AgentName,Doc.Custom.AgentPhone,Doc.Custom.AgentEmail,Region,AgentCodeKelly Lopez,1-800-\n555-1234,kelly.lopez@insurancebiz.com,Southeast,B475\nMake sure that the headings for all the data values you want to use in the workflow are defined as RICOH ProcessDirector document\nproperties.\nIn the example, you want to use the values for Doc.Custom.AgentName, Doc.Custom.AgentPhone, and Doc.Custom.AgentEmail\nin a step based on the EmailDocuments step template.\nYou define Doc.Custom.AgentName, Doc.Custom.AgentPhone, and Doc.Custom.AgentEmail as custom document properties.\nNote:\nWe recommend that the names of custom document properties start with Doc.Custom.\nIf you do not want to use a data value in the workflow, you do not need to define the heading for the data value as a RICOH\nProcessDirector document property. In the example, you do not define AgentRegion and AgentCode as RICOH ProcessDirector\ndocument properties.\nCreate a headers file that lists the database names of the document properties whose values you want to add to the DPF. Each database\nproperty name is on a separate line.\nFor example, you create a headers.txt file with this content:\nDoc.Custom.AgentNameDoc.Custom.AgentPhoneDoc.Custom.AgentEmail\nWhen the IdentifyPDFDocuments step in your workflow processes the set of files in the example, it creates a document properties file with data\nextracted from the letter and data from the auxiliary input file. For example, the company has mapped customer name and customer email\naddress data in the letter to document properties in the Identify PDF control file. The IdentifyPDFDocuments step creates a DPF with these\nvalues:\nDoc.Custom.CustomerName Doc.EmailAddress Doc.Custom.AgentNameDoc.Custom.AgentPhone\nDoc.Custom.AgentEmailChris Smith chris.smith@myisp.com Kelly Lopez1-800-555-1234\nkelly.lopez@insurancebiz.com\nTo set up to process sets of files containing PDF documents and data:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Input Devices.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:17 PM Setting up to process sets of files containing PDF documents and data - Jenski - Test portal- RPD Linux\n3. Add or copy a hot folder input device.\nFor example, click Add ⇒ Hot Folder, and name the input device PDFInputFromSets.\n4. On all the tabs, fill in the required and optional properties that you need to adjust to match your environment.\n5. Click the General tab.\n6. For the Child workflow property, select the name of the workflow that you are modifying to process sets of files.\nFor example, select PDFDocumentsFromSets.\nIf you are creating a new workflow, use the default value. After you save the new workflow, display the properties for the input device and\nselect the workflow as the value of this property.\n7. Click the Batching tab.\n8. For the Batching method property, select Number of sets, Pages in sets, or Sets by time.\n9. Specify values for other properties associated with the batching method you selected.\nFor example, you want the input device to batch and submit files to the workflow after it receives 50 sets of PDF files and CSV files. For the\nNumber of files to batch property, enter 50.\n10. Specify a value for the Matching pattern for sets property, or use the default value:\n(.+?)\\.[^.]*$|$\nThe default value tells RICOH ProcessDirector to add files whose names are identical except for their extensions to the same set.\nFor example:\ncustomer_1.pdfcustomer_1.csv\n11. For the Data patterns property, enter: .*pdf$\n12. Enter property values for the file pattern that identifies an auxiliary input file.\nFor example, type these values for an auxiliary input file with a CSV file extension:\nFile pattern: .*csv$\nSpool file usage: auxinput\nSpool file type: csv\nFile pattern required: Yes\nFile pattern sequence: 1\nRICOH ProcessDirector lets you use any value for the Spool file usage property that is not a RICOH ProcessDirector keyword. Keywords\ninclude control, overrrides, and print.\n13. Click Add.\n14. When you finish setting property values for the input device, click OK.\n15. Click the Workflow tab.\n16. Open a workflow that you want to modify, or create a new workflow.\nFor example, you copy and modify the EnhancePDFDocuments supplied workflow. You name the copied workflow\nPDFDocumentsFromSets.\n17. Add or modify a step based on the IdentifyPDFDocuments step template.\n18. Set values for the properties of the IdentifyPDFDocuments step:\n1. For the Identify PDF control file property, specify the full path or symbolic name of the control file that you created using RICOH\nProcessDirector Plug-in for Adobe Acrobat.\nThe default Identify PDF control file defines each PDF file as a single document. Use RICOH ProcessDirector Plug-in for Adobe Acrobat\nto create a custom control file if:\nYour PDF files contain two or more documents.\nYou want to add markup to the documents.\nYou want to map data in the documents to document properties.\n2. For the Auxiliary input file extension property, enter the file extension of the auxiliary input files.\nMake sure that this value matches the value of the Spool file type property for the auxiliary input file pattern that you defined on the\ninput device\nIn the example, the auxiliary input files have a CSV extension. Enter: csv\n3. For the Headers file property, enter the full path and name of the file that lists which values to copy from the auxiliary input file to\nthe DPF.\nFor example, enter /aiw/aiw1/aux_input/headers.txt (Linux) or C:\\aiw\\aiw1\\aux_input\\headers.txt (Windows).\n19. Make other changes to the workflow as needed.\n20. Save the workflow.\n21. Test the input device and workflow:\n1. Enable the workflow.\n2. Enable and connect the input device that sends jobs to the workflow.\n3. Submit sets of PDF files and CSV files to the input device until you reach the limit at which the input device batches the files and\nsubmits them to the workflow.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:17 PM Setting up to process sets of files containing PDF documents and data - Jenski - Test portal- RPD Linux\nFor the example input device, submit 50 sets of PDF and CSV files.\nWhen the IdentifyPDFDocuments step runs, it generates this output:\nA single PDF file with all the documents from all the sets.\nA sets directory that contains a subdirectory for each set of files.\nA document properties file that contains the values for any data mapped to document properties in the Identify PDF control file and the values\nof data from the auxiliary input files.\nParent topic: Configuring the PDF Document Support feature\n3 of 3"}]}