{"doc_name": "InserterReconciliationMethods.pdf", "doc_path": "data/raw/RPD-en-US/InserterReconciliationMethods.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3266, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Inserter reconciliation methods - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Inserter and Quadient Inserter Express / Inserter reconciliation methods\nInserter reconciliation methods\nRICOH ProcessDirector reconciles each job after the job finishes insertion. During reconciliation, RICOH ProcessDirector determines which\ndocuments in the job were damaged and need to be reprinted, and which documents to pull (remove) from the job. The reconciliation method\ntells RICOH ProcessDirector whether to reconcile damaged documents automatically, or manually with operator control.\nWhen the administrator configures job workflows for insertion, the administrator selects the reconciliation method in the step based on the\nReconcile step template. An operator can change the reconciliation method for a particular job by editing the job's properties and changing the\nvalue in the Automatic reconciliation property.\nThe reconciliation methods are:\nAutomatic reconciliation\nWhen a job finishes insertion, RICOH ProcessDirector automatically reconciles the documents in the job and reprints any damaged\ndocuments. Use this method if operators in your installation use the interface of the inserter controller to reconcile jobs.\nOperator action in RICOH ProcessDirector is required in these situations even with automatic reconciliation:\nThe inserter controller does not report a status for one or more documents in the job, and the Default insert status property of the inserter\ncontroller is not set.\nThe documents to be reprinted exceed the percentage of reprints allowed for the job in the Maximum documents to reprint (%) property.\nManual reconciliation\nWhen a job finishes insertion, the operator selects the Reconcile action to start manual reconciliation for the job. Then the operator uses the\nReconcile Job page of the RICOH ProcessDirector user interface to select an action for each document in the job.\nThe Reconcile Job page shows the insert status of each job and the initial action that RICOH ProcessDirector has determined for each\ndocument, based on the insert status of the document and the value of the Default insert status property on the inserter controller.\nThe operator can request one of these actions for each document:\nOK: Document is not reprinted.\nPull: Document is marked “pulled” (removed from the job) in the database and is not reprinted.\nReprint: Document is reprinted.\nRICOH ProcessDirector can use the automatic reconciliation method only if the inserter controller creates an inserter results file (or files). RICOH\nProcessDirector uses the status reported in inserter results files to determine which documents in a job have been damaged during insertion and\nneed to be reprinted. If the inserter controller does not create inserter results files, RICOH ProcessDirector must use the manual reconciliation\nmethod.\nNote:\nIf the original job is retained in the system after it has completed, the operator can use the RICOH ProcessDirector Process Again action to\nreprint any documents in the job. This function is useful if the operator discovers additional damaged documents after reconciliation.\nParent topic: Inserter and Quadient Inserter Express\n1 of 1"}]}