{"doc_name": "aiw00cbatchfolder.pdf", "doc_path": "data/raw/RPD-en-US/aiw00cbatchfolder.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7496, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Setting up hot folder input devices to process batch jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining input devices / Setting up hot folder input devices to process batch jobs\nSetting up hot folder input devices to process batch jobs\nTo set up a hot folder input device to process batch jobs, you must configure it to use the appropriate batching method and to recognize the\ninput files.\nNote:\nAll batching methods submit input files when some criteria is met, such as several files are received, a time of day is reached, or a list of\nexpected files arrives. Sometimes, you want to submit the input files before that criteria is met and before the current polling interval\nends.\nFor example, you have one hour until the end of your shift and there are 3857 input files waiting. The input device uses the Number\nbatching method and submits jobs when there are 5000 input files waiting. You can use the Batch all action for the input device to\nsubmit those 3857 files immediately, instead of waiting for more files.\nYou cannot use the Batch all action with the JDF or Pattern batching method.\nTo set up a hot folder input device to process batch jobs:\n1. Create and save any files that are needed for processing, such as JDF job tickets, list files, or overrides files, or make sure that your process\ngenerates these files as needed.\n2. Log in to RICOH ProcessDirector.\n3. In the Input Devices portlet, find the input device that you want to use to process batch jobs.\n4. Right-click the input device and select Properties.\n5. In the left pane, click Show all tabs to fully expand the notebook.\n6. For any batching method, set these input device properties as follows:\nWorkflow\nParentNoPrint.\nChild workflow\nThe workflow that is appropriate for the print files in the job.\nNote:\nIf you use the List batching method, to be sure that the jobs print in order, select a workflow that includes a step based on the\nWaitForGroup step template before the PrintJobs step.\nIf you use overrides files, select a workflow that includes a step based on the SetJobPropsFromTextFile step template.\nData patterns\nOne or more pattern-matching strings that define which characters in the data file should be matched with the other file names that\nmight arrive in the input device. If you specify more than one data pattern, the file is considered a match if it matches any pattern. The\ndata pattern is a regular expression.\nSubmit step\nSubmitInputFiles\n7. Set these input device properties depending on your batching method:\nJDF\nJDF patterns\nA pattern that matches some part of the name of your job tickets. By default for all input devices except HotFolderJDF this value is\nnull. For HotFolderJDF this value is the regular expression .*\\jdf$.\nList\nList patterns\nA pattern that matches some part of the file name of your list files. By default, this value is the regular expression .*lst$.\nOverrides patterns (optional)\nA pattern that matches some part of the file name of your overrides files.\nCreate .zip file\nIf this property is set to Yes, all input files that match the value set in the Data Patterns property and that are included in a list file\nare combined as a .zip file and submitted as a single job. If this property is set to No, all input files are submitted as child jobs.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Setting up hot folder input devices to process batch jobs - Jenski - Test portal- RPD Linux\nNumber and Number of sets\nNumber of files to batch\nThe number of files or complete sets that the input device should wait to receive before submitting them as a single group.\nCreate .zip file\nIf this property is set to Yes, all input files that match the value set in the Data Patterns property are combined as a .zip file and\nsubmitted as a single job. If this property is set to No, all input files are submitted as child jobs. This property is not available for\nthe Number of sets batching method.\nPages and Pages in sets\nExceed pages to batch\nYes: A PDF file or complete set of PDF files that contains enough pages to make the total number of pages in the input device\nexceed the value set for Number of pages to batch is submitted with the rest of the files.\nNo: This file or set remains in the input device as the first set of pages for the next batch.\nNumber of pages to batch\nThe number of pages that the input device should wait to receive before submitting the files or complete sets as a single group.\nCreate .zip file\nIf this property is set to Yes, all input files that match the value set in the Data Patterns property are combined as a .zip file and\nsubmitted as a single job. If this property is set to No, all input files are submitted as child jobs. This property is not available for\nthe Pages in sets batching method.\nTime and Sets by time\nBatching start date\nThe date when the input device should begin to use this batching method.\nBatching start time\nThe time when the input device should begin to use this batching method.\nBatching interval\nThe time interval that the input device should use to determine when or how often to submit a job.\nBatch date or Frequency\nUsed with the Batching interval property, specifies exact values for when or how often to submit a job.\nCreate .zip file\nIf this property is set to Yes, all input files that match the value set in the Data Patterns property are combined as a .zip file and\nsubmitted as a single job. If this property is set to No, all input files are submitted as child jobs. This property is not available for\nthe Sets by time batching method.\nPattern\nData pattern\nOne or more pattern-matching strings that define which characters in the data file should be matched with the other file names\nthat might arrive in the input device. If you specify more than one data pattern, the file is considered a match if it matches any\npattern. The data pattern is a regular expression.\nFile pattern (one value for each type of input file)\nA pattern-matching string that defines a particular type of input file, for example, .*jdf$ for a job ticket.\nSpool file usage (one value for each type of input file)\nA value that identifies what the input file is used for, for example, ticket for a job ticket or print for a print file.\nSpool file type (one value for each type of input file)\nThe file extension for the input file.\nFile pattern required (one value for each type of input file)\nWhether the job must contain this type of input file.\nThe job starts to process when all the required files are present. Make sure any optional files are already in the input device before\nthe required files; otherwise they will not be included in the job.\nFile pattern sequence (one value for each type of input file)\nIf two or more File pattern values are the same, or if two or more File pattern properties are associated with the same Spool file\nusage and Spool file type values, the order in which the set of values is applied.\n8. Click OK.\nIf the input device is enabled and connected, you see a confirmation window asking you if you want to disable and disconnect the input\ndevice. To save your changes, the input device must be disabled and disconnected.\n9. To use the input device, select it and click Enable and Connect.\nAfter you configure an input device to use a batching method, make sure that the input files you submit are appropriate for the batching\nmethod selected. Unidentified input files remain in the staging location for the input device with a status of Waiting.\nParent topic: Defining input devices\n2 of 2"}]}