{"doc_name": "aiw_c_seterrorpath.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_seterrorpath.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2701, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Defining an error path in a workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Defining an error path in a workflow\nDefining an error path in a workflow\nYou can add a branch in your workflow so that if a job goes into error state, the job continues processing in another path in the workflow\ninstead of staying in the Error state. You can define a branch out of any step in the workflow.\nTo define an error path in a workflow:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Find the step you want to create an error path for.\n5. Add the step that you want the error branch to take.\n6. Draw a connector from the step where the error could occur to the step that you want to execute when the error happens.\n7. Right-click the connector you just drew and select Properties.\n8. Add a rule for when the job goes into error:\n1. Type the Rule name to define the new rule.\nWe recommend giving the rule a name that identifies the branch as an error path, such as If error. You see the name next to the\nconnector on the workflow editor\n2. To specify the condition to test for the error state, set Property to Current job state, Comparison to is (=), and Value to Error.\nNote:\nError is the only value for the Current job state property that can be used in a rule.\n3. Make sure that the Order of execution value is set appropriately for the error path. If other conditions are met before the error path,\nthe job might not take the path you intended.\n9. Add any other conditions that you want to use to evaluate when to take the error path.\n10. Click OK.\n11. Repeat this procedure to add more error paths. Multiple error paths can exist in one workflow.\n12. Save and enable the workflow.\n13. Enable the workflow and test it to make sure that the rules in the branch work in the way you expect. Submit jobs that are sent through all\nthe paths. When a job takes the error path, it moves out of the Error state, so you must find another way to look for jobs instead of\nsearching for the Error state.\nNote:\nWhen the job goes into the Error state, files in the /tmp directory under the spool directory for the job are moved to an /error\ndirectory. When they are moved, the step name and phase name are prepended to the file names.\nParent topic: Preparing to use workflows\n1 of 1"}]}