{"doc_name": "pdfw_t_plugin_insertpages.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_insertpages.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7829, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Inserting pages from other PDF files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with page inserts\n/ Inserting pages from other PDF files\nInserting pages from other PDF files\nIn a PDF file, you can insert pages from other PDF files before each document that matches the placement conditions, after each document that\nmatches the placement conditions, or both. The inserted pages increase the number of pages in each document, and you can apply markup to\nthem.\nTo insert pages from other PDF files:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains page groups or define page groups.\n2. Click Ricoh ⇒ Manage Inserts.\n3. Click the icon.\n4. Specify the first PDF file with pages that you want to insert:\nIf you can access the file, click Browse in the File to Insert section. Navigate to the file. Select it, and click Open.\nIf you cannot access the file, type the full directory path to the file on the RICOH ProcessDirector primary server.\nFor example, type /aiw/aiw1/insertpages/insert1.pdf on a Unix-based system or C:\\aiw\\aiw1\\insertpages\\insert1.pdf on\nWindows.\nMake sure that RICOH ProcessDirector can access the file when the BuildPDFFromDocuments step runs.\n5. To insert all pages in the file, click the All pages radio button.\nTo specify the pages for insertion, click the Specific pages radio button, and type the page selection.\nUse a hyphen to separate the first and last pages in a page range.\nUse a comma to separate page selections.\nType n to specify the last page.\nFor example, type 8-n,5,2 to insert the pages from 8 to the end of the insert file, followed by pages 5 and 2.\n6. In the Insert Location section, choose whether to insert the pages before or after the pages in the documents that match the specified\nplacement conditions.\n7. In the Placement Conditions section, specify the documents that receive inserted pages:\nTo insert pages before or after each document in the open PDF file, click the All documents radio button.\nTo insert pages before or after some documents but not others, click the Documents based on a rule radio button.\nFrom the list, choose the rule that defines the placement conditions.\nYou also can do these actions:\nTo define a new rule, click the icon.\nTo go to the Rules Manager, click the icon.\nImportant:\nCustom rules for page inserts can include conditions based on the values of job properties, document properties, and document\nstatistics (such as Stat.TotalPagesInDocument and Stat.TotalSheetsInDocument).\nConditions based on the values of conditional triggers or page statistics (such as Stat.CurrentPageInJob and\nStat.CurrentSheetInJob) do not work with custom rules for page inserts. RICOH ProcessDirector evaluates whether a rule for page\ninsertions applies to a document before evaluating the information on the individual pages in a document.\nPre-defined rules, such as All Front Pages or Last Back Only, add page inserts to all documents or no documents. Because those\nrules do not restrict page inserts to specific documents, do not use them for page inserts.\n8. In the Sides section, specify whether you want to print the insert one-sided or two-sided.\nSimplex\nThe insert prints on a single side of the paper.\nDuplex\nThe insert prints on both sides of the paper, with the long side of the paper as the bound edge.\nTumble\nThe insert prints on both sides of the paper, with the short edge of the paper as the bound edge. The bottom of the front side of the\nsheet is the top of the back side of the sheet.\nFrom print job\nThe insert prints on the sides specified in the print job.\n9. Click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Inserting pages from other PDF files - Jenski - Test portal- RPD Linux\n10. To select another PDF file and specify how to insert pages, click the icon. Repeat the steps for the first PDF file.\nRICOH ProcessDirector inserts the pages from the PDF files in the order that the files appear on the Inserts Manager list, from top to\nbottom.\nFor example, an Inserts Manager list has 4 rows. The PDF files provide the following inserts:\nPage 1 in the first PDF file is inserted before each document in the open PDF file.\nPages 4–6 in the second PDF file are inserted before each document.\nPages 2–4 in the third PDF file are inserted after each document.\nPage 3 in the fourth PDF file is inserted after each document.\nThe first document in the open PDF file has 6 pages. After RICOH ProcessDirector adds the inserts, the first document has 14 pages, in this\norder:\nPage 1 from the first PDF file\nPages 4–6 from the second PDF file\nPages 1–6 from the original document\nPages 2–4 from the third PDF file\nPage 3 from the fourth PDF file\n11. To change the order that RICOH ProcessDirector uses to insert pages into documents, select a row on the Inserts Manager list. To move the\nrow up or down the list, click the icon or the icon.\n12. When you finish adding PDF files to the list, click OK.\n13. Optional: To verify that the pages have been inserted as you intended, click Ricoh ⇒ Preview.\nWhen you preview a PDF file with inserts, RICOH ProcessDirector Plug-in for Adobe Acrobat checks whether the PDF files are at the\ndirectory paths you specified on the Inserts Manager list.\nIf they are, the pages are inserted from the PDF files at those directory paths.\nIf they are not, the pages are inserted from the PDF files that are embedded in the control file.\nIf RICOH ProcessDirector Plug-in for Adobe Acrobat cannot find an embedded PDF file, the preview function displays a warning message\nand continues without inserting the pages.\n14. When you are ready to save all your enhancements to the open PDF file, including the new inserts, click Ricoh ⇒ Save Control File.\nIn the control file, RICOH ProcessDirector Plug-in for Adobe Acrobat embeds the PDF files that it can access.\nIf the PDF files are embedded, you need not copy them to a directory accessible to a RICOH ProcessDirector server.\nWhenever you save the control file, RICOH ProcessDirector Plug-in for Adobe Acrobat tries to replace each embedded PDF file with the file\nat the directory path shown on the Inserts Manager list.\n15. In the RICOH ProcessDirector BuildPDFFromDocuments step, specify the name and location of the control file that contains the pages to\ninsert.\nWhen a job with inserts from other PDF files enters the BuildPDFFromDocuments step, RICOH ProcessDirector checks whether the PDF files\nare at the specified directory paths.\nIf they are, the pages are inserted from the PDF files at those directory paths.\nIf they are not, the pages are inserted from the PDF files that are embedded in the control file.\nIf RICOH ProcessDirector cannot find an embedded PDF file, the job moves to error state. The job cannot complete the\nBuildPDFFromDocuments step until RICOH ProcessDirector can access all the PDF files that provide inserts or until you remove the page\ninsertion instructions from the control file.\nExample\nEach document in a PDF file has from 1 to 3 pages. You want to insert page A at the end of documents with 2 pages. You want to insert page A\nand page B at the end of documents with 1 page.\n1. Define a rule named TotalPagesLessThan3 with 1 condition:\nStat.TotalPagesInDocument < 3\n2. Define a page insert for page A and another page insert for page B.\n3. For each page insert:\nClick the After documents radio button.\nClick the Documents based on a rule radio button and select TotalPagesLessThan3.\n4. Make sure that the insert for page A is above the insert for page B on the Inserts Manager list.\nIf a document has 1 or 2 pages, RICOH ProcessDirector adds page A. If the document now has 2 pages, RICOH ProcessDirector adds page B after\npage A.\nParent topic: Working with page inserts\n2 of 2"}]}