{"doc_name": "tt_c_EnhanceAFPVerification.pdf", "doc_path": "data/raw/RPD-en-US/tt_c_EnhanceAFPVerification.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2297, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Enhancing AFP files for Automated Verification - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature / Enhancing AFP files for Automated Verification\nEnhancing AFP files for Automated Verification\nMost AFP files that are submitted to RICOH ProcessDirector need to be enhanced before they can be processed for Automated Verification.\nAFP files must contain page groups that identify the documents (mailpieces) in the AFP file. If an AFP file does not have page groups, you can use\nAFP Indexer to add them.\nThe barcodes that the Automated Verification feature uses must contain these properties:\nJob number\nSequence in child job\nYou must use the Enhance AFP function to add barcodes that contain the values of those properties to each document in AFP jobs.\nNote: AFP Editor, if it is installed, can also hide existing barcodes and create new ones. However, AFP Editor cannot include the values of\ndocument properties (such as Sequence in child job) in the barcode. Therefore, you must use Enhance AFP to create barcodes for use with\nAutomated Verification.\nTo create barcodes for use with Automated Verification:\n1. Create an Enhance AFP control file.\nYou can use the sample Enhance AFP control file named enhanceAfp.cfg in /opt/infoprint/ippd/extensions/doc/samples (Linux)\nor C:\\Program Files\\Ricoh\\ProcessDirector\\extensions\\doc\\samples (Windows) to create a new control file.\nYou can also use the AFP Enhancer mode in RICOH Visual Workbench to create a new control file. Make sure to save the RICOH Visual\nWorkbench control file and export the Enhance AFP control file.\n2. When you configure your Automated Verification workflow, specify the name of the Enhance AFP control file in the step based on the\nBuildAFPFromDocuments step template.\n3. Optional: If the output is not what you expected, use AFP Enhancer mode in RICOH Visual Workbench to edit the Enhance APP control file.\nIf you used the sample Enhance AFP control file enhanceAfp.cfg, use a text editor to modify the control file.\nIf you used the AFP Enhancer mode in RICOH Visual Workbench, open the RICOH Visual Workbench control file and make your changes.\nThen export the Enhance AFP control file.\nParent topic: Setting up the Automated Verification feature\n1 of 1"}]}