{"doc_name": "barcode_IMBreplaceposition_tab.pdf", "doc_path": "data/raw/RPD-en-US/barcode_IMBreplaceposition_tab.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4350, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Position tab for IMBs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Replacing POSTNET barcodes with IMBs\n/ Position tab for IMBs\nPosition tab for IMBs\nOn the Position tab, you can change the origin (top-left corner) of the Intelligent Mail barcode (IMB), the size of the barcode area, and the\norientation of the barcode symbol.\nWhen you create BCOCA IMBs, the barcode area must be large enough to contain the largest barcode symbol in each page group. If any part of\nthe barcode symbol extends outside of the barcode area, the printer reports an exception and does not print the barcode correctly.\nAFP Editor automatically creates IMBs with the same orientation as the POSTNET barcodes. However, you can select a different orientation for the\nbarcode symbol (0, 90, 180, 270 degrees).\nFields on the Position tab\nField Value Description\nOrigin of area: X position Any decimal value, such as The horizontal distance (in inches or millimeters) of the left side of the barcode area\n2.5. The X position cannot measured from the left side of the logical page (not the physical sheet of paper).\nbe greater than the width\nNote: If you rotated the AFP file using the Rotate by 90o option on the View\nof the page.\nmenu, specify the X position from the top-left corner of the page in the\nunrotated view.\nOrigin of area: Y position Any decimal value, such as The vertical distance (in inches or millimeters) of the top of the barcode area\n2.5. The Y position cannot measured from the top of the logical page (not the physical sheet of paper).\nbe greater than the height\nNote: If you rotated the AFP file using the Rotate by 90o option on the View\nof the page.\nmenu, specify the Y position from the top-left corner of the page in the\nunrotated view.\nSize of area: Width Any decimal value, such as The horizontal width (in inches or millimeters) of the barcode area measured in the\n2.5. The width of the area unrotated view. If the POSTNET barcode is a BCOCA object, the initial width is the\ncannot be greater than width of the POSTNET barcode area. If the POSTNET barcode is a text barcode, the\nthe width of the page. initial width is the maximum width for IMBs.\nNote: This field applies only to BCOCA barcodes. It is ignored for text\nbarcodes.\nSize of area: Height Any decimal value, such as The vertical height (in inches or millimeters) of the barcode area measured in the\n2.5. The height of the area unrotated view. If the POSTNET barcode is a BCOCA object, the initial height is the\ncannot be greater than height of the POSTNET barcode area. If the POSTNET barcode is a text barcode, the\nthe height of the page. initial height is the maximum height for IMBs.\nNote: This field applies only to BCOCA barcodes. It is ignored for text\nbarcodes.\nOrientation 0 degrees The barcode symbol is not rotated in the barcode area.\n90 degrees The barcode symbol is rotated 90 degrees in the barcode area.\n180 degrees The barcode symbol is rotated 180 degrees in the barcode area.\n270 degrees The barcode symbol is rotated 270 degrees in the barcode area.\nOrigin of barcode symbol: A decimal value. The horizontal distance (in inches or millimeters) of the origin of the barcode symbol\nX position measured from the left side of the logical page (not the physical sheet of paper). AFP\nEditor automatically calculates this value.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Position tab for IMBs - Jenski - Test portal- RPD Linux\nField Value Description\nOrigin of barcode symbol: A decimal value. The vertical distance (in inches or millimeters) of the origin of the barcode symbol\nY position measured from the top of the logical page (not the physical sheet of paper). AFP\nEditor automatically calculates this value.\nPlacement of area Page n The barcode is placed on page n of each page group. n is the number of the page\nwhere you drew the barcode area.\nMultiple pages: All pages The barcode is placed on all pages in each page group.\nMultiple pages: Even The barcode is placed on the even pages in each page group (pages 2, 4, 6,...).\npages\nMultiple pages: Odd The barcode is placed on the odd pages in each page group (pages 1, 3, 5,...).\npages\nOther topics in this section:\nType tab for IMBs\nData tab for IMBs\nParent topic: Replacing POSTNET barcodes with IMBs\n2 of 2"}]}