{"doc_name": "aiwi_whatsnew.pdf", "doc_path": "data/raw/RPD-en-US/aiwi_whatsnew.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 15316, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM New in this release - Jenski - Test portal- RPD Linux\nOverview\nOverview / New in this release\nNew in this release\nThese new functions and updates have been included in the listed versions of RICOH ProcessDirector.\nNew functions and updates in Version 3.13.3\nCut sheet support for TASKalfa feature\nRICOH ProcessDirector now supports Kyocera TASKalfa 15000c production printers with the EFI Printing System 50 option (EFI Fiery DFE). The\nno-charge Cut sheet support for TASKalfa feature adds the TASKalfa printer type for use with that printer line.\nFor information see: Cut Sheet support for TASKalfa feature\nInstall security updates without updating RICOH ProcessDirector\nIn this release, we are adding the ability to update select components without updating the entire product. Now, you can independently update\nthe installations of PostgreSQL, IBM DB2, Java, and Tomcat that are provided with RICOH ProcessDirector to address reported security\nvulnerabilities.\nGoing forward, Ricoh plans to check for security updates from the vendors/distributors monthly. After testing and verification, the packages will\nbe posted on the Ricoh software download site (dl.software.com).\nFor information see: Downloading and installing security updates\nMigration Assistant updates\nThis release provides various functionality improvements to the Migration Assistant. Most notably, the performance of the Objects section is\nimproved.\nUpdated IBM DB2\nThe version of IBM DB2 provided with RICOH ProcessDirector is updated to version 11.5.9 Special Build 63280.\nUpdated PostgreSQL\nThe version of PostgreSQL provided by RICOH ProcessDirector is updated to version 17.6.\nUpdated operating system support\nYou can now install application servers on Windows Server 2025.\nSupport for RICOH Pro 5400 series printers\nRICOH ProcessDirector now supports sending jobs to these printers with the Fiery E-48B digital front end:\nPro C5400S\nPro C5410S\nNew functions and updates in Version 3.13.2\nCommunicate inside RICOH ProcessDirector with Notes\nAdded by customer request: Communicate with your colleagues right from the user interface to enable effective, real-time collaboration. Open\nthe Notes panel from the banner to leave messages for the next shift, alert operators about service updates, and report status. You can create,\nedit, and delete messages, with support for reactions and replies to facilitate dynamic conversations.\nYou can tag colleagues and incorporate hashtags to link messages to specific objects or workflows, keeping conversations contextually relevant.\nSelecting a tag or hashtag filters the content to display only messages where those terms appear.\nAdditionally, the entire message history in Notes is fully searchable, allowing for fast retrieval of past communications.\nOrder Management feature enhancements\nIn Version 3.13.2, the Order Management feature becomes even more powerful! Orders and order properties are more integrated with the user\ninterface and other features. Added function includes:\nDefine custom properties for orders.\nInclude order properties on banner pages.\nCollect order data using the Reports feature and a new data collector.\nInclude orders and order properties in custom portlets.\nReference order properties from jobs.\nUse order properties in connector logic.\nSet locations at the group level\nMake managing access to resources by location more efficient by setting locations at the group level. Previously, locations were set for each\nuser and updated individually. Now, you can set locations for a group and all users added to the group inherit the settings. Move a user to a\ndifferent group and their locations are updated automatically.\nRICOH Supervisor™ renamed to RICOH Predictive Insight™\nIn April 2025, RICOH Supervisor was renamed to RICOH Predictive Insight. RICOH ProcessDirector is now updated to reflect that product name\nchange.\nUpdated PostgreSQL\nThe version of PostgrSQL provided by RICOH ProcessDirector is updated to version 17.4.\nImproved support for Custom PDF printers\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:21 PM New in this release - Jenski - Test portal- RPD Linux\nCustom PDF printers are easier to manage with the introduction of the Printer Definition object. Now, when you upload a GPZ file from a Ricoh\nrepresentative, you create a Printer Definition, then use the printer definition when you add the Custom PDF printer. With this change, you can\nmigrate printer definitions and Custom PDF printers using Migration Assistant more easily.\nNew functions and updates in Version 3.13.1\nUpdated translations\nThe content of the Version 3.13 product interface and the help system have been translated into these languages:\nBrazilian Portuguese\nFrench\nGerman\nItalian\nJapanese\nSpanish\nTo see the translated user interface and help content, download and install the Language Pack for your language.\nUpdated PostgreSQL\nThe version of PostgreSQL included with RICOH ProcessDirector is updated to version 16. If you previously installed the PostgreSQL database\nprovided with RICOH ProcessDirector, you now have the option to update that database during the installation process. You can also choose to\ncomplete the installation without updating the database and install the database update later.\nUsability improvements\nThis release includes improvements in the behavior of the user interface, including:\nIn the Workflow Editor step template list, moved the Favorites group to the top of the list.\nIn the Jobs portlet, added a collapsible area for filters, so they take up less space on the screen.\nIn the Orders portlet, made order numbers active, so clicking on them opens the order property notebook.\nOptimizing the BuildPDFFromDocuments step\nFor very large PDF jobs or jobs with complex processing requirements, the BuildPDFFromDocuments step can run for hours to finish processing.\nIn this release, we introduce advanced configuration options to help optimize the step to complete faster. For details, refer to: Optimizing\nBuildPDFFromDocuments steps. If you are interested in exploring this option, contact your Ricoh representative.\nNew functions and updates in Version 3.13\nOrder Management feature\nAt long last, order support comes to RICOH ProcessDirector! The Order Management feature adds the ability to create and track orders\nsubmitted from your MIS or order processing system, or to build orders manually in the Submit Jobs portlet. Submit your order file in XML\nformat and RICOH ProcessDirector interprets the file, creating orders and jobs to your specifications.\nThe Order Management feature is included with the base product as a no-charge feature, but is not installed by default.\nFor more information, see Order Management\nMarcomCentral Connect improvements\nWith the addition of the Order Management feature, integration with MarcomCentral is easier than ever. Sample workflows provided in the\nMacomCentral Connect feature have been updated to use the objects introduced by Order Management for faster integration with your\nMarcom storefront.\nFor more information, see MarcomCentral Connect\nImproved license key installation\nWe have redesigned the license installation process to improve the experience. The process is now faster and has better messaging and\nfeedback, so you know which feature licenses are activated.\nSupport for RICOH Pro 8400 series printers\nRICOH ProcessDirector now supports sending jobs to these printers with the Fiery EB-36 digital front end:\nPro 8400S\nPro 8410\nPro 8410S\nPro 8420\nPro 8420S\nPro 8420Y (Japan only)\nUsability improvements\nOn the Workflow Editor, step templates and step chains have been moved to a stationary side panel, instead of displaying in a floating\nwindow. In the panel, both step templates and step chains have also been grouped into categories, to make finding the item you need easier.\nIn the Migration Assistant, you can now cancel and revert a migration in progress. Objects and files that were migrated are reverted to their\npre-migration versions.\nOperating system support changes\nWith this release, we are adding support for two Linux operating system levels: Red Hat 9.2 through latest 9.X and Rocky Linux 9.0 through\nlatest 9.X\nIn addition, we now support installing the PostgreSQL database provided by RICOH ProcessDirector in a Podman container on all supported\nversions of Linux. You must install Podman 5.2.3 or higher before you install RICOH ProcessDirector.\nWe are removing support for Red Hat 7 and CentOS 7. With this change, CentOS is no longer a supported operating system.\nNew functions and updates in Version 3.12.2\nIntegrate document composition using FusionPro into your workflows\nWith this release, we introduce the FusionPro Connect feature, which lets you send jobs from RICOH ProcessDirector to FusionPro Server for\ncomposition and/or impositioning.\nRun RICOH ProcessDirector with your own PostgreSQL database\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:21 PM New in this release - Jenski - Test portal- RPD Linux\nYou can now configure RICOH ProcessDirector to use a PostgreSQL database that you install, instead of using the version installed with the\nproduct or using IBM DB2. Your database can be installed on the primary computer or anywhere in your network that the primary server can\naccess.\nMigration Assistant enhancements\nThe Migration Assistant makes moving from one system to another easier with two major improvements:\nConfiguration file migration\nYou can now migrate configuration files stored in the /aiw/aiw1 directory to the target system without manual intervention.\nReports database configuration and migration\nThe Migration Assistant can help you set up your Reports database on the target system. Whether you want to set up the target system to\nconnect to the same Reports database that the source system currently uses, or you want to create a new database and move your existing\ndata into it, the Migration Assistant makes the process easier.\nIn addition, you can now pause/resume and cancel a migration that is in progress.\nImproved security with fapolicyd support\nIf your company uses the File Access Policy Daemon (fapolicyd) to secure your computing environment, RICOH ProcessDirector now provides\nscripts to generate the list of the standard directories that it uses and a list of rules that permit RICOH ProcessDirector to run.\nSupport for requesting a printer preset with a job\nIf you print AFP jobs, you can now send a printer preset request along with the job. If the printer supports the function, it changes its settings\nto use that preset automatically before printing the job.\nEmbedded Tomcat version updated\nTo address security and functionality issues, the version of Tomcat included in RICOH ProcessDirector has been updated to version 9.\nNew functions and updates in Version 3.12.1\nUpdated translations\nThe content of the Version 3.12 product interface and the help system has been translated into these languages:\nBrazilian Portuguese\nFrench\nGerman\nItalian\nJapanese\nSpanish\nTo see the translated user interface and help content, download and install the Language Pack for your language.\nUpgrade and migrate to PostgreSQL on the same system\nIn RICOH ProcessDirector version 3.12, we introduced support for PostgreSQL as the main database underlying RICOH ProcessDirector. To move\nto PostgreSQL, you were required to install version 3.12 on a different server and use the Migration Assistant to migrate your data. With version\n3.12.1, you can upgrade and migrate your data on the same system. Install RICOH ProcessDirector, making sure to choose the PostgreSQL\ndatabase configuration. After the installation completes, follow the instructions to migrate your data, then remove IBM DB2 from your primary\ncomputer.\nManual failover now supported for PostgreSQL configurations\nManual failover configurations for system redundancy are now supported on RICOH ProcessDirector with PostgreSQL as well as DB2.\nXML-RPC calls no longer supported\nThe Connect extension, which let you connect to RICOH ProcessDirector remotely and use XML-RPC calls in scripts, is deprecated and no longer\nsupported. We recommend using RICOH ProcessDirector web service API instead. For information about using web services, see Web services\nin RICOH ProcessDirector.\nAdditional updates include:\nAbility to save the View job in workflow image\nAdded the StepChainDemo workflow to illustrate the use of step chains\nUpdated prerequisites for the Preprinted Forms Replacement feature, so customers with the AFP Support Feature can install Preprinted Forms\nReplacement without also installing PDF Document Support.\nUsability updates for the Migration Assistant\nNew functions and updates in Version 3.12\nPrimary database options now available\nAfter many years of supporting only one database, RICOH ProcessDirector can now run with PostgreSQL as its primary database. While IBM\nDB2 is still supported in the same configuration as it has been, PostgreSQL is now the default database configuration. Existing customers can\nupgrade to version 3.12 and continue to use DB2 with no interruptions, or can choose to migrate their data to a PostgreSQL database.\nNote: To migrate data from DB2 to PostgreSQL, you must install RICOH ProcessDirector version 3.12 on a different computer. You cannot\ninstall the PostgreSQL configuration on the same system as an existing DB2 configuration.\nThe PostgreSQL database is installed in a Docker container, so Docker Engine must be installed on the primary computer.\nMigration simplified\nOne of the most challenging aspects of moving to a new version of an application is ensuring that everything still works. Especially when the\nupgrade requires moving to a new system, it is challenging to know that you have copied everything that needs to be there. The RICOH\nProcessDirector Migration Assistant now makes the process much easier.\nInstall the base product on a new system, then log in and start the Migration Assistant. Use the Assistant to connect to your existing\ninstallation, choose the objects and settings to migrate to the new one, and let the Assistant do the work. The Migration Assistant can handle\nmoving data from an existing DB2 database to PostgreSQL, and can even work across operating systems.\nRICOH ProcessDirector for AIX replacement\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:21 PM New in this release - Jenski - Test portal- RPD Linux\nIn version 3.12, RICOH ProcessDirector for AIX has been discontinued. Customers running on AIX can continue to use the application until the\nend of support date. Alternately, they can migrate to version 3.12 on Linux or Windows and use the Migration Assistant to port their data to a\nnew system.\nNew Supported Printers\nRICOH ProcessDirector now supports printer models with the new Fiery® N-series Controller Digital Front Ends, based on Fiery and Ricoh\ntechnology. You can define these new printer models as Ricoh PDF printers:\nRICOH Pro C7500\nRICOH Pro C9500\nUpdated operating system support\nYou can now install RICOH ProcessDirector on these operating system versions:\nRocky Linux 8.4 through latest 8.X\nRocky Linux 9.0 through latest 9.X\nNote: You can only install the PostgreSQL configuration on these operating systems. IBM DB2 is not supported on Rocky Linux.\nRelease notes for prior versions of RICOH ProcessDirector are available on the RICOH Software Information Center here: Release notes: RICOH\nProcessDirector\nParent topic: Overview\n4 of 4"}]}