{"doc_name": "aiw_m_CompileObjectList.pdf", "doc_path": "data/raw/RPD-en-US/aiw_m_CompileObjectList.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1985, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Compiling a list of objects and their properties - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Compiling a list of objects and their properties\nCompiling a list of objects and their properties\nYou can compile a list of objects and the properties that define their characteristics. To compile the list, you export the entries in an object table\nto a Comma-Separated Values (CSV) file.\nThis action supports all object types for the base product, its features, and its extended features. Examples in the base product include input\ndevices, printers, jobs, media, locations, users, and groups. Examples in features include barcode readers and inserter controllers.\nThe list contains entries only for objects that match all the filters that are set. For example, you type New York in the filter field of the\nLocations table. The list contains only entries for locations with New York in the value of one or more properties that are included as columns in\nthe table.\nThe list contains all the properties shown in the object table. You can add properties to or remove them from the table. For more information\nabout changing table columns, refer to the help system.\nTo compile a list of objects and their properties:\n1. Display the object table:\nClick the Main tab.\nEach portlet for an object contains an object table.\nClick the Administration tab.\nSelect the object type.\n2. Make sure that the table includes the objects and properties that you want to compile.\nRICOH ProcessDirector compiles the list using only the objects and properties displayed in the table. To add or remove objects, adjust the\nfilters that you set. To add or remove properties, change the table columns.\n3. Click the button in the top right corner of the table and select Export table to CSV.\n4. Click OK.\nRICOH ProcessDirector exports the objects in the table as entries in a CSV file. The entries are sorted by object name.\nParent topic: Managing system objects\n1 of 1"}]}