{"doc_name": "aiw_sdk_batchmeth.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_batchmeth.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4496, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Batching methods - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods\nBatching methods\nThe way that hot folder and SFTP input devices submit jobs is determined by the Batching method property of the input device.\nBy default, using any batching method except None causes an input device to create jobs as groups that use the parent/child structure. A parent\njob contains no data; it is a container that maintains the relationship between other jobs. Those jobs are child jobs. Each input file that a batching\nmethod includes in a group becomes a child job.\nNote:\nIf you set the Create .zip file property of an input device to Yes, the input device does not create groups of jobs that use the parent/child\nstructure. Instead, the input device gathers all the input files in the group and creates a ZIP file to hold them. The ZIP file is submitted as\na single job. You must have a step in the workflow that unzips the file unless the other steps can process a file in ZIP file format.\nYou can submit all the input files in an input device with the Batch all action on the input device as long as the Batching method is not\nJDF or Pattern. The Batch all action does not wait for the Polling interval to be reached before creating the jobs.\nIn this section:\nBatch\nWhen the batching method is Batch, the input device submits one or more files as a group, based on the files that an operator selects.\nJDF\nWhen the batching method is JDF, the hot folder or SFTP input device submits one or more files as a group, based on the contents of the job\nticket.\nList\nWhen the batching method is List, the hot folder or SFTP input device submits one or more files as a group, based on the contents of a list file\nthat is received by the input device.\nNone\nWhen the batching method is None, the hot folder or SFTP input device submits every file as a separate print job.\nNumber\nWhen the batching method is Number, the hot folder or SFTP input device submits a specific number of files as a group. Only files that match\nthe Data patterns property of the hot folder or SFTP input device are counted and submitted.\nNumber of sets\nWhen the batching method is Number of sets, the hot folder or SFTP input device submits one or more jobs after a specific number of sets of\nfiles are received. Only complete sets of files are counted and submitted.\nPages\nWhen the batching method is Pages, the hot folder or SFTP input device submits one or more PDF files as a group, based on the number of\npages in the files that are received by the input device. This method is only valid for PDF files.\nPages in sets\nWhen the batching method is Pages in sets, the hot folder or SFTP input device submits one or more jobs after a set of PDF files with a specified\npage count is received by the in put device. This method is only valid for PDF files.\nPattern\nWhen the batching method is Pattern, the hot folder or SFTP input device copies one print file and its related files to the spool file directory for\nthe job as soon as it has all the required files. All these files must match the values set for the Data patterns property and the properties on the\nBatching tab of the input device properties notebook.\nSets by time\nWhen the batching method is Sets by time, the hot folder or SFTP input device submits one or more jobs containing complete sets of files that\narrive within a specified time period. The time period is determined by the values set for the Batching start date, Batching start time, Batching\ninterval, and Batching date or Frequency properties.\nTime\nWhen the batching method is Time, the hot folder or SFTP input device submits one or more files as a group. Only files that match the Data\npatterns property and that arrive during the time period determined by the values set for the Batching start date, Batching start time, Batching\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Batching methods - Jenski - Test portal- RPD Linux\ninterval, and Batching date or Frequency properties are submitted.\nOverrides files\nWhen you create a workflow, you can set default values for many job properties. However, those default values might not be appropriate for\nevery job. If you want to send different values with a print job, you can use an overrides file.\nList files\nYou can use list files to process multiple files with or without a JDF job ticket or to process overrides files with files.\nParent topic: Preparing to submit batch jobs\n2 of 2"}]}