{"doc_name": "aiw_c_addingsteps_encryptPDF.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_addingsteps_encryptPDF.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2867, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Adding steps to encrypt PDF files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Adding steps to encrypt PDF files\nAdding steps to encrypt PDF files\nYou can add steps to your workflow that add password protection to PDF files and that restrict the actions that can be done to the PDF files.\nFor example, you might need to send a sample of a job to your customer. If the job contains sensitive data, you can add a step based on the\nEncryptPDF step template to encrypt the sample before you send it.\nWhen you encrypt a PDF file, you can specify one or two passwords. The Permissions password is the master password and is required on the\nstep.\nThe Document open password is a more limited password. It unlocks the file so that it can be read, but not edited in any way. This password is\nonly needed to provide a read-only version of the PDF.\nIf the file does not contain secure information, you can encrypt it so that it can be opened without a password, but require the Permissions\npassword for editing functions.\nTo add steps to encrypt PDF files:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Add the EncryptPDF step to process the PDF files.\nMost workflow steps cannot process encrypted PDF files. Choose where you place this step carefully to prevent a workflow error. For\nexample, if you are delivering an encrypted PDF file as a final document, you should place the step as close to the end of the workflow as\npossible. If you are sending the encrypted PDF file as a preview to the customer, it can be placed earlier in the workflow.\n5. Enter the Permissions password for the file and select a Password-protected actions level.\n6. If the Password-protected actions level is set to Edit, Fill, Read and you want to provide a read-only version of the file, enter a value for the\nDocument open password property.\nIf the Password-protected actions level is set to Edit or Edit, Fill, leave the Document open password property blank.\n7. If the remaining steps in the workflow do not need to open the PDF file, you can use the default value for the Encrypted PDF file property.\nThe job default, ${JobID.print.pdf}, replaces the spool file for the job. To keep the unencrypted version of the file in the spool\ndirectory for further processing, specify a different value for the Encrypted PDF file property, such as:\n${getFileName(encrypted,pdf,write)}\n8. Save and enable the workflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}