{"doc_name": "ppfrsample_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_o_featov.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5856, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Preprinted Forms Replacement - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Preprinted Forms Replacement\nPreprinted Forms Replacement\nThe Preprinted Forms Replacement feature lets you print jobs on plain paper that previously required preprinted forms. You update the definition\nof each media object for the media requested by these jobs to include the electronic equivalent of the preprinted form data. The application that\nsubmits the print files to RICOH ProcessDirector can continue to specify the media for the jobs in the same way.\nFor each of your preprinted forms, you associate a PDF page representing the electronic equivalent of the preprinted data with each side of a\nmedia object. The incoming job requests the media for the job or for selected pages in the job by name. A step in the workflow combines the\nPDF page data with the job data to create a print file that you can print on plain paper.\nThe electronic form properties of media objects are used only when jobs go through the step that combines the electronic forms with the job\ndata. You can use the same media objects to print jobs on preprinted forms when jobs do not go through that step.\nYou can process jobs that are ready to use electronic forms and jobs that are not ready in one workflow by sending them through two branches:\nThe jobs that are ready to use electronic forms go through a branch with the step that combines electronic forms with job data.\nThe jobs that are not ready go through a branch without the step.\nThe branches check a job property, such as Custom 1. You assign the property one value for jobs that are ready to use electronic forms and\nanother value for jobs that are not ready.\nUsing branches in your workflow, you can use electronic forms to reduce or eliminate your inventory of preprinted forms at your own pace. For\nexample, you can select the preprinted form that you are about to reorder or the most expensive preprinted form to move to electronic forms\nfirst.\nPrerequisites\nThe Preprinted Forms Replacement feature requires the PDF Document Support or the AFP Support feature. If you install the AFP Support feature,\nthe Preprinted Forms Replacement feature also lets you insert PDF forms into AFP jobs.\nStep templates\nPreprinted Forms Replacement provides the CombinePDFWithForm and CombineAFPWithForm step templates. Steps based on these step\ntemplates combine electronic forms with data in PDF or AFP files respectively.\nNote:\nThe CombineAFPWithForm step template is available when the Preprinted Forms Replacement and AFP Support features are installed.\nElectronic Form properties for media objects\nTo define electronic forms for a media object, you use the Electronic Form section of the media properties notebook.\nThe Front of form and Back of form properties let you create an electronic form from a page in a PDF file. You can create an electronic form for\nthe front side of the media, the back side, or both. When the CombinePDFWithForm or CombineAFPWithForm step processes jobs or pages that\nrequest media with values for these properties, the step combines the forms with the data.\nThe Media name for printing property tells RICOH ProcessDirector the media name to use to schedule the job and to print the job or pages that\nrequest the media. The property values give you these choices:\nReplace the name of the media requested for the job with a new name.\nKeep the original name.\nRemove the name so that the printer default media is used.\nThe Media name for printing property values let you implement Preprinted Forms Replacement in your printing operation without retraining your\noperators or changing the data exchanged with other applications. For example:\nThe Form1240 media object was created for a preprinted form on white paper. After you attach electronic forms to the media object, you want\nthe CombinePDFWithForm or CombineAFPWithForm step to remove the media name Form1240 when jobs or pages request Form1240 media.\nYou set the value of the Media name for printing property to None. RICOH ProcessDirector prints the jobs or pages on the paper that is set as\nthe default media on the printer.\nThe Form1400 media object was created for a preprinted form on blue paper. After you attach electronic forms to the media object, you want\nthe step to replace the media name Form1400 with Letter Blue when jobs or pages request Form1400 media. You set the value of the Media\nname for printing property to Selected and then select Letter Blue. RICOH ProcessDirector prints the jobs or pages on Letter Blue paper.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM Preprinted Forms Replacement - Jenski - Test portal- RPD Linux\nThe Form 2010 media object was created for a preprinted form on high-quality bond paper. After you attach electronic forms to the media\nobject, you want the step to keep Form 2010 as the media name when jobs or pages request Form 2010 media.\nYou set the value of the Media name for printing property to Current name. Form 2010 remains a media name in the printer catalog. Operators\nload high-quality bond paper (without preprinted data) for jobs that request Form 2010 media.\nWhen you choose a value for the Media name for printing property, take your Management Information System (MIS) reporting needs into\naccount. Consider how you want to track and charge for the media.\nIn this section:\nUsage scenario for printing jobs on plain paper instead of preprinted paper\nIn this scenario, a printing company wants to replace their preprinted paper with electronic forms that print on plain paper. They want to make\nthe replacements on a client-by-client basis, and they start by replacing the preprinted paper for Client A. They continue to print the jobs for all\ntheir other clients on preprinted paper.\nParent topic: Document processing features\n2 of 2"}]}