{"doc_name": "aiw_gmc_settingupjobtypesforprintnet.pdf", "doc_path": "data/raw/RPD-en-US/aiw_gmc_settingupjobtypesforprintnet.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2919, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Defining a workflow to send AFP jobs to Quadient Inspire Designer - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Quadient Inspire Connect feature / Configuring to work with Quadient Inspire Designer for AFP print jobs\n/ Defining a workflow to send AFP jobs to Quadient Inspire Designer\nDefining a workflow to send AFP jobs to Quadient Inspire Designer\nCopy and customize one of the AFP workflows to create a workflow that sends jobs to Quadient Inspire Designer.\nThese AFP workflows are available when the Quadient Inspire Connect and AFP Support features are installed. These workflows include:\nComposeAFPDataRetrieved\nUse this workflow when you want to send a WFD file and one or more raw data files to Quadient Inspire Designer and generate new AFP files\nas part of your workflow and you want to store the data files in an external location.\nThis workflow expects you to submit the WFD file listed in the ComposeAFP step template. The workflow creates an overrides file from the\nvalues of the Data files and Data modules properties. Data files are not submitted as part of the job; the workflow expects to find the files in\nthe locations listed in the overrides file.\nComposeAFPDataSubmitted\nUse this workflow when you want to send a WFD file and one raw data file to Quadient Inspire Designer and generate new AFP files as part of\nyour workflow and you want to submit the data file as part of the print job.\nThis workflow expects you to submit a WFD file and the data file.\nNote:\nYou can only submit one data file as part of a print job. If the job requires more than one data file, you must store the data files in\nanother location and use the ComposeAFPDataRetrieved workflow instead.\nReformatAFP\nUse this workflow when you have an existing AFP file that you want to send to Quadient Inspire Designer to be reformatted or otherwise\nmodified.\nThis workflow expects you to submit a WFD file and, optionally, an existing AFP file.\nTo define a workflow to send jobs to Quadient Inspire Designer:\n1. Click the Workflow tab.\n2. Right-click the appropriate workflow from the list and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Find the ComposeAFP step template:\nIf you copied the supplied ComposeAFP step template and renamed it, delete ComposeAFP and add your new step template to the\nworkflow.\nIf you modified the supplied ComposeAFP step template without copying it, delete this version of ComposeAFP and add the modified\nversion to the workflow.\n5. Right-click the ComposeAPF step and select Properties to display the job default values. Update any values that are different for this\nworkflow.\n6. Click OK.\n7. Add and update any other step templates that the workflow requires.\n8. Save and enable the workflow.\nParent topic: Configuring to work with Quadient Inspire Designer for AFP print jobs\n1 of 1"}]}