{"doc_name": "aiw_ConfigVC60000.pdf", "doc_path": "data/raw/RPD-en-US/aiw_ConfigVC60000.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4652, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Configuring to send jobs to a printer that uses RICOH TotalFlow Print server - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Configuring to send jobs to a printer that uses RICOH TotalFlow Print server\nConfiguring to send jobs to a printer that uses RICOH TotalFlow Print server\nSending print jobs to a Ricoh TotalFlow printer requires specific configuration steps on the printer and in RICOH ProcessDirector.\nA printer that uses RICOH TotalFlow Print server can receive various types of print jobs. The type of job you plan to send determines the type of\nprinter object that you create in RICOH ProcessDirector and the configuration settings that you use on the printer itself.\nData Stream Printer/Control Unit RICOH ProcessDirector Printer Type\nAFP Any AFP\nPDF VC40000, VC60000, or VC70000 RICOH TotalFlow\nRICOH Cutsheet printer that is supported by RICOH PDF Printer\nRICOH ProcessDirector\nNote:\nSee Supported RICOH printers to\nmake sure the printer is supported.\nRICOH Cutsheet printer that is not in the RICOH TotalFlow\nsupported printer list\nOther Any Passthrough\nPDF jobs can be controlled either using RICOH ProcessDirector or at the printer using TotalFlow Print Server.\nWhen RICOH ProcessDirector is set up to control the printer, the PDF jobs are sent to the printer and printed in the order in which RICOH\nProcessDirector sent them.\nWhen TotalFlow Print Server is set up to control the printer, RICOH ProcessDirector spools the PDF jobs to the printer. The operator uses the\nTotalFlow Print Server console to release the jobs to the printer.\nIn this case, the job remains in the Spooled at printer state in RICOH ProcessDirector. If a user moves the job from the Active Jobs state to the\nInactive Jobs state on the printer console or deletes the job from the printer, RICOH ProcessDirector changes the state of the job to Status\nchanged on printer. An operator can use the Print again or Restart step action to send the job to the printer again. Or, if the job printed\nsuccessfully, the operator can use the Go to next step action, to continue processing the job through the workflow.\nIf RICOH ProcessDirector is restarted when jobs are in the Spooled at printer state, RICOH ProcessDirector changes the state of the jobs to Error.\nThe jobs might have already printed.\nIf the Merge banner pages into PDF print file property is set to No, the header page, PDF job, and trailer page are spooled at the printer as\nseparate files. The printer could print the files out of sequence. To avoid this problem, set the property to Yes, do not print banner pages, or\nmove the files at the same time. For example, move the files to the Inactive Jobs state or the Active Jobs state at the same time.\nIn this section:\nSetting up a RICOH TotalFlow Print server to connect with RICOH ProcessDirector\nDefining a Ricoh PDF printer to send jobs to RICOH TotalFlow Print server\nDefine a Ricoh PDF printer to represent a cut sheet printer that has the RICOH TotalFlow Print server console and is on the list of supported\nprinters.\nDefining a Ricoh TotalFlow printer to send jobs to RICOH TotalFlow Print server\nDefine a Ricoh TotalFlow printer to represent a Ricoh Pro VC40000, Ricoh Pro VC60000, Ricoh Pro VC70000, or a Ricoh cut sheet printer that\nuses RICOH TotalFlow Print server, but that is not in the supported printers list for Ricoh PDF printers.\nDefining an AFP Printer to send jobs to RICOH TotalFlow Print server\nDefine an AFP printer that uses a RICOH TotalFlow Print server.\nSending other types of jobs to a printer that uses RICOH TotalFlow Print server\nTo send other types of jobs, such as PostScript, to a printer that uses RICOH TotalFlow Print server, you can either copy the jobs to a printer hot\nfolder or use an LPR command.\nConfiguring media for a Ricoh TotalFlow printer\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Configuring to send jobs to a printer that uses RICOH TotalFlow Print server - Jenski - Test portal- RPD Linux\nRICOH ProcessDirector can detect the paper that is loaded on a Ricoh TotalFlow printer and can be configured to create media objects\nautomatically to represent that paper. Then, it can use media as a scheduling criteria and only schedule jobs to the printer when the correct\npaper is loaded. However, you must do more configuration to make sure that the media names are the same on the printer and in RICOH\nProcessDirector.\nConfiguring SNMP for printers\nSimple Network Management Protocol (SNMP) can be used by RICOH ProcessDirector to connect to a printer. RICOH ProcessDirector supports\nthe following versions: SNMP v1 and SNMP v3.\nParent topic: Defining printer objects\n2 of 2"}]}