{"doc_name": "tt_o_ReconcileMethods.pdf", "doc_path": "data/raw/RPD-en-US/tt_o_ReconcileMethods.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2785, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Automated Verification reconciliation methods - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Automated Verification / Automated Verification reconciliation methods\nAutomated Verification reconciliation methods\nDuring reconciliation, the system determines which documents in the job need to be reprinted because their barcodes were not read. The value\nof the Automatic reconciliation property tells the system whether to reconcile documents automatically, or manually with operator control.\nWhen the administrator configures workflows for Automated Verification, the administrator selects the reconciliation method in the step based\non the Reconcile step template. An operator can change the reconciliation method for a particular job by editing the job's properties and\nchanging the value in the Automatic reconciliation property.\nThe reconciliation methods are:\nAutomatic reconciliation\nWhen a job completes the ReadBarcodeData step, RICOH ProcessDirector automatically reconciles the documents in the job and reprints any\ndocuments whose barcodes were not read.\nNote:\nOperator action is required if the documents to be reprinted exceed the percentage allowed for the job in the Maximum documents\nto reprint % property. Operator action is also required if any duplicate barcodes are read in the job. In this case, the job enters the\nWaiting to reconcile state and the Reconcile action must be performed to set a disposition for each document that has a Duplicate\nstatus.\nManual reconciliation\nWhen a job completes the ReadBarcodeData step, the operator must select the Reconcile action to start manual reconciliation for the job.\nThen the operator uses the Reconcile Job page of the RICOH ProcessDirector user interface to select an action for each document in the job.\nThe Reconcile Job page shows the status of each document and the initial action that RICOH ProcessDirector has determined for each\ndocument, based on the Document status property selected on the ReadBarcodeData step.\nNote:\nThe table on the Reconcile Job page has columns for the Document status 1 and Document status 2 properties. To add another\ndocument status property, edit the columns to add the Document status 3, Document status 4, or Document status 5 property to\nthe table.\nThe operator can request one of these actions for each document:\nOK\nDocument is not reprinted.\nPull\nDocument is marked pulled (removed from the job) in the database and is not reprinted.\nReprint\nDocument is reprinted.\nNote:\nTo reprint additional documents after reconciliation, you can use the Create Job action on the Documents portlet on the Main page to\ncreate a new job to process selected documents.\nParent topic: Automated Verification\n1 of 1"}]}