{"doc_name": "addingwsafpfiles.pdf", "doc_path": "data/raw/RPD-en-US/addingwsafpfiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2057, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Adding content to white space in AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Adding content to white space in AFP files\nAdding content to white space in AFP files\nWhitespace Manager can find areas of available white space in AFP files and then fill the white space with content, such as images or text.\nYou can define white space in AFP files by choosing known white space on a page or by searching for the first available white space in a page\ngroup. You can also modify or delete any white space definitions you have created. After white space is defined, you can assign image and text\ncontent to the white space areas by creating rules that determine what content is assigned and under what conditions it is assigned.\nIn this section:\nCreating definitions for known white space\nYou can create a definition for white space that you know exists on the same page in all page groups.\nCreating definitions by searching for white space\nWhen you do not know where white space exists, you can search for the first available white space in a page group and create a definition.\nWhitespace Manager searches for the largest white space area on a page that meets the minimum dimensions specified.\nModifying or deleting white space definitions\nAfter you define white space areas in an AFP file, you can modify or delete any of the definitions.\nAssigning content to white space\nYou can assign image and text content to defined white space areas by creating rules that determine what content is assigned and under what\nconditions it is assigned.\nAdding steps to fill white space in AFP files\nAfter you define white space in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more workflows to fill the white\nspace with content in production AFP files that use the workflows. The step names the Visual Workbench control file that contains the\ndefinitions for the white space.\nParent topic: Working with sample AFP files\n1 of 1"}]}