{"doc_name": "pagegroups_overview.pdf", "doc_path": "data/raw/RPD-en-US/pagegroups_overview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2363, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Page groups - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP support for documents / RICOH Visual Workbench / AFP Indexer / Page groups\nPage groups\nAFP Indexer lets you organize a large AFP file into smaller, uniquely identifiable units, called page groups.\nYou can create page groups in these ways:\nYou can create page groups that have a fixed number of pages. For example, each page group can be three pages long. You can also exclude a\ncertain number of pages at the beginning of the AFP file from the page groups. For example, if the AFP file contains two pages of introductory\ninformation, AFP Indexer can skip the first two pages and create the first page group on the third page.\nYou can use triggers to define the page groups. A trigger is a block of text in the AFP file that occurs in a consistent location on the first page\nof all page groups and can contain the same text. As an option, you can also use triggers to indicate the end of page groups. For example, the\nblock of text that indicates the start of the page group might contain the text “Page 1” and the block of text that indicates the end of the page\ngroup might contain the text “Page 3”. If necessary, you can use multiple triggers to uniquely identify a new page group.\nFor example, a bank-statement application produces a file with hundreds of individual customer statements. Each statement has the same\ngeneral format, although statements might vary in size or number of pages. Each statement contains the page number, an account number, a\ndate, and the customer's address. With AFP Indexer, you create triggers that define the group boundaries in the file; in this example, one trigger\ncould be the text “Page 1” that occurs on the first page of every statement and another trigger could be the text “Account Summary” that\noccurs on the last page of every statement.\nIf you create page groups using triggers or if you create page groups of fixed length, all existing page groups and index tags that are defined in\nthe AFP file itself are ignored.\nYou can define which pages are used for header and trailer pages. AFP Indexer creates the first page group after the defined number of header\npages. It creates the final page group before the defined number of trailer pages.\nParent topic: AFP Indexer\n1 of 1"}]}