{"doc_name": "pref_c_RunPrefManageOutputWF.pdf", "doc_path": "data/raw/RPD-en-US/pref_c_RunPrefManageOutputWF.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3034, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Running the sample workflow for managing output preferences - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Preference Management feature / Running the sample workflow for managing output preferences\nRunning the sample workflow for managing output preferences\nThe PreferencesSample workflow for applying processing preferences to jobs illustrates how to use a preferences file to control multichannel\ndelivery. The PreferencesSample workflow creates three child jobs each of which processes documents differently based on the value of the\nOutput type property.\nThe sample objects and files used in this workflow include:\nWorkflow: PreferencesSample\nSample input device: PreferencesFolder\nSample document property mapping object: DocumentDelimitedSample\nSample PDF file: /aiw/aiw1/testfiles/DemoPref.pdf\nSample PDF file:\nSample PDF control file: /aiw/aiw1/testfiles/DemoPref.ctl\nSample PDF control file:\nSample preferences file: /aiw/aiw1/testfiles/pref/preferences.csv\nSample preferences file:\nThis sample workflow includes an ApplyPreferences step. The ApplyPreferences step uses the DocumentDelimitedSample document property\nmapping object to map values from the preferences file to values in the document properties file. These values are then used to determine which\noutput method is used for each document. One of the properties set by the ApplyPreferences step is the Output type property for each\ndocument.\nThe GroupDocuments step organizes the documents based on the Output type property. Based on the groupings identified, the\nCreateJobsFromDocuments step generates child jobs. The child jobs are resubmitted to the original workflow and follow the child job branch out\nof the SetJobPropsfromTextFile step. The child jobs move through their respective print, email, and suppression branches until processing is\nfinished and all of the jobs, the parent job and both child jobs, are completed.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Printers portlet, right-click the Sample printer and select Enable.\n3. In the Input Devices portlet, right-click the PreferencesFolder hot folder input device and select Enable and Connect.\n4. The parent job waits in the WaitForRelatedJobs step until all the child jobs reach the same step and then finishes.\nThe child jobs for Print and Suppress also process as far as the WaitForRelatedJobs step. The Email child job stops at the CheckEmailSettings\nstep, and goes into the Manual, working state. If you configured RICOH ProcessDirector to send email using an SMTP server, use the\nManual complete action to move the child job to the next step.\nIf you have not configured RICOH ProcessDirector to send email, you can delete the child job from the Jobs table and let the rest of the job\ncomplete.\nYou can see the parent job and the child jobs in the Jobs table. You can select the separate child jobs and click View to see the documents\nproduced by each child job.\nParent topic: Setting up the Preference Management feature\n1 of 1"}]}