{"doc_name": "aiwsecondaryservers.pdf", "doc_path": "data/raw/RPD-en-US/aiwsecondaryservers.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3375, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Secondary servers - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Secondary servers\nSecondary servers\nSecondary servers let you distribute processing, so that your RICOH ProcessDirector system runs more efficiently.\nYou can use secondary servers to do some of the more processing-intensive steps in your various workflows and to prevent the primary server\nfrom becoming overloaded. The primary server works with the secondary servers to coordinate the movement of all jobs across the system. The\nsecondary servers do not have their own embedded databases for storing system information. All the servers work with the database that is\ninstalled on the primary computer.\nRICOH ProcessDirector supports different types of secondary servers:\nLocal secondary servers\nCreated directly on the primary computer. Require minimal configuration.\nRemote secondary servers\nCreated on a Linux computer that is separate from the primary computer. You must install a Secondary Server feature on the remote\ncomputer and set up communication between the secondary server and the primary server.\nContainer secondary servers\nCreated either on the Linux primary computer or on a Linux computer that is separate from the primary computer. You must install Docker\nEngine 19.03 or above on the computer that will host the container secondary server. On a remote computer, you must also set up\ncommunication between the secondary server and the primary server. In addition, you might need to install a Secondary Server feature.\nThen, you create the container secondary server in RICOH ProcessDirector. Creating the server loads an image into a Docker container on the\ncomputer. The image contains a Linux operating system and everything needed to run a RICOH ProcessDirector secondary server.\nSecondary servers can manage all types of RICOH ProcessDirector objects, such as input devices, steps, and printers. They can also run external\nprograms that RICOH ProcessDirector accesses through external steps. External programs can do more processing or special types of processing.\nFor installations that have many printers and a high volume of jobs, adding secondary servers to the system can increase job throughput. The\nthroughput increases because each server has a smaller number of printers and jobs to monitor and control.\nFor AFP printers, you can set up secondary servers to stage work to the remote server so that RICOH ProcessDirector keeps the pipeline to the\nprinter full, reducing the likelihood that the printer waits for data. This configuration is particularly useful if you installed RICOH ProcessDirector\non an externally hosted or distributed network, such as a virtualized or cloud environment that is far removed from the physical printers.\nProperties of the AFP printer object allow you to specify a directory on the secondary server to receive the print files. The secondary server then\nmanages releasing jobs to the AFP printer when the printer needs work.\nYou can create secondary servers on the primary computer or install the Secondary Server feature on these systems:\nRed Hat 8.1 through latest 8.X\nRed Hat 9.2 through latest 9.X\nRocky Linux 8.4 through latest 8.X\nRocky Linux 9.0 through latest 9.X\nSUSE Linux Enterprise Server (SLES) 12.0 with Service Pack 4 or above for x86_64\nParent topic: System objects\n1 of 1"}]}