{"doc_name": "aiw00o36.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o36.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2344, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Workflows - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Workflows\nWorkflows\nA workflow defines a set of steps that a job follows through the system. A printing process can contain one or more workflows, depending on\nthe type of processing required and the configuration of your system.\nA job is an input file that RICOH ProcessDirector has accepted and submitted for processing.\nA workflow can contain linear or conditional processing. In linear processing, each step receives a job from one step and sends the job to one\nstep. In conditional processing, each step receives a job from one or more steps and sends the job to one or more steps. RICOH ProcessDirector\nuses conditional processing rules to determine which step to send each job to.\nWhen you create a workflow, you specify what steps the job passes through during processing, you place the steps in phases, and you make\nconnections between them. You also set values for job properties, such as customer name and due date, to be used when processing jobs. In\nconditional workflows, you create rules by specifying conditions, and you assign the rules to the connectors from a step to steps in different\nbranches of the workflow.\nIf you use the same set of connected steps in many of your workflows, you can create a step chain with those steps to use in your workflows.\nWhen you drag a step chain into one of the processing phases of another workflow, the steps from the step chain you added are copied into the\nphase where you dropped the step chain. The step chain appears as a single step in the workflow with a number as its icon, indicating how\nmany steps are contained in the step chain. Changes to the steps in the current workflow do not apply to the step chain that was dropped in.\nChanges made to a step chain outside of the workflow are not applied to the step chains placed in the workflows.\nThe default processing phases in the base product are:\nReceive\nPrepare\nPrint\nComplete\nFeatures can add other phases, such as Assemble and Insert.\nImportant:\nWhen you use the Workflow Editor to edit a job type created in a previous version of RICOH ProcessDirector, the job type becomes a\nworkflow. It can no longer be opened on the Administration page by clicking Workflow ⇒ Job Types.\nParent topic: System objects\n1 of 1"}]}