{"doc_name": "modifyingtext.pdf", "doc_path": "data/raw/RPD-en-US/modifyingtext.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3380, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying content text - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Adding content to white space in AFP files\n/ Assigning content to white space / Modifying content text\nModifying content text\nYou can modify the text you have defined for white space content.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo modify text you have defined in content:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the white space definitions.\n2. Click Mode ⇒ Whitespace Manager.\n3. Click Tools ⇒ Manage Campaigns.\nYou see the Manage Campaigns window.\n4. Select a rule from the list in the top pane of the window.\n5. Select text content from the drop-down list.\n6. Click Edit in the Content section.\nYou see the Modify Text window.\n7. Optional: On the Text tab, change data in the Text string data section, change the color in the Color drop-down list, or both.\nTo edit the text string, select a line of data and use Up or Down to change the order of the line or Remove to delete the line. You can also\nadd new values. Remember to add blank characters between words if you need to. For example, to change the text string from \"Page 1 of\n10\" to \"Page 1 for John Doe\":\n1. Press and hold the CTRL key, and then select of and Page Count.\n2. Click Remove.\n3. Type for in the Text field and click Add.\n4. Select an index tag that contains the customer name (such as John Doe) from the Index tag drop-down list and click Add.\nYou see the edited text string value in the field below the data fields.\n8. Optional: On the Font tab, select one of these:\nCore Fonts\nFrom the drop-down lists, select the character set and code page, and, if the font is an outline font, the point size in the Font\nInformation section.\nExternal Fonts\nType a character set and code page pair, a coded font name, or all three. For double-byte character set (DBCS) fonts, use the coded\nfont name only.\nNote:\nIf you enter a code page that is part of a DBCS-coded font, you see an error message that suggests you use the coded font\nname instead.\nYou see the Character Set Description and Font Resource fields change for the font you selected. Font Resource is \"Outline\" for core fonts\nand \"Raster\" for external fonts.\nNote:\nOn your workstation, if the font size does not exist for the color you selected, your display defaults to 12 black, even though the\nfinal AFP file will have the correct font and color.\nIf the character names do not match between a character set and code page, the job goes into an error state in RICOH\nProcessDirector and the printer issues an error. To correct the error, change the character set and code page to a valid pair and\nprocess the job again.\n9. Optional: On the Position tab, change the origin (top-left corner) of the text area. Specify the origin in inches or millimeters. Decimal values\n(such as 2.5) are allowed.\n10. Click OK.\nYou see the edited text.\n11. Optional: Click Preview to view how the text you specified is displayed in the defined white space.\nTo close the window, click the X in the upper right corner.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Modifying content text - Jenski - Test portal- RPD Linux\nParent topic: Assigning content to white space\n2 of 2"}]}