{"doc_name": "mail_c_configforpe.pdf", "doc_path": "data/raw/RPD-en-US/mail_c_configforpe.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2535, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Setting up the Postal Enablement feature - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Postal Enablement feature\nSetting up the Postal Enablement feature\nReview the overview topics related to Postal Enablement, then run the sample workflows to see how the supplied step templates and workflows\ncan work together. When you feel comfortable with the concepts, define one or more workflows to send jobs to your postal processing software\nand test them to make sure that they function correctly.\nIn this section:\nRunning the PrintAndMailJob sample workflow\nThe PrintAndMailJob sample workflow submits a PDF or AFP file for processing by Ricoh ProcessDirector and the Postal Enablement feature. The\nworkflow simulates sending the job to postal processing software to update addresses as needed and to replace a PostNet barcode with a\nDatamatrix barcode that identifies the job number and document number that can be used to track the progress of the document through other\nsteps in the workflow.\nRunning the sample workflows for qualified/non-qualified mail\nThe sample workflows for qualified and non-qualified mail include GroupDocsForPostalProcess, PrintForPostalProcess, and\nProcessQualifiedDocuments. By submitting the sample print job into the GroupDocsForPostalProcess workflow and simulating the results\nobtained from postal software, you can see three child jobs get created corresponding to different postal categories-- Qualified, Non-Qualified,\nand Other.\nCreating a workflow to exchange data with postal software\nYou can create a workflow, or a set of workflows, to extract mailing address data from the documents in a job and prepare the data for\nprocessing by external postal software. After the postal software verifies the addresses and improves their quality, the workflow can process\nresults received from the postal software to update the documents in the job.\nEnhancing PDF files for Postal Enablement\nTo process sample PDF files for Postal Enablement, use RICOH ProcessDirector Plug-in for Adobe Acrobat to enhance the files. The files must have\na page group, which identifies documents, and document properties required for the external postal software. The files might have other\nmarkup, such as a barcode that contains updated address data from the postal software.\nEnhancing AFP files for Postal Enablement\nMost AFP files that are submitted to RICOH ProcessDirector need to be enhanced before they can be processed for Postal Enablement.\nParent topic: Configuring\n1 of 1"}]}