{"doc_name": "copyingindexes.pdf", "doc_path": "data/raw/RPD-en-US/copyingindexes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2483, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Copying or moving page-level indexes to page groups - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Working with page-level indexes\n/ Copying or moving page-level indexes to page groups\nCopying or moving page-level indexes to page groups\nYou can copy or move all page-level index tags to a page group. Page-level index tags are found on a page in the AFP file, but at the page level\ninstead of the page-group level.\nYou can see what index tags are on a page by displaying the properties for the page. The name of an index tag and its value are listed in the TLE\nfield.\nTo copy or move page-level index tags so they are added to the page group:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. Select a page that is within a page group.\n3. Click Tools ⇒ Index Tools ⇒ Relocate Page Indexes to Page Groups.\nYou see the Copy Page Indexes to Page Group window. The Current Page field displays the page you selected in the page group.\n4. From the drop-down list, select which page-level index tags you want to add to the page group:\nThis page\nAdds all the page-level index tags from the current page to the page group. For example, if \"5\" is the current page, adds all the index\ntags from page 5 to the page group for each page group in the file that contains a page 5.\nThis and following pages\nAdds all the page-level index tags from the current page, and all pages that follow the current page, to the page group. For example,\nif \"3\" is the current page and \"5\" is the last page in the page group, all the index tags on page 3, page 4, and page 5 are added to\nthe page group for each page group in the file that contains those pages.\nLast page\nAdds all the page-level index tags from the last page to the page group.\n5. To move the page-level index tags to the page group, clear the Keep indexes in page field. Otherwise, the page-level index tags are copied\nto the page group.\n6. Click OK.\nIn the bottom pane, you see the index tags that have been added to the page groups.\n7. Optional: To remove the index tags that you added to a page group:\n1. Click Tools ⇒ Index Tools ⇒ Relocate Page Indexes to Page Groups.\nYou see the Copy Page Indexes to Page Group window with the selections you previously made.\n2. Click Delete.\nThe index tags are removed from the page group.\nParent topic: Working with page-level indexes\n1 of 1"}]}