{"doc_name": "slapolicyintervals.pdf", "doc_path": "data/raw/RPD-en-US/slapolicyintervals.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5847, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Checkpoint intervals - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Service policies / Checkpoint intervals\nCheckpoint intervals\nFor each checkpoint that the service policy defines, the service policy specifies a time interval. The interval is the amount of time that you expect\na job to take to complete a phase. The interval does not include estimated durations set for steps in the workflow.\nThe interval for each phase starts from the checkpoint start time, which is the same time for all intervals. The checkpoint start time is one of\nthese times:\nThe time that the last file for a job arrives in the system (the Job arrival time). If child jobs are created for the job, they have the same job arrival\ntime as the parent job.\nA start time set by RICOH ProcessDirector or by an authorized user (the Adjusted arrival time).\nA fixed start time specified in the service policy (the Service policy start time).\nBy default, the adjusted arrival time is the same as the job arrival time. RICOH ProcessDirector might set a new adjusted arrival time:\nWhen a job is assigned to a new workflow\nWhen a job enters a certain step\nWhen a job is split or commingled\nA service policy might specify a fixed start time if all jobs must be printed by a fixed time. For example, if all jobs must be printed by 10:00 the\nnext day, the service policy specifies a start time of 10:00 and an interval of 24 hours for the Print phase.\nWhen a service policy specifies a fixed start time, it can specify one of these adjustment methods. The Adjustment method tells RICOH\nProcessDirector how to adjust the checkpoint start time. The adjustment methods are:\nCutoff: The checkpoint start time depends on whether the adjusted arrival time is before or after the service policy start time. If the adjusted\narrival time is:\nBefore the service policy start time, the checkpoint start time is the service policy start time on the same day as the adjusted arrival time\nAfter the service policy start time, the checkpoint start time is the service policy start time on the next day\nIf the adjusted arrival time changes, the checkpoint start time might also change.\nStart: The checkpoint start time is the start time specified in the service policy on the same day as the adjusted arrival time.\nThis diagram shows how the checkpoint start time and the intervals for successive phases relate to each other. Notice that the interval for each\nphase starts from the same checkpoint start time, not from the end of the previous phase. Therefore, the interval for each phase includes the\ntime that it takes to complete all previous phases.\nCheckpoint start time <- Receive interval -> End of Receive phase\nCheckpoint start time <-- Prepare interval --> End of Receive + Prepare phases\nCheckpoint start time <--- Print interval ---> End of Receive + Prepare + Print phases\nCheckpoint start time <---- Complete interval ----> End of Receive + Prepare + Print + Complete phases\nNote: You can change the phase names to match the functions that you do in that phase better.\nThese examples show sample start times and intervals that a service policy might specify when using different adjustment methods.\nNo adjustment method: In this example, jobs must be printed 4 hours after the adjusted arrival time. Because the adjustment method is None,\nthe checkpoint start time is the same as the adjusted arrival time. If the adjusted arrival time has not been reset, it is the same as the time the job\narrived in the system.\nStart time: not specified\nAdjustment method: None\nInterval for Receive checkpoint: 20 minutes\nInterval for Prepare checkpoint: 2 hours\nInterval for Print checkpoint: 4 hours\nJob arrival time <- Receive interval = 20 minutes -> Job arrival + 20 minutes\nJob arrival time <--- Prepare interval = 2 hours ---> Job arrival + 2 hours\nJob arrival time <------ Print interval = 4 hours ------> Job arrival + 4 hours\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:24 PM Checkpoint intervals - Jenski - Test portal- RPD Linux\nCutoff adjustment method: In this example, jobs must be printed by 18:00 if the adjusted arrival time is before 10:00. Otherwise, the job must\nbe printed by 18:00 on the next day. Because the adjustment method is Cutoff, the checkpoint start time is the start time (10:00) on the same\nday as the adjusted arrival time or on the next day.\nStart time: 10:00\nAdjustment method: Cutoff\nInterval for Receive checkpoint: 20 minutes\nInterval for Prepare checkpoint: 4 hours\nInterval for Print checkpoint: 8 hours\n10:00 <- Receive interval = 20 minutes -> 10:20\n10:00 <------ Prepare interval = 4 hours ------> 14:00\n10:00 <------------ Print interval = 8 hours ------------> 18:00\nStart adjustment method: In this example, jobs must be printed by 16:00 on the day after the adjusted arrival time. Because the adjustment\nmethod is Start, the checkpoint start time is the start time (23:59) on the same day as the adjusted arrival time.\nStart time: 23:59\nAdjustment method: Start\nInterval for Receive checkpoint: 20 minutes\nInterval for Prepare checkpoint: 4 hours\nInterval for Print checkpoint: 16 hours\n23:59 <- Receive interval = 20 minutes -> 00:19\n23:59 <------ Prepare interval = 4 hours ------> 03:59\n23:59 <------------------ Print interval = 16 hours ------------------> 15:59\nNote: In these examples, each service policy defines a final checkpoint for the Print phase and intermediate checkpoints for the Receive\nand Prepare phases. The intermediate checkpoints let you find jobs that are late before they miss their final checkpoint. For example, if an\nerror (such as a transform error) occurs during the Prepare phase, RICOH ProcessDirector marks the job “late” when it misses the Prepare\ncheckpoint. If the operator corrects the error, the job might be able to complete printing on time.\nParent topic: Service policies\n2 of 2"}]}