{"doc_name": "pdfw_c_plugin_conditionaldef.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_conditionaldef.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2196, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Conditional processing - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / PDF Document Support / RICOH ProcessDirector Plug-in for Adobe Acrobat\n/ Conditional processing\nConditional processing\nWhen you add markup to a PDF file using RICOH ProcessDirector Plug-in for Adobe Acrobat, you can create conditional processing rules to place\nthe markup on specific pages.You also can use conditional processing rules to apply media and finishing options and to specify the pages from\nwhich RICOH ProcessDirector Plug-in for Adobe Acrobat and RICOH ProcessDirector extract document property values.\nRules can specify conditions based on pages within documents, such as All Front Pages, as well as on job properties, document properties,\nstatistics, and conditional triggers (text that determines whether a condition is met).\nFor example, you want the word Invoice at the top of the first page of a statement to trigger the placement of a barcode. First, you select the\nword Invoice and define it as a conditional trigger. Then you define a rule that specifies the conditional trigger. When you add a barcode to a PDF\nfile, you specify this rule to control placement of the barcode. The barcode only prints on the pages where the word Invoice appears in the\nlocation specified by the conditional trigger.\nYour RICOH ProcessDirector workflows can contain steps that set job property values during RICOH ProcessDirector processing. If you use RICOH\nProcessDirector Plug-in for Adobe Acrobat to define a rule with a job property, you can dynamically create and alter how the rule is applied by\nsetting the job property value in RICOH ProcessDirector. For example, you could use the Job.CustomerName job property to print a barcode only\nwhen the value of that property is BANK. RICOH ProcessDirector also keeps track of job processing statistics, such as the current page in a\ndocument. If you want to apply a barcode to page three in every document in a PDF job, you can make Stat.CurrentPageInDocument = 3 a\ncondition for the application of a rule.\nParent topic: RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}