{"doc_name": "vwb_barcodes_overview.pdf", "doc_path": "data/raw/RPD-en-US/vwb_barcodes_overview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3463, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Barcodes - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP Editor / Barcodes\nBarcodes\nA barcode is a pattern of elements (such as bars, spaces, and two-dimensional modules) that represent numeric or alphanumeric information in a\nmachine-readable form.\nThe way the elements of a barcode are arranged is called the barcode type, or symbology. The AFP Enhancer mode of RICOH Visual Workbench\nlets you create these types of barcodes:\nCode 39 (3-of-9 Code): A low-density barcode that can encode uppercase letters, numbers, and some special characters.\nData Matrix: A two-dimensional (2D) barcode that consists of black and white square modules arranged in either a square or rectangular\npattern. This barcode uses the Reed-Solomon error correction algorithm (ECC 200) to ensure data reliability.\nIntelligent Mail: A 4-state barcode that the United States Postal Service (USPS) defines to track and direct mail. Intelligent Mail barcodes (IMBs)\ncombine the capabilities of POSTNET and PLANET barcodes in one barcode.\nInterleaved 2-of-5: A high-density barcode that can encode numbers.\nPOSTal Numeric Encoding Technique (POSTNET): A barcode that the USPS defines to direct mail.\nQuick Response Code (QR Code): A two-dimensional (2D) matrix barcode that consists of black and white square modules arranged in a square\npattern. The contents of this barcode can be decoded at high speed. This barcode uses the Reed-Solomon error correction algorithm (ECC 200)\nto ensure data reliability.\nThe AFP Editor feature lets you create all the types of barcodes listed above and an additional type of barcode:\nPortable Data File 417 (PDF417): A two-dimensional (2D) barcode that consists of several rows, each of which is like a small linear barcode. The\nbarcode uses Reed-Solomon error correction.\nIn this section:\nBarcode placement and orientation\nWhen you use the RICOH Visual Workbench user interface to create a barcode in a sample AFP file, you define a barcode area. You specify the\norigin of the area, the size (height and width) of the area, and the location of the area in each document. The area can be a horizontal rectangle\n(for a “picket-fence” barcode), a vertical rectangle (for a “ladder” barcode), or a square.\nData for most types of barcodes\nAFP Enhancer and AFP Editor let you create Code 39, Data Matrix, Interleaved 2-of-5, PDF417 (AFP Editor only), POSTNET, and QR Code barcode\nobjects that follow the AFP Bar Code Content Object Architecture (BCOCA). AFP Enhancer and AFP Editor use the default values for all BCOCA\nproperties and display the default properties you can change.\nIntelligent Mail barcode data\nIntelligent Mail barcodes (IMBs) have several representations and two basic formats. A serial number that identifies each mailpiece is required\nwhen IMBs are used with the United States Postal Service (USPS) Intelligent Mail Full-Service option.\nPOSTNET to IMB replacement\nIntelligent Mail barcodes (IMBs) can replace both POSTNET and PLANET barcodes, as well as the alphanumeric characters that contain the\nparticipant code and keyline information for the USPS Address Change Service (ACS). AFP Editor provides a replace function that deletes\nPOSTNET barcodes and creates IMBs that contain the same routing code as in the replaced POSTNET barcodes (minus the check digit). POSTNET\nbarcodes and IMBs can be text barcodes or BCOCA objects.\nParent topic: AFP Editor\n1 of 1"}]}