{"doc_name": "ppfrsample_c_ModifyPDFwfForForms.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_c_ModifyPDFwfForForms.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5321, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Modifying a workflow to use electronic forms with PDF jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to use electronic forms / Modifying a workflow to use electronic forms with PDF jobs\nModifying a workflow to use electronic forms with PDF jobs\nYou can add a step based on the CombinePDFWithForm step template to a workflow to combine an electronic form with data for PDF jobs.\nBefore you add the step to the workflow, review the preprinted forms used to print jobs that the workflow processes. Add electronic forms to\nthe media objects for the preprinted forms that you want to print on plain paper. You do not have to define electronic forms for all the\npreprinted forms used by the workflow. You can define electronic forms only for the preprinted forms that you want to replace.\nTo modify a workflow to use electronic forms with PDF jobs:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Review the steps in the workflow and decide where you want to add the CombinePDFWithForm step.\nTo modify a simple workflow that processes PDF jobs, you could put a CombinePDFWithForm step after the OptimizePDF step and before\nthe CountPages step.\nTo modify a workflow that processes PDF jobs that contain documents, you could put a CombinePDFWithForm step after the\nBuildPDFFromDocuments step.\n5. Add the CombinePDFWithForm step to the workflow in the appropriate place.\n6. Unless you have special processing requirements, use the default values for the Combined PDF file and JDF output file properties of the\nstep.\nIf you specify other values, the combined PDF file does not become the current print file used by subsequent steps. Similarly, the JDF file\nproduced by the step does not become the JDF file used for subsequent steps.\n7. If you plan to use a printer that does not support Sides page exceptions in JDF job tickets, set the Simple sheet processing property to Insert\nblank back pages. If your printer can process Sides page exceptions, select Add Sides page exceptions to JDF, which will prevent any usage\ncharges your printer vendor might charge for blank back sides on duplex jobs.\n8. Optional: Add a branch that bypasses the CombinePDFWithForm step to process jobs that are not ready to use electronic forms. Jobs print\non preprinted forms when they go through that branch. When you add the branch, the same workflow can process the jobs that are ready\nto use electronic forms and the jobs that are not ready.\nTo send the jobs to different branches based on whether they use electronic forms, set a rule on one of the branches. For example, if you\nwant jobs with a Customer name of Acme or Pinnacle to use electronic forms, you could set this rule on the branch with the\nCombinePDFWithForm step:\nJob.CustomerName = 'Acme' OR Job.CustomerName = 'Pinnacle'\nJobs with a Customer name of Bank10 or Standard bypass the CombinePDFWithForm step and continue to print on preprinted forms.\n9. Save and enable the workflow.\n10. Test the workflow to make sure that it works properly.\nCheck the jobs that the CombinePDFWithForm step processes to make sure that they print on the media specified by the Media name for\nprinting property of the media object.\nWhen a media object includes a form for the back of the media, the CombinePDFWithForm step changes simplex jobs that require the media to\nduplex. For example, a simplex job has four pages. The PLE Media property specifies Form12 for page 3. The Form12 media object specifies an\nelectronic form for the back of the media.\nWhen the step processes the job:\nIt converts the job to duplex.\nIt adds three blank pages, one each after pages 1, 2, and 4.\nIt adds a page with the data for Form12 after page 3.\nWhen a media object includes a form for the back of the media and the JDF job ticket associated with the job specifies simplex for the job but\nincludes page exceptions for some duplex pages, the CombinePDFWithForm step changes simplex jobs that require the media to duplex. For\nexample, a simplex job has four pages. The PLE Media property specifies Form99 for pages 2 and 3. The Form99 media object specifies an\nelectronic form for the back of the media.\nWhen the step processes the job:\nIf the Simplex sheet processing property is set to Insert blank back pages, the step:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Modifying a workflow to use electronic forms with PDF jobs - Jenski - Test portal- RPD Linux\n1. Converts the job to duplex.\n2. Adds one blank page after page 1.\n3. Adds a page with the data for Form99 on the backs of pages 2 and 3.\nThe back of page 3 has the data from page 4 and the data for Form99.\nIf the Simplex sheet processing property is set to Add Sides page exceptions to JDF, the step:\n1. Does not change the Duplex property for the job from Simplex.\n2. Adds a new duplex side page exception for page 2 in the JDF.\n3. Adds a page with the data for Form99 on the backs of pages 2 and 3.\nParent topic: Setting up to use electronic forms\n2 of 2"}]}