{"doc_name": "dt_o_scen_deadlineandduration.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_scen_deadlineandduration.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3776, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Deadlines and estimated durations in a linear workflow scenario - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker / Usage scenarios for Deadline Tracker\n/ Deadlines and estimated durations in a linear workflow scenario\nDeadlines and estimated durations in a linear workflow scenario\nIn this scenario, a linear workflow has 10 steps. You want to track whether a job is on time or behind schedule from the time that the job enters\nthe workflow until it completes the PrintJobs step. The first three steps process a job immediately. Four steps each take 5 minutes to process a\njob. One step takes 10 minutes to process a job. You set estimated durations for those eight steps. You do not set estimated durations for the\ntwo steps that follow the PrintJobs step. You also want to know if a job does not meet its printing deadline. You place a SetDeadline step near\nthe start of the workflow.\nLinear PDF workflow\nSetJobPropsFromTextFile: 1 second.\nDetectInputDataStream: 1 second.\nSetDeadline: makes PrintJobs the deadline step; sets the deadline time to 35 minutes from the time that the job was submitted\n(Deadline date = Relative to property value; Property = Time submitted; Plus or minus = 35 minutes); 1 second.\nCountPages: 5 minutes.\nRunExternalProgram: runs a program for the accounting department; 5 minutes.\nPrintSetup (lets the operator verify that the requested paper is loaded in the trays): 5 minutes.\nCreatePageRanges: 5 minutes.\nPrintJobs: 10 minutes.\nRetainCompletedJobs: no estimated duration.\nRemoveJobs: no estimated duration.\nWith this workflow, you can see the deadline date and time, the deadline step, the deadline outcome, the percent complete, the tracking status\n(On schedule or Behind schedule), the predicted completion time, and the predicted outcome.\nWhen a job completes the PrintSetup step, the job is 50 percent complete because 3 steps with durations of 5 minutes have run of the 30-\nminute total. Based on the two remaining steps with estimated durations, RICOH ProcessDirector sets the Predicted completion time property to\n15 minutes from the time when the job completes the PrintSetup step.\nIf the job completes the CountPages step within 5 minutes and 3 seconds after starting the SetJobPropsFromTextFile step, the Tracking status of\nthe job is On schedule. If the job completes the RunExternalProgram step within 10 minutes and 3 seconds after starting the\nSetJobPropsFromTextFile step, the Tracking status of the job remains On schedule. If the job does not complete the PrintSetup step within 15\nminutes and 3 seconds of starting the SetJobPropsFromTextFile step, RICOH ProcessDirector sets the Tracking status of the job to Behind\nschedule. If the Tracking status of a job is Behind schedule, the row for the job in the Jobs table is colored yellow.\nRICOH ProcessDirector calculates the predicted outcome for a job by using the estimated durations, the current date and time, and the deadline\nfor the job. When a predicted outcome is May miss, RICOH ProcessDirector adds an orange dot to the Schedule risk column for the job in the\nJobs table.\nIf the job has not started the PrintJobs step 26 minutes after the job was submitted to the workflow, RICOH ProcessDirector sets the predicted\noutcome to May miss. The predicted outcome changes because the deadline is for 35 minutes and the estimated duration of the PrintJobs step is\n10 minutes. RICOH ProcessDirector estimates that the duration of the job is going to be 36 minutes.\nIf a job misses its deadline, RICOH ProcessDirector adds a red dot to the Deadlines portlet and to the Schedule risk column for the job in the Jobs\ntable.\nParent topic: Usage scenarios for Deadline Tracker\n1 of 1"}]}