{"doc_name": "defininglinkoptions.pdf", "doc_path": "data/raw/RPD-en-US/defininglinkoptions.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7472, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Defining link options for properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Customizing properties for AFP files / Defining link options for properties\nDefining link options for properties\nWhen you link document or job properties to index tags, you can define options for each property. These options apply to the property only\nwhen it is linked to the index tag.\nFor example, you can specify whether the index tag is required, the default value for the property if the index tag is not found in a document or\njob, and so on. You can also edit the text value for the index tag so that the property contains only part of the index tag value.\nBefore you can define the property link options, you must link the property to an index tag. When you link a property to an index tag, Document\nProperty Designer automatically displays the Define Link Options window so that you can define the options. If you have previously linked a\nproperty to an index tag, you can modify the link options.\nTo define link options for a property:\n1. In RICOH Visual Workbench, click Mode ⇒ Document Property Designer.\n2. Click Tools ⇒ Link Properties.\n3. In the Link Properties window, select the property whose link options you want to modify and click Modify Link.\nTo sort the properties by tag name or index tag type, click the column heading. Click once to sort in ascending order; click twice to sort in\ndescending order.\n4. Optional: In the Define Link Options window, change the index tags that the property is linked to by selecting one or more of the index\ntags from the Linked index tag table.\n5. Optional: To edit the text value of the property, click Edit index value.\nYou might want to edit the index tag value to remove any leading or trailing blanks, or to remove unwanted special characters.\nYou can select more than one index tag to edit; the rules that you define apply to all of the selected index tags. When you edit more than\none index tag at a time, the sample value fields at the bottom of the window do not display an example of the changed property.\nThe edits you make apply only to the property value and do not change the value of the index tag itself.\n6. Specify one or more of these fields:\nField Action\nThis field applies to supplemental page index tags when you have more than one supplemental page in the print stream; it\nspecifies whether the index tag value on a particular supplemental page can be used on any subsequent supplemental\npages.\nSelect this option if you want to make sure that a supplemental page uses only the values of the index tag for the current\npage group; a subsequent supplemental page cannot use the same value that was used on a previous supplemental page.\nIf you select this option and a value is missing for the index tag in a subsequent supplemental page, and if the Required\noption is selected below, the production AFP job is placed in an error state.\nFor example, you might define an index tag for a supplemental page that includes a customer address; that address is\nplaced on the documents associated with that supplemental page. If you select the Use local value option and the Required\noption, and the value of the index tag is null on the next supplemental page, the production AFP job is placed in an error\nstate. If you do not select Use local value, and the value of the index tag is null on the next supplemental page, the system\nplaces the customer address value from the preceding supplemental page on its associated documents.\nThis table shows some example results based on the options selected:\nSubsequent supplemental page\nUse local\nUse local value Required index tag value Result\nvalue\nY Y Exists New value is used on subsequent\nsupplemental page\nY N Exists New value is used on subsequent\nsupplemental page\nY N Null Value is blank on subsequent\nsupplemental page\nN N Null Current value is used on\nsubsequent supplemental page\nY Y Null Job moves to error state\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Defining link options for properties - Jenski - Test portal- RPD Linux\nFor linked document property index tags:\nSelect this option if the index tag must exist in each document and set of contiguous supplemental pages found\nbetween documents. If RICOH ProcessDirector does not find the linked index tag in a document or set of contiguous\nsupplemental pages, the production AFP job is placed in an error state.\nRequired For linked job property index tags:\nSelect this option if the index tag must exist at least once in the AFP file. If RICOH ProcessDirector does not find the\nlinked index tag in at least one document, the production AFP job is placed in an error state.\nAlthough the Required option requires that the index tag exists, if the value of the index tag is null, an error does not\noccur.\nFor linked document property index tags:\nThe default value is used if the index tag is not found in a document. If you did not select Required, type a default\nvalue for the document property, or select Not set. If the index tag is not found in a document and the default value\nis Not set, then if the index tag exists in the previous set of supplemental pages its value is used instead for this\ndocument. In this way you can use an index tag in a supplemental page as a default for all subsequent documents\nDefault value and override the value on a document-by-document basis by adding the index tag to individual documents.\nFor linked job property index tags:\nThe default value is used if the index tag is not found in any documents or supplemental pages in the AFP file. If you\ndid not select Required, type a default value for the job property, or select the Not set option.\nSelect the minimum number of characters (0 - 254) the document property value can contain. If the index tag value, after it\nMinimum is edited, is less than the minimum length, the production AFP job is placed in an error state. 0, the default, means no\nlength minimum length. If a value is null and the Minimum length is greater than 0, the production AFP file is placed in an error\nstate.\nSelect the maximum number of characters (0 - 254) the document property value can contain. If the index tag value, after\nMaximum\nit is edited, is greater than the maximum length, the production AFP file is placed in an error state. 0, the default, means\nlength\nno maximum length.\nSelect the maximum number of times (0 - 100) the index tag can occur in a document. If the index tag occurs a greater\nMaximum\nnumber of times, the production AFP job is placed in an error state. 0, the default, means that the index tag can occur any\ncount\nnumber of times without error. The Maximum count option counts index tags that have null values.\nSelect which index tag (0 - 100) in a document, or in a set of contiguous supplemental pages found between documents,\nis to be used as the document or job property value. For example, if you select 2, the value of the second index tag in the\nIgnore after\ndocument is the document or job property value. If the index tag occurs a fewer number of times in a document, the value\nnn\nof the last occurrence of the index tag is used. 0, the default, means that the value of the last index tag in the document is\noccurrences\nused as the document or job property value. Note that the Ignore after nn occurrences option counts index tags that have\nnull values.\n7. Click OK.\nParent topic: Customizing properties for AFP files\n2 of 2"}]}