{"doc_name": "creatingsupplpagesindex.pdf", "doc_path": "data/raw/RPD-en-US/creatingsupplpagesindex.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2563, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating index tags on supplemental pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Defining supplemental pages\n/ Creating index tags on supplemental pages\nCreating index tags on supplemental pages\nYou can create one or more index tags on pages that are not included in page groups.\nYou can create an index tag on a supplemental page for text in an AFP text block, text in an area, or mailing addresses in an address area. You do\nnot need to create a trigger on a supplemental page before you create an index tag. However, if the supplemental page does not contain a\ntrigger, the index tag is applied to every page outside a page group.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo create an index tag on a supplemental page:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. Select a page that is outside a page group.\n3. Click a text block or draw a box around a text area or address area that you want to index. The text blocks you can select are defined in the\nAFP file, from one character to the entire line of text. You see a red box around the data you selected.\n4. Right-click anywhere on the page and then click Create Index Tag or Create Index Tags for an Address.\nYou see the Create Supplemental Page Index Tag window, Create Index Tags in an Area window, or Create Index Tags in an Address Area\nwindow.\n5. Follow the procedure in Creating index tags for text blocks, Creating index tags in areas, or Creating index tags in address areas\nand select an existing supplemental page definition from the drop-down list or type a new supplemental page definition name.\n6. Click OK when you are done creating the index tag.\n7. Verify that the correct index tag has been created:\n1. Right-click on the page in the left pane and click Properties.\nThe name of the index tag and its value are listed in the TLE field.\n2. To close the Properties window, click X in the upper right corner.\n3. If the index tag is incorrect, click Tools ⇒ Modify Definitions to modify or delete the tag.\nThe index tag is listed as a Supplemental Page Definition under Page Indexes, Index areas, or Address Indexes.\n8. Optional: To create an additional index tag on the supplemental page or to define an index tag on a different supplemental page, repeat\nthe steps.\nParent topic: Defining supplemental pages\n1 of 1"}]}