{"doc_name": "aiw00c29.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c29.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4807, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Preparing for job submission - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission\nPreparing for job submission\nYou can submit jobs to RICOH ProcessDirector using different mechanisms, such as the LPD protocol, FTP, SCP, file copying, or the Submit Jobs\nportlet on the Main page. You can group and track related individual jobs as orders, making sure that all jobs within an order are managed\ntogether and completed in a coordinated manner.\nSome preparation is necessary no matter which submission method you use. If you install the AFP Support feature, you can submit jobs using\nDownload for z/OS or AFP Download Plus.\nIf you install the Web Services Enablement feature, you can use SOAP or REST web service connections to retrieve files from other applications\nand process them as jobs.\nJob submission is how you get your input files into the directory that an input device monitors. The input device then creates a job, assigns it a\nworkflow, and initiates the workflow.\nIn this section:\nConfiguring to use Download for z/OS\nBefore Download for z/OS can send data sets from z/OS to the RICOH ProcessDirector system, an administrator must do configuration tasks on\nz/OS. The administrator also does corresponding tasks on the RICOH ProcessDirector system to configure the input devices that receive the data\nsets and to configure the workflows that the data sets are assigned to.\nConfiguring to use AFP Download Plus\nBefore AFP Download Plus can send data sets from z/OS to the RICOH ProcessDirector system, an administrator must do configuration tasks on\nz/OS. The administrator also does corresponding tasks on the RICOH ProcessDirector system to configure the input devices that receive the data\nsets and to configure the workflows that the data sets are assigned to.\nConfiguring to use the LPD protocol\nBefore a user can use the line printer daemon (LPD) protocol to submit jobs to the RICOH ProcessDirector system, an administrator must do\nconfiguration tasks on the RICOH ProcessDirector system to configure the input devices that receive the jobs, to configure the workflows that the\njobs are assigned to, and to define the hosts that can use the LPD protocol to submit jobs to RICOH ProcessDirector. The administrator might also\nhave to do some configuration tasks on these hosts.\nConfiguring to use the pdpr command\nIf you are migrating from InfoPrint Manager to RICOH ProcessDirector and you use the pdpr command to submit jobs, you can configure RICOH\nProcessDirector to continue receiving jobs from the same pdpr command.\nPreparing for FTP or SCP clients\nTo get a job into a workflow, an application can copy or send the input file into a hot folder using a variety of methods, including File Transfer\nProtocol (FTP), Secure Copy Protocol (SCP), and RICOH ProcessDirector web services.\nConfiguring to use JDF job tickets\nBefore you can submit jobs with JDF tickets, you must configure the input devices that receive the jobs. You also must configure the workflows\nthat the jobs are assigned to. Printers defined as Ricoh PDF or TASKalfa printers can manage PDF jobs with JDF tickets better than printers\ndefined as Passthrough or Custom PDF printers can.\nPreparing to submit jobs using web services\nRICOH ProcessDirector provides a REST web service utility that you can use to submit jobs. If you can configure your application to use REST web\nservices, you can use the submitFile utility to submit a file to a workflow or hot folder.\nConfiguring to receive orders\nYou can submit orders by either uploading PDFs through the Submit Jobs portlet or by submitting an XML file from your existing order\nmanagement system.\nPreparing to submit batch jobs\nHot folder and SFTP input devices can submit every file they receive as a separate job, or they can group files together to create larger jobs, called\nbatch jobs. The simplest batch jobs contain only data files. More complex batch jobs include files that set job properties and files that locate files\nthat list the other files in the job.\nPreparing to receive XML\nHow you receive and process XML files depends on the information in the files and what you want to do with the information.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:10 PM Preparing for job submission - Jenski - Test portal- RPD Linux\nPreparing to receive JSON\nAfter you receive a JSON file, you convert it to XML. How you process the XML files depends on the information in the JSON files and what you\nwant to do with the information.\nConfiguring to submit jobs from the Main page\nYou can submit jobs to RICOH ProcessDirector using the Submit Jobs portlet on the Main page.\nSubmitting jobs in the Submit Job portlet\nRICOH ProcessDirector provides different mechanisms to submit jobs, including a portlet on the Main page.\nParent topic: Configuring\n2 of 2"}]}