{"doc_name": "tt_c_setup_verification.pdf", "doc_path": "data/raw/RPD-en-US/tt_c_setup_verification.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2733, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Setting up the Automated Verification feature - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature\nSetting up the Automated Verification feature\nAfter you read the Automated Verification overview topics, run the VerifySample workflow. You can then set up Automated Verification by doing\nthe configuration tasks described in this section.\nAfter the initial configuration is complete, test your Automated Verification workflow to make sure it works as you expect it to.\nIn this section:\nRunning the Automated Verification sample workflow\nThe Automated Verification feature provides a sample workflow that you can examine and run to understand how the feature works. The\nsample includes a barcode format, a barcode reader, a hot folder input device with a pre-submitted PDF file, and a workflow that includes the\nReadBarcodeData step.\nCreating barcode readers\nBarcode readers represent the cameras and barcode scanners in your system that read barcodes on documents in a print job to verify that each\ndocument has been processed. Each camera or barcode scanner requires a barcode reader.\nDefining a workflow that uses barcodes to track jobs\nYou can define a workflow that reads barcodes on documents in a job. The workflow reconciles the documents with barcodes that were read\nagainst the total documents in the job. The workflow can reprint any documents that were not accounted for during reconciliation.\nEnhancing PDF files for Automated Verification\nTo process PDF files for Automated Verification, use RICOH ProcessDirector Plug-in for Adobe Acrobat to enhance the files. The files must have a\npage group, which identifies documents, and a verification barcode that contains the Job number job property and the Sequence in child job\ndocument property.\nEnhancing AFP files for Automated Verification\nMost AFP files that are submitted to RICOH ProcessDirector need to be enhanced before they can be processed for Automated Verification.\nCustomizing the Verification recipient document property for PDF files\nYou can customize the Verification recipient document property for PDF files that you process at your installation. Operators can then use the\nVerification recipient property to identify documents that need to be reprinted during manual reconciliation.\nCustomizing the Verification recipient document property for AFP files\nIf you have the AFP Support feature installed, you can customize the Verification recipient document property for AFP files that you process at\nyour installation. Operators can then use the Verification recipient property to identify documents that need to be reprinted during manual\nreconciliation.\nParent topic: Configuring\n1 of 1"}]}