{"doc_name": "creatingtextstrings.pdf", "doc_path": "data/raw/RPD-en-US/creatingtextstrings.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4889, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating text with AFP Editor - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Creating text with AFP Editor\nCreating text with AFP Editor\nYou can create a string of text on a specified page of each page group in an AFP file and specify its color, font, and size.\nFor example, you can add page numbers or you can add text so that the information in a barcode is also printed as readable text.\nYou can create text in an AFP file from:\nText you enter from the keyboard\nIndex tags defined in each page group\nPage number or page count property values\nTo determine the position of the new text, work from a copy of the sample AFP file printed on the production printer. Measure where you want\nto place the top-left corner of the text area (X and Y positions) on the printed page from the top-left corner of the logical page.\nNote:\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo create text in an AFP file:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the file does not contain page groups, use AFP Indexer to create page groups.\n3. Click Mode ⇒ AFP Editor.\n4. To create an area for the text, position your cursor at a corner of the area you want to create. While pressing the left mouse button, draw a\nbox the size you want.\n5. Right-click anywhere in the AFP file and then click Create Text.\nYou see the Create Text String window.\n6. On the Text tab, type a descriptive name for the text area in the Text definition name field.\n7. In the Text string data section, create a text string.\nFor example, to add the page number, such as \"Page 1 of 10\", to the first page of each page group:\n1. Type Page in the Text field and click Add.\n2. Select Page in Page Group from the Property drop-down list and click Add. Page in Page Group is the number of the page in the\npage group.\n3. Type of in the Text field and click Add.\n4. Select Page Group Page Count from the Property drop-down list and click Add. Page Group Page Count is the total number of pages\nin the page group.\nYou see the text string value in the field below the data fields.\n8. Optional: To edit the text string, select a line of data and use Up or Down to change the order of the line or Remove to delete the line.\nRemember to add blank characters between words if you need to.\n9. Optional: Select a color for the text from the Color drop-down list.\n10. Optional: On the Font tab, select one of these:\nCore Fonts\nFrom the drop-down lists, select the character set and code page, and, if the font is an outline font, the point size in the Font\nInformation section.\nExternal Fonts\nType a character set and code page pair, a coded font name, or all three. For double-byte character set (DBCS) fonts, use the coded\nfont name only.\nNote:\nIf you enter a code page that is part of a DBCS-coded font, you see an error message that suggests you use the coded font\nname instead.\nYou see the Character Set Description and Font Resource fields change for the font you selected. Font Resource is \"Outline\" for core fonts\nand \"Raster\" for external fonts.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating text with AFP Editor - Jenski - Test portal- RPD Linux\nNote:\nOn your workstation, if the font size does not exist for the color you selected, your display defaults to 12 black, even though the\nfinal AFP file will have the correct font and color.\nIf the character names do not match between a character set and code page, the job goes into an error state in RICOH\nProcessDirector and the printer issues an error. To correct the error, change the character set and code page to a valid pair and\nprocess the job again.\n11. Optional: On the Position tab, change the origin (top-left corner), size, and orientation of the text area. Specify the origin and size in inches\nor millimeters. Decimal values (such as 2.5) are allowed. The fields are:\nX position\nThe horizontal distance of the left side of the area measured from the left side of the logical page (not the physical sheet of paper).\nY position\nThe vertical distance of the top of the area measured from the top of the logical page (not the physical sheet of paper).\nWidth\nThe horizontal width of the area.\nHeight\nThe vertical height of the area.\nOrientation\nThe number of degrees the text is rotated in the defined area: 0o, 90o, 180o, 270o\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the logical page in the unrotated view.\n12. Click OK.\nYou see the text in the AFP file.\n13. Repeat steps 4 to 12 to add text to another page in each page group. For example, select the second page to add \"Page 2 of 10\" to the\nsecond page of each page group.\nParent topic: Editing AFP files\n2 of 2"}]}