{"doc_name": "stepchains_runsamplewf.pdf", "doc_path": "data/raw/RPD-en-US/stepchains_runsamplewf.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3737, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Running the StepChainDemo sample workflow - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Step templates, steps, and step chains / Running the StepChainDemo sample workflow\nRunning the StepChainDemo sample workflow\nThe StepChainDemo workflow presents an example of step chain usage by showcasing how to group a collection of steps with a well-defined\nfunction. After you create a step chain, you can include it in other workflows, making the process easier and visually simplifying the workflow.\nThe sample objects and files used in this workflow include:\nWorkflow: StepChainDemo\nSample step chains:\nReceivePDFJob\nPrepareForPrint\nCompressAndRetain\nSample input device: HotFolderStepChain\nSample PDF file: /aiw/aiw1/testfiles/Demo.pdf\nThe illustrations below show the sample workflow as a series of phases containing step chains and steps corresponding to the processing steps\nthat your jobs pass through. The step chains appear as a single steps in the workflow with numbers as their icons, indicating how many steps are\ncontained in the step chains. The color of the step chains match the color of the phase they are in.\nReview the sample workflow and run a sample job to understand how step chains work.\nThe Receive phase sets the initial values of job properties and optimizes PDF jobs. In this phase, the ReceivePDFJob step chain is executed, which\nincludes the following steps: SetJobPropsFromTextFile, DetectInputDataStream, and OptimizePDF.\nThe Prepare phase consists of the PrepareForPrint step chain, which includes the following steps to prepare the PDF sample for print:\nCountPages, AssignValues, AssignValues2, and RunExternalProgram. This step chain also provides an example of how to create rules by using\nspecifying conditions. During the CountPages step, RICOH ProcessDirector calculates the total number of sheets in the job. Depending on this\nvalue, the job is sent to different branches, using either AssignJobValues or AssignJobValues2 step.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:24 PM Running the StepChainDemo sample workflow - Jenski - Test portal- RPD Linux\nAfter jobs have completed all other processing, they arrive in the Complete phase. In this phase, the CompressAndRetain step chain is executed,\nwhich includes the following steps: ContinueToNextStep, RetainCompletedJobs, CompressFiles, and RemoveJobs. During the execution of these\nsteps, PDF data files that are larger than 10 MB get compressed, and the job is retained for three days before being removed.\nTo run the sample workflow:\n1. Log in to RICOH ProcessDirector.\n2. Click the Main tab.\n3. In the Printers portlet, select the Sample printer and click Enable.\n4. In the Input Devices portlet, select the HotFolderStepChain hot folder input device and click Enable and Connect.\n5. Navigate to /aiw/aiw1/testfiles and copy Demo.pdf into /aiw/aiw1/System/hf/stepchain. The job shows up in the Jobs table.\nThe sample workflow uses a sample printer that does not print any data.\n6. In the Jobs table, find the job. To view the job in the workflow, on the Jobs portlet, right-click the job and select View job in workflow.\nYou can double-click the step chains to view the job's path through the conditions. For example, if you click the PrepareForPrint step chain\nicon, you can see that the job followed the second path ( AssignJobValues 2). This occurred because the Demo.pdf file has more than 20\npages.\nNote:\nIf you want to run the example again, you must copy the sample file to the hot folder again.\nYou can copy a larger file to the hot folder to simulate printing large files that go through the CompressFiles step of the\nCompressAndRetain step chain.\nParent topic: Step templates, steps, and step chains\n2 of 2"}]}