{"doc_name": "definingpageswithtrig.pdf", "doc_path": "data/raw/RPD-en-US/definingpageswithtrig.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3779, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Creating page-level triggers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Working with page-level indexes\n/ Creating page-level triggers\nCreating page-level triggers\nIn an AFP file with existing page groups or after you create page groups in a file, you can create triggers to define individual pages in page\ngroups.\nYou can create one or more triggers on an individual page, with the same or different page definition names. AFP Indexer defines a page if it\nfinds all the triggers with the same page definition name.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo create page-level triggers:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. Select a page in a page group.\n3. Click the text that you want to use as a trigger.\nYou see a red box around the text you selected.\nThe text blocks you can select are defined in the AFP file, from one character to the entire line of text. For example, the text “Account\nSummary” might be defined as two text blocks. You can click either the “Account” or “Summary” text block to create a trigger.\n4. Right-click the text and click Create Trigger.\nYou might see a message that says the page groups might change or the index tags might be invalid and asks if you want to continue.\nClick Yes.\nYou see the Create Trigger window with the selected text in the Edited trigger field.\nNote: You might need to use the scroll arrows to see the text in the Edited trigger field.\n5. Decide whether you want to use the entire text value as the page-level trigger or only part of the text. You can edit the text value to reduce\nthe number of characters you use for the trigger value. To select part of the text as the trigger:\n1. Click Edit trigger.\n2. Edit the trigger value in the Edit Value window.\n3. Click OK.\n6. Click Page for the trigger type.\nYou see the Select page definition field.\n7. Type a name to identify the page or select a name from the drop-down list.\n8. Click the Advanced tab to change the text threshold, the method for matching the trigger, or both:\nSelect a range from 1/100 to 1 inch for the text threshold. Although text might appear to be present in the same location, slight position\nvariations can occur in the AFP file. You can change the threshold to look for trigger text that is in slightly different positions on some\npages. The threshold defines how far the text can be from the original location and be considered a trigger. For example, a threshold\nvalue of 12 indicates that the trigger can be located within .12 of an inch either vertically or horizontally. Usually the default threshold\nvalue of 10 is sufficient.\nSelect the method used to match the trigger–on the trigger string value and the text block position, or on the position only:\nOn string and X,Y position\nThe trigger string value and horizontal and vertical position of the text block are matched. This is the default.\nOn string and X position\nThe trigger string value and horizontal position of the text block are matched.\nOn string and Y position\nThe trigger string value and vertical position of the text block are matched.\nOn X,Y position only\nThe horizontal and vertical position of the text block is matched.\n9. Click OK.\n10. Click Tools ⇒ Modify Definitions to modify or delete the trigger.\nThe trigger is listed under Page Group Definition ⇒ Page Definition ⇒ Page Triggers.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Creating page-level triggers - Jenski - Test portal- RPD Linux\n11. Optional: To create an additional trigger, repeat the steps.\nParent topic: Working with page-level indexes\n2 of 2"}]}