{"doc_name": "reportsPostgresql_datacollObj.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_datacollObj.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3025, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Data Collectors - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Data Collectors\nData Collectors\nData collector objects capture property values during job processing and store them in a PostgreSQL database created by the Reports feature.\nYou can access that data and use it as input to your business intelligence software.\nData Collectors let you configure:\nThe database table where the property values are stored.\nThe retention period for the captured data.\nJob, printer, device, and user property values to capture.\nYou cannot store positional job properties in the Reports database. To determine whether a property is positional, check the help for that\nproperty.\nRICOH ProcessDirector provides these data collectors that you can configure to meet your needs:\nJob Step Duration\nLets you measure how long each step was in the queued and processing states, as well as the total duration for each step to complete\nprocessing.\nYou can also select job properties to capture at the end of each step along with the step duration information.\nJob Step Progress\nLets you select the job properties that are captured at the start and completion of each step in the workflow.\nYou can use this data collector along with the WritePropsToReportsDatabase step to collect job and document properties.\nJob Print Progress\nLets you select the job and printer properties that are captured when a job starts printing and when it finishes printing successfully, or if an\nerror occurs.\nOrder Status\nLets you select the order properties that are captured when an order is created, changes state, or is deleted.\nPrinter Status\nLets you select the printer properties that are captured each time that the Enabled status or Printer status changes.\nUser Actions on Barcode Readers\nLets you select the barcode reader and user properties that are captured when a user does an action on a barcode reader.\nUser Actions on Input Devices\nLets you select the input device and user properties that are captured when a user does an action on an input device.\nUser Actions on Inserters\nLets you select the inserter and user properties that are captured when a user does an action on an inserter.\nUser Actions on Jobs\nLets you select the job and user properties that are captured when a user does an action on a job.\nUser Actions on Printers\nLets you select the printer and user properties that are captured when a user does an action on a printer.\nUser Actions on Users\nLets you select the target user and user properties that are captured when a user does an action on a target user.\nWorkflow Step Collector\nLets you manage the data stored by the WritePropsToReportsDatabase step.\nCollect the values of document properties using the WritePropsToReportsDataBase step. You can include the step multiple times in a\nworkflow to track changes in the value of the documents. The supplied Workflow Step Collector manages the job and document property\ndata stored by the step.\nParent topic: System objects\n1 of 1"}]}