{"doc_name": "rep_c_CreateAssocPropFile.pdf", "doc_path": "data/raw/RPD-en-US/rep_c_CreateAssocPropFile.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 13730, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Creating an associated properties file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Archive feature / Creating an associated properties file\nCreating an associated properties file\nYou can create an associated properties file to specify one or more properties that are associated with a job, but that are properties of other\nobjects. When a step based on the StoreInRepository step template runs, these properties and their values are stored in a repository along with\njob and document data. For example, you can store the model of the printer requested for a job or the color of the media specified to print a\njob.\nNote:\nYou can also specify positional job properties in an associated properties file and store their values in a repository. You cannot select a\npositional job property as a value for the Job properties to store property on the StoreInRepository step. In a workflow, the values of\npositional properties can be different for different steps based on the same step template.\nPositional job properties\nTo store values for a positional job property, you specify the property, the phase that the step is in, the internal name of the step with the\nproperty, and a property label. The syntax is:\nJob_property[Phase][Step_identifier]:Property_label\nFor example, you have the Automated Verification feature, and you want to store the name of the barcode reader that the ReadBarcodeData\nstep in the Insert phase uses to track the documents in a job through an inserter.\nWhen you create the associated properties file, you type this line into a text editor:\nJob.TrackAndTrace.BarcodeReader[Insert][ReadBarcodeData]:Property_label\nThe property label might be Job.BarcodeReader.\nWhen the StoreInRepository step runs, RICOH ProcessDirector:\n1. Gets the value of the Barcode reader job property (database name Job.TrackAndTrace.BarcodeReader) for the ReadBarcodeData step in the\nInsert phase.\nThis value might be BarcodeReader1.\n2. Stores the value of the Barcode reader property along with other information for the job and its documents in the repository.\nTo see whether a property on a step template is positional, click the ? icon and check the Usage notes in the help.\nProperties associated with a job\nTo store the value for a property of another object, you must be able to create a chain of relationships to that property. The chain must start with\na job property that specifies an object as a value. The next property in the chain must be a property of the object specified by the job property.\nThe chain must end with the property whose values you want to store.\nAlthough you can start the chain with any job property that specifies an object as a value, these job properties satisfy most needs.\nObject User interface name of Database name of job property Base product or feature\njob property\nBarcode reader Barcode reader Job.TrackAndTrace.BarcodeReader Automated Verification\nInput device None Job.SourceInputDeviceName Base product\nInserter Inserter controller Job.InserterSystem.ID Inserter\nMedia Media Job.Media Base product\nPrinter Requested printer Job.RequestedPrinter Base product\nThe following line shows a simple version of the syntax for specifying associated properties:\nProperty_to_store@Job_property:Property_label\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:18 PM Creating an associated properties file - Jenski - Test portal- RPD Linux\nNote:\nIf you chose Any printer on the PrintJobs step, you cannot use the Job.RequestedPrinter database name. Replace that name with\nJob.PreviousPrinter.\nThe system starts at the colon and reads the properties from right to left. The number of properties in the chain can vary. An @ symbol separates\nthe properties. To the right of the colon is a property label. The property label is required.\nThese examples give the user interface names of properties with the database names in parentheses. Use the database names when you create\nthe associated properties file.\nYou want to store values for the Printer model printer property (database name Printer.Model.Specific). You can chain the Requested printer job\nproperty (database name Job.RequestedPrinter) directly to the printer property.\nWhen you create the associated properties file, you type this line into a text editor:\nPrinter.Model.Specific@Job.RequestedPrinter:Property_label\nThe property label might be Job.PrinterModel.\nWhen the StoreInRepository step runs, RICOH ProcessDirector:\n1. Gets the value of the Requested printer property.\nThis value might be Printer4.\n2. Uses the Printer. portion of the Printer.Model.Specific property to identify the next object in the chain: a printer object.\n3. Gets the value of the Printer model property for Printer4.\nThis value might be Ricoh Pro C901.\n4. Stores the value of the Printer model property along with other information for the job and its documents in the repository.\nImportant:\nThe link between the job property and the object portion of the next property is critical. You must link the Requested printer job\nproperty to a printer property. The database name of a printer property starts with Printer. An example at the end of this topic\nshows how to link a job property to another property through an intermediate property.\nYou have the Automated Verification feature, and you want to store values for the Barcode Format property (database name\nBarcodeReader.BarcodeFormat). You can chain the Barcode reader job property (database name Job.TrackAndTrace.BarcodeReader) directly to\nthe Barcode Format property. Because the Barcode reader property is positional, you need to specify the Phase and Step identifier.\nYou have two different steps that read barcodes, and the barcode readers in the two steps use a different barcode format. You want the\nbarcode reader that the ReadBarcodeData step in the Insert phase uses.\nWhen you create the associated properties file, you type this line into a text editor:\nBarcodeReader.BarcodeFormat@Job.TrackAndTrace.BarcodeReader[Insert][ReadBarcodeData]:Property_label\nThe property label might be Job.BarcodeFormat.\nWhen the StoreInRepository step runs, RICOH ProcessDirector:\n1. Gets the value of the Barcode reader property for the ReadBarcodeData step in the Insert phase.\nThis value might be BarcodeReader2.\n2. Uses the BarcodeReader. portion of the BarcodeReader.BarcodeFormat property to identify the next object in the chain: a barcode reader\nobject.\n3. Gets the value of the Barcode Format property for BarcodeReader2.\nThis value might be BarcodeFormat2.\n4. Stores the value of the Barcode Format property along with other information for the job and its documents in the repository.\nTo create an associated properties file:\n1. With a text editor, create a new file.\n2. Type a line for the first property whose values you want to store.\nUse this syntax:\nProperty_to_store@Intermediate_property@Job_property[Phase][Step_identifier]:Property_label\nwhere:\nProperty_to_store is the database name of the property you want to store.\nIntermediate_property is the database name of an intermediate property, if needed, that links the job property to the property you want\nto store by identifying an intermediate object, such as Media. If you need to specify two intermediate properties, separate them with an\n@ symbol.\nYou can link many job properties directly to properties you want to store without an Intermediate_property.\nJob_property[Phase][Step_identifier] has these parts:\nJob_property is the database name of the job property that identifies an object such as a printer.\nIf you are storing a positional job property, which you cannot select as a value for the Job properties to store property on the\nStoreInRepository step, Job_property is the database name of the positional job property. You do not need to specify any additional\nproperties.\nIf the property is positional, Phase is the name of the phase that the step is in, and Step_identifier is the internal name of the step with\nthe property.\nIf the property is not positional, do not type a [Phase] or [Step_identifier].\nProperty_label is the name that appears on the Properties tab when you click Show details on the Results table of the Archive tab. We\nrecommend the format Job.MyProperty. The property label for each property in the associated properties file must be unique.\nFor example, you might type:\nJob.TrackAndTrace.BarcodeReader[Insert][ReadBarcodeData]:Job.BarcodeReader\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:18 PM Creating an associated properties file - Jenski - Test portal- RPD Linux\n3. If you want to store values for a second property, type a line break, and then repeat the previous step for the second property.\nFor example, you might type:\nPrinter.Model.Specific@Job.RequestedPrinter:Job.PrinterModel\n4. Save the text file.\nFor example, you might name the file associatedproperties.txt.\n5. Send the associated properties file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access\nto.\nThe file is now available to use as the value of the Associated properties file property for a StoreInRepository step in a workflow.\nWhen the StoreInRepository step runs, RICOH ProcessDirector stores (with each document and job) the value of each stored property specified in\nthe associated properties file.\nIf the value is null for any stored property on a line of the associated properties file, RICOH ProcessDirector stores a null value for the property.\nIf a property allows multiple selections, RICOH ProcessDirector stores the multiple selections separated by a vertical bar (|). For example, the\nvalue of a stored property might be BarcodeReader1|BarcodeReader2.\nIf multiple values are selected for both a job property and the associated object property, RICOH ProcessDirector adds an underscore and the\nname of the job property value to the property label. RICOH ProcessDirector stores each job property value separately. For example:\nJob.BarcodeFormat_BarcodeReader1 Job.BarcodeFormat_BarcodeReader2\nBarcodeFormat1|BarcodeFormat2 BarcodeFormat3\nUsers cannot search a repository for these properties. After you search on the Archive tab for job or document properties, RICOH ProcessDirector\ndisplays the values of associated properties on the Properties tab when you click Show details on the Results table.\nExamples\nStoring the model of the printer requested to print a job\nFile contents:\nPrinter.Model.Specific@Job.RequestedPrinter:Job.PrinterModel\nValue of Printer model property:\nRicoh Pro C901\nInformation stored in the repository for a specific job and each document in the job:\nJob.PrinterModelRicoh Pro C901\nInformation displayed in the properties notebook for the results of a search:\nJob.PrinterModel: Ricoh Pro C901\nNote:\nWhen processing an associated properties file, RICOH ProcessDirector does not store or display the value of the\nJob_property_identifying_object property or any Property_identifying_intermediate_object property.\nIf you chose Any printer on the PrintJobs step, you cannot use the Job.RequestedPrinter database name. Replace that name with\nJob.PreviousPrinter.\nStoring the barcode format used by a barcode reader\nFile contents:\nBarcodeReader.BarcodeFormat@Job.TrackAndTrace.BarcodeReader[Insert]\n[ReadBarcodeData]:Job.BarcodeFormat\nBarcode readers selected on the ReadBarcodeData step:\nBarcodeReader1\nBarcodeReader2\nBarcode formats selected for BarcodeReader1:\nBarcodeFormat1\nBarcodeFormat2\nBarcode format selected for BarcodeReader2: BarcodeFormat3.\nInformation stored in the repository for a specific job and each document in the job:\nJob.BarcodeFormat_BarcodeReader1 Job.BarcodeFormat_BarcodeReader2\nBarcodeFormat1|BarcodeFormat2 BarcodeFormat3\nInformation displayed in the properties notebook for the results of a search:\nJob.BarcodeFormat_BarcodeReader1: BarcodeFormat1|BarcodeFormat2\nJob.BarcodeFormat_BarcodeReader2: BarcodeFormat3\nStoring the reprint method used by an inserter\nFile contents:\nInserterSystem.ReprintMethod@Job.InserterSystem.ID:Job.InserterReprintMethod\nValue of Reprint method property (database name InserterSystem.ReprintMethod):\nOpen loop\nInformation stored in the repository for a specific job and each document in the job:\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:18 PM Creating an associated properties file - Jenski - Test portal- RPD Linux\nJob.InserterReprintMethod\nOpen loop\nInformation displayed in the properties notebook for the results of a search:\nJob.InserterReprintMethod: Open loop\nStoring the folder location of the input device that received a job\nFile contents:\nInputDevice.FolderLocation@Job.SourceInputDeviceName:Job.InputDeviceFolder\nValue of Folder location property (database name InputDevice.FolderLocation):\n/aiw/aiw1/System/hf/defaultPDF\nInformation stored in the repository for a specific job and each document in the job:\nJob.InputDeviceFolder\n/aiw/aiw1/System/hf/defaultPDF\nInformation displayed in the properties notebook for the results of a search:\nJob.InputDeviceFolder: /aiw/aiw1/System/hf/defaultPDF\nStoring the color of the media requested to print a job\nFile contents:\nMediaType.Color@Media.MediaTypeID@Job.Media:Job.MediaColor\nValue of Media color property (database name MediaType.Color):\nRicoh Pro C901\nInformation stored in the repository for a specific job and each document in the job:\nJob.MediaColor\nBlue\nInformation displayed in the properties notebook for the results of a search:\nJob.MediaColor: Blue\nNote:\nYou can replace the Media color property with other media type properties such as Media weight (database name\nMediaType.Weight) and Media details (database name MediaType.Details).\nTo store the values of a media size property, such as Media height (database name MediaSize.Height), use this\nline:MediaSize.Height@Media.MediaSizeID@Job.Media:Job.MediaHeight\nParent topic: Setting up the Archive feature\n4 of 4"}]}