{"doc_name": "aiw00pupdatemedia.pdf", "doc_path": "data/raw/RPD-en-US/aiw00pupdatemedia.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2258, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Viewing and updating the media ready in printer input trays - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Printers / Viewing and updating the media ready in printer input trays\nViewing and updating the media ready in printer input trays\nRICOH ProcessDirector uses SNMP and JMF to distinguish between the media that a printer supports and the media that is ready in its input\ntrays. Supported media is not ready until it is loaded in an input tray. Unless your printer can automatically match media, update the ready media\nfor the printer object when you load new media in the printer device.\nIf you are using a Ricoh PDF printer and the media catalog is defined on the printer, RICOH ProcessDirector automatically queries the printer and\nupdates the media ready in the printer input trays.\nTo view and update the media ready in printer input trays:\n1. In the Printers portlet, select a printer. Click Actions ⇒ Show Trays.\nAs an alternative, you can select a job in the Jobs portlet and click Schedule. Select the printer you want to use and then click Show Trays.\n2. If you have Media Matching set to Use the properties selected below and the printer reports all the properties you use to distinguish media,\nthe table shows the trays and the media that is currently loaded. If you load different media while this page is open, do these steps to\nupdate the media:\n1. Click Update.\nRICOH ProcessDirector queries the printer and returns the media that is ready in each input tray. If you loaded different media and\nthe table does not change, make sure that Get tray information from printer property on the printer is set to Yes.\n2. Click OK.\n3. If you have Media Matching set to Use the properties selected below, but the printer does not report all the properties you use to\ndistinguish media or SNMP is not turned on for the printer, follow the instructions for Media Matching set to Use media product ID or\nmedia name.\n4. If you have Media Matching set to Use media product ID or media name, do these steps to update the media:\n1. Select the input tray that you want to update.\n2. Click Set tray media.\n3. Select the media that is loaded in the tray and click OK.\n4. Click CLOSE.\nParent topic: Printers\n1 of 1"}]}