{"doc_name": "aiw00a36.pdf", "doc_path": "data/raw/RPD-en-US/aiw00a36.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2086, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM RICOH ProcessDirector servers - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / RICOH ProcessDirector servers\nRICOH ProcessDirector servers\nA RICOH ProcessDirector system is made up of the primary server and, if needed, one or more application and secondary servers.\nYou can create secondary servers on Linux systems; you can install application servers on Windows systems. You might have to do tasks on the\nprimary server, a secondary server, or an application server, such as starting, stopping, enabling, and disabling them. In some cases, the\nprocedures for application and secondary servers differ among the operating systems.\nIn this section:\nStarting and stopping servers\nThe RICOH ProcessDirector base product and secondary servers can be configured to start and stop when the system they are installed on starts\nand stops. Application servers must always be started manually; they stop when the system they are installed on shuts down, but can also be\nstopped manually.\nUpdating a primary computer host name or IP address\nWhen the host name or IP address of a primary computer changes, you must update RICOH ProcessDirector to recognize the change.\nRecovering from an unplanned outage\nIf your primary computer becomes unavailable because of network problems, hardware failure, or software failure, you must shut down the\nsystem, fix all the problems on the primary computer so that it is available to the network, and then restart the system. If an\napplication/secondary server is defined to the primary server when the primary server suffers an unplanned outage, that server attempts to\nreestablish the connection every 30 seconds, until it is able to connect or until it stops.\nMoving processing to and from a failover server\nFailover servers are designed to take over processing in the event that your RICOH ProcessDirector production server suffers a catastrophic event.\nUse this procedure to move processing between the RICOH ProcessDirector production server and the failover server.\nParent topic: Managing system objects\n1 of 1"}]}