{"doc_name": "docafp_c_ConfigureAFPDocuments.pdf", "doc_path": "data/raw/RPD-en-US/docafp_c_ConfigureAFPDocuments.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3733, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Setting up to use documents in AFP jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Configuring AFP Support for documents / Setting up to use documents in AFP jobs\nSetting up to use documents in AFP jobs\nTo use documents in AFP jobs, you define how to identify the documents, map data in the documents to RICOH ProcessDirector document\nproperties, and add markup to the documents. Finally, you save the setup information in Enhance AFP and RICOH Visual Workbench control\nfiles.\nYou map data in the documents to document properties supplied with RICOH ProcessDirector or to custom document properties that you define.\nDefine the custom document properties before you use the Document Property Designer mode of RICOH Visual Workbench.\nNote: This procedure gives general setup instructions. For detailed instructions, see the related topics.\nTo set up to use documents in AFP jobs:\n1. Open an AFP file in RICOH Visual Workbench.\n2. Use the AFP Indexer mode of RICOH Visual Workbench to create page groups, which identify the start of each document in a job.\nYou define triggers that specify document boundaries, or you create fixed-length page groups.\n3. Use the AFP Indexer mode to create index tags for the data that you map to document properties.\n4. Use the Document Property Designer (DPD) mode to link each document property to indexed data in the documents:\n1. Double-click the document property name at the bottom of the window.\n2. Supply the requested information in the Define Link Options dialog.\nWhen a document property is linked to an index tag, the value of the document property is the same as the value of the indexed\ndata.\n5. Add markup:\n1. Create an Enhance AFP control file to define where to place AFP data on a page.\nUse the AFP Enhancer mode to create barcodes, add text, and mask text or graphics by creating hidden areas (cover blocks).\nNote: The AFP Editor feature also lets you create barcodes, add text, and mask text or graphics by creating hidden areas. AFP\nEditor is not supplied with RICOH ProcessDirector. You must purchase the feature.\n2. Use the Whitespace Manager feature to define available areas of white space in AFP files and then fill the white space with content,\nsuch as images and text. You base the content on rules that you define. Whitespace Manager is not supplied with RICOH\nProcessDirector. You must purchase the feature.\n6. If you created an Enhance AFP control file:\n1. Click Tools ⇒ Export EnhanceAFP Control File.\n2. Send or copy the file to a directory on the primary computer that the RICOH ProcessDirector system user has access to.\n7. Click File ⇒ Save Control File to save the RICOH Visual Workbench control file.\nThe RICOH Visual Workbench control file contains AFP Indexer and Document Property Designer definitions. If you have AFP Editor or\nWhitespace Manager, the control file also contains those definitions.\n8. Send or copy the RICOH Visual Workbench control file to a directory on the primary computer that the RICOH ProcessDirector system user\nhas access to.\nWhen you create workflows that process AFP jobs containing documents:\nSpecify the name of the Enhance AFP control file in each step based on the BuildAFPFromDocuments step template.\nSpecify the name of the Visual Workbench control file in each step based on the IdentifyDocuments or IndexAFP step template.\nIf you have AFP Editor, specify the name of the Visual Workbench control file in each step based on the EditAFP step template.\nIf you have Whitespace Manager, specify the name of the Visual Workbench control file in each step based on the FillWhiteSpace step\ntemplate.\nParent topic: Configuring AFP Support for documents\n1 of 1"}]}