{"doc_name": "mcc_c_PrepToCallWebServices.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_PrepToCallWebServices.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5087, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Preparing to call MarcomCentral web services - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral / Preparing to call MarcomCentral web services\nPreparing to call MarcomCentral web services\nIn this procedure, you import WSDL files and install a security certificate. If your environment requires a proxy server to communicate with\nMarcomCentral, set up the system to use it. You decide whether you want to call operations in MarcomCentral web services in addition to those\noperations called by the sample input device, workflows, and notification. If you do, you learn the requirements of the operations and manually\ntest the web services.\nTo prepare to call MarcomCentral web services:\n1. Before you make calls to MarcomCentral web services, do these tasks:\n1. Import a WSDL file for each MarcomCentral web service that you plan to call.\nRICOH ProcessDirector creates SOAP request objects from SOAP operations in the WSDL file. You specify a prefix that RICOH\nProcessDirector adds to the names of the SOAP operations when it creates the objects. A SOAP request object lets RICOH\nProcessDirector determine the SOAP version and other information required to make a correct call to the web service.\n2. Install a security certificate for MarcomCentral on the RICOH ProcessDirector primary computer.\n3. If your environment requires a proxy server to communicate with MarcomCentral, set up the system to use it.\nFor more information, see the related tasks.\n2. If you have a production MarcomCentral store, we recommend setting up a test store.\nIf you have a test store, you can test your input device, CallSOAPService steps, and notifications without accidentally processing or closing\nout real orders. You can establish that the communication between RICOH ProcessDirector and MarcomCentral works with simple orders\nand a basic process. You can add information to your web service calls and test new web service calls incrementally.\n3. Decide whether you want to call operations in MarcomCentral web services in addition to those operations called by the sample objects in\ntheMarcomCentral Connect feature.\nThe sample objects call these operations in MarcomCentral web services:\nThe sample MarcomReceiveOrders input device calls the GetOrdersByDate operation in the Order web service and retrieves orders within\nspecified times and dates.\nThe CallSOAPService step in the sample MarcomProcessOrders workflow calls the GetJobTicketsByOrderNumber operation in the Job\nTicket web service and retrieves all the job tickets for an order.\nThe CallSOAPService step in the sample MarcomProcessJobTicket workflow calls the GetJobTicketByLineItem operation in the Job Ticket\nweb service and retrieves the URL of the file to download.\nThe sample MarcomCloseoutOrder notification calls the CloseoutByOrder operation in the Order Closeout web service and sends the\norder ID of a completed order.\nYou can add information for invoicing, packing slips, and settlements to the Request payload property of the notification. As an\nalternative, you can do invoice, packing slip, and settlement operations individually by calling the Invoice, Packing Slip, and Settlement\nweb services. For more information, see the MarcomCentral web services documentation.\nYou can call any operation in any MarcomCentral web service, including Catalog and Inventory, from a CallSOAPService step or a SOAP\nweb service notification.\n4. To call another operation in a MarcomCentral web service from the RICOH ProcessDirector workflows that process MarcomCentral orders\nand job tickets:\n1. Learn the requirements for communication with the MarcomCentral web service operation:\nThe values for requesting data\nThe format of the data provided in the response\nRefer to the MarcomCentral documentation for the web service or consult with the company.\n2. Run a manual test that authenticates with MarcomCentral and requests a response from the web service. Verify that the web service\ndoes the action that you want.\nMany browsers have plug-ins, such as Boomerang for Google Chrome, that test web service calls to SOAP clients.\nWhen the test call updates the correct information at your store and returns the correct response, the payload is ready to use in\nRICOH ProcessDirector.\n3. Save the payload in a text file.\n4. To put the call to the web service operation in a CallSOAPService step, add the step when you define the workflow for processing\norders or job tickets. Copy the payload into the Request payload property of the CallSOAPService step.\n5. To put the call to the web service operation in a notification, add the notification after you define the workflows for processing\norders or job tickets. Copy the payload into the Request payload property of the notification.\nAfter you prepare to call MarcomCentral web services, you are ready to prepare to retrieve orders from MarcomCentral.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Preparing to call MarcomCentral web services - Jenski - Test portal- RPD Linux\nParent topic: Setting up to process orders from MarcomCentral\n2 of 2"}]}