{"doc_name": "aiw_o_PDFPageCounts.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_PDFPageCounts.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2055, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Understanding page counts in PDF jobs - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Jobs with JDF job tickets / Understanding page counts in PDF jobs\nUnderstanding page counts in PDF jobs\nWhen a PDF job with a JDF job ticket that specifies a mixture of duplex and simplex pages is processed by the CountPages step, the blank sides\nof the simplex sheets are not counted in the Total pages property. Some printer controllers cannot process job tickets with these Sides page\nexceptions.\nFor those controllers, you can use either the IdentifyPDFDocuments or the BuildPDFFromDocuments step to insert blank pages in the PDF file\ninstead, through the Page exceptions for sides property. Both of those step templates are included in the PDF Document Support feature.\nThe Page exceptions for sides property has these values:\nReplace with job value\nAll Sides are processed using the Duplex job property. All existing Sides page exceptions in the JDF are removed. If a simplex page is included in\na duplex job, a blank PDF page is inserted in the output PDF. The blank page is counted in the Total pages property and could result in a click\ncharge by the printer vendor for that page.\nKeep values from JDF:\nAll the Sides page exceptions in the JDF are included in the JDF produced by the step. The job-level Sides value in the JDF is also used. The blank\nsides are not included in the Total pages property.\nIf an AFP or PostScript job is transformed to PDF using the TransformToPDFWithMediaInfo step that is provided with the Advanced Transform\nfeature, any sides settings in the AFP or PostScript are preserved as Sides page exceptions in the JDF output by the transform. Blank sides\nproduced by these page exceptions are not included in the Total pages property.\nThe JDF job ticket produced by the step includes a Sides page exception for every page in the job. To improve processing speed, add an\nOptimizeJDF step in the workflow after the TransformToPDFWithMediaInfo step.\nParent topic: Jobs with JDF job tickets\n1 of 1"}]}