{"doc_name": "aiw_c_hintssteptemplates.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_hintssteptemplates.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 9238, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Hints for using step templates - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Hints for using step templates\nHints for using step templates\nThese hints for using step templates help you choose the steps to place in a workflow, order the steps in the correct sequence, and take\nadvantage of conditional processing capabilities. The Workflow Editor does not validate workflows to make sure that steps are in the correct\nsequence or that conditional processing rules work.\nSample workflows for learning how to order steps\nRICOH ProcessDirector includes several sample workflows and others are supplied with features, such as Archive or Inserter. We strongly\nrecommend that you study the order of the steps in the sample workflows, especially the more complicated workflows, before you create your\nown.\nFirst and last steps in a workflow\nWe strongly recommend that you make the first step in a workflow SetJobPropsFromTextFile and the last step RemoveJobs. When workflow\nreceives a job, SetJobPropsFromTextFile reads all the steps in the workflow and initializes the values for the job properties with the defaults on\nthose steps.\nNote:\nThe AssignJobValues step sets property values but does not assign property values from all the steps in a workflow. Because\nSetJobPropsFromTextFile considers all steps, it is a better choice for the first step.\nThe RemoveJobs step not only deletes data files from the system but also cleans up database entries for a job.\nWe recommend that you put a RetainCompletedJobs step before the RemoveJobs step. If your workflow does not have a RetainCompletedJobs\nstep, jobs disappear from the system as soon as they complete the step before the RemoveJobs step.\nProperty values for multiple steps based on the same step template\nYou can place steps based on step templates with positional properties in a workflow multiple times, and their properties can take different\nvalues when each step is used. The RunExternalProgram step template is an example. Two different RunExternalProgram steps can run two\ndifferent external programs.\nYou can also place steps based on step templates that do not have positional properties in a workflow multiple times. When you change the\nvalue of one step’s properties, the values of the properties for the other steps change. The PrintJobs and RetainCompletedJobs step templates are\nexamples.\nTwo different PrintJobs steps can only have one Requested printer property value. If you want two different branches of a conditional workflow\nto print to a different printer, you must place a step based on the AssignJobValues step template before each PrintJobs step. Set the values you\nwant for each branch of the conditional workflow on each AssignJobValues step. The value of the Requested printer property in each\nAssignJobValues step overrides the Requested printer property value in the two PrintJobs steps.\nTwo RetainCompletedJobs steps can only have one Retention period property value. Use AssignJobValues steps to set different Retention period\nproperty values before the RetainCompletedJobs step.\nNote:\nIf a job moves through multiple workflows in your production print process, you can use AssignJobValues steps in one workflow to set\nproperty values for steps such as PrintJobs in another workflow. You cannot see the property value in the job’s properties notebook while\nthe job is in the first workflow because the step at which the property is set is not in the first workflow. As soon as the job transfers to\nthe second workflow, you can see the property value in the job’s properties notebook.\nTo see whether a property on a step template is positional, click the icon and check the Usage notes in the help.\nDifferent data streams in one conditional workflow\nIf you want to use different branches of a conditional workflow for jobs in different data streams, such as PDF and AFP, make sure that the Input\ndata stream property is set properly before the job reaches the conditional processing by data stream. The DetectInputDataStream step sets the\nvalue of the Input data stream property.\nIf your workflow only processes one data stream, you can omit the DetectInputDataStream step and set the value of the Input data stream\nproperty on the SetJobPropsFromTextFile step at the start of the workflow.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Hints for using step templates - Jenski - Test portal- RPD Linux\nIf you do not set the value of the Input data stream property, RICOH ProcessDirector might set the value to Unknown. If a connector has a rule\nthat checks the value of the Input data stream property, your workflow might give unexpected results when it processes jobs in Unknown data\nstreams.\nSteps for reprinting partial jobs\nThe CreatePageRanges step generates a subset AFP or PDF print file when you select the Print again function and specify less than the whole job.\nTo work, CreatePagesRanges needs information about the number of pages in the job. Steps based on the EnableRepositioning and CountPages\nstep templates can be used for this purpose but must be placed before the CreatePageRanges step in the workflow. You only need one of them.\nIf your job is indexed AFP, use EnableRepositioning. Otherwise, use CountPages. If your jobs are neither AFP nor PDF, do not use any of the three\nsteps.\nStep to keep related child jobs together\nIn some cases, your original job may end up as several child jobs that you want to keep together at critical points in the workflow such as\nprinting. Place a WaitForRelatedJobs step before the step that needs all the child jobs together. The WaitForRelatedJobs step stops processing\nuntil all the child jobs reach that point in the workflow.\nStep templates that cannot be copied or deleted\nSome step templates, such as PrintJobs and RemoveJobs, are protected by the system. They cannot be copied or deleted. Although you might\nwant to set the Requested printer property value in the PrintJobs step template to one type of printer and then copy the PrintJobs step template\nand set the value in the copy to another type of printer, you cannot do that. Use two steps based on the AssignJobValues step template to set\ndifferent property values and pass them to the PrintJobs step in the workflow.\nStep for notification of jobs that stop in a conditional workflow\nIf you want to write a message to the job log when a job stops in a step because the conditional processing in a workflow is not designed\ncorrectly, add a step based on the FailWithMessage step template as the last conditional branch of a step. When a job arrives at the\nFailWithMessage step, RICOH ProcessDirector writes the message that you specify with the FailWithMessage step.\nIf you do not have a FailWithMessage step and a job does not meet any of the conditions to go to another step, the job stays in the step in a No\nmatching connector state.\nSteps available to the Process again function\nEach step in a workflow has a Step restart type property. The default value is General. If a step has any Step restart type property value except\nNone, you can choose the step when you use the Process again function on a job. RICOH ProcessDirector saves the input print file to each step at\nwhich you can restart a job. If you want to reduce the number of copies of large files that you keep in the system, set the Step restart type\nproperty value to None on some steps. Operators can still process jobs again, but they might have to restart the job at an earlier step in the\nworkflow.\nNote:\nOnly steps that have been run for a job can be processed again. Depending on the step and attributes, a job that is processed again\nmight take a different path through the workflow.\nIf you edit a workflow with active jobs in it, you must start over at the beginning of the workflow to restart the job.\nSteps available to the Print again function\nWe recommend setting the Step restart type property value to Print on the CreatePageRanges step. When an operator uses the Print again\nfunction for a job, RICOH ProcessDirector starts the reprinting process at the first step in the workflow with a Step restart type property value of\nPrint. If you do not set the Step restart type property value on at least one step to Print, you cannot use Print again. RICOH ProcessDirector does\nnot set the Step restart type property value to Print by default.\nSteps available to the Override error function\nIf you use a step that puts a job in error, you can use the Override error function to move the job out of the error state manually. Set the value of\nthe Allow error override property to Yes. For example, the VerifyPrintedSheetCount step puts a job in error if the count does not match. When\nthe Allow error override property is set to Yes, an operator can force a job to continue through the workflow even though the printed sheet\ncount has not been verified.\nAdditional information on step templates\nSeveral step templates have relationships to other step templates. Each step template has a reference topic in the Supplied step templates section\nof the information center. See the usage notes in those topics to understand the relationships before using the step templates in a workflow.\nParent topic: Preparing to use workflows\n2 of 2"}]}