{"doc_name": "aiw_receiveord.pdf", "doc_path": "data/raw/RPD-en-US/aiw_receiveord.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3028, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Configuring workflows to receive orders - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Configuring to receive orders / Configuring workflows to receive orders\nConfiguring workflows to receive orders\nTo process order XML files generated by your ordering system, you set up a workflow that includes a step based on the CreateOrdersFromFile\nstep template. That step uses an order property mapping to define one or more orders and the jobs they contain. The step also submits those\njobs to another workflow for processing.\nNote:\nBefore you begin, make sure you create:\nAn order property mapping object that can interpret the order XML files that this workflow receives.\nAn input device that receives XML files. You can copy the OrderHotFolder sample or add a new input device.\nA workflow to process the jobs included in each order.\nTo configure a workflow to receive orders:\n1. Click the Workflow tab.\n2. Copy or create a workflow and open it in the Workflow Editor.\n3. If you are editing an existing workflow, disable it.\n4. If you are not using a copy of the OrderSample workflow, add a step based on the CreateOrdersFromFile step template to the Receive\nphase of the workflow.\n5. Set values for the properties of the CreateOrdersFromFile step:\n1. For the Order input file property, specify the name of the order XML file. You can enter a file name, a symbol that resolves to a spool\nfile name, or use a step resource. Refer to the help for additional information. The default value is the symbol:\n${getFileName(print,xml,read)}\n2. For the Order property mapping property, select the property mapping object you created for this workflow.\n3. For Create as child jobs, decide whether you want the jobs in each order to be created as independent jobs or as child jobs of the job\nthat processes the order XML.\nThe primary difference between the options is in the Job number property of those jobs. Job numbers for child jobs start with the job\nnumber of the parent, followed by a decimal and a number after it. For example, if the parent job number is 1020, the child job\nnumbers are: 1020.1, 1020.2, 1020.3 Independent jobs are assigned entirely different job numbers. In either case, the jobs are still\nlinked to the order.\n4. For Workflow for jobs, choose the workflow to process the jobs in each order. If you have not created that workflow yet, set it to Not\nset. Remember to update the workflow after you create the workflow.\nNote:\nThis step only runs on the primary server. Do not tune it to run on an application or secondary server, including a local secondary\nserver.\n6. Add steps and connectors for other processing, if needed.\n7. Save the workflow.\n8. Update the input device you created to make sure it submits jobs to the created workflow.\n9. Test the workflow:\n1. Enable the workflow.\n2. Enable and connect the input device that sends orders to the workflow.\n3. Submit an order XML file to the input device.\nParent topic: Configuring to receive orders\n1 of 1"}]}