{"doc_name": "avanti_t_assignCCtoPrinter.pdf", "doc_path": "data/raw/RPD-en-US/avanti_t_assignCCtoPrinter.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2772, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Assigning a cost center and job color to report to a printer - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Assigning a cost center and job color to report to a printer\nAssigning a cost center and job color to report to a printer\nFor Avanti Slingshot to account correctly for the time a job spends on a RICOH ProcessDirector printer, you must assign a cost center to the\nprinter. Using the printer cost center, RICOH ProcessDirector reports the total pages or sheets printed on specific media by name and by product\nID (if a Product ID value is specified for the media). RICOH ProcessDirector also reports whether all the pages in a job were printed in full color or\nonly in a single color ink or toner, usually black.\nThe cost centers are defined in the avanti.cfg file.\nTo assign a cost center and job color to report to a printer:\n1. In the Printers portlet, right-click the printer and select Properties.\n2. On the Avanti Slingshot tab, select a value for the Slingshot cost center property.\n3. For the Job color to report property:\nSelect Black for a black and white printer or a color printer set to print only with black ink or toner.\nSelect Color for a color printer set to print in full color.\nSelect From job for Ricoh TotalFlow printers, especially if jobs are printed in a combination of single-color and full color pages.\nNote: This property does not control whether the printer prints in full color or only with black ink or toner. The property is used only\nto report the ink or toner information to Avanti Slingshot.\n4. Select a value for the Print unit to report property.\nThe value selected is always used to calculate media volume. However, it is only used for job color if the Job color to report property is set\nto Black or Color.\n5. Click OK.\nWhen an Avanti Slingshot job runs in RICOH ProcessDirector, the amount of time each job spends on the printer is reported to the correct cost\ncenter in the Avanti Slingshot system. The start time on the printer is when the job state changes to Assigned. The complete time is when the job\nstate changes to Complete.\nWhen each job finishes printing, RICOH ProcessDirector reports the total pages or sheets printed on specific media by name and by product ID\n(when specified). RICOH ProcessDirector also reports whether all the pages were printed in full color or only with a single (usually black) ink or\ntoner.\nNote:\nIf you assign a value to the Slingshot cost center property for a printer, do not include the PrintJobs step in a series of steps that send cost\ncenter information to Avanti Slingshot.\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n1 of 1"}]}