{"doc_name": "pref_c_DefineDocProps.pdf", "doc_path": "data/raw/RPD-en-US/pref_c_DefineDocProps.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3637, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Defining document properties for use with a preferences file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Preference Management feature / Defining document properties for use with a preferences file\nDefining document properties for use with a preferences file\nBefore RICOH ProcessDirector can use data about documents, you must define the data as RICOH ProcessDirector document properties.\nTo define document properties for use with a preferences file:\n1. Identify data that you need document properties for.\nExamples:\nYou want to extract account number, customer name, and statement date from each document in the job. You need to define three\ndocument properties.\nAs a job goes through the workflow, the IdentifyPDFDocuments step (PDF files) or IdentifyDocuments step (AFP files) extracts the data\nfrom each document in the job.\nYou want to extract two columns of data from an external preferences file so you can insert the data into the job. The columns have the\nheadings Output Type and Awards. You need to define two document properties.\n2. For each document property, choose a user interface name and a database name.\nYou can use existing RICOH ProcessDirector document properties, or you can define your own custom document properties.\nExamples:\nYou can use the Output type document property (database name Doc.Pref.Output), which is supplied with the Preference Management\nfeature.\nInstead of using the Output type document property, you can define your own custom document property. You might give the document\nproperty the user interface name Delivery choice and the database name Doc.Custom.DeliveryChoice.\nYou can define your own custom document property with the user interface name Award level and the database name\nDoc.Custom.AwardLevel.\n3. Use the Administration ⇒ Objects ⇒ Custom properties page to define and activate the custom document properties you need.\nFor example, you might add document properties with these attributes:\nField name: Account number\nDescription: Customer account number\nData type: Number\nDatabase name: Doc.Custom.AccountNumber\nField name: Award level\nDescription: Customer award level\nData type: String\nDatabase name: Doc.Custom.AwardLevel\nNote: You can define all the properties then activate them all at once.\n4. If you are working with PDF files, load the updated RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in for\nAdobe Acrobat.\n5. Specify the data that the IdentifyPDFDocuments step (PDF files) or IdentifyDocuments step (AFP files) extracts from each document in the\njob:\nIf you are working with PDF files, use the Define Document Property function in RICOH ProcessDirector Plug-in for Adobe Acrobat.\nIf you are working with AFP files, use the Document Property Designer (DPD) mode of RICOH Visual Workbench.\nNote: If the AFP files do not have index tags defined for the document data that you want to extract, use the AFP Indexer mode to\nadd the tags. AFP Indexer is not supplied with RICOH ProcessDirector. You must purchase the feature.\n6. Save your document property definitions in a control file for use with the IdentifyPDFDocuments step (PDF files) or IdentifyDocuments step\n(AFP files):\nIf you are working with PDF files, use the Save control file function in RICOH ProcessDirector Plug-in for Adobe Acrobat.\nIf you are working with AFP files, use the Save control file function in RICOH Visual Workbench.\n7. Send the control file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access to.\nParent topic: Setting up the Preference Management feature\n1 of 1"}]}