{"doc_name": "sla_expectedwork.pdf", "doc_path": "data/raw/RPD-en-US/sla_expectedwork.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2642, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Expected work - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Expected work\nExpected work\nExpected work objects represent jobs that are scheduled to arrive at specific intervals. You can associate expected work objects with input devices\nso the input devices can monitor for those jobs to arrive. If they do not arrive when they are expected, the system alerts you.\nYou define expected work as jobs that are expected to arrive in a given time period. The input device counts the number of jobs that arrive and\ncompares them to the expected number of jobs at specific intervals. You can refine the expected work object so it applies to specific types of jobs\nbased on characteristics of the input file name. The input device parses the input file names to see if they match a regular expression and counts\nonly the jobs that match.\nNote:\nIf you use the lpr or lprafp command to submit a job to an LPD input device, the command renames the input file using a format that\nRICOH ProcessDirector cannot reliably parse. In this case, we recommend using only the Number of jobs expected property on expected\nwork objects and leaving the File patterns property blank.\nExpected work objects are particularly useful if your service level agreements (SLAs) with your customers rely on receiving jobs from them by a\nparticular time.\nFor example, you have a customer who sends you three jobs every day. The SLA states that if the jobs arrive by 8:00 AM, they must be printed by\n4:00 PM. You create an expected work object that instructs an input device to check the status at 8:00 AM each day and associate it with the\nappropriate input device. At 8:00 AM, the input device checks to see how many jobs have arrived:\nIf all three jobs have arrived, processing continues as usual.\nIf one or more of the jobs has not arrived, the Expected work status property of the input device is set to Late and an alert ( ) icon appears to\nthe right of the input device.\nYou can then use the Show expected work action on the input device to see more information about the work that has not arrived and try to\nresolve the problem.\nYou can define expected work objects to check for work at various time intervals based on the SLAs that you must meet. You can associate\nmultiple expected work objects with an input device, so the same input device can monitor for jobs that arrive daily and for jobs that arrive\nmonthly on the first of the month. You can also associate an expected work object with multiple input devices, if they all expect to receive jobs\non the same schedule.\nParent topic: System objects\n1 of 1"}]}