{"doc_name": "aiw_c_ConfigProductIDforPrinter.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_ConfigProductIDforPrinter.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3006, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Configuring to send media product IDs to Ricoh PDF printers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring media / Configuring to send media product IDs to Ricoh PDF printers\nConfiguring to send media product IDs to Ricoh PDF printers\nIf the control unit of a Ricoh PDF printer can use product IDs to select media, you can configure RICOH ProcessDirector to send product IDs.\nBecause RICOH ProcessDirector sends product IDs in JDF job tickets, the Data stream to send property for the Ricoh PDF printer object must be\nset to JDF/PDF.\nTo configure to send media product IDs to Ricoh PDF printers:\nIf the Media to use property for your printer is set to Printer, set the product ID values on the printer media objects:\n1. Click the Administration tab.\n2. In the left pane, click Media ⇒ Printer Media.\n3. Right-click the first media object that you want to assign a product ID, and select Properties.\n4. Type a value for the Product ID property.\n5. Click OK.\n6. Repeat these steps for each printer media object that you want to assign a product ID.\nIf the Media to use property for your Ricoh PDF printers is set to System and all of them use the same product IDs to match media, assign a\nproduct ID to each system media object:\n1. Click the Administration tab.\n2. In the left pane, click Media ⇒ System Media.\n3. Right-click the first media object that you want to assign a product ID, and select Properties.\n4. Type a value for the Product ID property.\n5. Click OK.\n6. Repeat these steps for each system media object that you want to assign a product ID.\nIf the Media to use property for your Ricoh PDF printers is set to System and some of them use different product IDs to match media, create a\nmediamap.cfg file. Use an editor that saves text in UTF-8 format:\n1. On the first line, type the Printer name value, a comma, the Media name for the media object, a comma, and the Product ID value for the\nmedia object.\nFor example, if the printer name is RicohPro9110, the media name is A4 Blue, and the media product ID is 39872, type:\nRicohPro9110,A4 Blue,39872\n2. On the next line, type another set of values for Printer name, Media name, and Product ID.\nFor example: RicohPro9110,A4 Yellow,39865\nFor ease of reference, we recommend that you keep all the lines for each printer together in the file.\n3. After you type the lines required to list the media names and product IDs for the first printer, type the lines required for the next printer.\nThis mediamap.cfg file maps three media names to product IDs for the Ricoh Pro 9110 printer. The file maps four media names to\nproduct IDs for the Ricoh Pro 8120 printer:\nRicohPro9110,A4 Blue,39872\nRicohPro9110,A4 Yellow,39865\nRicohPro9110,A4 White,39798\nRicohPro8120,A4 Blue,239872\nRicohPro8120,A4 Ivory,239823\nRicohPro8120,A4 White,239805\nRicohPro8120,A4 Recycled,239910\n4. Name the file mediamap.cfg and save it in the /aiw/aiw1/config directory as a text file in UTF-8 format.\nParent topic: Configuring media\n1 of 1"}]}