{"doc_name": "aiw00a26.pdf", "doc_path": "data/raw/RPD-en-US/aiw00a26.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2835, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Connecting and disconnecting input devices - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Input devices / Connecting and disconnecting input devices\nConnecting and disconnecting input devices\nConnecting and disconnecting an input device controls the flow of data into the input device from job submission tools. An input device can only\nreceive input files if it is connected.\nBefore you connect an LPD input device whose parent server is a Linux system, stop any LPD daemons on the Linux system that do not belong to\nRICOH ProcessDirector.\nDisconnected input devices do not receive any more input files. If an input device is still enabled, any input files that it received before it was\ndisconnected can still be submitted for processing.\nTo connect or disconnect an input device:\n1. In the Input Devices portlet, right-click the input device or devices that you want to connect or disconnect.\n2. Select Connect or Disconnect.\n3. If you see a confirmation message, click Yes.\nNote:\nIf the parent server for the input device is not available when you make the connection request, RICOH ProcessDirector changes the icon\nto the left of the input device. It also changes the Connection status property for the input device to Unable to connect. After you correct\nthe problem with the parent server, RICOH ProcessDirector connects the input device.\nIf more than one Download input device has the same port number assigned, RICOH ProcessDirector only lets you connect and enable\none of the input devices at a time.\nConnecting or disconnecting a Download input device also starts or stops the Download daemon. If the Download daemon stops\nrunning or the mainframe system loses connection, the Connection status property of the input device is changed to Disconnected.\nConnecting the first LPD input device on a RICOH ProcessDirector server also starts the LPD daemon. If the LPD daemon does not start,\nthe Connection status property for the input device changes to Unable to connect. If the parent server of the input device is a Linux\nsystem, a possible reason is that other LPD daemons are already running on the Linux system. Stop these daemons, then disconnect and\nreconnect the LPD input device.\nDisconnecting the last LPD input device on a RICOH ProcessDirector server also stops the LPD daemon.\nAfter RICOH ProcessDirector connects or disconnects an input device, the symbol next to it changes. The connected symbol is a solid\ngreen arrow. The disconnected symbol is a broken orange arrow.\nNote:\nYou can set up a notification object to send an email when an input device is disconnected.\nIf you have the Web Services Enablement feature, you can set up a notification object to issue a SOAP or REST web service call when an\ninput device is disconnected.\nParent topic: Input devices\n1 of 1"}]}