{"doc_name": "addingindexstep2.pdf", "doc_path": "data/raw/RPD-en-US/addingindexstep2.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4605, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Adding steps to index AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Adding steps to index AFP files\nAdding steps to index AFP files\nAfter you create page groups and index tags in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more workflows\nto create page groups and index tags in production AFP files that use the workflows. The step names the Visual Workbench control file that\ncontains definitions for the page groups and index tags.\nYou can base the step on the IndexAFP step template. If AFP Editor is installed, you can base the step on the EditAFP step template. If\nWhitespace Manager is installed, you can base the step on the FillWhiteSpace step template.\nIf you base the step on the IndexAFP step template, place the step before the EnableRepositioning step so that you can use the Print again action\nto reprint a page group.\nIf you base the step on the EditAFP or FillWhiteSpace step template, position the step relative to these steps if they are present:\nAfter a step that converts line data to AFP format (for example, after the ConvertLineDataJobIntoAFP step)\nAfter a step that converts Xerox data to AFP format\nBefore the EnableRepositioning step\nBefore a step that transforms AFP files into another format (for example, before the TransformJobIntoPDF step)\nBefore the PrintJobs step\nNote:\nYou can use the IndexAFP step template to enhance the AFP files that the RICOH ProcessDirectorTransform Features create.\nTo add a step to index AFP files:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\nIf you prefer to modify a copy of the workflow, right click it and choose Copy. Name the copy of the workflow, fill in or edit other values\nthat you need, and click Continue.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name. If you do not disable the workflow while you edit\nit, jobs that use this workflow continue to move through steps. When you save, the workflow is momentarily disabled then enabled again.\nJobs that are processing in the workflow could move into error.\n4. In the workflow editor, click the side panel in the top right corner of the window.\n5. Go to Steps and expand the AFP TOOLS group.\n6. Select one of these step templates:\nIndexAFP: This step template creates page groups and index tags in AFP files.\nEditAFP: This step template can create page groups and index tags before it creates barcodes, text, and hidden areas in AFP files.\nFillWhiteSpace: This step template can create page groups, index tags, barcodes, text, and hidden areas before it fills defined white space\nwith content in production AFP files.\nNote:\n1. The same Visual Workbench control file must contain the definitions for page groups, index tags, barcodes, hidden areas, and\nwhite space.\n2. The EditAFP step template is available only if AFP Editor is installed.\n3. The FillWhiteSpace step template is available only if Whitespace Manager is installed.\n4. Select the EditAFP step template only if the IndexAFP step and the EditAFP step can be done consecutively in the same phase.\nOtherwise, add the steps separately.\n7. Drag one of the steps into the workflow editor.\n8. Connect the step to other steps.\n9. Right-click the step and select Properties.\n10. If necessary, change the General properties.\n11. Click AFP.\n12. In the Visual Workbench control file field, type the path and file name of the Visual Workbench control file that contains the definitions to\ncreate the page groups and index tags.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:10 PM Adding steps to index AFP files - Jenski - Test portal- RPD Linux\nNote:\nThis control file is not the same as an index object file that the ConvertLineDataJobIntoAFP step might create.\nIf you want to use the same workflow for input files that require different control files, you can use symbolic notation for the name\nof the control file. For example, if you have two input files, abc.afp and xyz, with corresponding control files, abc.afp.ctl and\nxyz.ctl, and you want to use the same workflow for both files, you can use ${Job.InputFile}.ctl as the control file in the\nVisual Workbench control file field. ${Job.InputFile}.ctl causes RICOH ProcessDirector to set the value of the Visual\nWorkbench control file to the name of the input file plus the .ctl extension.\n13. If you selected the EditAFP step template, select Yes in the Index first field.\n14. Click OK.\n15. Save and enable the workflow.\nParent topic: Indexing AFP files\n2 of 2"}]}