{"doc_name": "aiwi0_integratefeat.pdf", "doc_path": "data/raw/RPD-en-US/aiwi0_integratefeat.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2821, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Integration features - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Integration features\nIntegration features\nIntegration features help you connect RICOH ProcessDirector to other products, including products from certain other companies. These features\nprovide objects that make integrating with the other applications easier. The other applications must be purchased separately.\nIn this section:\nAvanti Slingshot Connect\nThe Avanti Slingshot Connect feature lets you exchange information with the Avanti Slingshot Management Information System (MIS) software.\nAfter creating orders, Avanti Slingshot can send PDF print jobs with JDF job tickets to RICOH ProcessDirector. Alternatively, RICOH ProcessDirector\ncan send Avanti Slingshot the information required to create orders for jobs in RICOH ProcessDirector workflows.\nCut Sheet support for Kodak feature\nThe Cut Sheet support for Kodak feature provides support for the Kodak Digimaster printer.\nCut Sheet support for Xerox feature\nThe Cut Sheet support for Xerox feature provides support for specific models of Xerox printers.\nFusionPro Connect\nThe FusionPro Connect feature lets you use FusionPro to compose documents based on predefined templates. FusionPro Connect uses FusionPro\nServer to process the records in a data file in the format you select.\nMarcomCentral Connect\nThe MarcomCentral Connect feature illustrates how you can integrate the online-storefront and web-to-print functions of MarcomCentral速 into\nyour production workflows. A SOAP web service input device retrieves orders for print, digital, and other items from MarcomCentral. RICOH\nProcessDirector creates an order for each MarcomCentral order and a job for each order detail. RICOH ProcessDirector downloads files for print\nitems and notifies MarcomCentral to close out the order when all the items complete their processing.\nPitStop Connect\nPitStop Connect lets you integrate preflight operations that use Enfocus PitStop Server 10 or higher into your workflows for PDF print jobs.\nQuadient Inspire Connect\nThe Quadient Inspire Connect feature extends RICOH ProcessDirector to make it easier to interact with Quadient Inspire Designer v8 and higher.\nThe feature adds system objects tailored to work with files created by Quadient Inspire Designer so they can be submitted to the processing\nengine to generate print jobs as part of a print workflow.\nRICOH Predictive Insight Connect\nThe RICOH Predictive Insight Connect feature lets you send data collected by the Reports feature in the PostgreSQL database to the RICOH\nPredictive Insight application in the cloud.\nUltimate Impostrip速 Connect\nUltimate Impostrip速 Connect lets you integrate the impositioning functions of Ultimate Impostrip速 into your workflows.\nParent topic: Features\n1 of 1"}]}