{"doc_name": "replacingpostnetbarcodes.pdf", "doc_path": "data/raw/RPD-en-US/replacingpostnetbarcodes.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6026, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Replacing POSTNET barcodes with IMBs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Replacing POSTNET barcodes with IMBs\nReplacing POSTNET barcodes with IMBs\nYou can replace POSTNET barcodes in AFP files with Intelligent Mail barcodes (IMBs). When you replace POSTNET barcodes, AFP Editor deletes\nthe POSTNET barcodes and creates IMBs that contain the same routing codes as the POSTNET barcodes.\nPOSTNET barcodes can be in a fixed location in the AFP file or, in the case of a multiple line address, they might float between lines. You can\nselect the actual location of the POSTNET barcode that you want replaced, or you can select an area in which you think the barcode is located.\nAFP Editor can automatically place the IMBs in exactly the same position as the POSTNET barcodes they replace. The position of the POSTNET\nbarcodes can vary slightly in different page groups. The position of any POSTNET barcode can be up to .4 inches or 10 millimeters higher or\nlower than the position of the particular POSTNET barcode that you replaced in the sample AFP file. (This allows for variations in the position of\nthe POSTNET barcode in different page groups because of variable length addresses.)\nIf you do not want to place the IMBs in the same position as the POSTNET barcodes they replace, you can specify a new position for the IMBs. If\nyou specify a new position, AFP Editor places all IMBs in the exact position that you specify.\nTo determine the new position of the IMBs, work from a copy of the sample AFP file printed on the production printer. Measure where you want\nto place the top-left corner of the barcode area (X and Y positions) on the printed page from the top-left corner of the logical page.\nNote:\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo place the IMB in the same position as the Address Change Service (ACS) data and PLANET barcode, use AFP Editor to create a hidden area to\ncover the ACS data and PLANET barcode before you replace the POSTNET barcode.\nNote:\nYou can replace POSTNET barcodes that are on logical pages in the AFP file. However, you cannot replace POSTNET barcodes that are part\nof page segments or overlays.\nTo replace a POSTNET barcode with an IMB:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the file does not contain page groups, use AFP Indexer to create page groups.\n3. Click Mode ⇒ AFP Editor.\n4. Navigate to the page that contains one of the POSTNET barcodes.\n5. Optional: To place the IMB in the same position as a PLANET barcode, create a hidden area that covers the PLANET barcode and any other\ndata that you do not want to print, such as ACS data.\n6. Do one of these:\nSelect the POSTNET barcode.\nPosition your cursor at a corner of the area that contains the POSTNET barcode. While pressing the left mouse button, draw a box that\nincludes the barcode.\n7. Right-click anywhere in the AFP file and then click Replace POSTNET with IMB.\nNote:\nIf you do not see the Replace POSTNET with IMB option and the POSTNET barcode is a text barcode, identify the directory that\ncontains the POSTNET font to RICOH Visual Workbench (Resources ⇒ Specify Resource Directories). If you still do not see the\nReplace POSTNET with IMB option, try changing the default code page to another code page (Resources ⇒ Modify Default\nEncoding).\nIf you see an error message instead of the Replace Barcode window, AFP Editor could not find any POSTNET data in the area you\nselected.\n8. On the Type tab, type a descriptive name for the IMB and specify the representation of the IMB.\nSee Type tab for IMBs for a description of the fields.\n9. On the Data tab, specify the data to be encoded in the IMB symbol.\nSee Data tab for IMBs for a description of the fields.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Replacing POSTNET barcodes with IMBs - Jenski - Test portal- RPD Linux\n10. Optional: On the Position tab, change the origin of the barcode area or the orientation of the barcode symbol within the area. You can also\nchange on which pages to place the barcode in each page group.\nSee Position tab for IMBs for a description of the fields.\n11. Click OK.\nIf you have more than one barcode defined, you might see the Create Conditions between Definitions window. Click Yes if you want to\ncreate a condition for determining which barcode is used, and then click OK.\nYou see the IMB in the AFP file.\nNote:\nIf the IMB is a text barcode and you do not see the barcode symbol, identify the resource directory that contains the AFP IMB font\nto RICOH Visual Workbench (Resources ⇒ Specify Resource Directories). The AFP IMB font is installed in the\naiw/aiw1/plugins/EditAFP (Linux) or C:\\aiw\\aiw1\\plugins\\EditAFP (Windows) directory.\n12. If you see an error message, the barcode is not created in any page group. In addition, no other barcodes or hidden areas are created. If\nthe Replace Barcode window is open, correct the barcode properties. If the Replace Barcode window is already closed, click Tools ⇒ Modify\nDefinitions to correct the properties. (In the Modify and Delete Definitions window, identifies the barcode with the error.)\nIf you included index tag values in the barcode data and the error message indicates that barcode data is too long or contains characters\nthat are not valid, you might need to modify the index tag to correct the problem.\nIn this section:\nType tab for IMBs\nOn the Type tab, you specify the name of the Intelligent Mail barcode (IMB) area and whether to create a BCOCA or text barcode.\nData tab for IMBs\nOn the Data tab, you specify the data that AFP Editor encodes in the barcode symbol for Intelligent Mail barcodes (IMBs).\nPosition tab for IMBs\nOn the Position tab, you can change the origin (top-left corner) of the Intelligent Mail barcode (IMB), the size of the barcode area, and the\norientation of the barcode symbol.\nParent topic: Editing AFP files\n2 of 2"}]}