{"doc_name": "avanti_t_defineCostCenters.pdf", "doc_path": "data/raw/RPD-en-US/avanti_t_defineCostCenters.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1921, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Defining Avanti Slingshot Connect cost centers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Defining Avanti Slingshot Connect cost centers\nDefining Avanti Slingshot Connect cost centers\nAvanti Slingshot Connect cost centers are essential for allocating the costs of time and materials. Entries in the avanti.cfg file in RICOH\nProcessDirector are tied to objects in the Avanti Slingshot system where the cost allocation occurs. You must use the External Device ID for each\ncost center in the avanti.cfg file. If you use the name of the cost center and that name is different from the External Device ID that is defined in\nSlingshot, RICOH ProcessDirector cannot report data correctly. The entries in the avanti.cfg file are known as cost centers in RICOH\nProcessDirector and are called External Device IDs in the Avanti Slingshot system. These IDs let RICOH ProcessDirector correctly allocate\ninformation to the Avanti Slingshot cost centers.\nNote: Before you do this, look in System Setup ⇒ Organization ⇒ Operation Category in Avanti Slingshot to make sure that all of your\ncost centers have External Device IDs defined.\nTo define the cost centers for RICOH ProcessDirector:\n1. Navigate to the avanti.cfg file: /aiw/aiw1/config/avanti.cfg on Unix-based operating systems and C:\\aiw\\aiw1\\config\\avanti.cfg on\nWindows.\n2. Open the file in a text editor.\n3. Enter the values that match the External Device IDs defined for cost centers in Avanti Slingshot. Type each entry on a separate line.\nThe cost center values are case-sensitive.\n4. Save the avanti.cfg file and exit the text editor.\nThe new values that you have entered are available as Slingshot cost centers the next time you access RICOH ProcessDirector.\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n1 of 1"}]}