{"doc_name": "aiw00a13.pdf", "doc_path": "data/raw/RPD-en-US/aiw00a13.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4600, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Stopping the base product and secondary servers - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / RICOH ProcessDirector servers / Starting and stopping servers / Stopping the base product and secondary servers\nStopping the base product and secondary servers\nWhen you stop the RICOH ProcessDirector base product or a remote secondary server, you can stop the system with or without waiting for job-\nprocessing steps to complete. If you have the AFP Support feature installed, you can also choose whether to stop processes that were started by\nthe RICOH ProcessDirector printer driver component, by Download for z/OS, or by AFP Download Plus.\nAfter a system shutdown and restart, all the printers are disabled. If you want all the printers that were enabled before the shutdown to be\nenabled after the system is restarted, you can change the Remember enabled status of printers system property to Yes.\nTo stop the base product or a remote secondary server:\n1. Log in to the system as the RICOH ProcessDirector system user ( aiw1 is the default).\n2. Access the command line.\n3. Optional: To minimize the impact of shutting down the system on processes that are currently running, disable the input devices associated\nwith the server.\n4. Enter one of these commands:\nTo stop the system immediately without waiting for steps to complete:\nstopaiw\nAny steps that were in a processing state will move to an error state when you restart the system.\nTo stop the system after the currently processing steps are complete:\nstopaiw -q\nTo stop the system and all processes that were started by the printer driver component, by Download for z/OS, or by AFP Download Plus:\nstopaiw -t\nThis option is only available on a primary computer with the AFP Support feature installed.\nOn the primary computer, the command shuts down the primary server, local secondary servers, the user interface program, and the\ninformation center. If a remote secondary server is connected to the primary server when the primary server stops, the secondary server\ntries to reestablish the connection every 30 seconds, until it can connect or until the remote secondary server stops.\nOn a secondary computer, the command disconnects the remote secondary server from the primary server and stops the secondary server.\n5. Optional: While the stopaiw command does shut down RICOH ProcessDirector, in some situations, additional steps are required to ensure\nthat all processing ends. These situations include:\nApplying updates to the operating system.\nReworking the file system that contains /aiw. For example, moving the file system to a new storage unit.\nRunning a full storage backup. For example, shutting everything down so that data transfers do not occur during the backup.\nTo stop all other processing related to RICOH ProcessDirector:\n1. If you run in a PostgreSQL configuration, run the following command: systemctl stop postgresql\n2. The steps that follow require root authority. Type: su - root and press Enter. When prompted, enter the password for the root\nuser and press Enter.\n3. If you run in a DB2 configuration, type: /opt/infoprint/ippd/db/bin/db2fmcu -d\n4. If you run in a DB2 configuration, type: ps -ef | grep db2 to display all db2 processes that are still running. To end each db2\nprocess, type:\nkill followed by each of the process IDs listed in the results of the grep command. For example, your results might look similar to:\ndasusr1 14729 1 0 Aug24 ? 00:00:01 /home/dasusr1/das/\nadm/db2dasrrm\nroot 18266 1 0 Aug24 ? 00:15:08 /opt/infoprint/ippd/db/\nbin/db2fmcd\ndasusr1 18342 1 0 Aug24 ? 00:00:23 /opt/infoprint/ippd/db/das/\nbin/db2fmd -i dasusr1 -m /\nopt/infoprint/ippd/db/das/\nlib/libdb2dasgcf.so.1\nroot 21049 1 0 Sep01 ? 00:00:00 db2wdog 0 [aiwinst]\naiwinst 21051 21049 0 Sep01 ? 01:13:01 db2sysc 0\nroot 21059 21049 0 Sep01 ? 00:00:00 db2ckpwd 0\naiwinst 21061 21049 0 Sep01 ? 00:00:00 db2vend (PD Vendor\nProcess - 1) 0\nIn these results, the process IDs are listed in the second column. To end the first process in the list, type: kill 14729 and press\nEnter.\n5. Type: ps -ef | grep psfapid to display all psfapid processes. To end each psfapid process, type:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Stopping the base product and secondary servers - Jenski - Test portal- RPD Linux\nkill followed by each of the process IDs listed in the results of the grep command.\n6. Type: ps -ef | grep aiw1 to display all aiw1 processes. To end each aiw1 process, type:\nkill followed by each of the process IDs listed in the results of the grep command.\nParent topic: Starting and stopping servers\n2 of 2"}]}