{"doc_name": "aiw_SubmitJobs.pdf", "doc_path": "data/raw/RPD-en-US/aiw_SubmitJobs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1815, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Submitting jobs in the Submit Job portlet - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Submitting jobs in the Submit Job portlet\nSubmitting jobs in the Submit Job portlet\nRICOH ProcessDirector provides different mechanisms to submit jobs, including a portlet on the Main page.\nBefore you begin, make sure that you have permission to use the Submit Jobs portlet, and the hot folder is enabled and connected or the\nworkflow is enabled.\nIf you are submitting one or more jobs as an order, make sure you have all the information you need to create the order or the name of the order\nthat these jobs should be added to.\nTo submit jobs in the Submit Job portlet:\n1. To add the Submit jobs portlet on the Main page, hover over the Main tab until the menu appears, then select Submit Jobs.\n2. To browse for files, click and select the files that you want to submit for processing. Or, you can select the files from your computer,\nhold down the mouse button, drag and drop onto the Submit Jobs portlet. Release the mouse button when the Submit Jobs portlet area\nturns blue.\n3. To send a job to a specific input device, select Submit to ⇒ Input device. From the drop-down list, select which input device to process your\njobs.\n4. To send a job to an order, select Submit to ⇒ Order.\nFrom the Order list, choose an existing order to submit your jobs to, or select New Order to create a new one.\nFrom the Workflow list, select a workflow to process your jobs.\n5. To send a job to a specific workflow, select Submit to ⇒ Workflow. From the drop-down list, select which workflow to process your jobs.\n6. Click OK.\n7. Repeat for other files as needed.\n8. To clear the contents of the Submit Jobs portlet, click Dismiss.\nParent topic: Preparing for job submission\n1 of 1"}]}