{"doc_name": "supplpages_overview.pdf", "doc_path": "data/raw/RPD-en-US/supplpages_overview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2222, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Supplemental pages - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP support for documents / RICOH Visual Workbench / AFP Indexer / Supplemental pages\nSupplemental pages\nAFP Indexer lets you define pages in an AFP file as supplemental pages. Supplemental pages are those pages that you do not want included in\npage groups, such as header and trailer pages, separator pages, or any page that should be excluded from a customer statement.\nPages in an AFP file that are defined as supplemental pages can be indexed.\nYou can define supplemental pages in these ways:\nYou can use a trigger to define a block of text that occurs in a consistent location and uniquely identifies a page. If necessary, you can use\nmultiple triggers to identify supplemental pages. For example, you can create a trigger for a block of text that exists on the third page in a page\ngroup. The supplemental page is removed from each page group.\nYou can use an index tag to define a block of text that occurs in a consistent location on a page that is outside a page group. For example, you\ncan create an index tag for a block of text that exists on the header and trailer pages. You can edit the text value to remove unwanted text such\nas blanks or special characters.\nWhen you define a supplemental page, you give it a page definition name. You can assign multiple index tags and triggers to the same\nsupplemental page definition.\nNote: The term “page definition” in AFP Indexer refers to a supplemental page definition, a page-level trigger, or a page-level index, not\nthe AFP page definition resource.\nFor example, a bank-statement application produces a file with hundreds of individual customer statements. The file contains a header page\nbefore the customer statements and a trailer page at the end of the customer statements. Each statement ends with a page that separates it\nfrom the next statement. With AFP Indexer, you create triggers that define the header, trailer, and separator pages as supplemental pages with\npage definition names of Header, Trailer, and Separator. You can then create index tags on the supplemental pages.\nParent topic: AFP Indexer\n1 of 1"}]}