{"doc_name": "aiw00ccrautoms.pdf", "doc_path": "data/raw/RPD-en-US/aiw00ccrautoms.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6475, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Creating media objects automatically - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring media / Defining media objects / Creating media objects automatically\nCreating media objects automatically\nIf you are using a Ricoh PDF printer or if your printers can detect media information and send it over SNMP or JMF, you can have RICOH\nProcessDirector create media objects automatically. The only printer type that cannot detect media information is a PCLOut printer. PCLOut\nprinters come with the AFP Support feature.\nFor all printer types, RICOH ProcessDirector can use SNMP to retrieve media that is loaded in the printer. If RICOH ProcessDirector does not\nreceive all the information that you specify in the Media Matching section of the Media Settings page, you have to update the media object by\nadding the missing information. For example, if you use size, color, and weight values to identify media, but your printer only provides a size\nvalue, you must add the color and weight values.\nFor Ricoh TotalFlow printers, RICOH ProcessDirector currently only requests media using SNMP, not JMF.\nFor Ricoh PDF printers, RICOH ProcessDirector automatically requests the media information from the printer using JMF. Based on the type and\nversion of the controller on the printer, up to three media lists can be returned: standard media, catalog media, and loaded media. RICOH\nProcessDirector compares the media in the lists to existing media objects by name. For names that match, RICOH ProcessDirector updates the\nproperties of the media object to the values returned from the printer. For names that do not match, RICOH ProcessDirector creates a media\nobject.\nNote:\nSome printer models allow characters in their media names that are not supported in RICOH ProcessDirector media names, such as ? and\n#. When RICOH ProcessDirector finds one of those characters in a media name, it replaces the character with an underscore.\nUsing JMF, RICOH ProcessDirector can retrieve more media property values that are defined on the printer and supported by RICOH\nProcessDirector. If a loaded media list is not returned from the printer, RICOH ProcessDirector requests the loaded media information using SNMP.\nTo determine what media lists your printer model returns, see the readme.txt file on the primary computer in /opt/infoprint/ippd/pc.\nThe media lists are updated when there is a change on the printer, such as if new media is loaded or if the media catalog on the printer is\nupdated. When the list updates, any changes made in the media objects in RICOH ProcessDirector are overwritten by the most recent\ninformation from the printer. If your printers are defined as Ricoh PDF printers, we recommend managing media on the printer instead of in\nRICOH ProcessDirector.\nAfter you create your media objects, RICOH ProcessDirector can use them to match the available printer media input trays with the media\nrequested for a job.\nIf you are using SNMP or your printer does not send loaded media lists using JMF, use this procedure to create media objects. If you are initially\npopulating your media list, repeat this procedure loading in all the media you use.\nTo create media objects automatically:\n1. Click the Administration tab.\n2. In the left pane, click Media ⇒ Media Settings.\n3. In the Media Matching section, click Use media product ID or media name if the printer schedules by product ID or name, or Use the\nproperties selected below if the printer schedules by properties.\n4. If you select Use the properties selected below, select the properties that you use to distinguish media.\nFor example, select Media color and Media weight if you distinguish media based on color and weight.\n5. Click SAVE.\n6. In the input trays, load media that you want RICOH ProcessDirector to create media objects for.\n7. If you are creating media objects for a new printer, define the printer device.\nMake sure the Use SNMP and Get tray information from printer properties are set to Yes.\nRICOH ProcessDirector attempts to create media objects for all media loaded in the input trays.\n8. In the Printers table, right-click the printer and select Show Trays.\nIf the printer reported all the properties you selected to distinguish media, the Tray Media column shows the names of the media objects\nthat were created. Continue with step 10.\n9. If the printer did not report all the properties you selected to distinguish media, no media objects are created. You can manually create\nprinter media objects and set them as available in trays.\n1. Click Add Media.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Creating media objects automatically - Jenski - Test portal- RPD Linux\n2. Type a media name.\n3. Fill in the required and optional properties to distinguish the media.\n4. Click OK.\n5. Right-click the tray that this media is loaded in and select Set tray media.\n6. In the Tray Media list, select the media that you just created and click OK.\n7. Repeat for other media objects that need to be updated.\n8. Click CLOSE.\n10. If the printer reports all the properties that you use to distinguish media, load more media that you want to create RICOH ProcessDirector\nmedia objects for.\n11. If you have two or more printers, create media objects for each printer.\n12. Examine any media objects created by RICOH ProcessDirector. Change the name of the media object to something your operators\nunderstand:\n1. On the Administration page, click Media ⇒ System Media or Media ⇒ Printer Media.\n2. Right-click the media object and select Rename.\n3. Type a new name and click OK.\nOnly include the name from the media catalog. When you click OK, RICOH ProcessDirector adds the name of the printer and a period to\nthe beginning of the media name.\n13. If you load the same media in different printers and RICOH ProcessDirector creates different printer media objects, you can map all of them\nto the same system media object. To map printer media to system media:\n1. On the Administration page, click Media ⇒ Media Mapping.\n2. Click Add.\n3. Select the system media that you want to map.\n4. Select the printer and printer media to associate with the system media.\n5. Click OK.\n6. Repeat for each printer media.\nNow you can schedule print jobs based on media ready in the printer. If your printer can send information to RICOH ProcessDirector over SNMP\nor JMF, you can configure the printer to schedule jobs that automatically match the media loaded in the printer.\nParent topic: Defining media objects\n2 of 2"}]}