{"doc_name": "vwb_barcodes_overview_imb_data.pdf", "doc_path": "data/raw/RPD-en-US/vwb_barcodes_overview_imb_data.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 10440, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Intelligent Mail barcode data - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP Editor / Barcodes / Intelligent Mail barcode data\nIntelligent Mail barcode data\nIntelligent Mail barcodes (IMBs) have several representations and two basic formats. A serial number that identifies each mailpiece is required\nwhen IMBs are used with the United States Postal Service (USPS) Intelligent Mail Full-Service option.\nRepresentations\nAFP Enhancer lets you create Intelligent Mail barcodes (IMBs) in one of these representations:\nBCOCA objects: This object follows the Bar Code Content Object Architecture (BCOCA).\nGeneric barcodes: This object guarantees compatibility on all IPDS printers.\nFont barcodes: A Presentation Text Object Content Architecture (PTOCA) object with transparent text represents the content. The referenced\nfont resource must be available when printing.\nDrawRule barcodes: A PTOCA object uses rules to represent the content.\nAFP Editor lets you create Intelligent Mail barcodes (IMBs) in one of these representations:\nBCOCA objects: Barcode objects follow the Bar Code Content Object Architecture (BCOCA). AFP Editor can create standard height IMB\nsymbols.\nText barcodes:AFP Editor uses the 300 dpi AFP IMB font (US23) that the USPS provides. This barcode font creates standard height IMB symbols.\nIn general, BCOCA objects are preferred to other barcode representations. However, some older printers, such as IBM 3900 printers, cannot\nprocess BCOCA IMBs. To print on these printers, you must use other barcode representations to create IMBs.\nFormats\nIMBs have 5 elements and up to 31 digits. The mailer ID and serial number elements combine to fill 15 of the digits. There are 2 basic formats for\nIMBs, based on the length of the mailer ID assigned by the USPS. The 2 figures show the formats:\nFields in IMBs with a 9-digit mailer ID and a 6-digit serial number\nFields in IMBs with a 6-digit mailer ID and a 9-digit serial number\nBoth IMB formats have these elements:\nBarcode ID\nA 2-digit number that identifies Optional Endorsement Line (OEL) information. The USPS defines the barcode IDs. This field is required.\nService type ID\nA 3-digit number that identifies the mail class and the postal services. For example, “080” is first-class mail with Address Service requested.\nThe USPS defines the service types and service type IDs. This field is required.\nMailer ID\nA 6- or 9-digit number that identifies the mailer. The USPS assigns the mailer ID.\nNote: You can use the Mailer ID field for other purposes in an IMB that is used for reply mail.\nSerial number\nA 6- or 9-digit number that the mailer assigns to identify the mailpiece. If the mailer ID contains 6 digits, the serial number contains 9 digits.\nIf the mailer ID contains 9 digits, the serial number contains 6 digits. This field is required; however, if you use only USPS “Basic Services”,\nthe serial number can be zeroes.\nRouting ZIP Code\nThe 5-, 9-, or 11-digit routing ZIP Code of the mail recipient, also called the “Delivery Point Code”. This field is not required.\nAFP Editor lets you specify these IMB elements on the Data tab.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:24 PM Intelligent Mail barcode data - Jenski - Test portal- RPD Linux\nAFP Enhancer lets you specify these IMB elements using Content Expression Language (CEL). For example, you can use this supplied CEL\nexample:\n'04260' Job.Postal.MailerID fmt(\"%05d\",Doc.Address.ZipCode) '00'\nContent of CEL example Information to substitute or insert\nReplace 04 with your 2-digit Barcode ID.\nIf you have the Postal Enablement feature, the Job.Postal.MailStream job property specifies this\n04\ninformation. Define the property as your Barcode ID in the SetPostalJobProps step.\nReplace 260 with your 3-digit Service type ID.\nIf you have Postal Enablement, the Job.Postal.Type job property specifies this information. Define\n260\nthe property as your Service type ID in the SetPostalJobProps step.\nReplace this job property with a custom job property, such as Job.Info.Attr1. Define the property as\nyour Mailer ID in the SetJobPropsFromTextFile step.\nJob.Postal.MailerID If you have Postal Enablement, use this job property to specify the Mailer ID. Define the property as\nyour Mailer ID in the SetPostalJobProps step.\nIf you do not need to specify a unique serial number for each document:\nInsert a space, 6 zeroes, and another space between Job.Postal.MailerID and\nfmt(\"%05d\",Doc.Address.ZipCode) if you have a 9-digit Mailer ID.\nInsert a space, 9 zeroes, and another space if you have a 6-digit Mailer ID.\nIf you need to specify a unique serial number, see the next section.\nCreate an index tag for the ZIP code data and map the index tag to the Doc.Address.ZipCode\ndocument property.\nfmt(\"%05d\",Doc.Address.ZipCode)\nIf the ZIP code is nine digits, change \"%05d\" to \"%09d\".\nIf you want to extend the barcode by two digits, leave this content in the example.\n'00’ If you do not want to extend the barcode by two digits, delete this content.\nThis CEL example uses the Job.Info.Attr1 job property with a 6-digit Mailer ID and a 5–digit ZIP code:\n'04080' Job.Info.Attr1 000000000 fmt(\"%05d\",Doc.Address.ZipCode) '00'\nThis CEL example uses Postal Enablement job properties with a 9–digit Mailer ID and a 9–digit ZIP code:\nJob.Postal.MailStream Job.Postal.Type Job.Postal.MailerID 000000 fmt(\"%09d\",Doc.Address.ZipCode)\nSerial numbers\nThe serial number in an Intelligent Mail barcode (IMB) identifies the mailpiece. If you use the USPS “Full service” option, the serial number must\nnot repeat in another barcode for a 45-day period.\nA serial number can consist of 6 or 9 digits, depending on the length of the mailer ID.\nAFP Enhancer\nAFP Enhancer lets you specify a serial number using a document property.\nTo add a serial number to the '04260' Job.Postal.MailerID fmt(\"%05d\",Doc.Address.ZipCode) '00' supplied CEL statement:\nInsert a format function fmt() with the document property you are using for the serial number.\nFor example, insert fmt(\"%09d\",Doc.Custom.AccountNumber):\n'04260' Job.Postal.MailerID fmt(\"%09d\",Doc.Custom.AccountNumber) fmt(\"%05d\",Doc.Address.ZipCode) '00'\nThe format function expands the number to 9 digits if you specify \"%09d\" or to 6 digits if you specify \"%06d\".\nCreate an index tag for the account number data and map the index tag to the document property, for example, Doc.Custom.AccountNumber.\nNote: If you want to use data that repeats every month as the serial number but the serial number must not repeat for 45 days, create\nan index tag for the month data in a document date. Map the index tag to a custom document property, such as Doc.Custom.Month.\nInsert 2 format functions:\nfmt(\"%02d\",Doc.Custom.Month) fmt(\"%07d\",Doc.Custom.AccountNumber)\nAFP Editor\nAFP Editor lets you specify the serial number in these ways:\nIndex tag: You can specify an index tag that contains the value to encode as the serial number. The index tag can contain a different value in\neach page group (mailpiece). For example, if the customer ID is indexed, the serial number can be the customer ID. If the customer ID is shorter\nthan the 6 or 9 digits required for a serial number, AFP Editor automatically adds zeroes to the beginning of the customer ID.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:24 PM Intelligent Mail barcode data - Jenski - Test portal- RPD Linux\nSerial number file: For each barcode, you can specify a file that contains the number to use as the serial number in the first IMB in the AFP file.\nAFP Editor automatically increments the number in the file by 1 in each subsequent barcode that it creates to make the serial number unique.\nFor example, if the serial number file contains a starting serial number of 000000, the serial numbers in the barcodes are 000000, 000001,\n0000002, 0000003, and so on.\nBecause 6 or 9 digits might not be long enough to completely identify a mailpiece (for example: the recipient, the type of mailing, the date of\nmailing), you can use a sequential number as the serial number and save the serial number in an index tag in the mailpiece or in a separate\nindex file. If the USPS returns electronic Address Change Service (ACS) information, you can then use the serial number to retrieve the actual\nmailpiece or information about the mailpiece.\nWhen the EditAFP step creates IMBs in production AFP files:\n1. In the first IMB in the AFP file, it encodes the serial number that is in the serial number file.\n2. In each subsequent IMB created, it increments the serial number by 1. This ensures that the serial number is unique in each barcode.\n3. When the serial number reaches the maximum number of digits specified in the serial number file (6 or 9 digits), the number wraps to\n000001 or 000000001.\n4. When it finishes creating IMBs in the AFP file, it updates the serial number file so that the file contains the starting serial number for the\nfirst IMB in the next AFP file that the EditAFP step processes.\nFor example, if the serial number file contains the 6-digit serial number 000001, and the EditAFP step creates four IMBs in two AFP files (each\nAFP file uses the same serial number file), the barcodes contain these serial numbers:\nFirst AFP file: 000001, 000002, 000003, and 000004\nSecond AFP file: 000005, 000006, 000007, and 000008\nAFP Editor can save the actual barcode data that it encoded in each IMB in an index tag. This is especially useful when you use a serial number\nfile because each index tag in the AFP file contains the actual serial number that was encoded in the barcode.\nYou specify the name of the serial number file when you create an IMB in the sample AFP file. You can specify a different serial number file for\neach sample AFP file that has its own control file. Make sure the serial number file has the appropriate permissions set so that the RICOH\nProcessDirector system user (aiw1 is the default) and all users in the RICOH ProcessDirector group (aiwgrp1 is the default) can read and update\nthe file.\nNote: The EditAFP step processes multiple page groups concurrently. Therefore, the serial numbers in the IMBs are not always in\nsequential order by page group. For example, EditAFP might create the IMB in the third page group (using serial number 000002) before it\ncreates the IMB in the second page group (using serial number 000003). Even though the serial numbers might not be in sequential order\nby page group, the serial number in each IMB is unique.\nParent topic: Barcodes\n3 of 3"}]}