{"doc_name": "aiw00o15.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o15.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2133, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Primary server - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Primary server\nPrimary server\nThe RICOH ProcessDirector base product is made up of the primary server, the user interface, and the information center. The primary server\nincludes the RICOH ProcessDirector database, the PSF print driver, and other components. The primary server can interact with application servers\nand secondary servers. The number of application and secondary servers required depends on the needs of your environment. The primary\ncomputer is the computer that the primary server, along with the rest of the base product and most features, is installed on.\nYou install the base product on an x86 server that has one of these operating systems installed:\nRed Hat 8.1 through latest 8.X\nRocky Linux 8.4 through latest 8.X\nRocky Linux 9.0 through latest 9.X\nSUSE Linux Enterprise Server (SLES) 12.0 with Service Pack 4 or above for x86_64\nSUSE Linux Enterprise Server (SLES) 15.0 with Service Pack 1 or above for x86_64\nUsing the latest service pack is recommended.\nNote: The DB2 database cannot be installed on Rocky Linux. As a result, you can only install RICOH ProcessDirector with the PostgreSQL\ndatabase on Rocky Linux.\nThe primary server:\nManages all aspects of job processing, from the input devices that receive input files to the printers that print the jobs.\nProcesses each job through a series of steps, some of which can call other programs that are not part of RICOH ProcessDirector to do special\nprocessing.\nManages related applications, such as:\nThe database that RICOH ProcessDirector uses to store system information.\nThe web server that it uses to display the user interface.\nManages this information center.\nControls system settings, such as:\nWhat hosts can submit jobs using the LPD protocol.\nThe retention period for jobs after their processing completes.\nHow frequently users must change their RICOH ProcessDirector passwords.\nMaintains a shared file system that application and secondary servers mount to access system-wide information.\nParent topic: System objects\n1 of 1"}]}