{"doc_name": "aiw00c6.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c6.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2988, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Setting up AFP printers to print banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / AFP banner pages / Setting up AFP printers to print banner pages\nSetting up AFP printers to print banner pages\nRICOH ProcessDirector can print these types of banner pages with an AFP job: header pages, separator pages, and trailer pages. Header pages\nprint before the first data pages of a job. Separator pages print between copies of a multi-copy job. Trailer pages print after the last data pages\nof a job.\nThe default is for a printer to print only header pages.\nTo set up a printer to print banner pages:\n1. In the Printers Portlet, find the printer that you want to use to print jobs with banner pages. If the printer is enabled, right-click it and select\nDisable.\n2. Click the printer name to open the properties notebook.\n3. In the properties notebook, click Banner Pages to display the banner page properties for the printer.\n4. To select the types of banner pages that you want to print, set Enable header pages, Enable separator pages, or Enable trailer pages to Yes.\n5. To use a form definition other than the default for any of the types of banner pages, change Header page form definition, Separator page\nform definition, or Trailer page form definition to indicate the form definition that you want to use.\nNote:\nThe form definition that you specify must be in one of these directories:\nA directory that the AFP resource path property for the printer specifies\n/aiw/aiw1/resources (Linux) or C:\\aiw\\aiw1\\resources (Windows)\n/usr/lpp/psf/reslib (Linux) or C:\\Program Files (x86)\\Ricoh\\PSF\\reslib (Windows)\nThe default form definition that RICOH ProcessDirector uses includes a box pattern overlaid on the banner page. Specify a different\nform definition if you do not want the box pattern. For example, form definition F1A00010 does not include the box pattern.\n6. To print page edge marks (also called mark forms) on banner pages for identification purposes, set Header page edge marks, Separator\npage edge marks, or Trailer page edge marks to Yes.\n7. To print specialized versions of banner pages to match hardware characteristics of the printer, change Banner page type.\nNote: Configuration files to format the content of AFP banner pages are only available in the portrait orientation. Setting the Banner\npage property to Wide does not change the banner pages to landscape orientation.\n8. Click OK.\n9. Right-click the printer and select Enable.\n10. Repeat these steps for any other printers that you want to set up to print banner pages with jobs.\nNote: For header and trailer pages to print, the values for the Header copies and Trailer copies properties for the job must be set to 1 or\ngreater. If the values for those job properties are set to 0, the printer does not print a header page or a trailer page for a specific job, even\nthough these types of banner pages are enabled on the printer.\nParent topic: AFP banner pages\n1 of 1"}]}