{"doc_name": "aiw_dockerstartstop.pdf", "doc_path": "data/raw/RPD-en-US/aiw_dockerstartstop.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2070, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Starting and stopping Docker and Podman container secondary servers - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / RICOH ProcessDirector servers / Starting and stopping servers / Starting and stopping Docker and Podman container secondary servers\nStarting and stopping Docker and Podman container secondary servers\nDocker and Podman container secondary servers do not start and stop automatically when the computer they are installed on restarts or when\nyou run the startaiw or stopaiw commands. You must start and stop them separately.\nTo start or stop a Docker and Podman container secondary servers, run the appropriate command below.\nIf you created the container secondary server on the primary computer, run the command on the primary computer.\nReplace directory with: /aiw\nThe path_to_script is not required on the primary server.\nIf you created the container secondary server on a different computer, run the command from the secondary computer.\nOn a secondary computer, you must provide the full path to the script on the primary computer, including the directory that is mounted to the\n/aiw directory on the primary server. In the command below, replace these values:\npath_to_script\nThe full path to the script on the primary server, including the mounted directory. If the mounted directory is /aiw (as in the procedure above),\nthe value is: /aiw/aiw1/bin/\ndirectory\nThe full path to the directory that is mounted to the /aiw directory on the primary server. In the procedure above, this directory is also /aiw.\nTo start a specific container secondary server, replace [secondary_name] with the name of that server. Omit this value to start all of the\ncontainer secondary servers present on the Linux computer.\nStart Docker or Podman container secondary servers on a computer:\n[path_to_script]containers.pl start directory[secondary_name]\nStop Docker or Podman container secondary servers on a computer:\n[path_to_script]containers.pl stop directory[secondary_name]\nParent topic: Starting and stopping servers\n1 of 1"}]}