{"doc_name": "aiw00configsnmp.pdf", "doc_path": "data/raw/RPD-en-US/aiw00configsnmp.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2226, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Configuring SNMP for printers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Configuring to send jobs to a printer that uses RICOH TotalFlow Print server / Configuring SNMP for printers\nConfiguring SNMP for printers\nSimple Network Management Protocol (SNMP) can be used by RICOH ProcessDirector to connect to a printer. RICOH ProcessDirector supports\nthe following versions: SNMP v1 and SNMP v3.\nWhen using SNMP v1 as a security protocol, communication between RICOH ProcessDirector and a printer is based on the network TCP/IP\naddress or the host name of the printer.\nFor enhanced security protocol, with three different security levels based on authentication and encryption, use SNMP v3.\nTo configure SNMP credentials:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Printers.\n3. In the Printers table, right-click the printer and select Properties.\n4. On the SNMP tab, select one of the available SNMP versions.\nMake sure the Use SNMP and Get tray properties on the SNMP tab are both set to Yes.\nIf you are using SNMP v1, all the settings corresponding to SNMP v3 are grayed out.\n5. You need to specify the TCP/IP address or the host name of the printer for both SNMP versions.\n6. For SNMP v3, three different levels of security are available: minimum, medium, and maximum.\n1. For all SNMP v3 security levels, specify the SNMP user name that RICOH ProcessDirector uses to connect to the printer.\n2. If you use Medium or Maximum security levels, select the authentication type protocol used on the printer and enter the SNMP\npassword for authorization.\n3. If you use the Maximum security level, select the encryption type protocol and enter the Privacy password.\n7. By selecting the Allow fallback option for SNMP v3, if RICOH ProcessDirector fails to connect to the printer, a new attempt is made using\nSNMP v1.\n8. Click OK.\nNote:\nRICOH ProcessDirector does not support SNMP v3 to connect to TASKalfa, Kodak PDF, and Xerox PDF printers.\nIf you use SNMP v3, make sure the security settings are the same on the printer and in RICOH ProcessDirector.\nParent topic: Configuring to send jobs to a printer that uses RICOH TotalFlow Print server\n1 of 1"}]}