{"doc_name": "slapolicy.pdf", "doc_path": "data/raw/RPD-en-US/slapolicy.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3352, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Service policies - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Service policies\nService policies\nA service policy defines job checkpoints and the service level agreement (SLA) deadline. Checkpoints let you track the progress of jobs as they\nflow through the system; the SLA deadline represents the time that the job must complete a specific processing step to meet your commitments\nto your clients.\nExamples of performance commitments are:\nJobs will be printed 4 hours after they arrive in the system.\nJobs will be printed by 18:00 on the day they arrive if they arrive in the system before 10:00. Otherwise, they will be printed by 18:00 the next\nday.\nJobs will be ready to mail by 16:00 on the day after they arrive.\nIn addition, a service policy specifies whether RICOH ProcessDirector should adjust the job checkpoints and deadline to skip over any times when\nservices are not provided, such as holidays and weekends. RICOH ProcessDirector can make sure that the job checkpoints and any deadlines do\nnot occur during no-service periods.\nEach service policy defines job checkpoints and an SLA that apply to one specific performance commitment. For example, if an installation has\nthree performance commitments for different types of jobs or for different clients, the administrator would create three service policies.\nThe administrator can associate each service policy with one or more workflows. As each job arrives in the system, RICOH ProcessDirector uses\nthe service policy that is associated with the workflow to set checkpoints and a deadline for the job.\nIn this section:\nSLA deadline\nThe SLA deadline represents your ultimate commitment to your clients. It is the time by which a job must complete the processing step that the\nSLA measures.\nCheckpoints\nA service policy can define job checkpoints that occur at the end of a processing phase. Examples are the Receive, Prepare, Print, and Complete\nphases. A job checkpoint always occurs at the end of a phase.\nCheckpoint intervals\nFor each checkpoint that the service policy defines, the service policy specifies a time interval. The interval is the amount of time that you expect\na job to take to complete a phase. The interval does not include estimated durations set for steps in the workflow.\nCheckpoint times\nFor each job that has an associated service policy, RICOH ProcessDirector records planned checkpoint times. In addition, it records actual\ncheckpoint times for all jobs, even for jobs that do not have an associated service policy.\nNo-service periods\nRICOH ProcessDirector can adjust the planned checkpoint and SLA deadline times so they do not occur during periods when your installation\ndoes not provide services. For example, you might not provide services on holidays and weekends. These periods are called no-service periods.\nYou define these periods in no-service period objects.\nTime zones\nThe service policy specifies the time zone where jobs are printed. If jobs are printed in more than one time zone, you must create a service policy\nfor each time zone.\nCheckpoint status\nRICOH ProcessDirector periodically calculates a checkpoint status for each job as it progresses through the system. The checkpoint status helps\nyou find jobs that are late meeting their checkpoints.\nParent topic: System objects\n1 of 1"}]}