{"doc_name": "aiw_passthroughptr_bannerpgs.pdf", "doc_path": "data/raw/RPD-en-US/aiw_passthroughptr_bannerpgs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2867, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Setting up Passthrough printers to print PDF banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / PDF banner pages / Setting up Passthrough printers to print PDF banner pages\nSetting up Passthrough printers to print PDF banner pages\nRICOH ProcessDirector can print PDF header pages and trailer pages for a job sent to a Passthrough printer. Header pages print before the first\ndata pages of a job. Trailer pages print after the last data pages of a job.\nTo set up a Passthrough printer to print PDF banner pages:\n1. In the Printers Portlet, find the Passthrough printer that you want to use to print jobs with PDF banner pages. If the printer is enabled,\nright-click it and select Disable.\n2. Click the printer name to open the properties notebook for the printer.\n3. Click the Banner Pages tab to display the banner page properties for the printer.\n4. Enable the appropriate banner pages:\nTo use header pages, set the Enable header pages property to Yes.\nTo use trailer pages, set the Enable trailer pages property to Yes.\n5. Specify a value for the Merge banner pages into PDF print file property.\nIf you select No, update the Printer command property on the General tab so it includes multiple lpr commands. You must include one lpr\ncommand for the job and one for each type of banner page that is enabled. Enter the commands in the order that the pages should print\nin. For example, to print a header page, a PDF job, and a trailer page, use this command:\nlpr -P printerName ${getFileName(header,pdf,read)} && lpr -P printerName ${getCurrentFile(pdf)} &&\nlpr -P printerName ${getFileName(trailer,pdf,read)}\n6. Click OK.\n7. Right-click the printer and select Enable.\n8. Repeat these steps for any other Passthrough printers that you want to set up to print banner pages with jobs.\nNote:\nYou can only print these banner pages on a printer device that supports the PDF data stream.\nFor header and trailer pages to print, the values of the Header copies and Trailer copies properties for the job must be set to 1 or greater.\nIf the values of those job properties are set to 0, the printer does not print a header page or a trailer page for a specific job, even if these\ntypes of banner pages are enabled on the printer.\nIf you request header or trailer pages in the printer command, the value for the Header copies or Trailer copies property must be set to 1\nor greater or the job does not print correctly.\nTo make sure that a job and its banner pages print together, set the Merge banner pages into PDF print file property to Yes. If you set it to\nNo, another job sent to the printer at the same time might print between the job and its banner pages.\nIf you print a PDF 2.0 file with banner pages, the file is converted to PDF 1.7 format which is required for the banner pages.\nParent topic: PDF banner pages\n1 of 1"}]}