{"doc_name": "avanti_c_AddCreateOrderStepToWF.pdf", "doc_path": "data/raw/RPD-en-US/avanti_c_AddCreateOrderStepToWF.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4555, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Modifying a workflow to send order information to Slingshot - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Modifying a workflow to send order information to Slingshot\nModifying a workflow to send order information to Slingshot\nTo send order information to Avanti Slingshot, contact your Avanti support representative. Learn the values required to call the Slingshot web\nservice that receives order information from RICOH ProcessDirector. Then add a step based on the CreateOrderInSlingshot step template to your\nworkflow.\nWork with your Avanti support representative to configure Slingshot to create orders for jobs received from RICOH ProcessDirector.\nTo modify a workflow to send order information to Slingshot:\n1. Learn the values required to authenticate with Slingshot and call the REST web service that receives order information.\n2. Get the XML file containing the order information that RICOH ProcessDirector sends to Slingshot.\nContact your Avanti support representative to get the file and your RICOH ProcessDirector support representative to make sure that the\nXML works with RICOH ProcessDirector.\n3. To prepare RICOH ProcessDirector to communicate with Slingshot, do these tasks:\nIf Slingshot requires a security certificate, install the certificate on the RICOH ProcessDirector primary computer.\nIf your environment requires a proxy server to communicate with web services, set up the system to use it.\nFor more information, see the related tasks.\n4. Click the Workflow tab.\n5. Click the name of the workflow you want to modify.\n6. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n7. Add a step based on the CreateOrderInSlingshot step template to the workflow in the appropriate place.\nNote:\nRun this step on a job one time only.\nYou can put this step in a workflow multiple times. Make sure that each step is in a separate branch so that the steps do not\nprocess the same job.\nWhen you restart a job after Slingshot has created an order for it, make sure that a CreateJobInSlingshot step does not process the\njob.\nSlingshot returns a status code 500 error when it receives the same job number more than once.\nYou can run this step on parent or child jobs. Orders created in Slingshot from parent or child jobs do not retain the relationship\nbetween parent and children.\n8. Set values for the job properties.\n1. Set the Request URL property to the URL of the Slingshot web service that creates an order for each job received from RICOH\nProcessDirector.\nYour Avanti support representative supplies the URL.\n2. Set the Request payload property to the full directory path and name of the file containing the XML order information that RICOH\nProcessDirector sends to Slingshot.\n3. Set the value of the Request parameters property.\nWork with your Avanti representative to fill in values for the SenderID, Username, and Password parameters. The value of the\nRequestType parameter does not change.\n4. If your environment requires a proxy server to communicate with web services, set the Use proxy property to the correct proxy server.\n5. If your Avanti support representative gives you a password for the Password property, type it in the field.\n9. When you finish setting values for the properties, click OK.\n10. Save and enable the workflow.\nAfter you set up your RICOH ProcessDirector workflow and configure Slingshot, test the creation of orders in Slingshot. If the XML in the file\ncontaining the order information is correct, the RICOH ProcessDirector Job ID matches the Slingshot Order ID.\nIf you have not configured RICOH ProcessDirector to report job processing information to Slingshot:\nDefine Avanti Slingshot Connect cost centers.\nModify your workflow. To report the time a job spends in various steps to a cost center, set values for the Slingshot cost center and Slingshot\nmilestone status properties of the steps.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Modifying a workflow to send order information to Slingshot - Jenski - Test portal- RPD Linux\nFor more information about defining cost centers and modifying your workflow, see the information center.\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n2 of 2"}]}