{"doc_name": "pdfw_t_plugin_addimage.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addimage.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4102, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Adding an image to a PDF file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Adding markup to a PDF file\n/ Adding an image to a PDF file\nAdding an image to a PDF file\nYou can add JPEG images, such as a logo or an advertisement, to the PDF file. You can limit the placement of an image to specific pages in each\npage group by specifying a rule or typing page numbers. RICOH ProcessDirector Plug-in for Adobe Acrobat can process only JPEG files that are in\nRGB format; the CMYK format is not supported.\nTo add an image:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains a page group or define a page group.\n2. Use the left mouse button to draw a box where you want the image to print. You can also place an image over a hidden area markup box.\nNote: The image is not resized to match the size of the box. If you draw a box to the approximate size of the image, you can see its\nposition relative to all the markup you add to the PDF file.\n3. Click Add Image.\n4. Use the Location section of the definition window to change the placement of the image by entering new Horizontal and Vertical\ncoordinates. These coordinates specify the distance between the top left corner of the page and the top left corner of the image.\nNote: Width and Height change the size of the markup box but do not affect the location or size of the image.\n5. Type a Name for the image. Do not use spaces or special characters (such as @, #, $, or %). You can use periods and underscores.\n6. Use the Placement Conditions section to specify the pages to place the image on. Do either of these:\nSelect Pages based on a rule, and then select a rule from the drop-down list. The default rule is All Pages. You can also:\nClick the icon to define a new rule.\nClick the icon to go to the Rules Manager.\nSelect Specify pages and type the pages in each page group that you want. You can:\nUse a hyphen to separate the first and last pages in a page range.\nUse a comma to separate page selections.\nType n to specify the last page.\nExample: a PDF file has two page groups. The first has four pages, and the second has seven pages. Specifying pages 3–n places\nmarkup on pages 3–4 in the first page group, and pages 3–7 in the second.\n7. If the image you are defining exists in a file path that you can access, select Browse, click the JPEG image file you want to add to the PDF\nfile, and click Open. When you save this image definition to a control file, the image file is embedded in the control file. You do not need\nto copy the image to a directory accessible to a RICOH ProcessDirector server.\nInstead of embedding the image file in a control file, you can enter an image file name and location that RICOH ProcessDirector can access\nwhen a BuildPDFFromDocuments step processes PDF files. If you specify an image file name and location that RICOH ProcessDirector Plug-\nin for Adobe Acrobat cannot find, a message informs you that the image was not found. If you want to use the image file name and path\nfor the RICOH ProcessDirector server, select Yes. Otherwise, select No.\nTo specify a directory location accessible to RICOH ProcessDirector, type the full directory path and file name (for example,\n/aiw/aiw1/images/myimage.jpg). If RICOH ProcessDirector cannot find the image file when it processes a PDF file, the job fails in the\nBuildPDFFromDocuments step.\n8. Click OK to create the image configuration.\n9. Optional: Click Ricoh ⇒ Preview to verify that the image has the page placement you intended.\n10. Optional: You can edit the image definition by double-clicking the image box or by right-clicking the box and selecting Edit.\n11. When you are ready to save all your enhancements to the PDF file, including the new image definition, click Ricoh ⇒ Save Control File.\n12. In the RICOH ProcessDirector BuildPDFFromDocuments step, specify the name and location of the control file that contains the image\ndefinition.\nParent topic: Adding markup to a PDF file\n1 of 1"}]}