{"doc_name": "aiw_setuptotalflow.pdf", "doc_path": "data/raw/RPD-en-US/aiw_setuptotalflow.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2466, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Setting up a RICOH TotalFlow Print server to connect with RICOH ProcessDirector - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Configuring to send jobs to a printer that uses RICOH TotalFlow Print server\n/ Setting up a RICOH TotalFlow Print server to connect with RICOH ProcessDirector\nSetting up a RICOH TotalFlow Print server to connect with RICOH ProcessDirector\nThe RICOH TotalFlow Print server requires different settings depending on the type of printer you are defining to RICOH ProcessDirector. Follow\nthe appropriate steps for the printer type you are using.\n1. Log in to RICOH TotalFlow Print server as a user with administrator privileges.\n2. Click Configuration.\n3. In the left pane, click DFE → Network.\n4. Find Network Services, and look for the correct protocol in the Protocol type list:\nFor Ricoh PDF and Ricoh TotalFlow printers, enable JMF.\nFor AFP printers, enable IPDS TCP/IP.\nFor Passthrough printers, enable either LPR or Hot Folder depending on how you are setting up the Passthrough printer.\n5. For Ricoh PDF and Ricoh TotalFlow printers:\n1. Find Ethernet Adapters.\n2. Select a card and click Edit.\n3. In the list of properties, find the fields IP address of primary DNS server and IP address of secondary DNS server. If they do not contain\nvalues, get the correct values from your network administrator and enter them. Click OK.\n6. For all printer types other than AFP printers, in the left pane, click Workflow → Virtual Printers.\n7. Select the virtual printer that you plan to use with RICOH ProcessDirector and click Edit.\n8. Click the Protocols tab.\n9. In the list of Supported submission methods, make sure the correct protocol is enabled.\nFor Ricoh PDF and Ricoh TotalFlow printers, enable JMF.\nFor Passthrough printers, enable the method that you plan to use, such as LPR, Hot Folder, or FTP.\n10. Click OK.\n11. If you plan to send AFP jobs to this printer using an AFP printer object, check the code version installed. Select ? ⇒ About.\nIf the code version is v8.32.018 or higher and the BOS level is v153.09.123 or higher, your printer supports sending a requested preset with\nan AFP print job and having the printer switch to that preset automatically. You can update your workflows to set a preset name for AFP\njobs and have the printer use them without operator intervention.\nParent topic: Configuring to send jobs to a printer that uses RICOH TotalFlow Print server\n1 of 1"}]}