{"doc_name": "aiw00c1.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c1.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 10554, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Configuring to use Download for z/OS - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Configuring to use Download for z/OS\nConfiguring to use Download for z/OS\nBefore Download for z/OS can send data sets from z/OS to the RICOH ProcessDirector system, an administrator must do configuration tasks on\nz/OS. The administrator also does corresponding tasks on the RICOH ProcessDirector system to configure the input devices that receive the data\nsets and to configure the workflows that the data sets are assigned to.\nBefore you begin this procedure, review the supplied workflows. If you find one that contains some or all the steps that you want to include in\nyour workflow, you can copy it and modify it to meet your needs. The DownloadAFP and DownloadLineData workflows are recommended for\nuse with Download for z/OS.\nIn addition, determine whether you can use one of the Download input devices that RICOH ProcessDirector provides or whether the installation\nrequires a customized input device. RICOH ProcessDirector provides several Download input devices that you can use with only minor\nmodifications or that you can copy to create a customized Download input device.\nTo configure to use Download for z/OS:\n1. On the RICOH ProcessDirector system, copy and modify a workflow that contains the processing steps that you want the jobs that are\nsubmitted by Download for z/OS to follow.\nTo copy and modify one or more workflows:\n1. Click the Workflow tab.\n2. Right-click the workflow that you want to copy, and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. In the workflow editor, right-click each step and select Properties. Modify the properties as necessary.\n5. If the AFP resources (such as fonts, overlays, and page segments) required by the jobs that are processed through this workflow are\nnot going to be sent inline with the input file, make sure that those resources are available to the RICOH ProcessDirector system. It is\nrecommended that you move these resources to /aiw/aiw1/resources (Linux) or C:\\aiw\\aiw1\\resources (Windows) or\n/usr/lpp/psf/reslib (Linux) or C:\\Program Files (x86)\\Ricoh\\PSF\\reslib (Windows), so that they are available to all the\ncomponents of RICOH ProcessDirector. If you cannot use those directories, you can set the AFP resource path property on one of the\nsteps in the workflow to refer to the directory or directories that hold the resources.\nNote:\nThe AFP resource path can be set as a default job property on various step templates, including EnableRepositioning,\nCreatePageRanges, PrintJobs, and ConvertLineDataJobIntoAFP. You only need to set the value on one of the steps; the others\ninherit the value.\n6. When you are ready to use the new workflow, save and enable it by changing , the Save & Enable/Disable switch, to the On\nposition.\n7. Repeat these steps if you want to create additional workflows.\n2. On the RICOH ProcessDirector system, configure an input device so that it assigns the correct workflow or types for the z/OS data sets that\nit receives. It is recommended that you copy and rename one of the supplied Download input devices, then verify or update the settings\ndescribed below.\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Input Devices.\n3. Right-click the Download input device that you want to copy and select Copy.\nNote:\nThe new input device that RICOH ProcessDirector creates through the copy action is the same type as the copied input device.\nYou cannot create a new Download input device by copying a hot folder or an LPD input device.\n4. In the left pane, click Show all tabs to display all the properties for this input device.\n5. Verify or update the values for these properties:\nPort number\nThe port number that this input device uses to communicate with Download for z/OS. Make note of the port number that you\nspecify so that you can use it in your routing control data set on z/OS. If InfoPrint Manager for Windows is also receiving jobs\nfrom this z/OS system, make sure you assign a port number that InfoPrint Manager is not using.\nFolder location\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:10 PM Configuring to use Download for z/OS - Jenski - Test portal- RPD Linux\nThe directory on the primary computer that receives data sets from Download for z/OS. Make sure that the file system is set up\nso that the directory you list here is large enough to handle the amount of data that Download for z/OS sends without filling the\nfile system.\nStaging location\nThe directory that RICOH ProcessDirector moves input files to before they are submitted as jobs. Make sure that the file system is\nset up so that the directory you list here is large enough to handle the amount of data that Download for z/OS sends without\nfilling the file system. Remember that there might be two copies of an input file in the system at any time, one in the Folder\nlocation directory and one in the Staging location directory.\n6. If the input device needs to accept single or multiple data set jobs:\n1. Set the Submit step property to SubmitInputFiles and the Workflow property to ParentNoPrint.\n2. Determine how you want the input device to assign the workflow for each single job or child job. You can select one of these:\nSet the Child workflow initialization step property to Not set and set the Child workflow property to the name of an existing\nworkflow to assign the same workflow to every job that this input device processes.\nSet the Child workflow initialization step property to SetJobTypeFromRules and use the Child workflow parsing rules property\nto specify the name of the control file that can set the workflow from a JCL parameter value.\nRICOH ProcessDirector provides a sample control file that uses the values of JCL parameters to set the workflow. The sample\ncontrol file, called receive_jcl_jobtype.cfg, is installed in the /aiw/aiw1/samples/rules/ (Linux) or\nC:\\aiw\\aiw1\\samples\\rules\\ (Windows) directory. You can copy that file to the /aiw/aiw1/control_files/rules/\n(Linux) or C:\\aiw\\aiw1\\control_files\\rules\\ (Windows) directory and modify it to meet your needs, then update the\nvalue of the Child workflow parsing rules property to point to your file.\nSet the Child workflow initialization step property to SetJobTypeFromFileName and use the Child workflow pattern property\nto specify the string that RICOH ProcessDirector should look for in the input file name and use as the workflow name. If you\nuse this method, you must make sure that a workflow with the corresponding name exists.\nNote:\nIf you want to merge multiple input data sets into a single job, specify Yes for the Merge multiple data sets property of\nthe input device. If you are using RICOH ProcessDirector for Windows and merging data sets, you can use the\nDestination control file property to specify a file that contains a list of directories to search for AFP resources.\n3. On z/OS, use the Download for z/OS documentation to install and configure Download for z/OS. You might want to create several\nDownload for z/OS functional subsystems (FSSs).\nNote:\nWhen Download for z/OS is running in multiple dataset mode with Exit 15, each Download input device can receive jobs from only\none Download for z/OS functional subsystem application (FSA).\n4. Set up the Download for z/OS Print Parameters Exit 15, either APSUX15 or APCUX15, as required for the installation. If RICOH\nProcessDirector processes z/OS jobs that contain multiple data sets, the exit must pass the output-group identifier, OUTGRP, with the -opa\nparameter. The OUTGRP value is either FIRST, NEXT, LAST, or ONLY.\nNote:\nIBM can customize the exit to meet unique requirements of the installation. Contact IBM for further information.\n5. Update the routing-control data set on z/OS to include the TCP/IP address of the parent server that is running the target input device. The\nrouting-control data set must also specify the port numbers of the target input devices that you verified or updated in a previous step.\nThese examples show RICOH ProcessDirector entries in the routing-control data set that send different types of data sets to different input\ndevices on the RICOH ProcessDirector system:\n/**** RICOH PROCESSDIRECTOR ROUTING FOR LINE DATA\nDEST=PRT01,PRT02, /* ALL DATA SETS WITH DESTINATION PRT01 PRT02\nCLASS=C, /* AND A CLASS OF C\nIPADDR=9.99.176.136, /* SEND TO RICOH PROCESSDIRECTOR AT THIS IP ADDRESS\nPORTNUM=7777; /* AND THIS INPUT DEVICE PORT NUMBER\n/**** RICOH PROCESSDIRECTOR ROUTING FOR LINE DATA\nCLASS=A, /* ALL DATA SETS WITH A CLASS OF A\nFORMS=BILLS, /* AND WITH A FORMS VALUE OF BILLS\nRECEIPTS, /* OR A FORMS VALUE OF RECEIPTS\nIPADDR=9.99.176.136, /* SEND TO RICOH PROCESSDIRECTOR AT THIS IP ADDRESS\nPORTNUM=6001, /* AND THIS INPUT DEVICE PORT NUMBER\nRETRY=3, /* RETRY 3 TIMES IF TRANSMISSION FAILS\nRETRYINTV=60; /* WAIT 60 SECONDS BETWEEN RETRY ATTEMPTS\n/**** RICOH PROCESSDIRECTOR ROUTING FOR POSTSCRIPT AND PDF\nDEST=PRT03, /* ALL DATA SETS WITH DESTINATION PRT03\nCLASS=D, /* AND A CLASS OF D\nIPADDR=9.99.176.136, /* SEND TO RICOH PROCESSDIRECTOR AT THIS IP ADDRESS\nPORTNUM=8488, /* AND THIS INPUT DEVICE PORT NUMBER\nSEND_REC_LENGTH=NO; /* DO NOT PREPEND 2-BYTE LENGTH FIELD\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:10 PM Configuring to use Download for z/OS - Jenski - Test portal- RPD Linux\n6. On z/OS, make any installation-specific modifications to the z/OS Download printer. For example, an administrator might assign a RICOH\nProcessDirector-specific destination name to the printer. Then, jobs can use the DEST JCL parameter to request the RICOH ProcessDirector\ndestination.\n7. Drain and restart the z/OS Download printer to use the updated routing-control data set.\n8. Submit and print jobs to verify that Download for z/OS can send data sets, without errors, as a standalone program.\n9. If in a previous step you created a control file that sets job scheduling properties such as Class, Form, or Destination based on the JCL\nparameters of the job, make sure that the corresponding scheduling properties are set on the target printers in RICOH ProcessDirector. If\nthe scheduling properties do not match, the jobs cannot be scheduled to those printers.\n10. On the RICOH ProcessDirector system, make sure that the input devices that correspond to the routing-control data set entries are\nconnected and enabled.\n11. On the z/OS system, submit jobs to RICOH ProcessDirector. If errors occur, correct the errors that messages from z/OS or RICOH\nProcessDirector identify.\nParent topic: Preparing for job submission\n3 of 3"}]}