{"doc_name": "mail_c_createworkflow.pdf", "doc_path": "data/raw/RPD-en-US/mail_c_createworkflow.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 18780, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Creating a workflow to exchange data with postal software - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Postal Enablement feature / Creating a workflow to exchange data with postal software\nCreating a workflow to exchange data with postal software\nYou can create a workflow, or a set of workflows, to extract mailing address data from the documents in a job and prepare the data for\nprocessing by external postal software. After the postal software verifies the addresses and improves their quality, the workflow can process\nresults received from the postal software to update the documents in the job.\nThe Postal Enablement feature does not provide postal software. You can use your choice of external postal software, for example, the Bell and\nHowell BCC Mail Manager software or the TEC Solutions MailPreparer software. You must understand what information your postal software\nneeds to perform the postal processing that you want. You also need to know how to connect the postal software to RICOH ProcessDirector.\nTo create a workflow to exchange data with postal software:\n1. Identify the job and document data that you need to exchange with the postal software.\n1. Identify the data that your postal software requires for each mail piece.\nThe postal software requires name and address data in a specific format.\nIf you are using the postal software to compute postage, the software might need information about mail piece weight and\nthickness. Some postal software assumes that all mail pieces in a job have uniform weight and thickness. Other postal software lets\nyou specify different values for each mail piece.\n2. Identify the data that your postal software requires for each job.\nFor example, you might need to specify Mailer ID and Postage statement date.\n3. Identify the RICOH ProcessDirector job and document properties that correspond to the data required by your postal software.\nThe Postal Enablement feature provides a large number of job and document properties for use with postal software. For job\nproperties, examine the properties notebook for the SetPostalJobProps step template. For document properties, examine the\nproperties notebook for the BuildExternalDocPropsFile step template. Select from the document properties on the Available list.\n4. If you need custom document properties, edit the docCustomDefinitions.xml file and then run the docCustom utility to define the\nproperties to the system. See RICOH ProcessDirector: Installing Document Processing Features for instructions.\n2. If your print file is in PDF format, do these steps:\n1. Follow the instructions in the Information Center to enhance PDF files for Postal Enablement.\nThese instructions explain how to identify the start of each mail piece in a job, define document properties to extract address data\nfrom each mail piece, and make changes to the PDF file based on the data returned by the postal software.\n2. Save your document property definitions in a control file for use with a step based on the IdentifyPDFDocuments step template.\n3. Send the control file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access to.\n4. If you are making changes to the PDF file based on the data returned by the postal software (for example, adding a barcode or\nreplacing the address), save your document property definitions and updated address data in a control file with a different name from\nthe control file in the previous step. Send the control file to the RICOH ProcessDirector server in a directory that the RICOH\nProcessDirector system user has access to.\nThis new control file is used with a step based on the BuildPDFFromDocuments step template.\n3. If you have the AFP Support feature installed and your print file is in AFP format, do these steps:\n1. Follow the instructions in the Information Center to enhance AFP files for Postal Enablement.\nThese instructions explain how to identify the start of each mail piece in a job, define document properties to extract address data\nfrom each mail piece, and make changes to the AFP file based on the data returned by the postal software.\n2. Save the control file created by RICOH Visual Workbench and send it to the RICOH ProcessDirector server in a directory that the\nRICOH ProcessDirector system user has access to.\nThis control file is used with a step based on the IdentifyDocuments step template.\n3. If you are making changes to the AFP file based on the data returned by the postal software (for example, adding a barcode or\nreplacing the address), save your document property definitions and updated address data in an Enhance AFP control file. Send the\ncontrol file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access to.\nThe Enhance AFP control file is used with a step based on the BuildAFPFromDocuments step template.\n4. Log in to RICOH ProcessDirector as an administrator.\n5. Click the Workflow tab.\n6. Copy the workflow that best meets your processing needs:\nIf you do not need to change how documents are processed based on results from the postal software, right-click the PrintAndMailJob\nworkflow, and select Copy.\nThe PrintAndMailJob workflow collects document data to send to postal software and uses a step based on the RunHotFolderApplication\nstep template to exchange files with the postal software. After receiving the output of the postal software, the workflow updates the\ndocument data and prints the job for mailing. If you have RICOH ProcessDirector, the workflow processes both AFP and PDF print jobs. If\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:16 PM Creating a workflow to exchange data with postal software - Jenski - Test portal- RPD Linux\nyou are using only one format, you can delete the steps in the branch for the other format.\nIf you need to take results from the postal software and split a job into child jobs that are processed by different workflows, right-click the\nGroupDocsForPostalProcess workflow, and select Copy.\nGroupDocs ForPostalProcess is part of a set of three workflows:\nGroupDocsForPostalProcess\nThis workflow collects document data to send to postal software and updates the document data from the output of the postal\nsoftware. Using rules that you set up to interpret the data, the workflow produces child jobs for each type of mail that the postal\nsoftware identified. The workflow is configured to pass the child jobs to one of the next two workflows.\nProcessQualifiedDocuments\nThis workflow processes child jobs created by the GroupDocsForPostalProcess workflow if the documents in the job qualified for\nadditional postal processing. The workflow sorts the documents, using the optimal method determined by the postal software, and\npasses the child jobs to the PrintForPostalProcess workflow.\nPrintForPostalProcess\nThis workflow prints the child jobs created by the GroupDocsForPostalProcess workflow. The child jobs contain qualified, nonqualified,\nand other types of mail. The workflow makes sure that the order of documents within each job is correct for each type of mail.\nAfter you copy the GroupDocsForPostalProcess workflow, determine how many additional workflows you need to perform postal\nprocessing at your company.\n7. Name the copy of the workflow, fill in or edit other values that you need, and click OK.\n8. If you have both the AFP Support and PDF Document Support features installed, these workflows process both AFP and PDF print jobs. If\nyou only have one of those features installed, delete the steps in the branch for the other format.\n9. If the workflow process PDF jobs, right-click the IdentifyPDFDocuments step. Select Properties, and then click PDF. For the Identify PDF\ncontrol file property, type the path and file name of the control file that contains your document property definitions. Click OK.\n10. If you have the AFP Support feature installed and the workflow processes AFP jobs, do these steps:\n1. Right-click the IdentifyDocuments step. Select Properties, and then click AFP. For the Visual Workbench control file property, type the\npath and file name of the control file that you created with Document Property Designer. Click OK.\n2. If your AFP print file is not already indexed, add a step based on the IndexAFP step template before the IdentifyDocuments step.\nThis step shares the control file you specified for the IdentifyDocuments step. You do not need to specify the control file here.\n11. Right-click the SetPostalJobProps step. Select Properties, and then click Postal. Specify the values of the properties for the job. Click OK.\n12. Right-click the BuildExternalDocProps step. Select Properties , and then click Document processing. Do these steps:\n1. For the External document properties file property, specify the name and location that you want to use for the external document\nproperties file.\nThe default value writes a file named jobID.ToPostal.csv to the job's spool directory.\nWhen RICOH ProcessDirector creates this file, it converts the document properties file into the format required by the postal software.\n2. For the File type property, select CSV or Tab-delimited.\n3. From the Document properties list, select the document properties that you saved in the control file for the IdentifyPDFDocuments\nstep (PDF) or the IdentifyDocuments step (AFP).\nImportant:\nMake sure that you include the Document number or Sequence in job property.\n4. In the Column headings field, type the names of the column headings required by postal software for the document properties. Use\ncommas to separate the names, even if you selected Tab-delimited for the file type.\nThe order of the headings must match the order of the selected document properties.\n5. Click OK.\n13. Based on the capabilities of the postal software, choose an interface with RICOH ProcessDirector:\nRunHotFolderApplication step\nIf your software can receive data using a hot folder, use this step to send and receive files containing document information that the\npostal software requires. You must:\nConfigure the postal software to watch a directory for a file with a specific name or filetype.\nConfigure the postal software to write its output to a directory with known filename characteristics.\nSet up the network (for example, NFS or SAN), file permissions, and so on to share the directories defined for input and output on the\nRunHotFolderApplication step.\nThe sample workflows provided with the Postal Enablement feature use this step with example directory names.\nRunExternalProgram step\nIf your software accepts command line input, use this step to run the postal software directly in the workflow.\nThe postal software must have a command line invocation that can be run on the primary RICOH ProcessDirector server. If you have\nRICOH ProcessDirector, the command line invocation also can be run on a secondary server or a Windows application server.\nYou must use standard RICOH ProcessDirector methods, such as ${getFileName(postal,bcc,read)}, to reference the files exchanged with\nthe postal software.\nSendEmail and ManualStepWithAutoStart steps\nUse these steps for a manual interface with the postal software. The SendEmail step sends the output file to a person who submits the\nfile to the postal software while the job waits in the ManualStepWithAutoStart step. The person puts the results file returned by the\npostal software into the workflow where the MapExternalResultsFiletoDocProps step expects to find the file. The person then does a\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:16 PM Creating a workflow to exchange data with postal software - Jenski - Test portal- RPD Linux\nManual Complete action to let the job continue through the workflow to the MapExternalResultsFiletoDocProps step.\n14. If you are using the RunHotFolderApplication step to interface with the postal software, do these steps:\n1. Right-click the RunHotFolderApplication step. Select Properties, and then click Job Defaults.\n2. Specify values for the Sending folder, File to send, Retrieval folder, Retrieval pattern, and Retrieved file properties.\n3. Specify values for other properties as needed.\n4. Click OK.\n15. If you are using the RunExternalProgram step to interface with the postal software, do these steps:\n1. Delete the RunHotFolderApplication step and replace it with the RunExternalProgram step.\n2. Right-click the RunExternalProgram step, select Properties, and then click External.\n3. Specify the command line invocation for the postal software in the External command field.\n4. Specify other values as needed.\n5. Click OK.\n16. If you are using the SendEmail and ManualStepWithAutoStart steps to interface with the postal software, do these steps:\n1. Delete the RunHotFolderApplication step and replace it with the SendEmail step.\n2. Add the ManualStepWithAutoStart step to the workflow after the SendEmail step.\n3. Right-click the SendEmail step. Select Properties, and then click Email.\n4. For the Recipient address property, specify the email address.\n5. Specify the other values as needed.\nNote:\nIf you have not already specified SMTP server settings, you should specify them to enable the email function. After you save\nthe workflow, you can access the settings by clicking the Administration tab on the Main page. In the left pane, click System\n⇒ Settings.\n6. Click OK.\n7. Right-click the ManualStepWithAutoStart step, and select Properties.\n8. Specify values as needed.\n9. Click OK.\n17. Right-click the MapExternalResultsFileToDocProps step. Select Properties, and then click Document processing. Do these steps:\n1. For the Modified results file property, specify the name and location that you want to use for the modified results file.\n2. For the External results file property, specify the name and location that you want to use for the external document properties file\nthat is returned from the postal software.\n3. For the File type property, select the type of the external results file: CSV or Tab-delimited.\n4. For the External results contain column headings property, select Yes or No.\nIf the external results file does not contain column headings, you must edit the results file to contain only the columns of data that\nmap to the list of selected properties. The number and order of columns in the external results file must match the number and order\nof the document properties in the Selected list.\n5. If the external results file contains column headings, type the names of the column headings that you want to keep in the Columns\nto keep field. Use commas to separate the names.\n6. From the Document properties list, select the document properties that correspond to the column headings that you are keeping.\nThe order of the document properties must match the order of the column headings. The step uses this Information to create a\nmodified results file.\n7. Click OK.\n18. You can use the information in the modified results file to have other RICOH ProcessDirector steps do additional processing of the\ndocument data before the data is merged into the document properties file.\n19. Right-click the UpdateDocPropsFromExtResultsFile step. Select Properties, and then click Document processing. For the Modified results file\nproperty, type the path to and name of the file. Click OK.\nThis step merges the document data in the modified results file with the original document properties file that was created in the\nIdentifyPDFDocuments step for PDF jobs or the IdentifyDocuments step for AFP jobs.\nThe document data from your postal software is now in RICOH ProcessDirector. The data can be used by a variety of RICOH ProcessDirector\nsteps.\n20. If you want to set job properties based on document properties, do these steps:\n1. With a text editor, create a properties conditions file.\n2. Define the logic required to group documents for additional processing.\nFour sample properties conditions files are in the /aiw/aiw1/control_files/postal directory (on Linux) or the\nC:\\aiw\\aiw1\\control_files\\postal directory (on Windows):\npostal_doc.csv\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:16 PM Creating a workflow to exchange data with postal software - Jenski - Test portal- RPD Linux\npostal_doc_qualified.csv\npostal_doc_print.csv\npostal_doc_print_afp.csv\nFor more information, see the topic on the SetDocPropsFromConditions step template in the information center.\nThe GroupDocsForPostalProcess workflow uses a properties conditions file to place documents in child jobs for additional processing\nby the ProcessQualifiedDocuments workflow, the PrintForPostalProcess workflow, or both.\n3. If you are editing a copy of the PrintAndMailJob workflow, add a step based on the SetDocPropsFromConditions step template to the\nworkflow.\n4. Right-click the SetDocsPropsFromConditions step. Select Properties, and then click Documents. For the Property conditions file\nproperty, type the path to and name of the file. Click OK.\n21. If the workflow processes PDF jobs, right-click the BuildPDFFromDocuments step. Select Properties, and then click PDF. For the Build PDF\ncontrol file 1 property, type the path and file name of the control file that contains your document property definitions and address\nreplacement data. Click OK.\nNote:\nThe GroupDocsForPostalProcess workflow does not have a BuildPDFFromDocuments step. If you have been editing a copy of\nGroupDocsForPostalProcess, you can copy the PrintForPostalProcess workflow and edit the BuildPDFFromDocuments step in that\nworkflow, or you can create a workflow to perform the job processing you need. If you edit a copy of the PrintForPostalProcess\nworkflow, you can use different control files for each processing path.\n22. If the workflow processes AFP jobs, right-click the BuildAFPFromDocuments step. Select Properties, and then click Documents. For the\nEnhance AFP control file property, type the path and file name of the Enhance AFP control file that you created. Click OK.\nIf you edit a copy of the PrintForPostalProcess workflow, you can use different Enhance AFP control files for each processing path.\n23. Save the workflow.\n24. To test the workflow, do these steps:\n1. Create one or more input devices to point to the workflow.\n2. Enable the input devices.\n3. Submit your PDF or AFP print job to the input device.\n25. If you want to process reports from the postal software that are required for your postal service, you can add steps to your workflow to\nreceive those reports along with the external results file and use a step based on the CopyToFolder step template to submit the report files\nfor printing in their own workflow.\nAnother approach is to build a workflow that emails the reports to users. If the reports are in a specified directory with a specified name,\nthe SendEmail step can email them to a recipient that you specify on the step.\nParent topic: Setting up the Postal Enablement feature\n4 of 4"}]}