{"doc_name": "pdfw_c_plugin_rule.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_rule.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3230, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Working with rules - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with rules\nWorking with rules\nA rule is a set of one or more conditions. You can apply the conditions specified by a rule to place markup, extract data, or specify media and\nfinishing options. You can also include a rule as a condition within another rule.\nFor example, you can use a rule to:\nPlace a barcode on the first page of each document in your PDF file\nExtract a customer’s name when the city in the mailing address is New York\nSpecify gold media for the first page of each document for a Gold Club member\nEach condition in a rule compares two values. The first value can be a Predefined Rule (a rule defined by RICOH ProcessDirector Plug-in for\nAdobe Acrobat that specifies pages within documents), a Custom Rule (a rule that you have defined), a conditional trigger, a job property, a\ndocument property, or a statistic. The choices for the second value depend on the first value.\nWhen you create a rule with multiple conditions, you can specify whether the rule requires all conditions to be met or any condition to be met.\nRules can evaluate static and dynamic values. For example, a rule can evaluate whether the total number of documents in a job is greater than\n10. A rule can also evaluate whether the value of the Doc.Begin.Balance document property is equal to the value of the Doc.End.Balance\ndocument property.\nThe Figure below shows a rule with five different types of conditions.\nRule with multiple conditions\nIn this section:\nPre-defined rules\nRICOH ProcessDirector Plug-in for Adobe Acrobat has 11 pre-defined rules that apply markup to, set media and finishing options for, or extract\ndata from specific pages within each document in a PDF file. For example, you can use a pre-defined rule to place an image on all front pages in\neach document.\nConditional triggers\nA conditional trigger is text that determines whether a condition is met.\nUsing job properties or document properties in rules\nYou can compare a job property or document property to a static value, such as a number or word, or to a dynamic value, such as job property,\ndocument property or statistic.\nUsing statistics in rules\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Working with rules - Jenski - Test portal- RPD Linux\nYou can compare a statistic to a static value, such as a number or word, or to a dynamic value, such as a job property, document property, or\nstatistic.\nDefining a rule\nYou can define rules that specify conditions for markup. You can also define rules to set media and finishing options, or to extract data.\nDefining a conditional trigger\nYou can define text in a PDF file as a trigger to control whether markup is applied to a page when RICOH ProcessDirector processes a PDF file.\nThe text can also control whether media and finishing options are applied to a page and whether document properties are extracted from a\npage.\nManaging rules\nThe Rules Manager dialog shows information about your rules. You can define new rules, and edit or delete existing rules.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n2 of 2"}]}