{"doc_name": "reportsPostgresql_Overview.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_Overview.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5072, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Reports - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / Reports\nReports\nThe Reports feature lets you capture printer status changes, user actions, order status changes, and job and document property values in a\nPostgreSQL database. You can extract and analyze the data from the database using a business intelligence tool such as Tableau. You can also\ntransmit selected tables from the database to an application of your choice using a REST web service.\nThe feature adds one step template and two objects called Data Collectors and Data Transmitters. The Reports feature does not include business\nintelligence software. You can use your preferred tool with the information stored in the Reports database.\nStep template\nWritePropsToReportsDatabase\nLets you choose which job and document properties to store in the Reports database when the step runs and the database table to store the\ndata in. You can insert multiple WritePropsToReportsDatabase steps in a workflow wherever you want to store properties at different times\nduring job processing.\nObjects\nThe Reports feature adds the Data collector and Data transmitter objects.\nData collector\nData collectors let you configure what RICOH ProcessDirector information to store in the PostgreSQL database. You can capture job property\nvalues, order property values, document property values, printer data, and user activity data using the supplied Data collectors.\nData transmitter\nData transmitters let you configure what information to extract from one or more PostgreSQL databases to send to another application.\nData transmitters use the REST protocol to send the data to another application. You can specify when and how often the data is sent.\nReports database\nThe Reports feature stores data in a PostgreSQL database regardless of the database configuration that RICOH ProcessDirector uses. To create the\nReports database, you have two options:\nUse the instance of PostgreSQL provided with RICOH ProcessDirector.\nEven if you use IBM DB2 as your primary database, PostgreSQL is available with your installation. If you choose this option, PostgreSQL runs on\nyour primary computer, but the Reports database is in a separate database system from the primary database. The configuration process is\nsimplified, because the database is created automatically when you enable data collection.\nNote:\nThe provided version of PostgreSQL is provided as a container image. If your primary database is DB2, you must install either Docker\nEngine or Podman on your primary server to use this option.\nUse your own installation of PostgreSQL.\nIf you prefer to use your own installation, RICOH ProcessDirector can connect to a PostgreSQL database on any system in your network. Before\nyou enable data collection, you must create a database system, database, and database user ID.\nConfiguration\nYou use the Administration page to configure basic information about the Reports database, such as:\nThe database name\nThe user and password that RICOH ProcessDirector uses to access the database\nThe host name and port of the computer that the database tables are stored on\nTo collect job, order, printer, or user activity data, configure the appropriate data collector to specify the data to capture. To use the\nWritePropsToReportsDatabase step, add the step to your workflows as needed. When the step runs, it stores the property values in the specified\ndatabase tables. If the table does not exist when the step runs, RICOH ProcessDirector creates it.\nAfter the database is created and contains data, you can use SQL statements to query data and to export data to external storage for long-term\nuse or use a data transmitter to send the data to another application that accepts data exchange over the REST protocol.\nTo send data on a specific schedule, or when the Enabled status changes, you configure the appropriate data transmitter to specify the interval\nand frequency.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:24 PM Reports - Jenski - Test portal- RPD Linux\nYou can use the One-time transmission function to send a specific set of data outside the scheduled time, such as when testing the transmitter\nor to resend data that was previously sent.\nData visualization\nTo analyze data stored in the Reports database, you can use a business intelligence tool, such as Tableau. The Reports feature includes a Tableau\nworkbook with sample worksheets that let you visualize the data for pages printed and jobs by customer. After examining the supplied data\nvisualizations, you can create your own data visualizations and publish them to a server or make them available to management.\nIn this section:\nUsage scenario for Reports\nIn this scenario, a printing company wants to generate daily reports that show the pages printed on each printer and the jobs printed by each\ncustomer. They want to create a reporting dashboard with the two reports and publish the dashboard to a server that company management\ncan access.\nParent topic: No-charge product enhancement features\n2 of 2"}]}