{"doc_name": "rcm_creatingstepresources.pdf", "doc_path": "data/raw/RPD-en-US/rcm_creatingstepresources.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1781, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Creating step resources - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Creating step resources\nCreating step resources\nA step resource identifies a file that is used by a workflow step for its processing. Some step templates allow you to specify a file for the step to\nuse when processing jobs. Some of these files might be created on your workstation but need to be available to the workflow when it processes\njobs. You can view, retrieve, and replace the file by editing the step resource object.\nTo create a step resource:\n1. Click the Workflow tab.\n2. In the left pane, click Step Resources.\n3. Click Add .\n4. In the File name property, click the folder icon to browse the folders on your computer and select the file to upload. When you have\nselected the file, click Open. A progress indicator displays while the file is uploaded.\n5. Fill in any other values as needed. An asterisk, *, indicates that a property is required.\n6. To see information about any of the properties, click the question mark ( ) icon next to the property name.\n7. When you finish, click OK.\nUsage notes:\n1. After you create the step resource, you can view or download the file by clicking on the link in the File name property. A browser setting\ndetermines if the file opens or is downloaded to your computer.\n2. To use the step resource, open the workflow that contains the step that uses the file. For example, the IdentifyPDFDocuments step\ntemplate has a property named Identify PDF control file. To associate the step resource with the property, right-click the step and select\nProperties. Click PDF and select the file from the list of step resources in the Identify PDF control file field.\nParent topic: Preparing to use workflows\n1 of 1"}]}