{"doc_name": "rep_c_configforFileCabinet.pdf", "doc_path": "data/raw/RPD-en-US/rep_c_configforFileCabinet.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2942, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Setting up the Archive feature - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Archive feature\nSetting up the Archive feature\nAfter you read the Archive overview topics, you can set up Archive by doing the configuration tasks described in this section.\nAfter the initial configuration is complete, test your Archive workflows and repositories to make sure they work as you expect them to.\nIn this section:\nRunning the Archive sample workflow\nThe Archive feature provides a sample workflow that you can examine and run to understand how the feature works. The sample includes a\nrepository, a hot folder input device with a pre-submitted PDF file, a supplied history record notification, and a workflow that includes the\nStoreInRepository step.\nPlanning for retention of job and document data\nBefore you configure the Archive feature, plan the best way to set up repositories to hold the job and document data that you want to store.\nTuning for search and storage performance\nThe Archive configuration can be modified to optimize search and storage performance based on server resources.\nCreating repositories\nYou can create repositories to hold job and document data that you want to store for possible later retrieval to submit again as a new job. You\ncan create multiple repositories to hold job and document data for different lengths of time or to make the data accessible to different groups of\nusers.\nDefining history record notifications\nYou can use notifications to create records to be saved as part of job history. You can define history record notifications to capture timestamps of\njob state changes as a job is processed in its workflow.\nEnhancing PDF files for Archive\nUse the RICOH ProcessDirector Plug-in for Adobe Acrobat to enhance sample PDF files so that you can store the documents or historical\ninformation about them in a repository.\nEnhancing AFP files for Archive\nMost AFP files that are submitted to RICOH ProcessDirector need to be enhanced before you can store the documents or information about their\nprocessing history in the AFP files in a repository.\nCreating an associated properties file\nYou can create an associated properties file to specify one or more properties that are associated with a job, but that are properties of other\nobjects. When a step based on the StoreInRepository step template runs, these properties and their values are stored in a repository along with\njob and document data. For example, you can store the model of the printer requested for a job or the color of the media specified to print a\njob.\nWorkflows that store jobs and data in a repository\nWorkflows in the Archive feature can be created to store jobs, documents, properties, history information, or a combination of these in one or\nmore repositories. Workflow steps based on the StoreInRepository step template are used to store the files and data.\nParent topic: Configuring\n1 of 1"}]}