{"doc_name": "aiw_useannotations.pdf", "doc_path": "data/raw/RPD-en-US/aiw_useannotations.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1868, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Using workflow annotations - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Using workflow annotations\nUsing workflow annotations\nYou can create annotations to write comments or reminders directly in your workflow. Add descriptions or comments to the steps, step chains,\nor connectors by using the annotations.\nTo create an annotation:\n1. Click the Workflow tab.\n2. In the left pane, click Workflows.\n3. Click a workflow that you want to open.\n4. In the workflow editor, right-click and select Add annotation from the menu.\n5. Enter your comment and click the arrow icon to post the annotation.\nThe annotation is saved and visible on the workflow.\nTo edit your annotation:\n1. Double-click an existing annotation.\n2. Click the post annotation arrow to save the edited text.\nTo switch layers:\n1. To bring an annotation in front of the workflow elements, click , the more options menu, and select Bring to front.\n2. To send an existing annotation behind the workflow elements, left-click , the more options menu, and select Send to back.\nTo move the annotations around the workflow editor, drag an existing annotation to the point where you want it placed.\nTo change a color of an annotation, click the color wheel to pick the color you want.\nTo add an annotation to a step chain:\n1. Click the Workflow tab.\n2. In the left pane, click Step Chains.\n3. Click a step chain that you want to open.\n4. In the step chain editor, right-click and select Add annotation from the menu.\n5. Enter your comment and click the arrow icon to post the annotation.\nThe annotation is saved and visible on the workflow.\n6. To save the step chain, click the menu in the upper right corner and select Save step chain.\n7. To exit the step chain editor, click the X in the upper right corner.\nParent topic: Preparing to use workflows\n1 of 1"}]}