{"doc_name": "aiw_jobtypeforpreviewprint.pdf", "doc_path": "data/raw/RPD-en-US/aiw_jobtypeforpreviewprint.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2561, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Defining a workflow with preview printing - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Defining a workflow with preview printing\nDefining a workflow with preview printing\nTo print sample pages from a job so you can verify the output before you print the entire job, you must define a workflow that includes one or\nmore steps based on the PreviewPrint step template.\nThere are various ways to use preview printing and corresponding methods for creating workflows. For example, you could:\nCreate a workflow with one PreviewPrint step and configure it so operators check the preview print every time the step runs.\nIf the output is not acceptable, the operators can change property settings for the job and use the Process Again action to do the preview print\nagain.\nCreate a workflow with multiple PreviewPrint steps and configure it so some of the preview prints are accepted automatically.\nOperators can compare all the output and adjust the job properties to match the preview print that is most acceptable, then let the job\ncontinue processing with the next step.\nCreate a preflight workflow that includes multiple PreviewPrint steps with some of the preview prints accepted automatically, with or without a\nPrintJobs step. Then, create other workflows that correspond to the properties used in each PreviewPrint step.\nOperators can compare the preview print output and choose which one is most acceptable. Then, they can accept the preview print and choose\nto continue processing the job either in the same workflow or in one of the other workflows.\nYou can choose the method that best matches your process.\nTo define a workflow with preview printing:\n1. Click the Workflow tab.\n2. Right-click a workflow that you want to use as a model and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Review the steps that are included in the workflow and the default values that they set.\n5. Add one or more steps based on the PreviewPrint step template to the workflow in the appropriate places and set the job property\ndefaults.\nIf you add more than one PreviewPrint step, you can set the Accept preview print automatically property to Yes to have some of the steps\naccepted without intervention.\n6. Add any other steps that you want to include in this workflow, including steps that change output options between steps based on the\nPreviewPrint step template.\n7. Save and enable the workflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}