{"doc_name": "reportsPostgresql_c_AddStepsToCapturePropertyValues.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_c_AddStepsToCapturePropertyValues.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2446, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Adding steps that store property values in the Reports database - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring to use Reports / Adding steps that store property values in the Reports database\nAdding steps that store property values in the Reports database\nYou can add steps to your workflows to capture job and document property values and store them in the Reports database.\nBefore you do the steps in this procedure, determine which job and document properties you want to capture and when you want to capture\nthem. The properties you select should relate to the type of reports you want to generate from the data.\nTo add steps that store property values in the Reports database:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Add the WritePropsToReportsDatabase step to the workflow.\n5. Right-click the step and select Properties.\n6. Click the Reports tab.\n7. In the Job properties to write and Document properties to write fields, select the property values that you want to store in the PostgreSQL\ndatabase.\nNote:\nSome property values are blank until after a certain point in a workflow. For example, a job does not have a value for Assigned to\nprinter (Job.Print.AssignPrintTime) until the job is sent to the printer in the PrintJobs step. If you store Assigned to printer to the\nPostgreSQL database before the PrintJobs step runs, the property is present in the database table, but the value is blank.\n8. To include a label in the database for the information that the step stores, enter a value for Event type.\n9. Fill in values for the other properties as needed.\nYou must use different table names for the Document properties table and Job properties table properties. The values you use must also be\ndifferent from the Database table names specified in the data collectors.\n10. Click OK.\n11. Optional: If you want to collect data at other points in the workflow, add another WritePropsToReportsDatabase step and update its\nproperties.\n12. Save and enable the workflow.\nParent topic: Configuring to use Reports\n1 of 1"}]}