{"doc_name": "importingexistingdefinitions.pdf", "doc_path": "data/raw/RPD-en-US/importingexistingdefinitions.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2592, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Using existing page groups and index tags - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Using existing page groups and index tags\nUsing existing page groups and index tags\nIf page groups and index tags are defined in the AFP file instead of a Visual Workbench control file, you can choose whether to use the existing\npage groups in the AFP file and, if the page groups are nested, which level of page groups to use.\nYou can also choose whether to use the existing index tags. If you do not tell AFP Indexer whether to use existing page groups and index tags, all\nexisting page groups and index tags are used unless you create new page groups.\nIn most cases, if an AFP file contains page groups, you should use them. If you use the existing page groups, you cannot change the page group\nboundaries. However, you can create additional index tags and modify existing tag values.\nNote: Be cautious about changing which level of existing page groups to use if you have made enhancements to the sample AFP file. For\nexample, if you have created page groups or index tags, the page groups might change or the index tags might be invalid. In addition,\nother types of definitions in the control file (for example, barcodes created with AFP Editor) might not work properly if they are based on\nthe page groups or index tags created with AFP Indexer.\nTo use existing page groups and index tags:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. Click Tools ⇒ Other Page Groups ⇒ Use Existing Page Groups.\nYou might see a message that says the page groups and indexes might change or be invalid and asks if you want to continue. Click Yes.\nYou see the Use Existing Page Groups window.\n3. In the Use page group level field, select a number, 0 to 20, for the levels in the page group structure that you want to keep.\nNote: To keep all page groups, select 0. Select a number greater than 0 only if you have nested page groups.\nFor example, the first figure shows a page group structure with two levels. To keep the page groups in all of the levels, select 0. However,\nto keep only the page groups in the second level (and any levels below it), select 1. The second figure shows the new page structure after\nyou select 1.\n4. To remove the index tags that are defined in the AFP file, clear the Use index tags box.\n5. Click OK.\nYou see the page groups and index tags that you chose to use in the AFP file.\nParent topic: Indexing AFP files\n1 of 1"}]}