{"doc_name": "aiwcafpres.pdf", "doc_path": "data/raw/RPD-en-US/aiwcafpres.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7216, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM AFP resources in RICOH ProcessDirector - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / AFP resources in RICOH ProcessDirector\nAFP resources in RICOH ProcessDirector\nWhenever you view or print an Advanced Function Presentation (AFP) file or convert a line data job to AFP, RICOH ProcessDirector most likely\nencounters references to AFP resources such as overlays, page segments, and fonts. If those resources are sent inline with the job, RICOH\nProcessDirector uses the inline resources. If they are not inline, RICOH ProcessDirector must know where to find them on your system to be able\nto display, print, or convert the job correctly.\nTwo kinds of resource libraries exist: those that use a resource access table (RAT) and those that do not use a RAT. A resource access table is an\nindex of a resource library. The index is stored as a file in the library that it refers to. Color Management Resources (CMRs) and data objects must\nbe stored in resource libraries that use a RAT. Other resources, such as form definitions, page definitions, and overlays, can be stored in resource\nlibraries that do not use a RAT.\nYou can configure RICOH ProcessDirector to use resources that are stored on any system in your network, as long as RICOH ProcessDirector can\naccess the system that they reside on. However, it is recommended that you move all your resources to the default resource directory on your\nRICOH ProcessDirector primary computer. By storing them in that directory, all the RICOH ProcessDirector components, including any\napplication/secondary servers that you install on different computers, can find them with no additional configuration.\nThe default resource directory is /aiw/aiw1/resources (Linux) or C:\\aiw\\aiw1\\resources (Windows). RICOH ProcessDirector does not make\nany changes to that directory during updates, so you do not have to reload the resources when you install an update.\nThe easiest way to move your file to the default directory is to use FTP. Create any subdirectories that you want to use under\n/aiw/aiw1/resources (Linux) or C:\\aiw\\aiw1\\resources (Windows) and use an FTP client to move the resources into them. Make sure that\nyou transfer the files as binary data, not as text. If you prefer not to move the resources to the default directory, you can create a different\ndirectory on the system and FTP the resources to that location instead.\nNote:\nRICOH ProcessDirector also searches for resources in /usr/lpp/psf/reslib (Linux) or C:\\Program Files (x86)\\Ricoh\\PSF\\reslib\n(Windows), but it is not recommended that you store your resources there because they could be overwritten if we provide a resource file\nwith the same name as your resource file.\nIf you cannot move your resources onto the primary computer, leave them where they are:\nOn Linux, NFS-mount a directory on your primary computer to that computer. To do this option, install NFS server and client software, which is\navailable from a variety of vendors.\nOn Windows, map a folder on the computer with the resources as a network drive on the primary computer. To use this option, configure\nRICOH ProcessDirector to map the network drive whenever RICOH ProcessDirector starts. For information about mapping network drives on a\nWindows computer, see the RICOH ProcessDirector information center.\nThe main drawback to leaving your resources where they are is the system generates a significant amount of network traffic as it retrieves the\nresources. The increase in traffic and time needed to retrieve the resources could reduce printer performance.\nIf you are migrating from InfoPrint Manager on Windows to RICOH ProcessDirector on Linux, be aware that Linux is case-sensitive. As a result,\nRICOH ProcessDirector looks for resource names in the case that is specified in the job. Windows is not case-sensitive; therefore, jobs that printed\nwith InfoPrint Manager might have referred to resources in a different case than the actual resource names found on Windows. If you copy\nresources from your Windows system to Linux, make sure that the resource names match the case specified in your jobs.\nIf the print or conversion step is configured to run on a secondary computer rather than the primary computer, the directory that contains the\nresources must be available to that secondary computer. The default is that RICOH ProcessDirector mounts the /aiw/aiw1/resources (Linux) or\nC:\\aiw\\aiw1\\resources (Windows) directory from the primary to the secondary computer. If you are using other directories to store resources,\nyou may need to NFS-mount your secondary computer directly to those directories as well.\nIf you use a step based on the TransformJobIntoPDF step template and want to specify a form definition for the RICOH AFP to PDF transform to\nuse, be aware that the RICOH ProcessDirector Transforms and InfoPrint Transform Manager look for AFP resources only in a directory named\nreslib under the path that they are installed in. They do not use the AFP resource path that you specify for the other RICOH ProcessDirector\nsteps. If a form definition with the name you specify in RICOH ProcessDirector exists in the reslib directory but is not identical to the one that\nRICOH ProcessDirector can access in its AFP resource path, you might see different results when you view the file in RICOH ProcessDirector than\nwhen you print the output of the RICOH AFP to PDF transform.\nAfter you have decided where your resources are to be stored and have either moved them or mounted the appropriate directories, you must\nidentify the resource locations to RICOH ProcessDirector.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM AFP resources in RICOH ProcessDirector - Jenski - Test portal- RPD Linux\nIn this section:\nIdentifying AFP resource directories to RICOH ProcessDirector\nIf any of your AFP resources (such as fonts, form definitions, page segments, and overlays) are neither sent inline with the job nor in the default\nresource directory, you must configure your workflows so that RICOH ProcessDirector knows where to find those resources during processing. In\naddition, you might want to add those directories to existing step templates and printers.\nSearch order for AFP resource extensions\nPrint files refer to AFP resources by their names, without including a file type extension. However, resource files often have extensions added to\nthem. When a component of RICOH ProcessDirector requests a resource, it uses the inline resource if the job includes one. Otherwise, it first\nlooks for a file that matches the resource name without an extension. If it cannot find one, it adds one extension after another to the file name\nand searches for the resource using the new name.\nJob properties and AFP form definitions\nRICOH ProcessDirector job properties can specify some of the same options as the form definition used for the job. If a job property and form\ndefinition conflict, these rules determine which value to use.\nColor mapping table source and output files\nA color mapping table is a printer resource object that defines a translation from certain Mixed Object Document Content Architecture\n(MO:DCA) structured fields to new color structured fields that newer printers use.\nParent topic: Configuring\n2 of 2"}]}