{"doc_name": "ppfrsample_c_RunFormsForJobsWF.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_c_RunFormsForJobsWF.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5217, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Running the sample workflow that uses electronic forms to print jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to use electronic forms / Running the sample workflow that uses electronic forms to print jobs\nRunning the sample workflow that uses electronic forms to print jobs\nThe ElectronicFormJobSample workflow demonstrates how to combine electronic forms with data in PDF files for jobs. The sample workflow\nprints some jobs by combining electronic forms with data. It prints other jobs on preprinted forms. The workflow is installed with the Preprinted\nForms Replacement feature.\nThe workflow includes two branches:\nThe [1] Electronic branch sends jobs with Electronic in the job name through the CombinePDFWithForm step, which combines the electronic\nforms with the data. The jobs then go to the CountPages step. When the jobs reach the PrintJobs step, they are printed on plain paper.\nThe [2] Preprinted branch sends jobs that do not have Electronic in the job name directly to the CountPages step. Those jobs bypass the\nCombinePDFWithForm step and are printed on preprinted forms.\nThe sample objects and files used in this workflow include:\nWorkflow: ElectronicFormJobSample\nInput device: ElectronicFormJobFolder\nMedia object: ElectronicFrontAndBack\nPDF files:\nElectronicJob.pdf\nPreprintedJob.pdf\nThese simplex jobs, which are identical except for their job names, have 500 pages of variable name and address data with a letter salutation.\nThe printed output of both jobs is 500 customer letters with information about a rewards program on the front and footnotes on the back.\nThe sample workflow processes the PreprintedJob.pdf file as a simplex job that prints on the preprinted form that the\nElectronicFrontAndBack media object represents. The preprinted form has the static text of the customer letter on the front side and the static\ntext of the footnotes on the back side.\nThe sample workflow processes the ElectronicJob.pdf file by converting it from a simplex job to a duplex job that prints on plain paper. The\nsample workflow creates the front pages of the duplex job by combining an electronic form with the variable name and address data. The\nelectronic form has the static text of the customer letter. The sample workflow creates the back pages of the duplex job by adding an electronic\nform with the static text of the footnotes.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Input Devices portlet, right-click the ElectronicFormJobFolder hot folder and select Enable and Connect.\nThe first time that you enable and connect the hot folder, RICOH ProcessDirector submits the ElectronicJob.pdf and\nPreprintedJob.pdf jobs to the ElectronicFormJobSample workflow.\nThe jobs move through the workflow and stop at the PrintJobs step. Both jobs are in the Device unavailable state, waiting for the Sample\nprinter to be enabled.\n3. Review the ElectronicFrontAndBack media object.\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Media.\n3. Right-click the ElectronicFrontAndBack media object and select Properties.\n4. To view the electronic form for the front of the media, click the blue Front of form link.\nThe PDF page used for the front of the form opens in a new browser tab.\n5. When you are finished viewing the form, close the tab.\n6. To view the electronic form for the back of the media, click the blue Back of form link.\nThe PDF page used for the back of the form opens in a new browser tab.\n7. When you are finished viewing the form, close the tab.\n8. Look at the value of the Media name for printing property.\nThe property is set to None.\n4. Review the PreprintedJob.pdf job.\n1. Right-click the job and select View.\nYou see 500 pages of variable name and address data with a letter salutation.\n2. Click Close.\n3. Right-click the job and select Properties.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Running the sample workflow that uses electronic forms to print jobs - Jenski - Test portal- RPD Linux\n4. Click the General tab.\nDuplex is set to No.\n5. Click the Scheduling tab.\nThe Media value is ElectronicFrontAndBack.\n5. Review the ElectronicJob.pdf job.\n1. Right-click the job and select View.\nYou see 1,000 pages: 500 customized letters with variable name and address data and static text about a rewards program on the\nfront. On the back of the letter are footnotes with static text.\n2. Click Close.\n3. Right-click the job and select Properties.\n4. Click the General tab.\nDuplex is set to Yes.\n5. Click the Scheduling tab.\nThe Media value is Not set.\nThe ElectronicJob.pdf job entered the workflow with the same property values as the PreprintedJob.pdf job:\nDuplex was set to No.\nMedia was set to ElectronicFrontAndBack.\nWhen the CombinePDFWithForm step processed the ElectronicJob.pdf job, it combined the forms with the data and changed the job\nfrom simplex to duplex.\nBecause the Media name for printing property on the ElectronicFrontAndBack media object is set to None, the CombinePDFWithForm step\nremoved the ElectronicFrontAndBack media name from the job. Setting the property to None causes the job to print on whatever paper is\nused when jobs do not specify media.\nParent topic: Setting up to use electronic forms\n2 of 2"}]}