{"doc_name": "aiw_o_encryptedPDF.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_encryptedPDF.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3079, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Jobs with encrypted PDF files - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Jobs with encrypted PDF files\nJobs with encrypted PDF files\nRICOH ProcessDirector can receive encrypted PDF files, but must decrypt the files to process the jobs. It can also encrypt PDF files to be sent\noutside the system if needed.\nReceiving encrypted PDF files\nMost steps cannot process encrypted files. As a result, you must decrypt them and remove the encryption password before the first step in the\nworkflow that needs to open the PDF file. Use a step based on the DecryptPDF step template to open the file and remove the encryption\nsettings.\nNote:\nThe DecryptPDF step template cannot process PDF files inside a ZIP file.\nTo decrypt a PDF file, you must use the password that was set when the file was created. In Adobe Acrobat, this corresponds to the Document\nOpen Password or the Permissions Password. Work with your customer to determine the best way to manage these passwords. You can choose\nto use the same password for every PDF file that a customer submits. In that case, you can record the Permissions Password value as the\nDecryption password in the DecryptPDF step without updating it.\nAlternatively, you can choose to set a different password for every PDF file submitted. If the password changes with every job, you must provide\na way for the operator to enter the password for each job. You can add a manual step to the workflow before the DecryptPDF step and give it a\nname like EnterDecryptPassword. During processing, the job stops at that step. The operator opens the job property notebook and enters the\nDecryption password in the Decrypt PDF tab. Then the operator can complete the manual step so the password is available when the DecryptPDF\nstep runs.\nThe Permissions password can also be submitted in an overrides file along with other job properties. However, this method is not recommended\nbecause it is not secure.\nEncrypting PDF files in a workflow\nIf you need to encrypt your PDF files as part of a workflow, use the EncryptPDF step. When you encrypt a PDF file, you can specify one or two\npasswords. The passwords work in conjunction with a list of password-protected actions to limit what the recipient can do with the file.\nThe Permissions password is the master password. It unlocks the file, so the recipient can read it, fill in form fields, and even edit the contents,\ndepending on the password-protected actions selected.\nThe Document open password is a more limited password. It unlocks the file so the recipient can read, but not edit it in any way. This password\nis only needed if both of these statements are true:\nThe recipient must enter a password to open the file and read it.\nThe recipient must be prohibited from changing the document, such as by filling in forms or editing the contents.\nIf the file does not contain secure information, you can set the allowed actions to permit opening the file without a password, but to require the\nPermissions password for editing.\nParent topic: Product overview\n1 of 1"}]}