{"doc_name": "aiw_c_addconnectorrule.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_addconnectorrule.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 9369, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Adding conditional processing to a workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Adding conditional processing to a workflow\nAdding conditional processing to a workflow\nYou can add conditional processing to a workflow by specifying rules for the connectors between steps. For example, a rule might specify jobs\nwith fewer than 20 pages. The connector with that rule sends jobs to steps that request a cut sheet printer. Another connector sends all other\njobs to steps that request a continuous forms printer.\nWe recommend that you plan your conditional processing before you specify rules. Outline the conditions that apply to each processing path.\nWhen a step sends jobs to different steps based on conditions, make sure that the conditional processing rules cover all jobs that the step\nreceives.\nWhen a step uses conditional processing to send different jobs to different steps, the connectors should have mutually exclusive rules. If you send\nall jobs that do not meet the conditions for the other connectors through a connector with a rule that has no conditions, make sure that\nconnector has the highest value for its Order of execution property of all the connectors exiting the step.\nTo add conditional processing to a workflow:\n1. Click the Workflow tab.\n2. Click the name of the workflow with connectors that need conditional processing rules.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Right-click the connector and select Properties.\n5. Give the connector a conditional processing rule:\nTo define a new rule, type a Rule name.\nWe recommend giving the rule a very short name that describes the processing. You see the name next to the connector on the workflow\neditor\nTo use an existing rule, select it on the Rule template to use list.\nNote:\nTo use an existing rule as a template for a new rule, select it. Change the name of the rule, its conditions, or both.\nYou can have multiple rules with the same name. Rules with the same name can have different conditions, and rules with\ndifferent names can have the same conditions. If you assign a rule to multiple connectors and then change the conditions for the\nrule assigned to one connector, the conditions for the rule assigned to the other connectors do not change.\n6. If the rule has multiple conditions, specify whether All, Any, or a combination of the conditions apply to the connector.\n7. Specify the first condition using the Property field, the Comparison field, and the Value field.\nProperty values are case-sensitive.\nImportant:\nThe Comparison value is not (!=) does not process jobs that have no value for the specified property. To process these jobs, select\nthe Comparison value Not set.\nFor example, you want to send jobs with fewer than 20 pages to steps that request a cut sheet printer. Select the Total pages property, the\nless than (<) comparison, and type 20 for the value. You see a description of the rule in the Summary area: Job.TotalPages < 20.\n8. To specify another condition, click Add ( ) and use the Property, Comparison, and Value fields.\nTo delete a condition, click Delete ( ).\n9. When you finish specifying conditions, click OK.\n10. Repeat the procedure described above to give rules to other connectors that send jobs from the same step.\nIf one of the connectors does not need a rule because it processes all jobs that do not meet the conditions specified by the other\nconnectors, we recommend that you define a rule with a name but no conditions. Use the name to describe the processing, for example:\nelse. Make sure this connector has the highest value for its Order of execution property of all the connectors exiting the step, so the\nconditions on all the other connectors are evaluated before this one. The order of execution is displayed on the label on the connector\nbefore the value of the Rule name.\n11. Go to another step with connectors to multiple steps, and repeat the procedure described above.\n12. When you finish, select Save workflow from the More menu to the left of the workflow name.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:12 PM Adding conditional processing to a workflow - Jenski - Test portal- RPD Linux\nNote:\nIf a rule is not assigned to a connector, RICOH ProcessDirector deletes the rule when you close the workflow.\n13. Enable the workflow and test it to make sure that the conditional processing works in the way you expect. Submit jobs that are sent\nthrough all the paths.\nExamples\nConditional processing by total pages in a job\nYou want to process jobs with fewer than 20 pages differently from jobs with 20 pages or more. Jobs with fewer than 20 pages could be\nprinted simplex on a cut sheet printer with ring binding. Jobs with 20 pages or more could be printed duplex on a continuous forms printer\nwith perfect binding. This example describes conditional processing in the sample PDFProduction workflow.\nUse conditional processing with connectors to two steps, AssignJobValues and AssignJobValues2:\nCreate the connector to the AssignJobValues step. In the Connector Property, change the Order of execution value to 1. Then give the\nconnector a rule with one condition: Total pages < 20. Name the rule: < 20pg.\nCreate the connector to the AssignJobValues2 step. In the Connector Property, change the Order of execution value to 2. Then give the\nconnector a rule with no conditions. Name the rule: else.\nWhen you send jobs through the PDFProduction workflow, RICOH ProcessDirector first checks to see if the job has fewer than 20 pages. If it\ndoes, RICOH ProcessDirector sends the job through the < 20pg connector to the AssignJobValues step. If the job has 20 or more pages,\nRICOH ProcessDirector sends the job through the else connector to the AssignJobValues2 step.\nNote:\nIf you create the connector with the else rule and the Order of execution value for the connector is 1, RICOH ProcessDirector sends\nall jobs through that connector. No jobs are sent through the connector with the < 20pg rule.\nIn the sample PDFProduction workflow, the AssignJobValues step sets the Custom 1 job property to Small job. The AssignJobValues2\nstep sets the Custom 1 job property to Large job.\nTo print jobs with fewer than 20 pages simplex on a cut sheet printer with ring binding, use the AssignJobValues step to set the Binding\nproperty value to Ring, the Duplex property value to No, and the Requested printer property value to the name of a cut sheet printer. To\nprint jobs with 20 pages or more duplex on a continuous forms printer with perfect binding, use the AssignJobValues2 step to set the\nBinding property value to Perfect, the Duplex property value to Yes, and the Requested printer property value to the name of a continuous\nforms printer.\nConditional processing by customer name\nYou want to process jobs for customer A in one way and jobs for customers B and C in another way. You also want RICOH ProcessDirector\nto issue an error message when a job for customer D enters the workflow by mistake. The FailWithMessage step issues an error message.\nUse conditional processing with connectors to three steps:\nGive the connector to the step for customer A a rule with one condition: Customer name = A. Name the rule A.\nGive the connector to the step for customers B and C a rule with two conditions:\nCustomer name = B\nCustomer name = C\nSpecify that Any of the conditions apply. Name the rule B or C.\nCreate the connector to the FailWithMessage step and set its Order of execution value to 3. Give the connector a rule with no conditions.\nName the rule: else.\nConditional processing by customer name and duplexed printing\nYou want to process duplex jobs for customer A and B on a high quality printer and duplex jobs for customers C and D on a standard quality\nprinter. Jobs that do not require duplex printing are all printed on the same printer.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:12 PM Adding conditional processing to a workflow - Jenski - Test portal- RPD Linux\nUse conditional processing with connectors to three steps:\nOn the first connector, define these conditions:\n1. Customer name = A\n2. Customer name = B\n3. Duplex = Yes\nDo one of these:\nSelect Custom, and in the text box, type: (1 OR 2) AND 3. Name the rule (A or B) and duplex, and set the Order of execution value to 1.\nThis connector sends the job to an AssignJobValues step that sets the Requested printer property to a high quality duplex printer.\nOn the second connector, define these conditions:\n1. Customer name = C\n2. Customer name = D\n3. Duplex = Yes\nDo one of these:\nSelect Custom, and in the text box, type: (1 OR 2) AND 3. Name the rule (C or D) and duplex, and set the Order of execution value to 2.\nThis connector sends the job to an AssignJobValues step that sets the Requested printer property to a standard quality duplex printer.\nOn the third connector, define this condition: Duplex = No\nName the rule Simplex and set the Order of execution value to 3.\nThis connector sends the job to an AssignJobValues step that sets the Requested printer property to the printer used for simplex jobs.\nParent topic: Preparing to use workflows\n3 of 3"}]}