{"doc_name": "mcc_c_RunSOAPmccWF.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_RunSOAPmccWF.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 12189, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Running the sample workflows for processing orders retrieved from MarcomCentral - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral / Running the sample workflows for processing orders retrieved from MarcomCentral\nRunning the sample workflows for processing orders retrieved from MarcomCentral\nThe MarcomProcessOrders and MarcomProcessJobTicket workflows show how to process orders retrieved from a sample store at the\nMarcomCentral website. The sample store serves as a test environment for the RICOH ProcessDirector web services interface to MarcomCentral.\nA SOAP web service input device, a CallSOAPService step, and a SOAP web service notification communicate with the MarcomCentral website.\nThe workflows also include examples of these steps: ApplyXSLTransform, CreateOrdersFromFile, and DownloadFile\nThe sample input device, CallSOAPService step, and notification run a simulation. They do not call the specified MarcomCentral web services. The\nsimulation lets you run the samples without getting your own MarcomCentral credentials and setting up a sample MarcomCentral store that\nresembles the sample store. The samples use SOAP 1.1 request payloads to retrieve a simulated MarcomCentral order and two job tickets. The\nvalue in the static credential and password fields tells RICOH ProcessDirector to run the simulation.\nAfter you run the samples, you can copy them. Then you can adjust the values in the copies to exchange data with your own store at the\nMarcomCentral website.\nNote:\nThe sample objects and files are installed with the MarcomCentral Connect feature.\nThe simulation includes Web Services Description Language (WSDL) SOAP request objects imported from MarcomCentral. The sample input\ndevice, CallSOAPService steps, and notification each specify a SOAP request.\nThis simulation uses these objects and files:\nWorkflows:\nMarcomProcessOrders\nMarcomProcessJobTicket\nOrder property mapping: MarconOrderSample\nInput device: MarcomReceiveOrders\nThe input device retrieves XML orders from the MarcomCentral website by simulating a call to a web service at\nhttps://services.printable.com/Trans/1.0/Order.asmx\nThe SOAP request is Marcom-GetOrdersByDate.\nNotification: MarcomCloseoutOrder\nThe notification sends order completion information to the MarcomCentral website by simulating a call to a web service at\nhttps://services.printable.com/Trans/1.0/Closeout.asmx\nThe SOAP request is MarcomSample-CloseoutByOrder.\nXML orders\nIn the simulation, one order is retrieved every 30 seconds from the web service.\nAfter you run the sample workflows, you can see the contents of a sample order. Go to: /aiw/aiw1/spool/default/job_number\nReplace job_number with the number of the job, for example, 10000001.\nDisplay the contents of the job_number.print.xml file, for example, 10000001.print.xml.\nXML job tickets\nIn the simulation, two job tickets are retrieved for every order.\nAfter you run the sample workflows, you can see the contents of the two sample job tickets. Go to:\n/aiw/aiw1/spool/default/child_job_number\nReplace child_job_number with the number of the child job, for example, 10000001.1 or 10000001.2.\nDisplay the contents of the child_job_number.print.xml file, for example, 10000001.1.print.xml or 10000001.2.print.xml.\nPrint file: Savings.pdf\nThis file is downloaded locally from http://localhost:15080/restapi/\nXSLT style sheet file: downloadOverrides.xslt\nThe file is in the Marcom directory: /aiw/aiw1/testfiles/Marcom\nCallSOAPService step:\nThe CallSOAPService step retrieves a job ticket from the MarcomCentral website by simulating a call to a web service at\nhttps://services.printable.com/Trans/1.0/JobTicket.asmx\nThe SOAP request is Marcom-GetJobTicketByLineItem.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Printers portlet, right-click the Sample printer and select Enable.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:16 PM Running the sample workflows for processing orders retrieved from MarcomCentral - Jenski - Test portal- RPD Linux\n3. In the Input Devices portlet, right-click the MarcomReceiveOrders SOAP web service input device and select Enable and Connect.\nA job named Marcom Sample Order appears in the jobs table.\n4. Right-click the MarcomReceiveOrders input device and select Disable and Disconnect.\nNote:\nThe sample input device polls for orders every 30 seconds and retrieves an XML job. If you do not disable and disconnect the input\ndevice, a new job appears in the jobs table every 30 seconds.\nThe request payload for the input device includes these RICOH ProcessDirector symbols:\n${WebService.StaticCredential}\nSpecifies the static credential\n${WebService.LastSuccessRequestTime}\nSpecifies the date and time when the input device last successfully requested a response from the web service.\n${WebService.CurrentRequestTime}\nSpecifies the date and time of the current request.\nEach time the MarcomReceiveOrders input device retrieves an XML job, it sends the job to the MarcomProcessOrders workflow.\nThe job goes through these and other steps in the MarcomProcessOrders workflow:\nThe SetJobPropsFromTextFile step sets the Job name property to Marcom Sample Order.\nThe CreateOrdersFromFile step uses the MarcomOrderSample property mapping object to identify orders and jobs, then map the values\nof some XML elements in the XML order file to order and job properties.\nThe table lists the properties that are set.\nXML element Database name User interface name\n/Order/OrderNumber Order.Name Order name\n/Order/ID Order.Reference External order reference\n/Order/OrderDetails/OrderDetail/User/Name Order.Customer Customer name\n/Order/OrderDetails/OrderDetail/SKUDescription Order.Description Description\n/Order/OrderDetails/OrderDetail/Quantity Job.Copies Job copies requested\n/Order/OrderDetails/OrderDetail/OrderNumber Job.Marcom.OrderNumber MarcomCentral order number\n/Order/ID Job.Marcom.OrderId MarcomCentral order ID\n/Order/OrderDetails/OrderDetail/ID Job.Marcom.JobTicketId MarcomCentral job ticket\n/Order/OrderDetails/OrderDetail/ProductType Job.Marcom.ProductType MarcomCentral product type\n/Order/OrderDetails/OrderDetail/ProductName Job.Name Job name\nThe step identifies one order with two jobs in it. It creates two jobs, Jensen Bank Baseball Cap and Brochure, and submits the jobs to the\nMarcomProcessJobTicket workflow.\nThe original order job is sent to the WaitForRelatedJobs step.\nThe jobs start processing in the MarcomProcessJobTicket workflow. When the jobs leave the SetJobPropsFromTextFile step, the rule on the\n[1] Warehouse connector checks the value of MarcomCentral product type property. Versioned, Variable, and JobDirect are product types\nfor printable items.\nIf the item does not have a printable product type, the workflow sends the job through the Warehouse branch.\nIf the item has a printable product type, the workflow sends the job through the Printable branch.\nNon-printable jobs go through the ManualStepWithAutoStart step in the Warehouse branch of the workflow. The jobs wait in that step\nuntil the warehouse staff indicate that the jobs are ready to ship.\nPrintable jobs go through these steps and connectors in the Printable branch of the workflow:\nWhen the job arrives at the second ContinueToNextStep step, the rule on the [1] File ready connector checks whether the Custom 3 (URL\nof download file) property is set to a value.\nIf it is, the print file is ready to download. The workflow sends the job directly to the DownloadFile step.\nIf it is not, the rule on the [2] Check for file connector checks whether the value of the Custom integer 1 job property is less than 10.\nThe first time that the job arrives at the second ContinueToNextStep step, the value of the Custom integer 1 property is 0.\nIf the value is 0 through 9, the workflow sends the job to the Wait step, which waits for 30 seconds. The workflow then sends the job\nto the CallSOAPService step.\nThe CallSOAPService step calls the MarcomCentral web service that retrieves a job ticket for a printable item. The step specifies two\nRICOH ProcessDirector symbols as part of the value in the Request payload property:\n${Job.WebService.Password}\nSpecifies the static credential.\n${Job.Marcom.JobTicketId}\nSpecifies the job ticket ID.\nThe ApplyXSLTransform2 step uses the downloadOverrides.xslt XSLT style sheet to convert an XML element into a RICOH\nProcessDirector job property:\nXML element Database name of job propertyUser interface name of job property\nJobTicket/FinalOutputFileURL/URL Job.Info.Attr3 Custom 3\nThe step puts the value in an overrides file, and overwrites the overrides file in the spool directory for the job with the new overrides\nfile.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:16 PM Running the sample workflows for processing orders retrieved from MarcomCentral - Jenski - Test portal- RPD Linux\nThis example shows the contents of the sample overrides file:\nJob.Info.Attr3=http://localhost:15080/restapi/Savings.pdf\nThe AssignJobValues step increments the value of the Custom integer 1 property by 1. The workflow then sends the job back to the\nsecond ContinueToNextStep step, which sends the job through the Wait step to the CallSOAPService step. The CallSOAPService step\nrepeats the call to the MarcomCentral web service that retrieves a job ticket for a printable item. If the Custom 3 property still does not\nhave a value for the URL, the workflow sends the job through the CallSOAPService step up to 9 times.\nIf the value is 10, the job has been sent to the CallSOAPService step 10 times. After 5 minutes, the Custom 3 property still does not\nhave a value for the file to download. The job does not meet the rule on the [2] Check for file connector. The workflow sends the job\nthrough the [3] Timeout connector to the FailWithMesssage step and writes a failure message to the job log. The message states:\nFile was not available to download in the time allowed.\nNote:\nBecause the message is a job property, it appears on the Information tab of the job property notebook for all jobs that go\nthrough the workflow. The message appears in the job log only when the workflow sends the job through the [3] Timeout\nconnector to the FailWithMesssage step.\nThe DownloadFile step downloads the Savings.pdf print file from http://localhost:15080/restapi/ by setting the value of the URL\nfor download file property to the ${Job.Info.Attr3} symbol.\nThe OptimizePDF, CountPages, CreatePageRanges, and PrintJobs steps process and print the job on the Sample printer.\nThe WaitForRelatedJobs step holds the parent job and each of the child jobs until all the child jobs arrive at the step.\n5. In the jobs table, right-click the Jensen Bank Baseball Cap job and select Manual Complete.\n6. Select Move to next step and click OK.\nThe job moves to the WaitForRelatedJobs step.\nWhen both jobs reach the WaitForRelatedJobs step, the workflow sends all three jobs (the original order job, the non-printable job, and the\nprintable job) to the RetainCompletedJobs step. The state of each job changes to Retained. The state of the order changes to Complete.\nThe MarcomCloseoutOrder web service notification calls the web service at\nhttps://services.printable.com/Trans/1.0/Closeout.asmx\nThe request payload includes these RICOH ProcessDirector symbols:\n${WSNotification.WebService.Credential}\nSpecifies the static credential.\nThe ${Job.Marcom.OrderId}\nSpecifies the order ID.\nIf the notification called the web service instead of running the simulation, this change would occur at the sample store on the\nMarcomCentral website. On the Display by Item dialog in the Order Manager, the value in the Order Status column for each item in order\nnumber WS113 would change from Work in Progress to Shipped.\n7. In the jobs table, right-click the Brochure job and select View.\nThe viewer displays the PDF file that was printed as part of the order.\nTo run the sample workflows again, enable and connect the MarcomReceiveOrders input device. Then disable and disconnect it.\nNow that you have run the samples, you can copy them. Adjust the values in the copies to exchange data with your own store at the\nMarcomCentral website. See the related topics.\nParent topic: Setting up to process orders from MarcomCentral\n3 of 3"}]}