{"doc_name": "designeroverview.pdf", "doc_path": "data/raw/RPD-en-US/designeroverview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3725, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Document Property Designer - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP support for documents / RICOH Visual Workbench / Document Property Designer\nDocument Property Designer\nDocument Property Designer lets you customize document and job properties for AFP files. You can use these properties in your workflows in a\nvariety of ways.\nYou can work with your RICOH ProcessDirector support representative to define custom properties for your installation. You can define these\ndocument properties, for example:\nTo sort documents according to ZIP codes, you can define a custom document property named Zip code.\nTo group documents according to account numbers, you can define a custom document property named Account number.\nA customized property can contain the value of any index tag in an AFP document. Index tags are called Tagged Logical Elements (TLEs) in the\nAFP architecture.\nYou use Document Property Designer to link the properties to index tags that are defined in a sample AFP file that represents your production\nAFP files. Document Property Designer creates a Visual Workbench control file with information about how the properties are linked to index\ntags. Then you configure the RICOH ProcessDirector steps that calculate the values of properties. The steps use the control file to determine how\ndocument or job properties are linked to index tags.\nFor example, if you have defined a document property named Zip code, and each document in your sample AFP file contains an index tag named\nmail code that contains the ZIP code, you can use the Document Property Designer to link the Zip code document property to the mail code\nindex tag. When a document property is linked to an index tag, RICOH ProcessDirector assigns the value of the index tag to the document\nproperty in the production AFP jobs that contain the same index tags as the sample AFP file.\nYou can link the same property to different index tags in different sample AFP files. For example, if one sample AFP file has an index tag named\nmail code and a second sample AFP file has an index tag named route code, you can link the same document property to index tag mail code in\nthe first sample AFP file and to index tag route code in the second sample AFP file. If you link one or more properties to different index tags in\ndifferent sample AFP files, you must create a separate Visual Workbench control file for each sample AFP file. Then you can configure the RICOH\nProcessDirector steps that calculate the values of properties so that each step uses the control file that applies to the production AFP jobs that use\nthe workflow.\nYou can also link several index tags to the same property. For example, if you have an index tag named routing code and an index tag named\npostal code, you can map both index tags to the property mail code. You can use the same Visual Workbench control file for several jobs that\nuse different index tag names for the same property; however, the system expects that only one of the index tags will be in a particular\ndocument. If more than one index tag occurs in a document, the system assigns the property value based on the first occurrence.\nWhen you link properties to index tags, Document Property Designer also lets you:\nEdit the index tag value so that the property contains only part of the index tag value. For example, you can edit a customer account number so\nthat the property contains only a portion of the account number.\nDefine link options for the properties. For example, you can specify the default value for a document property if the index tag is not found in a\ndocument.\nParent topic: RICOH Visual Workbench\n1 of 1"}]}