{"doc_name": "aiw00o4.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o4.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2837, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Job submission methods - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Job submission methods\nJob submission methods\nYou can submit jobs to RICOH ProcessDirector from other systems using RICOH ProcessDirector user interface, FTP, web services, other file\ncopying methods, or a command that uses the LPD protocol. If you have the AFP Support feature installed, you can submit jobs to RICOH\nProcessDirector from host systems using Download for z/OS and AFP Download Plus.\nJobs are submitted to input devices and workflows that you define, which then receive the job and initiate job processing.\nThe supported job submission methods are:\nSubmit Jobs portlet\nYou can upload files and submit the jobs to a hot folder input device or a workflow for processing using theRICOH ProcessDirector user\ninterface. Furthermore, with the Order Management feature, you can group jobs and process them together as an order.\nBefore using the Submit Jobs portlet, make sure that the hot folder input device is enabled and connected, and that the workflow is also\nenabled. Additionally, make sure that the input device or workflow is configured to accept jobs submitted using the portlet.\nFTP, SCP, or file copy\nYou can use an FTP or SCP client, web services, or your preferred file copying method to move print files into a hot folder. You can include a\nJob Definition Format (JDF) job ticket with the print files. When you copy or move a job to the hot folder directory, the input device that is\nassociated with the hot folder automatically receives the job and initiates job processing.\nRESTful web services\nYou can use a REST web service utility to submit jobs. If you can configure your application to use REST web services, you can use the\nsubmitFile utility to submit a file to a workflow or hot folder.\nLPD protocol\nYou can use the lpr command or another command that uses the LPD protocol to submit jobs to a RICOH ProcessDirector LPD input device.\nSpecify the name of the LPD input device as the target printer. For example, the name of the LPD input device is the value of the -P option of\nthe lpr command, or of the -p option of the lprafp command.\nDownload for z/OS\nDownload for z/OS is a separately orderable feature of IBM Print Services Facility (PSF) for z/OS. Download for z/OS automatically sends host\nsystem output to other systems in the TCP/IP network, such as RICOH ProcessDirector, for further processing.\nAFP Download Plus\nAFP Download Plus is also a separately orderable feature of PSF for z/OS. It can gather job attributes and print resources, process PSF exits,\nconvert line data to the AFP data stream, package the job, secure the job, and send the job to another system in the TCP/IP network, such as\nRICOH ProcessDirector, for further processing.\nParent topic: Product overview\n1 of 1"}]}