{"doc_name": "pdfw_c_plugin_predefined_rule.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_predefined_rule.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2056, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Pre-defined rules - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with rules / Pre-defined rules\nPre-defined rules\nRICOH ProcessDirector Plug-in for Adobe Acrobat has 11 pre-defined rules that apply markup to, set media and finishing options for, or extract\ndata from specific pages within each document in a PDF file. For example, you can use a pre-defined rule to place an image on all front pages in\neach document.\nThe table below describes each pre-defined rule.\nPre-defined rules\nRule Definition\nAll Front Pages All front-facing pages in each page group. If the rule is used to define a document property, the value extracted\nis from the last front page in a page group.\nAll Back Pages All back-facing pages in each page group. This rule does not apply to a simplex job. If the rule is used to define\na document property in a duplex job, the value extracted is from the last back page in a page group.\nAll Pages Markup prints on all pages in each page group. Document properties values are extracted from the last page\n(either front or back) in a page group. If a rule does not have a condition with a pre-defined rule, RICOH\nProcessDirector Plug-in for Adobe Acrobat applies the rule to All Pages.\nFirst Front Only First page in each page group.\nFirst Back Only First back page in each page group. This rule does not apply to simplex jobs.\nSecond Front Only Second front-facing page in each page group.\nSecond Back Only Second back-facing page in each page group. This rule does not apply to simplex jobs or to jobs that do not\nhave a second back page.\nLast Front Only Last front-facing page in each page group.\nLast Back Only Last back of each page group. This rule does not apply to simplex jobs.\nLast Page Only Last page of each page group (front or back is not a factor).\nNo Pages No pages. To keep a rule from being applied, you can add a condition with No Pages = True.\nParent topic: Working with rules\n1 of 1"}]}