{"doc_name": "aiwdoc_i_c_create_jt_splitsize.pdf", "doc_path": "data/raw/RPD-en-US/aiwdoc_i_c_create_jt_splitsize.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4416, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Workflow to split AFP jobs by size - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Configuring AFP Support for documents / Workflow to split AFP jobs by size\nWorkflow to split AFP jobs by size\nThe AFP Support feature includes step templates that you can use to split a job into smaller jobs so that, for example, they can be printed on\nseparate printers.\nTo split a job without fragmenting any of its documents across two jobs, you must identify the boundaries of the documents in the job. To do\nthat, you must define page groups in the AFP file, either when you create the job, or by using a step based on the IndexAFP step template,\nprovided with the AFP Support feature.\nThe IdentifyDocuments step applies the rules that you defined in Document Property Designer to create the document property file for the\noriginal job. The SplitDocuments step determines which documents are placed into each child job, and updates the document properties file with\nthat information.\nNow you can choose a method for building the new AFP files for the child jobs:\nYou can use a CreateJobsFromDocuments step, which makes document properties files for the child jobs but does not create AFP files. In this\nimplementation, you must include a BuildAFPFromDocuments step in the workflow assigned to the child jobs. BuildAFPFromDocuments creates\nthe AFP file with all the documents in the correct order. We recommend this method. Because BuildAFPFromDocuments is defined in the child\nworkflow, the step runs in parallel for all the child jobs. This parallel processing can cause the overall job to complete faster, although the\nexistence of several parallel processes might lead to database contention issues in rare cases.\nYou can add a CreateAFPJobsFromDocuments step in the Assemble phase of this workflow. If you choose this method, all the AFP files for all\nthe child jobs are built sequentially.\nWe do not recommend this method if you have the Inserter feature and the inserter controller specifies the open-loop reprint method. You\nmust add the BuildAFPFromDocuments step in the child workflow for the open-loop reprint method; so, adding the\nCreateAFPJobsFromDocuments step in the original workflow causes duplicate processing, and degrades system performance.\nThe original workflow does not have any steps in the Print phase because the child workflow controls printing. After all the child jobs complete,\nthe parent job goes to the next step in the original workflow.\nThe child workflow should begin with steps based on these two step templates: SetJobPropsFromTextFile and SetJobPropsFromOriginal.\nSetJobPropsFromTextFile sets values for job properties from the steps of the child workflow. SetJobPropsFromOriginal copies the values that were\nset in the original workflow to become the values for those properties in the child workflow. Then if you chose to run the building of the child\nAFP files in parallel by including a CreateJobsFromDocuments step in the original workflow, you need to use a BuildAFPFromDocuments step in\nthe child workflow.\nNote:\nIf you have customized phase names in your system, the phase names in the tables might not match the names in your system.\nSplitting jobs by size, using CreateJobsFromDocuments\nParent/child Phase Step\nParent Receive SetJobPropsFromTextFile\nIn the Input data stream field, select AFP.\nPrepare UseInlineFormDefinition\nIndexAFP\nEnableRepositioning\nIdentifyDocuments\nAssemble SplitDocuments\nCreateJobsFromDocuments\nComplete RetainCompletedJobs\nRemoveJobs\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Workflow to split AFP jobs by size - Jenski - Test portal- RPD Linux\nParent/child Phase Step\nChild Receive SetJobPropsFromTextFile\nSetJobPropsFromOriginal\nAssemble BuildAFPFromDocuments\nPrint EnableRepositioning\nCreatePageRanges\nPrintJobs\nComplete RetainCompletedJobs\nRemoveJobs\nSplitting jobs by size, using CreateAFPJobsFromDocuments\nParent/child Phase Step\nParent Receive SetJobPropsFromTextFile\nIn the Input data stream field, select AFP.\nPrepare UseInlineFormDefinition\nIndexAFP\nEnableRepositioning\nIdentifyDocuments\nAssemble SplitDocuments\nCreateAFPJobsFromDocuments\nComplete RetainCompletedJobs\nRemoveJobs\nChild Receive SetJobPropsFromTextFile\nSetJobPropsFromOriginal\nPrint EnableRepositioning\nCreatePageRanges\nPrintJobs\nComplete RetainCompletedJobs\nRemoveJobs\nParent topic: Configuring AFP Support for documents\n2 of 2"}]}