{"doc_name": "pdfw_c_plugin_managemediafinish.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_managemediafinish.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2394, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Managing media and finishing options - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Media and finishing\n/ Managing media and finishing options\nManaging media and finishing options\nThe Media and Finishing dialog shows information about your media and finishing options for a PDF file. You can edit and delete options, select\nnew media and finishing options, and set the order in which RICOH ProcessDirector applies the options to a PDF file.\nFor each page-level media or finishing option, the Range column shows the page selection or the name of the rule that RICOH ProcessDirector\nPlug-in for Adobe Acrobat uses to apply the option to documents in the PDF file. The Paper substitution column shows media options, and the\nSubset finishing column shows finishing options.\nTo specify a new page-level media or finishing option, click the icon.\nTo work with a page-level media or finishing option, select it. Click the icon to modify the option or the icon to delete it.\nTo revise the order in which page-level media and finishing options are applied to the PDF file, select an option. Then click the up or down arrow\nto move it.\nRICOH ProcessDirector Plug-in for Adobe Acrobat applies the page-level options to the PDF file in the order that they appear on the list, from top\nto bottom. If two page-level options specify conflicting selections for the same page (for example, two different types of media), RICOH\nProcessDirector Plug-in for Adobe Acrobat applies the option that is lower on the list.\nFor example, the first option specifies Letter Blue media for the first page of each document in the PDF file. The second option specifies Letter\nGold media for the first page of each document for a Gold Club member. When the PDF file is printed, the first page of every document for a\nGold Club member prints on Letter Gold media. The first page of every other document prints on Letter Blue media. If the option for Letter Blue\nmedia is below the option for Letter Gold media, the first page of every document prints on Letter Blue media. No first pages print on Letter\nGold media.\nNote: The order of media options does not affect how RICOH ProcessDirector Plug-in for Adobe Acrobat applies finishing options, and\nvice versa.\nParent topic: Media and finishing\n1 of 1"}]}