{"doc_name": "ult_config_sendjobs.pdf", "doc_path": "data/raw/RPD-en-US/ult_config_sendjobs.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7221, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Configuring to send jobs to Ultimate Impostrip - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring to send jobs to Ultimate Impostrip®\nConfiguring to send jobs to Ultimate Impostrip®\nTo send jobs to Ultimate Impostrip®, you must configure the Ultimate Impostrip® program, the primary computer, and some system settings,\nthen tune the RunImpostripOnJob step template and add it to a workflow.\nNote:\nIf Ultimate Impostrip® is installed on a Windows computer running in a language other than English, do not install Ultimate Impostrip®\nin the default install directory. The program does not work properly with non-English default install paths. We recommend installing\nUltimate Impostrip® in C:\\ImpostripOnDemand on non-English Windows computers.\nTo configure to send jobs to Ultimate Impostrip®:\nConfigure Ultimate Impostrip®.\n1. Log in to the computer that Ultimate Impostrip® is installed on and launch the application.\n2. In the XML Configurator section, deselect Using First File Name as Output Name for XML Redirection Job (if it is available) and select\nEnable XML Ticket Input Folder, then click OK or SAVE.\n3. In the Hot Folders section, define the impositioning options for all hot folders that you want RICOH ProcessDirector to use.\n4. Select the hot folder you want to configure and find the Output section.\n5. Make sure that PDF or PDF Output is selected and click Save.\n6. Repeat the two previous steps for all hot folders that you want RICOH ProcessDirector to use.\nShare folders and mount drives between Ultimate Impostrip® and RICOH ProcessDirector:\n1. On the Windows computer where Ultimate Impostrip® is installed, share the folder that Ultimate Impostrip® is installed in.\nOn an English system, the default installation folder is:\nLegacy Version: C:\\Program Files (x86)\\Ultimate Technographics\\ImpostripOnDemand\nNew Generation: C:\\Program Files\\Ultimate Technographics\\Ultimate Impostrip\n2. Name the share UltimateImpostrip. Do not include spaces in the share name.\nMake sure the permission level is Read/Write.\n3. On the RICOH ProcessDirector primary computer, mount the primary computer to the directory that holds the Ultimate Impostrip®\nprogram.\nNote:\nSkip this step if you are using Ultimate Impostrip® New Generation (Version 2019 1.0 or newer) and it runs on a RICOH\nProcessDirector application server.\nOn the primary server, use a command similar to this example, substituting the name of Windows system for server_name and the name\nof the user that RICOH ProcessDirector uses to access the system for user:\nmount -t cifs -o username=user,uid=32457,gid=32458 //server_name/UltimateImpostrip /mnt/Ultimate\n4. Open the /etc/exports file in a file editor.\n5. Review the contents of the file to see if it includes an entry for the system that Ultimate Impostrip® is installed on. If you do not see an\nentry for that system, add a line to the file in this format:\n/aiw server_name(crossmnt,rw,no_root_squash,sync,no_subtree_check)\nSave and close the file. Restart NFS to have the updated file take effect.\n6. Return to the Windows computer where Ultimate Impostrip® is installed and open Windows File Explorer.\n7. Map a network drive to the /aiw file system on the primary computer. Use this address for the server:\n\\\\primary_server_hostname\\aiw\n8. Test the configuration by creating a file in the drive_letter:\\aiw1 directory, verifying that you can see it in the mounted directory, and\nthen deleting it.\nUpdate RICOH ProcessDirector system settings.\n1. Log in to RICOH ProcessDirector.\n2. Click the Administration tab.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Configuring to send jobs to Ultimate Impostrip - Jenski - Test portal- RPD Linux\n3. In the left pane, click Settings ⇒ Ultimate Impostrip® Settings.\n4. In the General section, choose how RICOH ProcessDirector retrieves the list of Ultimate Impostrip® hot folders that can receive print jobs.\nThe option you choose depends on the version of Ultimate Impostrip® you have installed. If you use version 10 or older, select Use .ini\nfile. If you use version 2019 1.0 or newer, select Use URL.\n5. If you choose Use .ini file, enter the full path to the Ultimate Impostrip® initialization file on the system that Ultimate Impostrip® is\ninstalled on.\nThe initialization file contains the name of the directory that RICOH ProcessDirector uses as a Sending folder if one is not provided on the\nstep. It also contains a list of Ultimate Impostrip® input hot folders that correspond to different impositioning combinations.\nNote:\nIf the mount is set as explained above, use /mnt/Ultimate/IMPressJM.ini.\nWhen this directory is specified, users can select from a list of Ultimate Impostrip® input hot folders to perform the appropriate\nimpositioning on the job.\n6. If you chose Use URL, enter the URL of the Ultimate Impostrip® server, including the port number.\n7. Verify that the Ultimate Impostrip® configuration is set correctly. Scroll to the bottom of the page to see the Ultimate Impostrip® Hot\nFolders table. Click Update to show the available hot folders. Make sure all the hot folders you expect to see are included in the list.\n8. In the Mapping section, specify what type of Windows system Ultimate Impostrip® is installed on: a system that a RICOH ProcessDirector\nserver runs on or a Windows system with no RICOH ProcessDirector server installed.\n9. If you chose Other Windows system, fill in the paths for the directories that exchange files between the Ultimate Impostrip® host server\nand the RICOH ProcessDirector primary computer.\nXML Ticket Hot Folder\nIf the mount is configured as explained above, enter the directory path that is appropriate for your version of Ultimate Impostrip® under\nRICOH ProcessDirector:\nLegacy Version: /mnt/Ultimate/XmlInput\nNew Generation: /mnt/Ultimate/xml_redirection\nPrint spool directory\nEnter this value under Ultimate Impostrip®, replacing drive_letter with the letter of the network drive that you mapped above:\ndrive_letter:\\aiw1\\spool\n10. Click SAVE.\nTune the RunImpostripOnJob step template to run on the correct server.\n1. Click the Workflow tab.\n2. In the left pane, click Step Templates.\n3. Right-click the RunImpostripOnJob step template and select Properties.\n4. On the Tuning tab:\nIf Ultimate Impostrip® is installed on an application server, under Servers to use, select Run on specific servers, then select the correct\napplication server.\nIf Ultimate Impostrip® is installed on a different Windows computer, under Servers to use, select Run on specific servers, then select\nSystem.\nAdd the RunImpostripOnJob step template to a workflow.\n1. Click the Workflow tab.\n2. Select the workflow that you want to copy and click Copy workflow.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. In the workflow editor, click Step Templates in the top right corner of the window.\n5. Drag the RunImpostripOnJob step into position and make sure it is connected to the workflow.\n6. Right-click the step and select Properties to see the properties and job defaults.\n7. Update the properties as needed. Refer to the ? help for additional information about each property.\n8. Click OK.\n9. Save the workflow.\nParent topic: Configuring\n2 of 2"}]}