{"doc_name": "ws-inputdevice_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/ws-inputdevice_o_featov.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3408, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Web Services Enablement - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Web Services Enablement\nWeb Services Enablement\nThis feature lets RICOH ProcessDirector objects and steps use Representational State Transfer (REST) and Simple Object Access Protocol (SOAP) to\ncommunicate with web services for applications. The RICOH ProcessDirector implementations of REST and SOAP support Extensible Markup\nLanguage (XML). The implementation of REST also supports JavaScript Object Notation (JSON).\nThe feature adds:\nInput device types\nNotification object types\nStep templates\nInput device types\nWeb Services Enablement provides two types of input devices. REST and SOAP web service input devices communicate with applications by\ncalling web services and retrieving information that RICOH ProcessDirector uses to create jobs.\nNotification object types\nWeb Services Enablement provides two types of notification objects. REST and SOAP web service notifications call web services to update an\napplication when a job or printer event occurs. For example, a notification can update an application when all the items in an order job ship to a\ncustomer. A notification also can alert an application when a printing error occurs, or when an input device status changes.\nStep templates\nWeb Services Enablement provides these step templates:\nCallRESTService\nCallSOAPService\nSteps based on these step templates let you communicate with applications that provide web service interfaces. These steps call web services\nfrom any phase within RICOH ProcessDirector workflows.\nAuthentication\nWeb Services Enablement input devices and notifications can communicate with web services for applications that require API key or session\nauthentication. They also can communicate with applications that do not require authentication. Input devices authenticate when they poll for\ninput. Notifications authenticate when they send status to the application.\nFor API key authentication, you put an authorization code in a Static credential property or define an HTTP user ID and password. The object\npasses the authorization code or the HTTP user ID and password to the web service that exchanges data. The web service then authenticates\nwith the application and returns a response.\nFor session authentication, you put authentication credentials (user ID and password) and other values in a set of authentication request\nproperties. The input device or notification first calls a REST web service to authenticate with the application. After a successful authentication,\nthe web service returns a token. The input device or notification then transmits the token in the call to the web service that exchanges data.\nIn this section:\nUsage scenario for processing JSON orders with web services\nIn this scenario, a printing company wants to process orders retrieved from a website for ordering books. Each order consists of 2 job tickets.\nOne job ticket provides information (including the location of the print file) required to print the book. The other job ticket provides information\nrequired to print the cover for the book. The book and its cover go through different production processes, and the printing company must\nreport when the whole order is completed. The website provides a REST web services interface.\nParent topic: Advanced workflow features\n1 of 1"}]}