{"doc_name": "aiwi0_basefeatures.pdf", "doc_path": "data/raw/RPD-en-US/aiwi0_basefeatures.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2667, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Features - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features\nFeatures\nRICOH ProcessDirector features provide more functions or let you add support for devices like inserters to the system. The modular design of\nRICOH ProcessDirector lets you add features to the base product as your business needs change.\nMost features are integrated seamlessly into the user interface and are installed using the Feature Manager utility on the Administration page of\nthe user interface. When you install a feature with Feature Manager, the feature is in trial mode. To continue using a feature after the trial period,\nyou must purchase the feature and install a license key for it. If you do not install a license key, the feature stops working at the end of the trial\nperiod.\nRICOH ProcessDirector extended features are custom software components that you can purchase from your Ricoh support representative. The\nRicoh support representative installs the extended features on the existing RICOH ProcessDirector primary computer.\nIn this section:\nNo-charge product enhancement features\nThese features provide support for adding languages, stronger security, and some frequently added job properties to your system. They also add\nthe ability to work with the individual PDF documents inside a job and collect data about your system for reporting purposes.\nAFP datastream support\nThese features provide support for processing AFP jobs and documents. The AFP Support feature is a prerequisite for the other features in this\nsection.\nIntegration features\nIntegration features help you connect RICOH ProcessDirector to other products, including products from certain other companies. These features\nprovide objects that make integrating with the other applications easier. The other applications must be purchased separately.\nDocument processing features\nDocument processing features expand the capabilities of a workflow from controlling and tracking jobs to controlling and tracking individual\ndocuments in a job.\nDatastream transforms\nThese features provide support for converting jobs in one datastream to another.\nAdvanced workflow features\nAdvanced workflow features add complexity to your workflow system, so you can track deadlines, manage groups of jobs as a unit, and connect\nto other applications using SOAP or REST APIs.\nExtended features\nRICOH ProcessDirector extended features are custom software components that you can purchase from your Ricoh support representative. The\nRicoh support representative installs the extended features on the existing RICOH ProcessDirector primary computer.\nParent topic: Product overview\n1 of 1"}]}