{"doc_name": "doc_c_createworkflow_pull.pdf", "doc_path": "data/raw/RPD-en-US/doc_c_createworkflow_pull.pdf", "num_pages": 5, "nonempty_pages": 5, "total_chars": 16656, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Setting up a workflow that processes a pull list - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to pull documents from a job / Setting up a workflow that processes a pull list\nSetting up a workflow that processes a pull list\nTo extract documents from a job using a pull list, you set up a workflow that includes a step based on the SetDocPropsFromList step template.\nAdditional steps and conditional processing (or additional workflows) are required to process both the documents extracted from the job and the\ndocuments remaining in the job.\nThe PullPDFSample supplied workflow resembles the PDF workflow that we are going to set up in this procedure. Before you set up your own\nworkflow, open the PullPDFSample workflow. Examine the steps and conditional processing in the workflow as you read this procedure.\nNote:\nIf you have the AFP Support feature installed, the PullAFPSample supplied workflow shows how to extract documents from a workflow\nthat processes AFP files.\nTo set up a workflow that processes a pull list:\n1. Identify data that determines whether a document is pulled.\nExamples:\nYou want to pull documents based on a list of account numbers. The account number determines whether a document is pulled.\nYou want to pull documents based on a list of postal codes. The postal code determines whether a document is pulled.\nYou want to pull documents based on a list of policy types and states. The policy type and state determine whether a document is pulled.\n2. Decide which document properties you are going to use to specify the data that the IdentifyPDFDocuments step (PDF files) or\nIdentifyDocuments step (AFP files) extracts from each document in the print file.\nYou can use existing RICOH ProcessDirector document properties, or you can define your own custom document properties.\nExamples:\nYou can use the Doc.PullProp document property, which is supplied with all document processing features.\nYou can use one or more custom document properties, such as Doc.Custom.AccountNumber, Doc.Custom.PostalCode,\nDoc.Custom.PolicyType, and Doc.Custom.State.\nIf the custom document properties do not already exist, you must define them.\nNote:\nTo define document properties:\nEdit the document properties configuration file.\nRun the docCustom utility.\nThe first time that you run the utility, it creates the Custom Document Properties feature.\nUse Feature Manager to install or update the Custom Document Properties feature.\nIf you are working with PDF files, load the updated RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in\nfor Adobe Acrobat.\n3. Specify the data that the IdentifyPDFDocuments step (PDF files) or IdentifyDocuments step (AFP files) extracts from each document in the\njob:\nIf you are working with PDF files, use the Define Document Property function in RICOH ProcessDirector Plug-in for Adobe Acrobat.\nIf you are working with AFP files, use the Document Property Designer (DPD) mode of RICOH Visual Workbench.\nNote:\nIf the AFP files do not have index tags defined for the document data that you want to extract, use AFP Indexer to add the tags.\nAFP Indexer is installed with the AFP Support feature.\n4. Save your document property definitions in a control file for use with the IdentifyPDFDocuments step (PDF files) or IdentifyDocuments step\n(AFP files):\nIf you are working with PDF files, use the Save control file function in RICOH ProcessDirector Plug-in for Adobe Acrobat.\nIf you are working with AFP files, use the Save control file function in RICOH Visual Workbench.\n5. Send the control file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access to.\n6. Log in to RICOH ProcessDirector.\n7. Click the Workflow tab.\n8. Make a copy of the workflow that you want to modify, or create a new workflow.\nIn this procedure, we modify a simple workflow that processes PDF files. The workflow has these steps:\n1 of 5"}, {"page": 2, "text": "2/4/26, 2:15 PM Setting up a workflow that processes a pull list - Jenski - Test portal- RPD Linux\nSetJobPropsFromTextFile\nCountPages\nIdentifyPDFDocuments\nWriteDocumentsToDatabase\nBuildPDFFromDocuments\nUpdateDocumentsInDatabase\nCreatePageRanges\nPrintJobs\nRetainCompletedJobs\nRemoveJobs\nNote:\nIf you have the AFP Support feature installed, a simple workflow that modifies AFP files might have UseInlineFormDefinition and\nEnableRepositioning steps in place of the CountPages step, an IdentifyDocuments step in place of the IdentifyPDFDocuments step,\nand a BuildAFPFromDocuments step in place of the BuildPDFFromDocuments step.\n9. Add a step based on the SetDocPropsFromList step template to the workflow after the WriteDocumentsToDatabase step.\n10. Set values for the properties of the SetDocPropsFromList step:\n1. For the List file directory property, specify the location of the directory that contains the pull lists.\nFor example: /aiw/aiw1/clientfiles/pull.\n2. For the Delimiter property, specify the delimiter used to separate values in the pull list.\nIf the pull list only uses one property, you must put each value on a separate line and specify New Line as the delimiter.\nIf the pull list uses two or more properties, you must put each set of values on a separate line. Specify the delimiter that you use to\nseparate the values on each line: Tab, Semicolon, Comma, Space, or Tilde.\nExamples:\nThe pull list contains account numbers:\n4377852A\n4372341A\n4400076A\n4401132H\nSet the value of the Delimiter property to New Line.\nThe pull list contains policy types and states separated with commas:\nHome,AZ\nHome,CO\nAuto,CO\nSet the value of the Delimiter property to Comma.\n3. For the Columns in list file property, select all the document properties that you are using to specify the data that determines\nwhether a document is pulled.\nExamples:\nDoc.PullProp\nDoc.Custom.AccountNumber\nDoc.Custom.PostalCode\nDoc.Custom.PolicyType and Doc.Custom.State\n4. If the you are using two or more document properties to specify the data, order the document properties (from top to bottom) to\nmatch the order of the data columns in the pull list (from left to right).\nTo rearrange the properties, click , the pencil icon. In the dialog that opens, right-click each selected property and choose\nMove to top. After all of the selected properties are at the top of the list, click and drag them into the correct order. After rearranging\nthe properties, click outside of the dialog to close it.\n5. For the Stop for excess columns property:\nSelect YES if you want the step to move into an error state if the pull list has more columns of data than the number of document\nproperties specified by the Columns in list file property.\nFor example, select YES if the pull list has two columns of data and the Columns in list file property specifies two document\nproperties. You want the step to go into error if a pull list with four columns of data is placed in the list file directory.\nSelect NO if you do not want the step to move to an error state if the pull list has more columns of data than the number of\ndocument properties specified by the Columns in list file property.\nFor example, select NO if the pull list has four columns of data but you are using only the first column. The Columns in list file\nproperty specifies one document property.\nNote:\nIf the pull list has excess columns, they must all be to the right of columns you are using.\nThe step always moves into an error state if the pull list has fewer columns of data than the number of properties specified by the\nColumns in list file property.\n2 of 5"}, {"page": 3, "text": "2/4/26, 2:15 PM Setting up a workflow that processes a pull list - Jenski - Test portal- RPD Linux\n6. For the Document property to set property, select the document property that you want to use to specify whether a document is\npulled.\nThe Doc.Pull property is supplied with all document processing features. It is a convenient choice for the value of the Document\nproperty to set property. As an alternative, you can create a custom document property or use an existing document property as the\nvalue of Document property to set.\nImportant:\nIf you use a document property that already contains a value for the documents in the job, RICOH ProcessDirector overwrites\nthe original value with the new value for matching documents or the new value for other documents. Because the new value\nreplaces the original value, make sure that you no longer need the original value.\n7. Specify values for the Value for matching documents and Value for other documents properties.\nIf the document property that you specify as the value of the Document property to set property does not exist in the document\nproperties file for the job, RICOH ProcessDirector creates a column for the document property in the file and populates the column\nwith values specified for the Value for matching documents and Value for other documents properties.\nIf the document property does exist in the document properties file, RICOH ProcessDirector changes the values for the property based\non the values of the Value for matching documents and Value for other documents properties.\nExample:\nA document properties file contains three document properties:\nDoc.Custom.AccountNumber Doc.Custom.PolicyType Doc.Custom.State\n144372 Home CO\n144372 Auto CO\n144372 Business CO\n187456 Home AZ\n187456 Auto AZ\n187456 Business AZ\n223114 Home NY\n223114 Auto NY\n223114 Business NY\nA pull list contains values for the Doc.Custom.PolicyType and Doc.Custom.State document properties:\nHome,AZ\nHome,CO\nAuto,CO\nThe value of the Document property to set property is Doc.Pull. The document properties file for the job does not have a column for\nthe Doc.Pull document property.\nThe value of the Value for matching documents property is YES.\nThe value of the Value for other documents property is NO.\nWhen a job enters the SetDocPropsFromList step, RICOH ProcessDirector:\nCreates a column for Doc.Pull in the document properties file for the job.\nSets the value of the Doc.Pull document property to YES if the values of the document properties for a document match all the\nvalues of the document properties on the pull list.\nThe value of the Doc.Pull document property is set to YES for documents containing Home policies in Arizona (AZ) and documents\ncontaining Home or Auto policies in Colorado (CO).\nSets the value to NO if the value of any document property for a document does not match the value of a document property on\nthe pull list.\nThe value of the Doc.Pull document property is set to NO for documents containing Auto policies in Arizona, documents\ncontaining any policy other than Home or Auto, and documents containing policies in any state except Arizona or Colorado.\nThe updated document properties file has four document properties:\nDoc.Custom.AccountNumber Doc.Custom.PolicyType Doc.Custom.State Doc.Pull\n144372 Home CO YES\n144372 Auto CO YES\n144372 Business CO NO\n187456 Home AZ YES\n187456 Auto AZ NO\n187456 Business AZ NO\n223114 Home NY NO\n223114 Auto NY NO\n223114 Business NY NO\n8. Edit the other step properties as needed.\n11. Optional: If you want jobs to wait until you receive a pull list, add a Wait step to the workflow before the SetDocPropsFromList step.\nSpecify values for the step properties.\nExamples:\nTo wait until 6 PM, set the Wait until property to 6:00 PM. Do not specify values for the Wait for and Complete step after properties.\nTo wait four hours, set the Wait for property to 4 hours. Do not specify values for the Wait until and Complete step after properties.\nTo wait six hours or until 5 PM, whichever occurs first, set the Wait until property to 5:00 PM, the Wait for property to 6 hours, and\nthe Complete step after property to First occurs.\n3 of 5"}, {"page": 4, "text": "2/4/26, 2:15 PM Setting up a workflow that processes a pull list - Jenski - Test portal- RPD Linux\nTo wait at least three hours and at least until 4 PM, whichever occurs last, set the Wait until property to 4:00 PM, the Wait for property\nto 3 hours, and Complete step after property to Last occurs.\n12. Add steps that process the documents after the SetDocPropsFromList step.\nFor example:\nYou can add a GroupDocuments step and set the value of the Group first property to Pull document.\nThen you can add a CreateJobsFromDocuments step and set the value of the Child workflow property to the name of the current\nworkflow.\nNote:\nThis example uses the conditional processing in the PullPDFSample supplied workflow. As an alternative, you can set the Child\nworkflow property to the name of another workflow and use that workflow to process the child jobs.\nThe CreateJobsFromDocuments step creates two child jobs: one for the group of documents with Pull document set to YES and another\nfor the group of documents with Pull document set to NO.\n13. Add conditional processing for documents that are pulled and documents that remain in the job.\nFor example:\nAdd conditional processing for parent and child jobs near the start of the workflow, after the SetJobPropsFromTextFile step.\nDefine a rule for the branch that receives the parent jobs:\nJob number Unlike *.*\nIn our example, this branch is connected to the existing DetectInputDataStream step.\nAdd a step based on the SetDocPropsFromConditions step template.\nCreate a new branch for the child jobs, which have a decimal point in their job number, and connect the branch to the\nSetDocPropsFromConditions step.\nIn our example, connect the SetDocPropsFromConditions step to the BuildPDFFromDocuments step, which connects to the\nUpdateDocumentsInDatabase step.\nSet the properties for the SetDocPropsFromConditions step.\nIn our example, the step assigns a value to a job property based on the value of the Pull document document property. The property\nconditions file sets the value of the Custom 1 job property (database property name Job.Info.Attr1) to Pull or Print. This example\nshows the contents of the property conditions file:\n\"Doc.Pull\",\"Job.Info.Attr1\"\n\"=YES\",\"Pull\"\n\"=NO\",\"Print\"\n14. Add steps that process the pulled documents.\nFor example, if you are processing PDF jobs, you might add an EmailDocuments step that emails the pulled documents to someone for\nverification that the documents were pulled.\n15. Add steps that process the documents to be printed.\nFor example, if you are processing PDF jobs, you might add CreatePageRanges and PrintJobs steps.\n16. Add conditional processing to send the child jobs to separate pull and print branches of the workflow.\nIn our example, add a connector between the UpdateDocumentsInDatabase step and the new EmailDocuments step. Add this rule to the\nconnector: Custom 1 = Pull\nIn our example, add a connector between the UpdateDocumentsInDatabase step and the CreatePageRanges step. Add this rule to the\nconnector: Custom 1 = Print\nWhen jobs are sent through the workflow and the child jobs reach the SetDocPropsFromConditions step, RICOH ProcessDirector sets the\nvalue of the Custom 1 job property:\nFor a child job with the Doc.Pull property set to Yes, the Custom 1 job property is set to Pull. The child job goes through the connector\nwith the rule Custom 1 = Pull.\nFor a child job with the Doc.Pull property set to No, the Custom 1 job property is set to Print. The child job goes through the connector\nwith the rule Custom 1 = Print.\n17. If you created conditional processing for parent and child jobs, send the parent and child jobs together to the RetainCompletedJobs step:\n1. Add a step based on the WaitForRelatedJobs step template to the workflow before the RetainCompletedJobs step.\n2. Connect the branch for parent jobs and the two branches for child jobs to the WaitForRelatedJobs step.\nIn our example, connect these steps to the WaitForRelatedJobs step:\nCreateJobsFromDocuments in the branch for parent jobs.\nEmailDocuments in the branch for child jobs with documents that have been pulled.\nPrintJobs in the branch for child jobs with documents to be printed.\nThe workflow now resembles the PullPDFSample workflow with these differences:\nPullPDFSample has DetectInputDataStream, FailWithMessage, SetDocPropsFromOriginal, CountPagesChild, AssignJobValuesPull, and\nAssignJobValuesPrint steps.\nThis workflow has an EmailDocuments step in place of the AssignJobValuesPull and ManualStepWithAutoRestart steps in the\nPullPDFSample workflow.\n18. Save the workflow.\n19. Test the workflow:\n1. Create one or more input devices to point to the workflow.\n4 of 5"}, {"page": 5, "text": "2/4/26, 2:15 PM Setting up a workflow that processes a pull list - Jenski - Test portal- RPD Linux\n2. Enable the workflow.\n3. Enable the input devices.\n4. Place a sample pull list in the list file directory.\n5. Submit your job to the input device.\nParent topic: Setting up to pull documents from a job\n5 of 5"}]}