{"doc_name": "CreatingControlRules.pdf", "doc_path": "data/raw/RPD-en-US/CreatingControlRules.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4891, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating rules for inserter control files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Creating rules for inserter control files\nCreating rules for inserter control files\nRICOH ProcessDirector can create an inserter control file for each job and send it to the inserter controller before the job is inserted. Because the\nformat and content of inserter control files vary for each inserter manufacturer, you create rules files that tell RICOH ProcessDirector how to\ncreate the inserter control file.\nYou create these files:\nRules file: Defines the fields in each record (except for the header record) of the inserter control file and specifies the value to put in each field\nof the record. This file is required. RICOH ProcessDirector uses the rules file to write the inserter control file records. RICOH ProcessDirector\nwrites one record for each document in the document properties file. The records follow the header record (if any). Typically, this process\ncreates one record for each document in a job.\nHeader rules file: Defines the fields in the header record and specifies the value to put in each field of the record. RICOH ProcessDirector uses\nthe header rules file to write the header record at the top of the inserter control file. Typically, RICOH ProcessDirector creates one header record\nin an inserter control file. Some inserters generate several XML elements in the header, but these elements occur only once in the XML output\nfile. This file is required only if the inserter control file format specifies a header record.\nSome inserter controllers use two inserter control files for each job. In this case, you create a second rules file and header rules file for the second\ninserter control file.\nThe rules file defines the position of each field in a record and specifies the value to put in each field. In each field, RICOH ProcessDirector can\nput a fixed value (such as blanks or zeroes) or the value of a RICOH ProcessDirector property. For information about which property values you\ncan include in inserter control files, see the related Reference topic.\nRICOH ProcessDirector provides sample rules files for several inserter manufacturers that you can copy and customize for your installation.\nSample rules files for inserter control files shows the sample RICOH ProcessDirector rules files in the inserter directory:\n/aiw/aiw1/samples/control_files/inserter (Linux)\nC:\\aiw\\aiw1\\samples\\control_files\\inserter (Windows)\nIf you have the full Inserter feature, you can use any of the sample inserter rules files listed. If you have the Quadient Inserter Express feature, you\ncan only use the sample Quadient rules files.\nSample rules files for inserter control files\nInserter manufacturer Rules file Header rules file\nBowe BOWE.icf.halFile.dsc BOWE.icf.halFile.header.dsc\nBowe with JetVision camera JET.icf.dsc None (no header record)\nsystems\nBowe Bell & Howell BBH.icf.idFile.dsc None (no header record)\nGunther None (no control file used) None (no control file used)\nInserters with Ironsides camera IRON.icf.kicFile.dsc None (no header record)\nsystems IRON.icf.jdfFile.dsc\nKern KERN.icf.kicFile.dsc None (no header record)\nPitney Bowes PB.icf.inputFile.dsc PB.icf.inputFile.header.dsc\nQuadient quadient.jaf.inputfile.dsc quadient.jaf.inputfile.header.dsc\nTo create rules files for inserter control files:\n1. Log in to the primary computer as the RICOH ProcessDirector system user (aiw1 is the default).\n2. Navigate to the inserter directory:\n/aiw/aiw1/samples/control_files/inserter (Linux)\nC:\\aiw\\aiw1\\samples\\control_files\\inserter (Windows)\n3. Copy all the sample rules files for your inserters to the /aiw/aiw1/config/fbi/ directory.\nWe recommend this directory because files in this directory are backed up when you do an aiwbackup process.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating rules for inserter control files - Jenski - Test portal- RPD Linux\nFor example, to copy all the sample rules files for Pitney Bowes inserters:\nOn Linux, enter this command:\ncp /aiw/aiw1/samples/control_files/inserter/PB.icf.inputFile.* /aiw/aiw1/config/fbi/\nOn Windows, use Windows Explorer to copy and paste these files:\nPB.icf.inputFile.dsc\nPB.icf.inputFile.header.dsc\n4. Open the sample rules files with a text editor. Compare the sample rules files with the inserter manufacturer specifications and make any\nnecessary changes.\nFor information about the syntax of the rules files, see the related Reference topics.\n5. Save the files. You can keep the same file names or change them. The file name extension must be .dsc.\nWhen you create the inserter controller object, specify the full path names of the rules files you created in these properties on the Control File tab\nand, if necessary, on the Second Control File tab:\nRules file\nHeader rules file\nParent topic: Configuring the system to use inserters\n2 of 2"}]}