{"doc_name": "rep_c_CreateAFPWorkflow.pdf", "doc_path": "data/raw/RPD-en-US/rep_c_CreateAFPWorkflow.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5748, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Creating a workflow to store AFP jobs and documents in a repository - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Archive feature / Workflows that store jobs and data in a repository\n/ Creating a workflow to store AFP jobs and documents in a repository\nCreating a workflow to store AFP jobs and documents in a repository\nTo store jobs and documents in a repository, you must create a workflow that includes a step based on the StoreInRepository step template. You\ncan also add StoreInRepository steps to your existing workflows. If you want the repository to hold documents and document data, make sure to\nadd the necessary document processing steps if they are not already present.\nBefore you create a workflow, plan for retention of files and documents, create repositories, and make enhancements to AFP files.\nTo create a workflow to store AFP jobs and documents in a repository:\n1. Click the Workflow tab.\n2. Right-click the RepositorySample workflow and select Copy.\nThe RepositorySample workflow processes PDF jobs. To change the workflow to process AFP jobs, you must replace some of the steps in\nthe workflow.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Right-click the If PDF connector and select Properties. Change the value of the Rule name property to If AFP. Change the value of the rule\ncondition Value property to AFP. Click OK.\n5. Add a step based on the UseInlineFormDefinition step template at the start of the If AFP conditional processing branch, before the\nCountPages step.\n6. Replace the CountPages step in the Prepare phase with a step based on the EnableRepositioning step template.\n7. Replace the IdentifyPDFDocuments step with a step based on the IdentifyDocuments step template.\n8. Right-click the IdentifyDocuments step. Select Properties, and then click AFP. For the Visual Workbench control file property, type the path\nand file name of the control file that you created with Document Property Designer. Click OK.\n9. If your AFP print file is not already indexed, add a step based on the IndexAFP step template before the IdentifyDocuments step.\nThis step shares the control file you specified for the IdentifyDocuments step. You do not need to specify the control file here.\n10. Replace the BuildPDFFromDocuments step with a step based on the BuildAFPFromDocuments step template.\n11. Right-click the BuildAFPFromDocuments step. Select Properties, and then click AFP. For the Enhance AFP control file property, type the path\nand file name of the control file that contains your document enhancements. Click OK.\n12. Replace the CountPages step in the Print phase with a step based on the EnableRepositioning step template.\n13. Optional: Right-click the RetainCompletedJobs step. Select Properties, and then click Job Defaults - General. Update the value of the\nRetention period property. Click OK.\n14. Right-click the StoreInRepository step, select Properties, and then click Repository:\n1. For the Repository property, select the repository that you want to store job and document data in.\n2. From the Available job properties to store list, select the job properties that you want to use to search for jobs and documents in the\nrepository.\n3. From the Available document properties to store list, select the document properties that you want to use to search for documents in\nthe repository.\n4. If you want to preserve the values of job properties for use when the job or its documents are resubmitted to a workflow:\n1. Use a text editor to create an override properties file.\n2. Place the database name of each job property on a separate line.\n3. To add a comment, place it on a separate line that starts with a pound sign (#).\nThis example shows a file with three job properties (Customer name, Media required, and Duplex) and a comment:\nJob.CustomerNameJob.MediaRequired# This is a comment.Job.Duplex\n4. Name the file, save it, and move it to a directory on the RICOH ProcessDirector primary computer. For example:\n/aiw/aiw1/control_files/job_properties.txt (Linux)\nC:\\aiw\\aiw1\\control_files\\job_properties.txt (Windows)\n5. On the StoreInRepository step, enter the path and name of the file in the Path to override properties file property.\n5. If you are using an associated properties file, enter the path and name of the file in the Associated properties file property.\n6. If you want to store document data that is contained in a file but is not defined as a document property to RICOH ProcessDirector,\nenter the full path and name or the symbolic name of the file in the Document properties file property and make sure to select ALL in\nthe Document properties to store list.\n7. Click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Creating a workflow to store AFP jobs and documents in a repository - Jenski - Test portal- RPD Linux\nNote:\nMake sure that the StoreInRepository step is in the correct place in the workflow. Storing a file after steps that change the order of\npages, such as ReverseOutputOrder, affects your ability to search using document properties in the viewer.\n15. Optional: If you want to store job files in the repository more than once, include additional StoreInRepository steps in the workflow.\n16. Save the workflow.\n17. To test the workflow:\n1. Create one or more input devices to point to the workflow.\n2. Enable the input devices.\n3. Submit your AFP print job to the input device.\n4. When the job finishes, look in the Archive to make sure that the right information was stored.\nNote:\nIf a job is processed again and runs the StoreInRepository step more than once, two copies of the document or job are stored in the\nrepository.\nParent topic: Workflows that store jobs and data in a repository\n2 of 2"}]}