{"doc_name": "aiw_comparing_workflows.pdf", "doc_path": "data/raw/RPD-en-US/aiw_comparing_workflows.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1820, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Comparing workflows - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Comparing workflows\nComparing workflows\nThe workflows comparison feature helps you analyze differences and similarities between two workflows directly from the Workflow Editor. You\ncan easily identify changes and similarities between steps, step chains, connectors, branches, or annotations in the workflows.\nWhen the workflow elements are selected for comparison, you can view the differences side by side, allowing you to review values, properties, in\na structured and readable format. You can use the workflow comparison feature to confirm whether the workflows use the same elements,\ndetect discrepancies that require attention, or validate that an update or imported configuration matches an existing one. The comparison view\nhighlights the differences or similarities using different colors.\nYou can compare workflows from the system you are running the Workflow Editor feature or you can compare workflows exported from other\nsystems.\nTo compare two workflows:\n1. Click the Workflow tab.\n2. In the left pane, click Workflows.\n3. Select two workflows you want to compare.\n4. Right-click and select Compare.\nA new page is opening called COMPARE WORKFLOWS.\n5. To select the first workflow, choose where is the location of the first workflow:\n1. To select an existing workflow from the current system, click WORKFLOW ON THIS SYSTEM and select or type a workflow.\n2. To select a workflow from an XML or a ZIP file that has been exported from another system:\n1. Click WORKFLOW FROM AN EXPORT FILE to enable the option.\n2. Import an XML or ZIP file containing a list of exported workflows.\n3. Select the workflow you want to compare from the list.\nParent topic: Preparing to use workflows\n1 of 1"}]}