{"doc_name": "CreatingResultsRules.pdf", "doc_path": "data/raw/RPD-en-US/CreatingResultsRules.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4704, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating rules for inserter results files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Creating rules for inserter results files\nCreating rules for inserter results files\nInserter results files contain the results of insertion. You configure RICOH ProcessDirector to read the inserter results file for each job and use the\ninformation in it to determine the status of documents after insertion and which documents need to be reprinted. Because the format and\ncontent of inserter results files can vary, you create rules files that tell RICOH ProcessDirector how to parse (analyze) the fields in each record and\nhow to map the information in the fields to RICOH ProcessDirector job and document property values.\nThe rules files are:\nParsing rules file: Defines the fields in each record of the inserter results file. This file is required.\nJob-properties rules file: Specifies how to set RICOH ProcessDirector job-property values. If the inserter results files are job-specific, this file is\nrequired. However, the file can be empty if you do not need to set any job properties. If the inserter results files are not job-specific (such as\nGunther results files), this file is not allowed.\nDocument-properties rules file: Specifies how to set RICOH ProcessDirector document-property values. This file is required.\nFor information about which properties you can set in the rules files, see the related Reference topic.\nRICOH ProcessDirector provides sample rules files for several inserter manufacturers that you can copy and customize for your installation.\nSample rules files for inserter results files shows the sample rules files in the inserter directory:\n/aiw/aiw1/samples/control_files/inserter (Linux)\nC:\\aiw\\aiw1\\samples\\control_files\\inserter (Windows)\nIf you have the full Inserter feature, you can use any of the sample inserter rules files listed. If you have the Quadient Inserter Express Feature, you\ncan only use the sample Quadient rules files.\nSample rules files for inserter results files\nInserter\nmanufacturer Parsing rules Document-properties rules Job-properties rules\nBowe BOWE.icf_results.mslFile.dsc BOWE.icf_results.process.doc.dsc BOWE.icf_results.process.job.dsc\nBowe with JET.icf_results.flatFile.dsc JET.icf_results.process.doc.dsc JET.icf_results.process.job.dsc\nJetVision\ncamera systems\nBowe Bell & BBH.icf_results.idFile.dsc BBH.icf_results.process.doc.dsc BBH.icf_results.process.job.dsc\nHowell\nGunther GUN.icf_results.logFile.dsc GUN.icf_results.process.doc.dsc None (not supported)\nInserters with IRON.icf_results.dsc IRON.icf_results.process.doc.dsc IRON.icf_results.process.job.dsc\nIronsides\ncamera systems\nKern KERN.icf_results.outputFile.dsc KERN.icf_results.process.doc.dsc KERN.icf_results.process.job.dsc\nPitney Bowes PB.icf_results.outputFile.dsc PB.icf_results.process.doc.dsc PB.icf_results.process.job.dsc\nQuadient quadient.jrf_results.outputfile.dsc quadient.jrf_results.process.doc.dsc quadient.jrf_results.process.job.dsc\nTo create rules files for inserter results files:\n1. Log in to the primary computer as the RICOH ProcessDirector system user (aiw1 is the default).\n2. Navigate to the inserter directory:\n/aiw/aiw1/samples/control_files/inserter (Linux)\nC:\\aiw\\aiw1\\samples\\control_files\\inserter (Windows)\n3. Copy all the sample rules files for your inserters to the /aiw/aiw1/config/fbi/ directory.\nWe recommend this directory because files in this directory are backed up when you do an aiwbackup process.\nFor example, to copy all the sample rules files for Pitney Bowes inserters:\nOn Linux, enter this command:\ncp /aiw/aiw1/samples/control_files/inserter/PB.icf_results.*.dsc /aiw/aiw1/config/fbi/\nOn Windows, use Windows Explorer to copy and paste these files:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating rules for inserter results files - Jenski - Test portal- RPD Linux\nPB.icf_results.outputFile.dsc\nPB.icf_results.process.doc.dsc\nPB.icf_results.process.job.dsc\n4. Open the sample rules files with a text editor. Compare the sample rules files with the inserter manufacturer specifications and make any\nnecessary changes.\nFor information about the syntax of the rules files and the document properties and job properties that you can set in the rules files, see\nthe related Reference topics.\n5. Save the files. You can keep the same file names or change them.\nThe file name extension must be .dsc.\nWhen you create the inserter controller object, specify the full path names of the rules files you created in these properties on the Results File tab:\nParsing rules file\nDocument-properties rules file\nJob-properties rules file\nParent topic: Configuring the system to use inserters\n2 of 2"}]}