{"doc_name": "aiw_supervisor.pdf", "doc_path": "data/raw/RPD-en-US/aiw_supervisor.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4293, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Setting up to send data to RICOH Predictive Insight - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to send data to RICOH Predictive Insight\nSetting up to send data to RICOH Predictive Insight\nThe RICOH Predictive Insight settings let you configure the system to send data to RICOH Predictive Insight.\nThe data that you send to RICOH Predictive Insight must be stored in the Reports database by the RICOH ProcessDirector data collectors. Before\nyou do this procedure, you need to configure the Reports feature, including setting up data collectors and workflow steps to gather the data\nthat you want to send to RICOH Predictive Insight. The data collected by the data collectors before setting up a RICOH Predictive Insight data\ntransmitter can be used in RICOH Predictive Insight after the transmission is enabled.\nNote:\nMake sure that you have enabled data capturing in Reports ⇒ Database Settings and for each data collector you want to collect data.\nTo create a connection to RICOH Predictive Insight and to transmit data, you must complete a series of steps. The data connection requires you to\ncreate a credential and a data transmitter. The credential uses an authentication code to create a certificate that authenticates with RICOH\nAccount Administration for access to Ricoh cloud applications. To get access to RICOH Account Administration, contact the system administrator\nfor RICOH Predictive Insight.\nAfter you create a certificate that authenticates RICOH ProcessDirector to Ricoh cloud, you must create a RICOH Predictive Insight data\ntransmitter that enables the data transmission.\nImportant:\nOnly one Ricoh cloud credential and one RICOH Predictive Insight data transmitter can be created for sending data to RICOH Predictive\nInsight.\nTo set up to send data to RICOH Predictive Insight:\n1. Click the Administration tab.\n2. In the left pane, click Settings ⇒ RICOH Predictive Insight.\n3. Go to Settings and set the values for these properties:\n1. Select the time zone for the RICOH ProcessDirector primary computer from the Primary computer time zone list.\n2. Enter the name of the RICOH ProcessDirector system in the System display name field. The name identifies your RICOH\nProcessDirector system in RICOH Predictive Insight.\n3. If you choose to use a proxy server, make sure that the proxy server is configured on the System Settings page.\n4. Click Save settings.\n4. In the Credential section, click the Add icon to create a Ricoh cloud credential. A new dialog opens to set up the credential:\n1. Fill in the fields in the General section.\n2. In the Certificate section, click Generate code. RICOH Account Administration opens in a new tab.\n3. Log in to RICOH Account Administration and copy the code.\n4. Return to RICOH ProcessDirector and paste the generated code into the One-time code field.\n5. Click OK to generate the certificate and save the credential.\n5. In the Data Transmitter section, click the Add icon to create a new RICOH Predictive Insight data transmitter. A new dialog opens to set up\nthe data transmitter:\n1. Review the current values for the properties and make any required updates on all the tabs. To see information about any of the\nproperties, click the question mark button next to the property name.\n2. When all the settings are configured correctly, click the switch at the top of the General tab to enable the data transmitter.\n3. Click OK.\nIf all settings are configured correctly, you should see a green check mark in front of every section. The first data transmission occurs on the\nschedule you set. The first transmission could take a while to complete, even if only a small amount of data is sent. The upper right corner of the\nRICOH Predictive Insight Settings page shows the status of the connection and the date and time of the last successful transmission.\nIn this section:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Setting up to send data to RICOH Predictive Insight - Jenski - Test portal- RPD Linux\nHints for using RICOH ProcessDirector data in RICOH Predictive Insight\nAfter you configure data collectors and data transmitters, your challenge is to create dashboards and widgets in RICOH Predictive Insight to use\nthat data. Here are some suggestions to make that process easier.\nParent topic: Configuring\n2 of 2"}]}