{"doc_name": "pref_c_createworkflow.pdf", "doc_path": "data/raw/RPD-en-US/pref_c_createworkflow.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3541, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Setting up a workflow that uses an external preferences file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Preference Management feature / Setting up a workflow that uses an external preferences file\nSetting up a workflow that uses an external preferences file\nTo process documents based on information from an external preferences file, you set up a workflow that includes a step based on the\nApplyPreferences step template. Additional steps and conditional processing (or additional workflows) might be required to handle the\nprocessing for each document based on the preference information.\nBefore you set up a workflow:\nDefine the values you are using from the external preferences file as RICOH ProcessDirector document properties.\nDefine a document property mapping object.\nDecide how to make the preferences file available to RICOH ProcessDirector. For example:\nYou might submit a preferences file with each job.\nRICOH ProcessDirector might retrieve a preferences file from a static location (either on the primary computer or from a mounted drive) and\nuse that preferences file with multiple jobs.\nCreate an input device to receive the required files:\nJob files, if RICOH ProcessDirector retrieves the preferences file from a static location\nJob files and preferences files\nTo set up a workflow that uses a preferences file:\n1. Click the Workflow tab.\n2. Click the name of a workflow that you want to modify, or create a new workflow.\nFor example, you might copy and modify the EnhancePDFDocuments supplied workflow.\n3. If you are editing an existing workflow, disable it.\n4. Add a step based on the ApplyPreferences step template to the workflow after the IdentifyPDFDocuments step and before the\nBuildPDFFromDocuments step.\nIf you have the AFP Support feature installed and the workflow processes AFP files, add the ApplyPreferences step after the\nIdentifyDocuments step and before the BuildAFPFromDocuments step.\n5. Set values for the properties of the ApplyPreferences step:\n1. For the Preferences file property, specify the full path or symbolic name of the preferences file.\nIf you are placing the preferences file on the RICOH ProcessDirector server for use by multiple jobs, specify the full path and name of\nthe file, for example: /aiw/aiw1/preferences/preferences.csv.\nIf you are submitting a preferences file with each job, specify the symbolic name of the file, for example:\n${getFileName(pref,csv,read)}.\nNote:\nTo use the values in the example, you define pref as the value of the Spool file usage property and csv as the value of the\nSpool file type property on the Batching tab when you created the input device.\n2. For the Property mapping property, select the document property mapping object you created for this workflow.\n6. Optional: Add steps and connectors for conditional processing, if needed.\nThe PreferencesSample supplied workflow contains conditional processing that might be used with values from an external preferences file.\n7. Save the workflow.\n8. Test the workflow:\n1. Enable the workflow.\n2. Enable and connect the input device that sends jobs to the workflow.\n3. Submit a preferences file and a job to the workflow:\nIf RICOH ProcessDirector is retrieving a preferences file from a static location, copy a sample preferences file to that location and\nthen submit your job to the input device.\nIf you are submitting a preferences file with your job, submit both files to the input device.\nParent topic: Setting up the Preference Management feature\n1 of 1"}]}