{"doc_name": "editoroverview.pdf", "doc_path": "data/raw/RPD-en-US/editoroverview.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4055, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM AFP Editor - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP Editor\nAFP Editor\nThe AFP Editor feature is a plug-in to RICOH Visual Workbench. AFP Editor lets you create barcodes, text, and hidden areas in documents.\nBarcodes and text are used for a variety of purposes, such as routing and tracking mail and adding page numbers to documents. If you hide\nareas in documents, no one using an AFP viewer sees the data in the area, and the data does not print. You make these enhancements in sample\nAFP files that represent your production AFP files.\nAFP Editor creates these types of barcodes:\nCode 39\nData Matrix\nInterleaved 2–of-5\nIntelligent Mail (IMB)\nPortable Data File 417 (PDF417)\nPOSTNET\nQuick Response (QR) Code\nAFP Editor lets you:\nHide existing barcodes and replace them with new barcodes.\nAutomatically replace POSTNET barcodes with Intelligent Mail barcodes that have the same routing code.\nCreate a condition between two barcodes that determines which barcode is created in a document.\nFor example, an AFP file has QR Codes on some but not all documents. You want to add a new, larger QR Code to each document that does\nnot have a QR Code. You define a QR Code that matches the existing QR Code, and you define the new QR Code. You create a condition so\nthat whenever a document does not have a QR Code, the new QR Code is added.\nTo define a barcode or text, you use the values of index tags, job properties, and static text. For example, you use the AFP Indexer mode of\nRICOH Visual Workbench to define a postal code as an index tag. AFP Editor lets you create a barcode that uses the value of the index tag for\nthe postal code.\nNote: AFP Editor lets you include the value of a document property in a barcode only if an index tag in the documents is mapped to the\ndocument property. For example:\nYou map an index tag that contains the postal code to the Postal code document property, and you use the value of the index tag that\ncontains the postal code when you define a barcode. The barcode contains the value of the Postal code document property.\nYou are using the Automated Verification feature, so the barcodes must contain both the Job number and Sequence in child job\nproperties. AFP Editor cannot create a barcode that contains the Sequence in child job document property, because the documents have\nno data about their relative position within a child job. RICOH ProcessDirector computes the value of the Sequence in child job document\nproperty for each document. As a result, you must use AFP Enhancer to generate those barcodes.\nAFP Editor lets you put the page in the page group and the page count for the page group in barcodes and text. For example, AFP Editor lets you\nput Page 1 of 5 in a barcode that prints on page 1 and Page 2 of 5 in a barcode that prints on page 2.\nAFP Editor lets you limit the placement of barcodes, text, and hidden areas to specific pages in each document. For example, AFP Editor lets you\nplace a barcode on the first page of each document or text on all the even-numbered pages.\nControl file used with AFP Editor\nYou save your AFP Editor work in a Visual Workbench control file.\nWhen you are ready to use the barcodes, text, and hidden areas in a workflow, send or copy the Visual Workbench control file to a directory on\nthe primary computer that RICOH ProcessDirector has access to.\nNew step template\nAFP Editor adds the EditAFP step template. A step based on this step template uses information in a RICOH Visual Workbench control file to\ncreate barcodes, text, and hidden areas in AFP files.\nIn this section:\nBarcodes\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM AFP Editor - Jenski - Test portal- RPD Linux\nA barcode is a pattern of elements (such as bars, spaces, and two-dimensional modules) that represent numeric or alphanumeric information in a\nmachine-readable form.\nHidden areas\nA hidden area is an area in each page group that no one using an AFP viewer can see and that does not print.\nParent topic: AFP datastream support\n2 of 2"}]}