{"doc_name": "ppfrsample_c_SetupElectronicForms.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_c_SetupElectronicForms.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1986, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Setting up to use electronic forms - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to use electronic forms\nSetting up to use electronic forms\nAfter you read the Preprinted Forms Replacement overview topics, set up to use electronic forms by doing the configuration tasks described in\nthis section.\nAfter the configuration is complete, test your workflows that combine electronic forms with job data to make sure that they work as you expect\nthem to.\nIn this section:\nAdding electronic forms to media objects\nElectronic forms are pages in PDF files that you add to media objects. The CombinePDFWithForm or CombineAFPWithForm step combines the\nPDF page data with PDF or AFP job data to create a print file that you can print on plain paper.\nRunning the sample workflow that uses electronic forms to print jobs\nThe ElectronicFormJobSample workflow demonstrates how to combine electronic forms with data in PDF files for jobs. The sample workflow\nprints some jobs by combining electronic forms with data. It prints other jobs on preprinted forms. The workflow is installed with the Preprinted\nForms Replacement feature.\nRunning the sample workflow that uses electronic forms to print jobs with documents\nThe ElectronicFormDocSample workflow demonstrates how to combine electronic forms with data in PDF files for jobs that contain documents.\nThe sample workflow prints some jobs by combining electronic forms with data. It prints other jobs on preprinted forms. The workflow is\ninstalled with the Preprinted Forms Replacement feature.\nModifying a workflow to use electronic forms with PDF jobs\nYou can add a step based on the CombinePDFWithForm step template to a workflow to combine an electronic form with data for PDF jobs.\nModifying a workflow to use electronic forms with AFP jobs\nYou can add a step based on the CombineAFPWithForm step template to a workflow to combine an electronic form with data for AFP jobs.\nParent topic: Configuring\n1 of 1"}]}