{"doc_name": "pref_c_SendPrefFileToSystem.pdf", "doc_path": "data/raw/RPD-en-US/pref_c_SendPrefFileToSystem.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3884, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Making a preferences file available to the system - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Preference Management feature / Making a preferences file available to the system\nMaking a preferences file available to the system\nYou can make an external preferences file available to the system in several different ways. For example, you can submit a job and a preferences\nfile together to an input device, you can copy a preferences file to a directory on the primary computer for use with multiple jobs, or you can\ninstruct RICOH ProcessDirector to retrieve a preferences file from an external location.\nBefore you make a preferences file available to RICOH ProcessDirector:\nVerify that the preferences file has headings for all the columns of data you want to use with RICOH ProcessDirector.\nDefine RICOH ProcessDirector document properties for each column of data you use.\nDefine a document property mapping object that maps the headings in the preferences file to the document properties.\nDecide how to make the preferences file available to RICOH ProcessDirector.\nChoose an existing hot folder input device or create a new one to use with a preferences file.\nTo make a preferences file available to the system, do the steps that are required for the method that you plan to use:\nIf you plan to send the preferences file with the job, you must configure an input device that uses the pattern batching method, then configure\nthe step to find the preferences file.\nIf you plan to store the preferences file in a static location (either on the primary computer or in a shared directory), you only need to configure\nthe step to find the preferences file.\nConfigure the input device to use the Pattern batching method.\n1. Select the input device on the Input Devices portlet.\n2. If the input device is enabled, disable it.\n3. Click Actions ⇒ Properties.\n4. Click the Batching tab and for the Batching method property, select Pattern.\n5. Enter property values for the file pattern that identifies a job.\nFor example, use these values to identify a PDF job:\nFile pattern: .*pdf$\nSpool file usage: print\nSpool file type: pdf\nFile pattern required: Yes\nFile pattern sequence: 1\nIf you have the AFP Support feature installed and want to process AFP jobs, change the File pattern and Spool file type values to .*afp$\nand afp.\n6. Click Add.\n7. Enter property values for the file pattern that identifies a preferences file.\nFor example, use these values for a preferences file in comma-separated values (CSV) format with a csv file extension:\nFile pattern: .*csv$\nSpool file usage: pref\nSpool file type: csv\nFile pattern required: Yes\nFile pattern sequence: 2\nIf the preferences file is in tab-delimited format with a txt extension, change the File pattern and Spool file type values to .*txt$ and\ntxt.\nYou can use any value for the Spool file usage property that is not a RICOH ProcessDirector keyword. Keywords include control,\noverrrides, and print.\n8. Click Add.\n9. When you finish setting property values for the input device, click OK.\nConfigure the step to find the preferences file.\nWhen you set up the workflow that uses the preferences file, set the value of the Preferences file property on the ApplyPreferences step:\nIf you plan to send the preferences file with the job, specify the symbolic name of the file, for example:\n${getFileName(pref,csv,read)}.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Making a preferences file available to the system - Jenski - Test portal- RPD Linux\nThe symbolic name uses the values for Spool file usage and Spool file type that you specified on the Batching tab when you created the input\ndevice.\nIf you plan to store the preferences file in a static location, specify the full path and name of the file, for example:\n/aiw/aiw1/preferences/preferences.csv.\nParent topic: Setting up the Preference Management feature\n2 of 2"}]}