{"doc_name": "cac_CMRHalftone.pdf", "doc_path": "data/raw/RPD-en-US/cac_CMRHalftone.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3527, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Halftone CMRs - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Color Management Resources / Types of CMRs / Halftone CMRs\nHalftone CMRs\nHalftone (HT) CMRs carry the information that a printer uses to convert print jobs into a pattern of dots that it can put on paper. Halftone CMRs\ncan be used with both color and grayscale print jobs.\nHalftone CMRs generally specify the line screen frequency, halftone pattern, and rotation of the halftone that they carry. Some device-specific\nhalftone CMRs also include the printer resolution.\nA printer that uses AFP color management to print color or grayscale print jobs must use a halftone CMR to convert the print job into a format\nthat the printer can reproduce in ink or toner. If a halftone CMR is not specified in the print job, the printer applies a default halftone CMR.\nNote:\nIf you send your color print jobs to an InfoPrint 5000 printer, halftones are applied by the print engine. As a result, the printer ignores\nhalftone CMR requests.\nYou can associate device-specific halftone CMRs or generic halftone CMRs with print jobs:\nIf you know which printer is printing the job, you can associate a device-specific halftone CMR with the print job (or with AFP resources inside\nthe print job). The printer uses the halftone CMR that you specify.\nIf you do not know which printer is printing the job, but you want to ensure that it uses a halftone CMR that has certain characteristics, such as\na specific line screen frequency, you can associate a generic halftone CMR with the print job.\nBecause it is difficult to know which halftone CMRs should be used for the current conditions on the current printer, we recommend that you\nspecify halftone CMRs generically and let the printer choose the most appropriate CMR that it has available.\nGeneric halftone CMRs\nYou can use generic halftone CMRs when you want to choose one or more characteristics of the halftone CMR for a print job, but you do not\nknow exactly which halftone CMRs are available.\nWhen a print job specifies a generic halftone CMR, the print server looks in the resource library for halftone CMRs that match the printer device\ntype and model. If the print server finds an appropriate CMR, it sends the device-specific halftone CMR to the printer with the print job. If the\nprint server does not find an appropriate halftone CMR, it sends the generic halftone CMR to the printer.\nIf a print job arrives at the printer requesting a generic halftone CMR, the printer compares the requested characteristics with the available\ndevice-specific halftone CMRs. If there is a match, the printer uses the selected device-specific halftone CMR when it processes the print job. If\nthere is no match, the printer uses the halftone CMR whose line screen frequency value is closest to the one requested.\nThe Color Management Object Content Architecture (CMOCA) has defined a variety of generic halftone CMRs, which cover the most common\nline screen frequencies and halftone types. A print server that supports CMOCA can interpret generic halftone CMRs if it has device-specific\nhalftone CMRs available to it in a resource library. If you use AFP Resource Installer, the generic halftone CMRs are installed in every resource\nlibrary that you create and populate by using AFP Resource Installer.\nPrinters that support CMOCA should be able to interpret those generic CMRs and associate them with device-specific halftone CMRs.\nParent topic: Types of CMRs\n1 of 1"}]}