{"doc_name": "pdfw_c_plugin_ui.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_ui.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 9249, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM User interface - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / User interface\nUser interface\nThe plug-in user interface consists of the Ricoh menu added to Adobe Acrobat, a right mouse button popup menu, a left mouse button popup\nmenu, and windows that you use to perform RICOH ProcessDirector Plug-in for Adobe Acrobat functions.\nRicoh menu and right mouse button popup menu\nThe Table Ricoh and right click menu options describes the options you can select from the Ricoh menu that is added to the Adobe Acrobat\nPro menu bar and when you right click in a PDF file.\nRicoh and right click menu options\nMenu Option Description\nSelect Makes RICOH ProcessDirector Plug-in for Adobe Acrobat the active Adobe Acrobat tool. After activating\nthe plug-in, you can use the left mouse button to draw a box in an area of the PDF file where you want to\nselect specific text or add markup.\nAdd Markup Displays the options on the left-mouse button menu.\nView Markup Navigator Displays a list of the markup, document property, and page group definitions that have been added to the\nactive PDF file. You can use this view to edit markup and to locate markup that is hidden under other\nmarkup. Mark the check box next to a name in the list to display the box for that markup. Remove the\ncheck to hide the markup box. If you deselect the check box in front of a markup type, you hide the boxes\nfor all markup of that type.\nView Page Group Navigator Views the pages that belong to each page group. Click the + sign to expand the page groups and click the\n− sign to collapse the page groups. You can also use this view to navigate to specific pages in the PDF file.\nClick one of the pages in a page group to make that the active page in Adobe Acrobat.\nIf you do not see the page groups you were expecting based on your page group definition, you must edit\nthe definition to obtain the correct page groups. If you do not see the correct page groups in this view, you\ncannot obtain correct print results in RICOH ProcessDirector.\nPreview Verifies that files are going to print as you expect when your markup, media, and finishing are applied to a\njob. After you have examined the preview rendering of the PDF file, click X in the upper right corner of the\nPDF file to close the rendered PDF file and to return to your original PDF file.\nPreview Preferences Sets or changes preview preferences. You can define: the maximum number of pages to process, the\nrendering intent, and other settings.\nView Document Property Values Views the values of the document properties that are defined in the loaded control file. You can save the\nvalues to a tab-delimited text file.\nManage Rules Displays your conditional processing rules. You can define new rules, and you can edit or delete existing\nrules.\nManage Inserts Inserts pages from other PDF files before each document that matches the placement conditions, after\neach document that matches the placement conditions, or both. The inserted pages increase the number\nof pages in each document, and you can apply markup to them.\nMedia and Finishing Defines media and finishing options for a range of a pages or for the documents within your PDF file.\nLoad Control File Loads an existing control file. RICOH ProcessDirector Plug-in for Adobe Acrobat saves all page group,\ndocument property, and markup definitions into one or more control files. If you load a control file, you\nload all definitions in that control file. You can only have one control file loaded at a time.\nSave Control File Stores any markup, document property, and page group definitions to a control file. The Save Control File\nwindow displays the name and location of the control file you are saving. You can enter a new name for\nthe control file, or keep the existing name to overwrite the control file you previously loaded or saved.\nWhenever you save a control file used by RICOH ProcessDirector, you must copy the control file to the\nlocation you define in the control file properties in the RICOH ProcessDirector BuildPDFFromDocuments or\nIdentifyPDFDocuments step.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM User interface - Jenski - Test portal- RPD Linux\nMenu Option Description\nClear Markup Removes all markup, document property, and page group definitions from the active PDF file. You use this\noption when you want to start over or create a new control file that does not contain any of the markup\nfrom the prior control file. If, after using this option, you add markup or other definitions to the PDF file,\nyou use the Save Control File option and save the definitions with a new control file name.\nPreferences Sets or changes preferences, such as the default font used for the labels for the markup you add to a PDF\nfile; the maximum number of pages to process; the rendering intent; logging options; and the maximum\namount of memory (heap space) to reserve for RICOH ProcessDirector Plug-in for Adobe Acrobat.\nHelp Opens the publication RICOH ProcessDirector: Using RICOH ProcessDirector Plug-in for Adobe Acrobat.\nAbout Displays the version information for your RICOH ProcessDirector Plug-in for Adobe Acrobat installation.\nLeft-mouse button menu\nThe Table RICOH ProcessDirector Plug-in for Adobe Acrobat left mouse menu describes the options you can select from the RICOH\nProcessDirector Plug-in for Adobe Acrobat menu that you see when you use the left mouse button to draw a box in the PDF file. To use the left\nmouse button, you must first make RICOH ProcessDirector Plug-in for Adobe Acrobat the active tool in Adobe Acrobat by either clicking the\nplug-in icon or by clicking Ricoh ⇒ Select. You draw a box in a PDF when you want to select text or define an area to place markup. To draw a\nbox, click the left mouse button, and without letting go of the mouse button, drag the cursor down and to the right until you have either\nselected the text you want or have drawn a box the size that you want. When you release the mouse button, a menu pops up with the following\noptions.\nRICOH ProcessDirector Plug-in for Adobe Acrobat left mouse menu\nMenu Option Description\nDefine Page Group Defines a page group to break a PDF file into mailpieces, such as statements or invoices. You must define\nthe page group before you add markup or define document properties.\nDefine Conditional Trigger Defines a conditional trigger from text in the PDF. You use a conditional trigger in a conditional placement\nrule that defines the pages on which markup is printed or document properties are extracted. For example,\nyou want to add a QR barcode only on the page where the word Invoice occurs near the top left of either\nthe first or second page of a statement. You first define the word Invoice as a conditional trigger. Then,\nwhen you are defining the QR barcode, you select that trigger as a conditional placement rule on the QR\nbarcode so it only prints on the pages where the word Invoice occurs in the location you selected.\nDefine Document Property Defines existing data in your sample PDF file as a document property so RICOH ProcessDirector can use\nthat data in different steps (such as adding barcodes). After you define document properties, you can later\nsearch for them in the RICOH ProcessDirector viewer for reprint and other actions.\nYou can also define a document property on any text or DataMatrix barcode that you want to extract from\nthe PDF file. In that case, you do not select a standard RICOH ProcessDirector document property; instead,\nyou provide your own name for the property.\nDefine Multiple Properties Defines document properties from a block or multiline section of text.\nDefine Address Block Defines document properties for an address block.\nHide Area Creates a cover block to hide content in a PDF file. Hidden content does not print and is not viewable in\nRICOH ProcessDirector Plug-in for Adobe Acrobat preview or in the PDF viewer in RICOH ProcessDirector.\nYou can hide an area and then place other markup over the hidden area.\nAdd Barcode Adds and configures a barcode. First you select the area where you want to place the barcode. Then, you\nselect a barcode type and add content. When adding a barcode for downstream processing of mailpieces,\nyou must understand the precise optical marks required by your machinery and have configuration\nspecifications from your supplier.\nAdd OMR Adds and configures optical markings to help manage downstream processing of mailpieces in the PDF file.\nWhen adding an OMR, you must have an understanding of the precise optical marks required by your\nmachinery and have configuration specifications from your supplier.\nAdd Image Adds an RGB JPEG-formatted image to create new content or to cover existing content.\nAdd Text Adds text to any location in a PDF file. You designate the area where you want the text to print and select\ncontent from a combination of options, including typing text.\nIn this section:\nFields in the RICOH ProcessDirector Plug-in for Adobe Acrobat cut off values\nMonitors with a very high resolution and certain display settings can cause problems in the way information is displayed.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n2 of 2"}]}