{"doc_name": "slapolicynoservice.pdf", "doc_path": "data/raw/RPD-en-US/slapolicynoservice.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2960, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM No-service periods - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Service policies / No-service periods\nNo-service periods\nRICOH ProcessDirector can adjust the planned checkpoint and SLA deadline times so they do not occur during periods when your installation\ndoes not provide services. For example, you might not provide services on holidays and weekends. These periods are called no-service periods.\nYou define these periods in no-service period objects.\nNote: No-service periods are not considered for deadlines set with the SetDeadline step or the Change Deadline action.\nEach service policy specifies whether to adjust planned checkpoints and the SLA deadline for the no-service periods. For example, if you provide\nservices during no-service periods only for “express” jobs, the service policy for “express” jobs would specify not to adjust planned checkpoints,\nwhile other service policies would specify to adjust planned checkpoints.\nThese examples show how RICOH ProcessDirector adjusts the checkpoint start time, planned checkpoint times, and SLA deadline for no-service\nperiods.\nJob arrives during a no-service period: In this example:\nJanuary 1 is defined as a no-service period.\nThe interval for the Prepare checkpoint is 2 hours.\nThe interval for the Print checkpoint is 1 day.\nThe checkpoint start time is the time the job arrives in the system.\nTo meet its deadline, the job must be delivered to the inserter line 28 hours after it arrives.\nThe job arrived in the system on January 1, 2007 (01/01/2007) at 10:00:00.\nCheckpoint/Deadline times Not adjusted for no-service periods Adjusted for no-service periods\nCheckpoint start: 1/1/07 10:00:00 1/2/07 00:00:00\nPlanned Prepare: 1/1/07 12:00:00 1/2/07 02:00:00\nPlanned Print: 1/2/07 10:00:00 1/3/07 00:00:00\nSLA deadline 1/2/07 14:00:00 1/3/07 04:00:00\nCheckpoint interval includes a no-service period: In this example:\nEvery Saturday is defined as a no-service period.\nThe interval for the Prepare checkpoint is 2 hours.\nThe interval for the Print checkpoint is 1 day.\nThe checkpoint start time is the time the job arrives in the system.\nTo meet its deadline, the job must be ready to be sent to the post office 72 hours after it arrives.\nThe job arrived in the system on January 5, 2007 (01/05/2007) at 10:00:00.\nNote: January 6, 2007 is a Saturday.\nCheckpoint/Deadline times Not adjusted for no-service periods Adjusted for no-service periods\nCheckpoint start: 1/5/07 10:00:00 1/5/07 10:00:00\nPlanned Prepare: 1/5/07 12:00:00 1/5/07 12:00:00\nPlanned Print: 1/6/07 10:00:00 1/7/07 10:00:00\nSLA deadline 1/8/07 10:00:00 1/9/07 10:00:00\nIf you delete a no-service period, checkpoint times and the deadline for jobs that are already in the system do not change, even if they were set\nusing that no-service period. To reset the checkpoints and deadline, you must reprocess the job from the beginning.\nParent topic: Service policies\n1 of 1"}]}