{"doc_name": "aiw00c82.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c82.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2169, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Setting up user exit programs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up datastream transforms / Setting up user exit programs\nSetting up user exit programs\nRICOH ProcessDirector can call user exit programs that can modify the AFP print file for a job before or after it prints. Authorized users can\nmodify and compile the sample exit programs that RICOH ProcessDirector provides or they can write their own. RICOH ProcessDirector provides\nsample exit programs in the /usr/lpp/psf/exits (Linux) or C:\\Program Files (x86)\\Ricoh\\PSF\\exits (Windows) directory.\nThe sample job completion user exit writes job statistics to the /Ricoh/var/psf/ (Linux) or \\PSF\\var\\psf\\ (Windows) jobcompletion.log file.\nIn the log entries, RICOH ProcessDirector appends aiw1 to the printer name as it appears in the RICOH ProcessDirector user interface.\nTo set up a user exit program:\n1. In the Printers Portlet, select the printer that you want to assign a user exit program to.\n2. Click Disable.\n3. Select the printer again and click Properties.\n4. In the properties notebook for the printer, click Exits.\n5. Enable the types of user exit programs that you want the printer to call by setting one or both of these properties to Yes:\nEnable input data exit\nThis exit program modifies the contents of the AFP print file before RICOH ProcessDirector sends the print file to the printer.\nEnable job completion exit\nThis exit program modifies the contents of the AFP print file after the printer reports that the job has printed.\n6. Specify the name of the compiled version of the user exit program for one or both of these properties:\nInput data exit program\nJob completion exit program\nNote:\nIf the compiled version of the user exit program resides in the /usr/lpp/psf/bin (Linux) or C:\\Program Files\n(x86)\\Ricoh\\PSF\\bin (Windows) directory, you do not need to include the path. If it resides in a different location, you can\nspecify a path with the program name. The value for the combined path and program name can be up to 255 characters.\n7. Click OK.\n8. Select the printer and click Enable.\nParent topic: Setting up datastream transforms\n1 of 1"}]}