{"doc_name": "pref_o_InfoAboutDocs.pdf", "doc_path": "data/raw/RPD-en-US/pref_o_InfoAboutDocs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2161, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Using information about documents - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Preference Management / Using information about documents\nUsing information about documents\nAll document processing features collect and track information about individual documents in a job. RICOH ProcessDirector extracts the\ninformation (such as customer names and addresses) from data in the documents themselves. The Preference Management feature lets you use\nother information (such as favorite movies or document delivery preferences) about the individual or account associated with each document.\nThe documents themselves do not contain that information.\nYou can use information about the individuals or accounts in two different ways:\nTo change the content of documents\nTo control how RICOH ProcessDirector processes documents\nTo change the content of documents, you apply markup based on the values of document properties. For example, you have information about\nthe favorite movie of each customer. You create markup for several different special offers. You define a RICOH ProcessDirector document\nproperty for favorite movies. You send the information about favorite movies to RICOH ProcessDirector in a preferences file. RICOH\nProcessDirector uses the information to select a special offer and apply it to each document.\nTo control how RICOH ProcessDirector processes documents in your workflow, you create conditional processes based on the values of document\nproperties. For example, you have information about the document delivery preferences of each customer. You define a RICOH ProcessDirector\ndocument property for delivery preferences, and you send the information about customer delivery preferences to RICOH ProcessDirector in a\npreferences file. You create conditional processes that print or email documents to customers by assigning the values for the document property\nthat specifies delivery preferences to a job property so that RICOH ProcessDirector can create separate jobs for the documents with each delivery\npreference.\nParent topic: Preference Management\n1 of 1"}]}