{"doc_name": "creatingpagegroupscontainer.pdf", "doc_path": "data/raw/RPD-en-US/creatingpagegroupscontainer.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2048, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating page groups - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating page groups\nCreating page groups\nYou can create page groups in AFP files. Page groups organize AFP files into smaller, uniquely identifiable units. When you create page groups,\nany existing page groups defined in the AFP file itself are not used.\nYou can create page groups that are a fixed number of pages long, or you can create page groups of variable length by defining triggers. You\ncan also define which pages are used for header and trailer pages. AFP Indexer creates the first page group after the defined number of header\npages. It creates the final page group before the defined number of trailer pages.\nThe sample AFP file must contain page groups before you can define header and trailer pages, create index tags for a page group, or make any\nother enhancements. If page groups are defined in the AFP file itself, you can use these page groups or you can create new page groups.\nIn this section:\nCreating page groups of fixed length\nYou can create page groups that are of fixed length. This is useful if all page groups in the AFP file always consist of the same number of pages.\nCreating page groups with triggers\nYou can create page groups by defining one or more triggers. A trigger is a block of text that occurs in a consistent location on the first or last\npage of all page groups.\nCreating page groups when white space is found\nYou can create page groups when white space is found in an area. White space does not contain IOCA (Image Object Content Architecture)\nimage data. As an alternative, you can create page groups when IOCA image data is found in an area.\nDefining header and trailer pages\nAfter you create fixed-length page groups or page groups with triggers, you can define header and trailer pages and decide if the pages are kept\nin the final output for viewing and printing.\nParent topic: Indexing AFP files\n1 of 1"}]}