{"doc_name": "creatingindexesinarea.pdf", "doc_path": "data/raw/RPD-en-US/creatingindexesinarea.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6583, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating index tags in areas - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating index tags / Creating index tags in areas\nCreating index tags in areas\nYou can create index tags for text in an area.\nThe area must occur in a consistent location in each page group; however, it can consist of a variable number of lines. In the index area, you can\ncreate an index tag with text from more than one AFP text block on a line. You can concatenate the text in the text blocks, or separate the text\nwith a blank or any other character. You can also edit the text to remove unwanted characters.\nFor example, a customer account number might occur on the first page of each page group in three separate AFP text blocks on the same line.\nTo create an index tag that contains the entire account number, first you identify the account number area by drawing a box around all three text\nblocks. Then you create one index tag with text from all three text blocks, and you specify the character to use to separate the text in each text\nblock. If the text blocks contain account number “123”, “45”, and “678”, the index tag can contain: “12345678”, “123 45 678”, or “123-45-\n678”.\nNotes:\n1. If the AFP file does not contain page groups, create page groups. Otherwise, to create an index tag for an area on a page outside a page\ngroup, see Creating index tags on supplemental pages.\n2. In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo create index tags in an area:\n1. In RICOH Visual Workbench, open a sample AFP file that contains the text you want to index. Then click Mode ⇒ AFP Indexer.\n2. To create the index area, position your cursor at a corner of the area that contains text you want to index. While pressing the left mouse\nbutton, draw a box that includes the text you want to index.\nThe index area must include the first character in each AFP text block that you want to index; however, the area does not need to include\nall the characters in the AFP text blocks.\n3. Right-click anywhere on the page and click Create Index Tags.\nYou see the Create Index Tags in an Area window.\n4. Check that the text you want to index is shown in the Lines in the area field. If the text is not shown, click Cancel and redraw the area on\nthe page, or click the Position tab to adjust the origin and size of the index area.\nNote: If the text displays correctly in the AFP file but incorrectly in the Lines in the area field, try changing the default code page\n(Resources ⇒ Modify Default Encoding). If the text still does not display correctly, this usually indicates that the code page does not\nuse standard Unicode mapping. In this case, use the SampleCodePointMap.cp font-mapping file to create a code point map file\nbefore proceeding.\n5. Optional: On the Position tab, change the origin (top-left corner) and size of the index area in these fields. Decimal values (such as 2.5) are\nallowed. Specify the origin and size in inches or millimeters.\nX position\nThe horizontal distance of the left side of the area measured from the left side of the logical page (not the physical sheet of paper).\nY position\nThe vertical distance of the top of the area measured from the top of the logical page (not the physical sheet of paper).\nWidth\nThe horizontal width of the area.\nHeight\nThe vertical height of the area.\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the logical page in the unrotated view.\n6. On the Index Tags tab, type a descriptive name for the area in the Index area name field.\nFor example, if the area contains an account number, the name could be “Account number area”.\n7. Specify the character or characters that you want to use to separate text blocks in the Character between text blocks field.\nThe default character that separates text blocks is one blank. If you want to concatenate the text in multiple text blocks, delete the blank\nfrom the field.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating index tags in areas - Jenski - Test portal- RPD Linux\nIn the Lines in the area field you see the text with the character that you specified (if any) shown between the text blocks.\n8. To create an index tag for the text shown in a line in the area:\n1. Click Add.\n2. Use the default code page encoding or select an encoding from the drop-down list if the text displays incorrectly.\n3. Type a descriptive name for the index tag.\nFor example, if the index tag contains an account number, the name could be “Account number”.\n4. Select the line that contains the text you want to index:\nTo select the first line or a line relative to the first line, click First line. Then use the drop-down list for this field to select a relative\nline. For example, select First line plus 1.\nTo select the last line or a line relative to the last line, click Last line. Then use the drop-down list for this field to select a relative line.\nFor example, select Last line minus 1.\nYou see the value of the index tag in the Edited value field.\n5. Decide whether you want to use the entire text value to create the index tag or only part of the text. To select part of the text as the\nindex tag, click Edit index value. Edit the index value in the Edit Value window and click OK.\n6. Clear the Create tag for an empty value field if you do not want AFP Indexer to create index tags with null values.\nOtherwise, an index tag contains the value “null” if the text that you indexed does not exist in a particular page group. For example,\nif a page group has an address that does not contain a country name, the index tag for country name is “null” for that page group.\n7. Click OK.\nYou see the index tag and the index tag value in the Index tags for specific lines field.\n9. Optional: To create another index tag with text on the same line or on a different line, click Add again.\nYou can create as many index tags as you want in the area.\n10. Click OK.\nYou see the index tags listed in the bottom pane for each page group.\n11. Verify that the correct index tags have been created:\n1. Double-click the index tags in the bottom pane and verify that the correct pages in the page groups are displayed.\n2. If an index tag is incorrect, click Tools ⇒ Modify Definitions to modify or delete the tag.\nThe index tag is listed under Page Group Definition ⇒ Page Group Indexes ⇒ Index areas.\nParent topic: Creating index tags\n2 of 2"}]}