{"doc_name": "pdfw_i_c_create_jt_splitsize.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_i_c_create_jt_splitsize.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3180, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Workflow to split PDF jobs by size - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Configuring the PDF Document Support feature / Workflow to split PDF jobs by size\nWorkflow to split PDF jobs by size\nThe PDF Document Support feature includes step templates that you can use to split a job into smaller jobs so that, for example, they can be\nprinted on separate printers.\nTo split a job without fragmenting any of its documents across two jobs, you must identify the boundaries of the documents in the job. To do\nthat, you define page groups in PDF files using RICOH ProcessDirector Plug-in for Adobe Acrobat. You copy the plug-in control file with the page\ngroup definition to the location you specify in the IdentifyPDFDocuments step.\nYou include an IdentifyPDFDocuments step so it can apply the rules that you defined in RICOH ProcessDirector Plug-in for Adobe Acrobat to\ncreate the document properties file for the original job. The SplitDocuments step determines which documents are placed into each child job and\nupdates the document properties file with that information.\nYou use a CreateJobsFromDocuments step, which makes document properties files for the child jobs but does not create PDF files. You must also\ninclude a step based on the BuildPDFFromDocuments step template in the workflow assigned to the child jobs. BuildPDFFromDocuments creates\nthe PDF file with all the documents in the correct order. In this step, you also specify the RICOH ProcessDirector Plug-in for Adobe Acrobat control\nfiles that add markup to the PDF file.\nThe original workflow does not have any steps in the Print phase because the child workflow controls printing. After all the child jobs complete,\nthe parent job goes to the next step in the original workflow.\nThe child workflow should begin with steps based on these two step templates: SetJobPropsFromTextFile and SetJobPropsFromOriginal.\nSetJobPropsFromTextFile sets values for job properties from the steps of the child workflow. SetJobPropsFromOriginal copies the values that were\nset in the original workflow to become the values for those properties in the child workflow. Then if you choose to run the building of the child\nPDF files in parallel by including a CreateJobsFromDocuments step in the original workflow, you need to use a BuildPDFFromDocuments step in\nthe child workflow.\nNote:\nIf you have customized phase names in your system, the phase names in the table might not match the names in your system.\nSplitting PDF jobs by size using CreateJobsFromDocuments\nParent/child Phase Step\nParent Receive SetJobPropsFromTextFile\nIn the Input data stream field, select PDF.\nPrepare CountPages\nIdentifyPDFDocuments\nAssemble SplitDocuments\nCreateJobsFromDocuments\nComplete RetainCompletedJobs\nRemoveJobs\nChild Receive SetJobPropsFromTextFile\nAssemble BuildPDFFromDocuments\nPrint CountPages\nCreatePageRanges\nPrintJobs\nComplete WaitForRelatedJobs\nRetainCompletedJobs\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Workflow to split PDF jobs by size - Jenski - Test portal- RPD Linux\nParent/child Phase Step\nRemoveJobs\nParent topic: Configuring the PDF Document Support feature\n2 of 2"}]}