{"doc_name": "aiw_c_xml_PrepToReceive.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_xml_PrepToReceive.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5746, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Preparing to receive XML - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to receive XML\nPreparing to receive XML\nHow you receive and process XML files depends on the information in the files and what you want to do with the information.\nBefore you do these tasks, read the usage scenario and examples for processing orders in an XML file. Those topics give examples for the steps in\nthis topic.\nTo prepare to receive XML:\n1. Evaluate the XML files that provide input to the process. Make sure that you understand what information the files contain and how the\ninformation is organized.\nIf possible, ask the XML provider for the XML Schema Definition (XSD).\n2. Decide how to process the XML files in RICOH ProcessDirector. These step templates manipulate XML:\nA step based on the CreateJobsFromXML step template creates jobs from elements in an XML file that match an XPath expression. The\nstep submits the jobs to a workflow.\nA step based on the ApplyXSLTransform step template transforms XML into a file that specifies the values of RICOH ProcessDirector job or\ndocument properties. The step also transforms XML into another XML format.\nYou can use steps based on other step templates, such as RunExternalProgram, to manipulate XML files.\n3. To extract values for RICOH ProcessDirector job and document properties, identify the XML elements and attributes that supply values for\nthe properties.\nNote:\nThe PDF Document Support feature or AFP Support feature is required to use document properties.\n4. Decide how many CreateJobsFromXML steps are required to process the XML.\nWhen you create the workflows that process XML files, you decide which workflow receives the new jobs output by each\nCreateJobsFromXML step. You also decide whether the new jobs are child jobs.\nFor example:\nYour XML file contains multiple orders, and each order contains multiple items. A hot folder input device receives the XML files and\nprocesses them with the first workflow.\nA CreateJobsFromXML step in the first workflow creates a job for each order and submits the jobs to a second workflow. That workflow\nextracts information about the order.\nA CreateJobsFromXML step in the second workflow creates a job for each item in the order and submits them as child jobs to a third\nworkflow. The third workflow processes the item jobs.\nYour XML file contains a list of book titles and the PDF files required to print each book. An input device receives requests to print one or\nmore copies of a book on the list and assigns the job to a workflow.\nUsing the book title in the request, a CreateJobsFromXML step in the workflow creates an XML job with the PDF files required to print the\nbook. The step submits the job to a second workflow.\nA CreateJobsFromXML step in the second workflow creates an XML job for each PDF file (one for the cover and another for the text). The\nstep submits the jobs as child jobs to a third workflow. The third workflow prints the cover and text jobs.\nYour XML file contains a list of document properties to add to the document properties file for a job.\nAn ApplyXSLTransform step transforms the XML into a comma-separated values file that the workflow uses as a property conditions file.\nThe workflow does not have a CreateJobsFromXML step.\nA SetDocPropsFromConditions step reads the property conditions file and sets the document properties based on the values supplied in\nthe XML file.\n5. For each CreateJobsFromXML step, define the XPath expression required to create jobs from elements in the XML input file.\nUsually, the workflow that receives jobs from a CreateJobsFromXML step has an ApplyXSLTransform step to transform elements in the XML\ninto RICOH ProcessDirector job or document properties.\n6. For each ApplyXSLTransform step, use a third-party XSLT tool (such as Altova MapForce) to create an XSLT style sheet.\nTo transform XML elements into RICOH ProcessDirector job properties in an overrides file, see the sample XSLT style sheet for processing\norders in an XML file.\nMake the output file for the ApplyXSLTransform step ${getFileName(overrides,text,write)}.\nAfter you install a document processing feature, see the information center topic for adding a step to transform XML elements into\nRICOH ProcessDirector document properties.\n7. Decide how to receive XML files for processing.\nYou can submit XML files to a hot folder input device or place an XML file at a location where the RICOH ProcessDirector server retrieves it.\nFor example:\nIf your XML file contains multiple orders, and each order contains multiple items, submit the XML files to a hot folder input device.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Preparing to receive XML - Jenski - Test portal- RPD Linux\nIf your XML file contains a list of book titles and the PDF files required to print each book, place the file at a convenient location. Update\nthe file whenever the book titles and print files change.\nWhen a CreateJobsFromXML step runs, it uses an XPath expression to create an XML job from information in the list.\n8. If you place an XML file at a location from which the RICOH ProcessDirector server retrieves it, decide how to submit jobs to the workflow.\nOne way is to submit an overrides file to a hot folder. The overrides file triggers the hot folder to create a job and submit it to the\nworkflow.\nTo use an overrides file as a trigger, set these properties when you define the hot folder:\nSet the Completion method property to Trigger.\nSpecify the same pattern value for both the Trigger patterns and Overrides patterns properties.\nYou now have the information, XPath expressions, and XSLT style sheets required to define workflows to process XML.\nParent topic: Preparing for job submission\n2 of 2"}]}