{"doc_name": "aiw_c_setup_workflow_restarttype.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_setup_workflow_restarttype.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6999, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Setting up a workflow that uses a Reformat step restart type - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Setting up a workflow that uses a Reformat step restart type\nSetting up a workflow that uses a Reformat step restart type\nTo move jobs from one printer to another, you might need to reformat the jobs. For example, a job is formatted to print 2-up on a continuous\nforms printer, but you need to move the job to a cut sheet printer where the data should be formatted 1-up. Scheduling the job to the printer is\nnot enough because the data in the job must be reformatted to print correctly on the printer. You must set up the workflow to reformat the job\nfor the printer.\nAfter you set up the workflow, an operator can use the Output format scheduling property to make jobs match a printer. When the operator\nuses the Schedule jobs page to change the Output format of a job, the job is sent to the step that has a Reformat step restart type. From that\nstep, the job is sent through the workflow path that runs the correct steps for the selected Output format.\nBefore you set up a workflow, identify the reformatting required. Your workflow needs a conditional processing path for each Output format\nvalue that is used by your printers.\nThe Output format scheduling property has five values. Because the values only schedule jobs to printers, you can assign them to any job\nformatting process. This list gives a suggested use for each value:\nA to Z for PDF\nYou might assign the A to Z for PDF value to roll-to-fold PDF printers and to jobs that you format for those printers.\nZ to A for PDF\nYou might assign the Z to A for PDF value to roll-to-roll PDF printers and to jobs that you format for those printers.\nA to Z for AFP\nYou might assign the A to Z for AFP value to roll-to-fold AFP printers and to jobs that you format for those printers.\nZ to A for AFP\nYou might assign the Z to A for AFP value to roll-to-roll AFP printers and to jobs that you format for those printers.\nTransform\nYou might assign the Transform value to Postscript printers and to jobs in any data stream that you format for those printers.\nTo set up a workflow that uses a Reformat step restart type:\n1. Assign Output format values to your printers:\n1. In the Printers portlet, right-click a printer and select Properties.\n2. On the Scheduling tab, set a value for the Output format property.\n2. Click the Workflow tab.\n3. Click the name of the workflow you want to modify.\n4. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n5. Set the Output format value for the jobs in the workflow.\nFor example:\nSet a value for Output format in an overrides file.\nOn the AssignJobValues step, select Output format as a value for the Values to set property and then select a value for Output format.\nOn the PrintJobs step, set a value for Output format.\n6. Set the Step restart type to Reformat on the step that sends jobs through connectors to the branches that reformat the jobs for printers\nwith different Output format values.\nIf you need to add a step to the workflow for this purpose, you might use the ContinueToNextStep step template.\nImportant:\nYour workflow should have only one step with a Reformat step restart type. If multiple steps have this step restart type, the job\nmoves to error state when an operator makes the Output format value for the job match the Output format value for the printer.\n7. Add conditional processing to the workflow to do the reformatting.\nDepending on your needs, the conditional processing might be simple or complicated.\nSteps such as ReversePDFPageOrder, PreparePDFOutputForFinishing, or ReverseOutputOrder (for AFP jobs) can be used to reorder the\npages in a job. Place the steps that reformat the job after the step with the Reformat restart type, and add conditional processing for each\ntype of job that you are reformatting.\nIf the Output format of the job is Transform and you have an appropriate Transform feature installed, steps such as TransformJobIntoPDF,\nTransformJobIntoAFP, or TransformWIthAdvancedFeature can be used to transform the job into the correct data stream for the printer.\nThe example at the end of this procedure shows how to modify a simple PDF workflow to reformat jobs.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Setting up a workflow that uses a Reformat step restart type - Jenski - Test portal- RPD Linux\n8. Save and enable the workflow.\n9. Test the workflow to make sure that jobs with each Output format value follow the proper path through the workflow and are reformatted\nfor the requested printer.\nExample: Modifying a simple workflow that sends jobs to a roll-to-fold PDF printer\nThe workflow has these steps:\nSetJobPropsFromTextFile\nDetectInputDataStream\nCountPages\nCreatePageRanges\nPrintJobs\nRetainCompletedJobs\nRemoveJobs\nTo reformat the PDF jobs for a roll-to-roll PDF printer:\n1. Assign the A to Z for PDF value for Output format to your roll-to-fold printer.\n2. Assign the Z to A for PDF value for Output format to your roll-to-roll printer.\n3. Set the Output format value for the jobs in the workflow to A to Z for PDF.\n4. Between the CountPages and CreatePageRanges steps, add a Continue step based on the ContinueToNextStep step template.\n5. On the Continue step, set Step restart type to Reformat.\n6. Add a rule with one condition on the connector between the Continue and CreatePageRanges steps: Output format = A to Z for PDF.\nName the rule If Roll to Fold.\n7. Add a disconnected step based on the ReversePDFPageOrder step under the If Roll to Fold connector. Connect the new step to the\nContinue and CreatePageRanges steps.\n8. Add a rule with one condition on the connector between the Continue and ReversePDFPageOrder steps: Output format = Z to A for PDF.\nName the rule If Roll to Roll.\n9. On the PrintJobs step, set Requested printer to Not set.\nThis setting keeps RICOH ProcessDirector from automatically sending the jobs to a specific printer.\n10. Save and enable the workflow.\n11. Run jobs through the workflow:\n1. Enable the workflow.\n2. Enable and connect the input device that sends jobs to the workflow.\n3. Submit a job formatted for a roll-to-fold printer to the workflow.\nThe job should print on the roll-to-fold printer.\n4. Disable the roll-to-fold printer.\n5. Submit another job formatted for a roll-to-fold printer to the workflow.\nWhen the job reaches the PrintJobs step, it should stop.\n6. Select the job in the Jobs table and click Schedule.\n7. Select the roll-to-roll printer and click Make Jobs match printer.\n8. Click OK.\nThe job should return to the Continue step, go through the If Roll to Roll branch, and print on the roll-to-roll printer.\nParent topic: Preparing to use workflows\n2 of 2"}]}