{"doc_name": "cac_DORTypes.pdf", "doc_path": "data/raw/RPD-en-US/cac_DORTypes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4390, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Types of Data Objects - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Data Objects / Types of Data Objects\nTypes of Data Objects\nImage data objects can be stored in a number of different formats, including AFPC JPEG Subset, EPS, GIF, IOCA, PDF, PNG, and TIFF. These image\ntypes are device-independent so they can be used by different systems and still be interpreted consistently.\nAFPC JPEG Subset (JPEG)\nAFPC (AFP Consortium) JPEG Subset files, formerly called JPEG File Interchange Format (JFIF) files, are bitmap image files that are compressed by\nusing Joint Photographic Experts Group (JPEG) compression. As a result, AFPC JPEG Subset files are most commonly referred to as JPEG files.\nJPEG files most commonly use the file extension .jpg, but can also use .jpeg, .jpe, .jfif, and .jif.\nJPEG compression deletes information that it considers unnecessary from images when it converts them. JPEG files vary from having small\namounts of compression to having large amounts of compression. The more an image is compressed, the more information is lost. If the image\nis compressed only once, there usually is no noticeable effect on the image. However, if the image is compressed and decompressed repeatedly,\nthe effects of deleting information become more noticeable.\nJPEG compression is commonly used for photographs, especially photographs that are transmitted or displayed on webpages. The compression\nmakes the files small enough to transmit on a network efficiently, but leaves enough information that the image is still visually appealing.\nEncapsulated PostScript (EPS)\nEPS is a PostScript graphics file format that follows conventions that Adobe Systems defined. EPS files support embedded ICC profiles.\nGraphics Interchange Format (GIF)\nGIF files are bitmap image files that are limited to a palette of 256 RGB colors. Because of the limited color range that it can contain, GIF is not\na good format for reproducing photographs, but it is generally adequate for logos or charts. GIF images are widely used on the Internet\nbecause they are usually smaller than other image formats. GIF files use the file extension .gif.\nImage Object Content Architecture (IOCA)\nIOCA is an architecture that provides a consistent way to represent images, including conventions and directions for processing and exchanging\nimage information. The architecture defines image information independently of all data objects and environments in which it might exist and\nuses self-identifying terms; each field contains a description of itself along with its contents.\nPortable Document Format (PDF)\nPDF is a standard file format that Adobe Systems developed.\nPDF files can be used and stored on various operating systems and contain all the required image and font data. Design attributes in a PDF are\nkept in a single compressed package.\nNote:\nSingle-page and multiple-page PDF files can be used as data objects in AFP print jobs.\nPortable Network Graphics (PNG)\nPNG files are bitmap image files that support indexed colors, palette-based images with 24-bit RGB or 32-bit RGBA colors, grayscale images, an\noptional alpha channel, and lossless compression. PNG is used for transferring images on the Internet, but not for print graphics. PNG files use\nthe file extension .png.\nTagged Image File Format (TIFF)\nTIFF files are bitmap image files that include headers to provide more information about the image. TIFF files use the file extensions .tif or .tiff.\nTIFF files support embedded ICC profiles. If an ICC profile is embedded in a file, the characteristics of the input color space are known\nwhenever the file is used; however, the profiles increase the file size. When you save a file in the TIFF format, you can use various compression\nalgorithms.\nNote:\nSingle-image and multiple-image TIFF files can be used as data objects in AFP print jobs.\nNot all printers support all types of data objects.\nThe embedded ICC profiles in EPS, JPEG, and TIFF files contain the information that a printer uses to convert colors in the image from an input\ncolor space into the profile connection space (PCS). The input color space is either an industry-standard space or a custom space that describes\nthe color reproduction capabilities of a device, such as a scanner, digital camera, monitor, or printer.\nParent topic: Data Objects\n1 of 1"}]}