{"doc_name": "editingdpdindex.pdf", "doc_path": "data/raw/RPD-en-US/editingdpdindex.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3860, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Editing text for index tags linked to properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Customizing properties for AFP files\n/ Editing text for index tags linked to properties\nEditing text for index tags linked to properties\nYou can edit the text value for an index tag so that the document or job property contains only part of the index tag value. You might want to\nedit the text value to remove any leading or trailing blanks, or to remove unwanted special characters.\nThe edits you make apply only to the property value and do not change the value of the index tag itself.\nFor example, if the index tag value contains an account number, 01-345678, you can edit the text value so that the property value contains only\npart of the account number, such as 345678.\nWhen you edit a text value, make sure that you edit it so that it is appropriate for all documents or jobs because the index tag values can be\ndifferent in each document or job.\nThe editing rules in the table below are applied top to bottom; for example, first editing by stripping of characters, then editing on delimiters,\nand finally editing on characters.\nTo edit the text value for an index tag that is linked to a property:\n1. On the Edit Value window, select On for one or more of these fields:\nField Action\nType one character or a blank character (use the space bar to type a blank character) that you want to remove from the\nvalue. The character is case-sensitive. Then, select one of these buttons:\nStrip leading characters\nThe specified character is removed from the beginning of the value.\nFor example, if you type a blank character, all blanks are removed from the beginning of the value.\nStrip trailing characters\nThe specified character is removed from the end of the value.\nEdit by stripping For example, if you type a blank character, all blanks are removed from the end of the value.\ncharacters\nStrip leading and trailing characters\nThe specified character is removed from the beginning and end of the value.\nFor example, if you type a blank character, all blanks are removed from the beginning and end of the value.\nStrip all characters\nThe specified character is removed from all positions in the value.\nFor example, an account number is: 324-1443255-11. You can type a - to strip all - characters from the value,\nproducing 324144325511.\nType a text string of one or more characters or blanks in the Specify delimiter string field to indicate where the text value\nis split into separate strings. The text is case-sensitive. Then select numbers for Select first string and Select number of\nEdit on strings to mark the beginning and end of the edited text.\ndelimiter For example, an account number is: 324-1443255-11. You can use - as the delimiter to split the value into these three\nstrings: 324, 1443255, and 11. To select the second and third strings, 1443255-11, select 2 for both Select first string\nand Select number of strings.\nEdit on Select numbers for Select first character position and Select number of characters to indicate the first character in the\ncharacter text value and how many characters are included.\nWhen you select the options in the window, the index tag value in the Original text field is edited based on your selections and the new\nvalue is displayed in the Edited text field. The index tag value that is displayed is the value of the first index tag in the first document in the\nfile.\nOptionally, you can select more than one index tag to edit; the rules that you define apply to all of the selected index tags. When you edit\nmore than one index tag at a time, the sample value fields at the bottom of the window do not display an example of the changed\nproperty.\n2. Click OK.\nParent topic: Customizing properties for AFP files\n1 of 1"}]}