{"doc_name": "reportsPostgresql_c_SetUpRPDconnectToPostgreSQL.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_c_SetUpRPDconnectToPostgreSQL.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4248, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Configuring to connect to the Reports database - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring to use Reports / Configuring to connect to the Reports database\nConfiguring to connect to the Reports database\nRICOH ProcessDirector stores the data collected by data collectors and WritePropsToReportsDatabase steps in a PostgreSQL database.\nThe easiest way to set up the Reports database is to use the instance of PostgreSQL installed with RICOH ProcessDirector. If you choose this\noption, at the end of this procedure, the application creates a new PostgreSQL database system and database to store the collected data.\nNote: If you use IBM DB2 as your main database and want to use the PostgreSQL database installed with RICOH ProcessDirector with the\nReports feature, you must install Docker Engine on your primary computer. The PostgreSQL database provided with RICOH ProcessDirector\ncomes in a Docker container. If you do not want to install Docker Engine, you can use a PostgreSQL database installed independently.\nIf you cannot or do not want to use the PostgreSQL provided with RICOH ProcessDirector, you can install your own PostgreSQL. This instance can\nbe installed on the primary computer or on another computer in your network. If you choose this option, create a PostgreSQL database system, a\ndatabase, and a database user ID before you start this procedure. Make sure the correct ports are open to permit communication between the\nsystems. For download and installation instructions, refer to these links:\nhttps://www.postgresql.org/download/\nhttps://www.postgresql.org/docs/\nTo change the database after it is created, such as to move it to a different server or to connect to a centrally managed PostgreSQL database in\nyour production environment, you must create the new database outside of RICOH ProcessDirector. Then, you can update the database settings\nin RICOH ProcessDirector to connect to the new database.\nTo configure to connect to the Reports database:\n1. Click the Administration tab.\n2. In the left pane, click Reports ⇒ Database Settings.\n3. Set the PostgreSQLserver IP address or host name property to communicate with the database.\nIf you are using the PostgreSQL provided by RICOH ProcessDirector, set the value to: localhost\nIf you are using a PostgreSQL outside of RICOH ProcessDirector, set the value to the IP address or host name of the system the database is\ninstalled on.\nNote: Even if you install this database on the primary computer, do not set the value to localhost. Use the IP address of the\nprimary computer.\n4. Review the current values for the other properties and make any required updates.\nTo see information about any of the properties, click the question mark button next to the property name.\n5. Click SAVE.\nNote:\nRICOH ProcessDirector does not collect data during job processing until you enable data collection and also enable one or more\nData Collectors or add a WritePropsToReportsDatabase step to a workflow.\n6. When you are certain that the database settings are correct, click the Data Collection switch at the top of the Database Settings page and\nclick Save to enable data collection.\nIf you use the RICOH ProcessDirector PostgreSQL, the first time you enable data collection, the database is created using the property\nvalues that you specified. If you use a different PostgreSQL, the application connects to the database you created.\nDisabling data collection disconnects RICOH ProcessDirector from the database. Enabling data collection re-establishes the connection.\nNote:\nUpdating properties on this page does not update the database. You must use PostgreSQL metacommands or another interface to make\nchanges to the database, then update these properties to match.\nFor example, your corporate guidelines require all passwords to be reset every 90 days. To update the password that RICOH\nProcessDirector uses to access the PostgreSQL database, you must:\n1. Update the password in the database using metacommands or a separate user interface.\n2. Update the password on the Database Settings page.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Configuring to connect to the Reports database - Jenski - Test portal- RPD Linux\nParent topic: Configuring to use Reports\n2 of 2"}]}