{"doc_name": "barcode_IMBreplacedata_tab.pdf", "doc_path": "data/raw/RPD-en-US/barcode_IMBreplacedata_tab.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3389, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Data tab for IMBs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Replacing POSTNET barcodes with IMBs\n/ Data tab for IMBs\nData tab for IMBs\nOn the Data tab, you specify the data that AFP Editor encodes in the barcode symbol for Intelligent Mail barcodes (IMBs).\nFields on the Data tab for IMBs\nField Value Description\nBarcode ID* 00 - 50 Optional Endorsement Line (OEL) sort level and exception handling.\nService type ID* 040 - 782 Type of mail and any mail services requested.\nMailer ID* 0, 6, or 9 digits A 6 or 9-digit mailer ID obtained from the United States Postal Service (USPS).\nNote: You can use the Mailer ID field for other purposes in an IMB used for\nreply mail.\nSerial number* A 6- or 9-digit serial number that identifies the mailpiece. The length depends on the number of digits specified\nfor mailer ID. The mailer ID and serial number together can contain 15 digits.\nNote: AFP Editor adds leading zeroes to the value in this field so that the value in the Mailer ID and Serial\nnumber fields together contain 15 digits.\nZeroes AFP Editor creates a serial number that contains zeroes. Mailers who use only the\nUSPS “Basic services” option can use serial numbers with zeroes.\nIndex tag The name of an index tag that contains the serial number.\nFile name The full path name of an IMB serial number file that contains the serial number to be\nencoded in the first barcode in the AFP file. AFP Editor increments the serial number\nin the file by 1 for each barcode.\nNote: For Linux, the serial number file must have the appropriate permissions\nset so that the RICOH ProcessDirector system user (aiw1 is the default) and all\nusers in the RICOH ProcessDirector group (aiwgrp1 is the default) can read and\nupdate the file.\nRouting code* The routing code (also called routing ZIP Code and delivery point ZIP Code) of the recipient. The routing code, if\none is specified, can contain 5, 9, or 11 digits.\nIndex tag The name of an index tag that contains the routing code. If no index tag name is\nspecified, AFP Editor does not encode a routing code in the IMB.\nNote: AFP Editor removes any non-numeric characters from the value in the\nindex tag before encoding it in the barcode symbol. For example, if the value\nof the index tag in a page group is “12345–6789”, the value in the barcode\nsymbol is “123456789”.\nPOSTNET data AFP Editor includes the same routing code as in the POSTNET barcode. The routing\ncode in the POSTNET barcode on the current page in the AFP file is displayed.\nCreate index tag Save Indicates that AFP Editor is to create an index tag that contains the data encoded in\nthe IMB in the page group. This option provides a record of the IMB data that you\ncan use to retrieve a mailpiece if, for example, the USPS reports an address change\nfor the mailpiece.\nIndex tag name The name to assign to the index tag that contains the IMB data. Any combination of\na-z, A-Z, 0–9, special characters, and blanks.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Data tab for IMBs - Jenski - Test portal- RPD Linux\nField Value Description\n*For more information about the values for these fields, see the Intelligent Mail® Barcode Technical Resource Guide.\nOther topics in this section:\nType tab for IMBs\nPosition tab for IMBs\nParent topic: Replacing POSTNET barcodes with IMBs\n2 of 2"}]}