{"doc_name": "not_o_NotifObj.pdf", "doc_path": "data/raw/RPD-en-US/not_o_NotifObj.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4053, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Notifications - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Notifications\nNotifications\nNotification objects define the events that cause the system to generate notifications. You can define any number of notification objects based\non the needs of your shop.\nEmail notifications send emails to specified individuals or groups based on the occurrence of specified events. The Archive feature adds history\nrecord notifications. History record notifications collect timestamps for job state changes. You can choose which changes to record and under\nwhat conditions, such as certain step names or workflows. The Web Services Enablement feature adds web service notifications. Web service\nnotifications call a web service when specific input device, job or printer events occur.\nEmail notifications\nWhen you create an email notification object, you can specify:\nThe event that causes the system to send the notification.\nThe subject line and content of the email that is sent, including variable inserts such as the input device name, printer name, job name, or other\nproperties.\nWho should receive the notification, including carbon copies and blind carbon copies.\nThe conditions that determine when the notification email is sent. For example, you can set up one notification object to monitor when a\nprinter enters the Needs attention state and send a notification email to one group if the printer problem occurs between 8:00 and 12:00. You\ncan define a different notification object to send the same email to a different user if the printer problem occurs after 12:00.\nA limit for the number of messages you want to receive within a specified time period.\nAfter you create an email notification object, you can use the Test function to check that the correct message was sent to the specified users.\nHistory record notifications\nWhen you create a history record notification object, you can specify:\nWhich job states are monitored.\nWhat changes to those job states trigger the object to write a history record.\nWhen the history records are written, they contain the following information:\nStep - The name of the step the job was in when the record was triggered.\nEvent type - One of three values you specified for a state change: ChangedTo, ChangedFrom, and Changes.\nState - The job state that is being tracked.\nPhase - The workflow phase the job was in when the record was triggered.\nWorkflow - The workflow processing the job.\nTime event occurred - The time the event occurred (as a timestamp).\nName - Name of the history record notification object that wrote the record.\nYou cannot see history records until you store them in an archive. To see the history records, from the Archive tab, specify the job and document\nproperties you used to write the history records in the repository and click Search. Click the ID of the result and then click the History tab to see\nthe data in the history records.\nWeb service notifications\nWhen you create a web service notification object, you can specify:\nThe URL of the web service that the notification communicates with.\nThe payload the web service passes to the external application.\nThe static credential or authentication request required to use the other application.\nWhen setting a static credential, the authentication request properties are not used. If you need to authenticate before calling the desired web\nservice, use the Authentication URL and Authentication payload properties.\nIf the web service uses a proxy to communicate through.\nThe event that causes the system to send the notification.\nThe conditions that determine when the notification web service call is executed. For example, you can set up one notification object to\nmonitor when a job completes printing and send a communication over web services to tell the application that submitted the job that it has\nprinted. You can request that the web service call only be sent if the job is from a certain customer or has a specific filename.\nParent topic: System objects\n1 of 1"}]}