{"doc_name": "aiwdoc_i_r_supportingmorelangs.pdf", "doc_path": "data/raw/RPD-en-US/aiwdoc_i_r_supportingmorelangs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2547, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Considerations for a system with more than one language - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Naming custom document properties in more than one language\n/ Considerations for a system with more than one language\nConsiderations for a system with more than one language\nIf you are using a language other than English on your system, or if you want to let users see user interface text for custom document properties\nin more than one language, you might need to do these tasks.\nIdentifying the code page in docCustomDefinitions.xml\nAt the top of the docCustomDefinitions.xml file, make sure you correctly identify the code page so that the file can be processed correctly when\nyou update configuration files. Here are some examples of valid code page declarations:\n<?xml version=\"1.0\" encoding=\"UTF-8\"?> (specified in the sample file)\n<?xml version=\"1.0\" encoding=\"iso-8859-1\"?> (Latin-1)\n<?xml version=\"1.0\" encoding=\"shift_jis\"?> (Japanese)\nMaking sure the document properties names files are in ISO-8859-1 format\nThe docCustomDefinitions.properties file and docCustomDefinitions_language.properties files must contain only Latin-1 or Unicode-encoded\n(\\udddd notation) characters. If you created your docCustomDefinitions.properties and docCustomDefinitions_language.properties files in a\ndifferent format (such as Shift JIS or UTF-8), you must convert each file to ISO-8859-1 before placing it in the /aiw/aiw1/config (UNIX-based\noperating systems) or C:\\aiw\\aiw1\\config (Windows) directory. Although you can convert the files using whatever method you choose, this\nsection describes one possible method: using the native2ascii utility.\nThe native2ascii utility converts text to Unicode Latin-1. It is shipped with RICOH ProcessDirector.\nOn Linux, the native2ascii utility is at /opt/infoprint/ippd/jre/bin.\nOn Windows, the native2ascii.exe utility is at C:\\Program Files\\Ricoh\\ProcessDirector\\jre\\bin.\nThe utility is also provided with the Java Development Kit, which you can download from this site:\nhttp://www.oracle.com/technetwork/java/javase/downloads\nInstructions for using the utility (for Java 6) are here:\nhttp://download.oracle.com/javase/6/docs/technotes/tools/#intl\nFor example, to convert a UTF-8 file named docCustomDefinitions-UTF8.properties, you can use this command:\nnative2ascii -encoding UTF-8 docCustomDefinitions-UTF8.properties > docCustomDefinitions.properties\nParent topic: Naming custom document properties in more than one language\n1 of 1"}]}