{"doc_name": "cptoutputpdf_c_WFforPDFwithMedia.pdf", "doc_path": "data/raw/RPD-en-US/cptoutputpdf_c_WFforPDFwithMedia.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4206, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating a workflow that transforms AFP or PostScript input to PDF output with media information - Jenski - Test portal- RPD Li…\nConfiguring\nConfiguring / Setting up datastream transforms / Configuring for the Advanced Transform feature\n/ Creating a workflow that transforms AFP or PostScript input to PDF output with media information\nCreating a workflow that transforms AFP or PostScript input to PDF output with media\ninformation\nIf you have installed the Advanced Transform feature, you can create a workflow that transforms AFP or PostScript input into PDF output. The\ntransform also generates a JDF job ticket that has media information, including page exceptions.\nTo create this workflow, you must have at least one of the following input transforms for the Advanced Transform feature:\nInputAFP\nInputPS\nTo create the workflow, you must also have the OutputPDF output transform.\nWhen the TransformToPDFWithMediaInfo step in the workflow generates the JDF job ticket, it uses the media names in the AFP or PostScript\ninput, for example, TRAY1. The media names in the JDF job ticket must match the names of RICOH ProcessDirector media objects. You can use\nany of these methods to make the media names match:\nYou can change the media names in the AFP or PostScript input.\nYou can create RICOH ProcessDirector media objects with the same names as the media names in the AFP or PostScript input.\nYou can create a media mapping file that maps the media names in the AFP or PostScript input to the names of RICOH ProcessDirector media\nobjects.\nIf any media name in the JDF job ticket is not defined as a RICOH ProcessDirector media object when the TransformToPDFWithMediaInfo step\nfinishes processing a job, the job goes into the error state. The Reason for wait status value is No matching media.\nTo create a workflow that transforms AFP or PostScript input to PDF output with media information:\n1. Click the Workflow tab.\n2. Right-click a workflow that you want to use as a model and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Add a step based on the TransformToPDFWithMediaInfo step template to the workflow.\n1. Make sure that you update the value of the Transform input stream property appropriately.\n2. To map the media names in the AFP or PostScript input to the names of RICOH ProcessDirector media objects, create a media\nmapping file.\nFor information about creating a media mapping file, see the related task topic.\n3. If you created a media mapping file, specify the full path and name of the file as the value of the Path to media mapping file\nproperty.\n4. If you are retrieving media information from an AFP data stream, edit the value of the Media information command property. Add\nthe -enablefdp argument between the input argument, -i, and the type argument, -type.\nThis example shows the edited command:\nperl ${AIWDATA}/bin/callxform.pl -C ${getControlFileName()} -i\n${getCurrentFile(${Job.Transform.InputStream})} -enablefdp -type xif -loglevel I -logdate -\nlogtime -logdir ${Job.SpoolFileStem}tmp -logfile ${Job.ID}.xif.log -verbose -relaxed -msg.add\nPSI3002 -remove abcefhilnoprst01234\nIf you are retrieving media information from a PostScript data stream, the command works without any edits.\n5. Update the other properties for the step with the values that you need.\n5. Update the properties for the other steps in the workflow with the values that you need.\n6. Save the workflow.\n7. Enable the workflow and test it.\nIn this section:\nMapping AFP or PostScript media names to RICOH ProcessDirector media names\nYou can create a media mapping file to map media names in the AFP or PostScript input to RICOH ProcessDirector media names. A step based\non the TransformToPDFWithMediaInfo step template uses the file when it transforms AFP or PostScript input into PDF output. The step creates a\nPDF file for the job and a JDF job ticket with media information, including page exceptions.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating a workflow that transforms AFP or PostScript input to PDF output with media information - Jenski - Test portal- RPD Li…\nParent topic: Configuring for the Advanced Transform feature\n2 of 2"}]}