{"doc_name": "pdfw_over_plugin_markup.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_over_plugin_markup.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3158, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Adding markup to a PDF file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Adding markup to a PDF file\nAdding markup to a PDF file\nYou use RICOH ProcessDirector Plug-in for Adobe Acrobat to add markup to a PDF file that represents your production PDF files. You mark up a\nPDF file by drawing a box around existing content or by drawing a box to add new markup. You can preview the PDF file as you add markup to\nverify its content and placement on specific pages. When you are done enhancing the sample PDF file, you save your changes to one or more\ncontrol files and make them accessible by a RICOH ProcessDirector server so it can apply the control files to production PDF files.\nBefore you add markup to a PDF file, you must define the page grouping for the documents in the PDF file. When previewing the page\nplacement of markup, you may not be able to view the placement or content that RICOH ProcessDirector applies to markup when processing\nyour RICOH ProcessDirector workflows. RICOH ProcessDirector Plug-in for Adobe Acrobat may not have access to all of the properties that you\nuse to define both page placement rules and markup content (such as in text and barcodes). See the help on previewing a PDF file for more\ninformation.\nWhen RICOH ProcessDirector applies markup defined in the control files that you specified in a BuildPDFFromDocuments step, RICOH\nProcessDirector applies the markup in this order:\nHidden areas\nImages\nText\nOMR marks\nBarcodes\nIn this section:\nAdding a barcode to a PDF file\nTo add a barcode to a PDF file, select the area where you want to place the barcode, specify a barcode type, and add content. You can limit the\nplacement of a barcode to specific pages in each page group by specifying a rule or typing page numbers.\nAdding OMR marks to a PDF file\nYou can add a variety of OMR marks of different height, width, and pitch to a PDF file. You can limit the placement of OMR marks to specific\npages in each page group by specifying a rule or typing page numbers.\nAdding an image to a PDF file\nYou can add JPEG images, such as a logo or an advertisement, to the PDF file. You can limit the placement of an image to specific pages in each\npage group by specifying a rule or typing page numbers. RICOH ProcessDirector Plug-in for Adobe Acrobat can process only JPEG files that are in\nRGB format; the CMYK format is not supported.\nHiding an area in a PDF file\nYou can hide an area of a PDF file by defining a cover block to keep an area on a page from being shown or printed when you process a\nproduction PDF file in RICOH ProcessDirector. You can limit the placement of a hidden area to specific pages in each page group by specifying a\nrule or typing page numbers.\nAdding text to a PDF file\nYou can add fixed text or variable text to a PDF file. You also can combine fixed and variable text in one text box. Fixed text is text that you type.\nVariable text is data from document properties, job properties, or statistics.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}