{"doc_name": "kdk_kodakpdfptr_bannerpgs.pdf", "doc_path": "data/raw/RPD-en-US/kdk_kodakpdfptr_bannerpgs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2522, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Setting up Kodak PDF printers to print PDF banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / PDF banner pages / Setting up Kodak PDF printers to print PDF banner pages\nSetting up Kodak PDF printers to print PDF banner pages\nKodak PDF printers can print PDF header pages and trailer pages for a job. Header pages print before the first data pages of a job. Trailer pages\nprint after the last data pages of a job.\nTo set up a Kodak PDF printer to print PDF banner pages:\n1. In the Printers Portlet, find the Kodak PDF printer that you want to use to print jobs with PDF banner pages. If the printer is enabled, right-\nclick it and select Disable.\n2. Click the printer name to open the properties notebook.\n3. Click the Banner Pages tab to display the banner page properties for the printer.\n4. Make sure that the desired banner pages are enabled for your printer:\nTo use header pages, set the Enable header pages property to Yes.\nTo use trailer pages, set the Enable trailer pages property to Yes.\n5. Specify values for the Merge banner pages into PDF print file and Banner page input tray properties.\n6. Click OK.\n7. Right-click the printer and select Enable.\n8. Repeat these steps for any other Kodak PDF printers that you want to set up to print banner pages with jobs.\nNote:\nFor header and trailer pages to print, the values of the Header copies and Trailer copies properties for the job must be set to 1 or greater.\nIf the values of those job properties are set to 0, the printer does not print a header page or a trailer page for a specific job, even if these\ntypes of banner pages are enabled on the printer.\nTo make sure that a job and its banner pages print together, set the Merge banner pages into PDF print file property to Yes. If you set it to\nNo, another job sent to the printer at the same time might print between the job and its banner pages.\nIf your job includes job-level stapling, the header page and trailer page are not merged to ensure that the job is stapled.\nYou can set the Merge banner pages into PDF print file property to Yes for jobs that include page exceptions for sides and media if your\nprinter supports these page exception. If you have other finishing options for your job, such as punching, set the property to No. If you\nare using Postscript, set the property to No.\nIf you print a PDF 2.0 file with banner pages, the file is converted to PDF 1.7 format which is required for the banner pages.\nParent topic: PDF banner pages\n1 of 1"}]}