{"doc_name": "aiw_defineAFPforTotalFlow.pdf", "doc_path": "data/raw/RPD-en-US/aiw_defineAFPforTotalFlow.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3650, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Defining an AFP Printer to send jobs to RICOH TotalFlow Print server - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Configuring to send jobs to a printer that uses RICOH TotalFlow Print server\n/ Defining an AFP Printer to send jobs to RICOH TotalFlow Print server\nDefining an AFP Printer to send jobs to RICOH TotalFlow Print server\nDefine an AFP printer that uses a RICOH TotalFlow Print server.\nTo send AFP jobs to a printer that uses RICOH TotalFlow Print server:\n1. Log in to RICOH ProcessDirector as a user authorized to create printers.\n2. Make sure that the AFP Support feature is installed.\n3. Click the Administration tab.\n4. In the left pane, click Devices ⇒ Printers.\n5. Click Add ⇒ AFP Printer.\n6. On the General tab, fill in values for all the required fields.\nIf you set up a secondary server that you want to use to drive this AFP printer, set these properties:\nPrinter server: The secondary server name\nCopy to secondary server: Yes\nDestination directory on secondary server: The location on the secondary server file system where you want RICOH ProcessDirector to\nwrite print files.\n7. To use the media loaded on the printer as a scheduling property for this printer, continue with the procedure for Configuring media for a\nRicoh TotalFlow printer.\n8. To use other properties to schedule jobs to this printer, click the Scheduling tab and set values for the properties that you want to use. If\nyou leave values blank, they match any value that is set in the corresponding job scheduling properties.\nNote: If you use Preset name as a scheduling property:\nThe value is not updated automatically. You must update it manually whenever the preset on the printer changes.\nThe value you set here is not transmitted to the printer.\nJobs that have a value for their Preset name property can be scheduled to this printer, but they do not request the preset when they\narrive at the printer. If your printer supports requesting a preset with the print job, do not use Preset name as a scheduling property.\nLeave this printer property blank.\n9. On all the tabs, fill in values for any of the optional fields.\nNote:\nThe default value for the Inactivity timer property is 300 seconds, so RICOH ProcessDirector releases the connection to the printer\nafter approximately 5 minutes of inactivity. To maintain the connection between RICOH ProcessDirector and the printer even when\nit is not actively printing, change that value to 9999.\nIf the Share printer connection property is Yes, the printer driver component of RICOH ProcessDirector releases control of the printer\nafter a period of inactivity so that the same physical printer can receive jobs from another input source, such as a hot folder. The\nIPDS printer connection timer property determines how long to wait before releasing control. The IPDS printer connection timer\nproperty must be less than the Inactivity timer property. If the IPDS printer connection timer property is greater than the Inactivity\ntimer property, RICOH ProcessDirector drops the connection before it can share the printer.\nThe default is that the printer driver reports status information in the language that you selected when you installed the RICOH\nProcessDirector server. To receive messages from this printer in a different language, set the Printer language property appropriately.\nThe default value for the Font fidelity property is Continue printing. Do not change this default if IPDS resolution is set to Automatic\nat the printer console.\n10. Click OK.\nParent topic: Configuring to send jobs to a printer that uses RICOH TotalFlow Print server\n1 of 1"}]}