{"doc_name": "InserterOverview.pdf", "doc_path": "data/raw/RPD-en-US/InserterOverview.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 10190, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Inserter and Quadient Inserter Express - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Inserter and Quadient Inserter Express\nInserter and Quadient Inserter Express\nThe Inserter features help to automate the insertion of printed documents and extra inserts (such as marketing materials) into envelopes. RICOH\nProcessDirector supports two features that support inserters: the full Inserter feature and the Quadient Inserter Express feature.\nBoth Inserter features:\nPrepare print jobs for insertion.\nWrite and send control files to inserter controllers.\nReceive results files from inserter controllers and interpret them to determine the insert status of each document in the job.\nAutomatically (or manually, with operator control) reconcile the job, and reprint any damaged documents.\nSupported inserters\nThe Inserter feature works with inserters from a wide range of manufacturers; the Quadient Inserter Express feature only works with Quadient\ninserters. They provide sample system objects and sample configuration files for inserters from these manufacturers:\nBowe\nBowe with JetVision camera systems\nBowe Bell & Howell\nGunther\nInserters with Ironsides camera systems\nKern\nPitney Bowes\nQuadient with the Automated Insertion Management System (AIMS) software.\nNote:\nThe Quadient Inserter Express feature only provides sample system objects and sample configuration files for Quadient inserters.\nPrerequisites\nTo use the Inserter features, first install a feature that supports document processing:\nFor PDF files, install the PDF Document Support feature.\nFor AFP files, install the AFP Support feature.\nFile requirements\nInput files must be either:\nPDF files for which you have defined page groups using RICOH ProcessDirector Plug-in for Adobe Acrobat.\nAdvanced Function Presentation (AFP) format, or a format that RICOH ProcessDirector can convert to AFP format. AFP page groups must define\nthe mailpieces in the file.\nWith the AFP Support feature installed, RICOH ProcessDirector automatically converts line data and mixed-mode files to AFP format.\nIf you have AFP Support and purchase the InfoPrint XT product, RICOH ProcessDirector converts Xerox metacode and Line Conditioned Data\nStream (LCDS) files to AFP format.\nIf you have AFP Support and purchase the Advanced Transform feature, RICOH ProcessDirector converts PostScript, PDF, or PCL data into an\nAFP format that is acceptable for use with AFP document processing functions.\nThe AFP Indexer mode of RICOH Visual Workbench creates page groups in AFP files created by InfoPrint XT or the Advanced Transform feature.\nThe Ricoh PostScript/PDF to AFP, PCL to AFP, and SAP to AFP Transform features convert input files into AFP image data files. These files do not\ncontain page groups. As a result, they cannot be used with the document processing functions provided in the AFP Support feature.\nWorkflow phase processing\nThe inserter features add the Insert phase to the RICOH ProcessDirector Workflow Editor. The figure Insert phase in the RICOH\nProcessDirector workflow, shows how the Insert phase fits into the existing phases.\nNote:\nIf you have customized phase names in your system, those phase names differ from the phase names in the diagram.\nInsert phase in the RICOH ProcessDirector workflow\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:23 PM Inserter and Quadient Inserter Express - Jenski - Test portal- RPD Linux\nA job that requires insertion is processed through the workflow phases, with some variations specific to inserting.\nReceive phase\nRICOH ProcessDirector accepts an input file for processing and creates a job in the system. It assigns the job a unique job number in the\nsystem.\nPrepare phase\nRICOH ProcessDirector creates page groups and extracts the values of document properties in AFP or PDF jobs.\nAssemble phase\nRICOH ProcessDirector processes the documents in the job:\n1. RICOH ProcessDirector assigns each document in the job a unique document number.\n2. RICOH ProcessDirector enhances the documents. For example, it hides existing insertion control marks and adds barcodes to control\ninsertion. The barcodes contain the values of document and job properties (such as the job number, document number, and the insert\nsequence number of the document).\nPrint phase\nRICOH ProcessDirector prints the job. The job header page is configured to include the job number, the inserter job name , and the name of\nthe inserter controller for the job. The inserter job name can be different from the job number.\nInsert phase\nRICOH ProcessDirector communicates with the inserter controller and reconciles the job after it completes insertion:\n1. If the inserter controller uses an inserter control file to control the insertion of documents in a job, RICOH ProcessDirector creates the\ninserter control file for the job and sends it to the inserter controller.\nNote:\nYou can configure RICOH ProcessDirector to create the inserter control file before printing the job. This setting is useful if the\ninserter operator loads the initial portion of a large job on the inserter before the job finishes printing.\n2. The inserter operator manually loads and runs the job on the inserter.\n3. RICOH ProcessDirector receives the inserter results file (if any) for the job and interprets it to determine which documents to reprint.\n4. RICOH ProcessDirector reconciles the job:\nIf the automatic reconciliation method is selected, RICOH ProcessDirector automatically reprints any damaged documents.\nIf the manual reconciliation method is selected, the operator uses the Reconcile function to review the list of damaged documents\nand indicate which documents to reprint. The operator can also mark individual documents as pulled (removed) from the job. Pulled\njobs are not reprinted.\n5. RICOH ProcessDirector reprints documents on the printer that the administrator selected for reprints or on the printer that the\noperator selected during manual reconciliation.\nIf the closed-loop reprint method is selected, RICOH ProcessDirector reprints the documents in the same job.\nIf the open-loop reprint method is selected, RICOH ProcessDirector creates a child job to reprocess the documents (for example, add\nnew barcodes) and print them.\nComplete phase\nIf jobs are retained on the system, the operator can reprint any documents that are damaged after the job completes reconciliation. Two\nmethods to reprint the documents are available:\nReconcile the job again. This method reprints the documents in the same job (closed-loop reprint method) or in a child job (open-loop\nreprint method).\nCreate a new job. If a Transform feature is installed, RICOH ProcessDirector can transform the documents to a different data stream and\nprint them on a suitable printer.\nStep templates\nThe Inserter feature adds several step templates:\nThe WriteInserterControlFile and SendInserterControlFile step templates let you create an inserter control file. The inserter control file tells the\ninserter controller how to process each document in a job and send the file to the inserter controller.\nThe SetInsertProperties step template lets you set document properties that are required for insertion.\nThe InsertJobs step template lets you track the insertion of documents into envelopes.\nThe CreateInserterReprints step template lets you process documents to be reprinted after insertion by creating a print file containing only the\nreprints.\nReconciliation method\nBoth the PDF Document Support and AFP Support features support manual reconciliation. When a job enters the Reconcile step, the operator\nselects the Reconcile action to start manual reconciliation for the job. Then the operator uses the Reconcile Job dialog on the RICOH\nProcessDirector user interface to request an action for each document in the job. To use manual reconciliation, set the Automatic reconciliation\nproperty on the Reconcile step to No.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:23 PM Inserter and Quadient Inserter Express - Jenski - Test portal- RPD Linux\nThe inserter features add support for automatic reconciliation. When a job enters the Reconcile step, RICOH ProcessDirector automatically\nreconciles the documents in the job and reprints any documents whose barcodes were not read. Operator action is required in these situations:\nThe documents to be reprinted exceed the percentage allowed for the job in the Maximum documents to reprint % property.\nThe inserter controller does not report a status for one or more documents in the job, and the Default insert status property of the inserter\ncontroller is not set.\nTo use automatic reconciliation, set the Automatic reconciliation property on the Reconcile step to Yes.\nIn this section:\nInserter control files\nFile-based inserter controllers use an inserter control file to control the insertion of the documents in the job. RICOH ProcessDirector can create\nan inserter control file for each job and send it to the inserter controller before the job is inserted.\nInserter results files\nAfter a job completes insertion, most inserter controllers write an inserter results file that contains the status of each document in the job after\ninsertion and other information related to insertion. RICOH ProcessDirector receives the inserter results file (or files) for each job from the inserter\ncontroller and interprets the information in the file to determine which documents to reprint and how to set job and document properties.\nInserter completion methods\nThe inserter completion method is how RICOH ProcessDirector determines when the inserter controller has finished inserting a job.\nInserter reconciliation methods\nRICOH ProcessDirector reconciles each job after the job finishes insertion. During reconciliation, RICOH ProcessDirector determines which\ndocuments in the job were damaged and need to be reprinted, and which documents to pull (remove) from the job. The reconciliation method\ntells RICOH ProcessDirector whether to reconcile damaged documents automatically, or manually with operator control.\nInserter reprint methods\nThe inserter reprint method is how RICOH ProcessDirector reprints documents that are damaged during insertion.\nParent topic: Document processing features\n3 of 3"}]}