{"doc_name": "avanti_c_ModifyWorkflow.pdf", "doc_path": "data/raw/RPD-en-US/avanti_c_ModifyWorkflow.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4544, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Modifying a workflow to send job information to Slingshot - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Modifying a workflow to send job information to Slingshot\nModifying a workflow to send job information to Slingshot\nTo send Avanti Slingshot the time required for the job to complete a single step or a series of steps, you must specify the Slingshot cost center\nand the milestone status for the single step or for the first and last steps in the series. By associating one or more steps with a cost center, you\nidentify all the time spent on processing by the cost center.\nYou do not need to associate all steps with Slingshot cost centers.\nWhen you choose the steps to modify in a workflow, make sure that a job goes through one step with a Slingshot milestone status property\nvalue of Complete for each Slingshot cost center that you want to report information to.\nBefore you modify a workflow, define the Avanti Slingshot Connect cost centers.\nTo modify a workflow to send information to Slingshot:\n1. Click the Workflow tab.\n2. Click the name of the workflow.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. For each single step whose job information you want to send to Slingshot (one-to-one mapping of step to cost center):\n1. Right-click the step and select Properties.\n2. For the Slingshot cost center property, select the Slingshot cost center that you want to report job information to.\n3. For the Slingshot milestone status property, select Complete.\n4. Click OK.\n5. For each series of steps whose job information you want to send to Slingshot:\n1. Right-click the first step in the series and select Properties.\n2. For the Slingshot cost center property, select the Slingshot cost center that you want to report job information to.\n3. For the Slingshot milestone status property, select In progress.\n4. Click OK.\nNote:\nFor the steps between the first and last steps in the series, you do not need to set the Slingshot cost center and Slingshot\nmilestone status properties. RICOH ProcessDirector reports the time a job spends in these steps to the Slingshot cost center\neven if you do not set the properties.\n5. Right-click the last step in the series and select Properties.\n6. For the Slingshot cost center property, select the same Slingshot cost center that you selected for the first step.\n7. For the Slingshot milestone status property, select Complete.\n8. Click OK.\n6. Save and enable the workflow.\n7. When the workflow processes a job, check to see if the job information is sent to the specified cost center in Slingshot.\nNote:\nFor a typical implementation of Slingshot, you do these steps to exchange information with RICOH ProcessDirector. Your\nimplementation of Slingshot can have steps that differ from these steps.\n1. Log in to the Avanti Slingshot client.\n2. Navigate to System Setup ⇒ General ⇒ Integration Log.\n3. For the Slingshot job, you should see Export entries in the Type column for the JDF Type that Slingshot uses to send jobs to RICOH\nProcessDirector.\n4. If RICOH ProcessDirector successfully imports the job, you should see Import entries in the Type column with HTTP in the Method\ncolumn, Updating Job in the Purpose column, and Processing inbound JMF Status File for job in the Result Details column.\n5. On the Integration Log, click the arrow to the left of a Slingshot job.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Modifying a workflow to send job information to Slingshot - Jenski - Test portal- RPD Linux\n6. Click Edit ( ) to display the job record in Detail View.\n7. Review the Troubleshooting Details.\nYou should see processing information about the Slingshot cost center assigned to the RICOH ProcessDirector workflow steps or\nprinter.\nNote:\nThe External Device ID for the Slingshot cost center has the same name as the Avanti Slingshot Connect cost center.\n8. Navigate to CRM ⇒ Jobs.\n9. Select the Slingshot job.\n10. Click the Cost Summary tab.\nYou should see values in the Actual column.\n11. Click the Milestones tab.\nYou should see tasks for the Slingshot cost centers with check marks in the Done column.\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n2 of 2"}]}