{"doc_name": "creatingpagegroupsfixed.pdf", "doc_path": "data/raw/RPD-en-US/creatingpagegroupsfixed.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2648, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating page groups of fixed length - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating page groups\n/ Creating page groups of fixed length\nCreating page groups of fixed length\nYou can create page groups that are of fixed length. This is useful if all page groups in the AFP file always consist of the same number of pages.\nWhen you create fixed-length page groups, AFP Indexer can skip a certain number of pages at the beginning of the AFP file before creating the\nfirst page group.\nNotes:\n1. Some AFP files are formatted so that two pages print side-by-side on the same physical sheet and are later cut into two separate stacks.\nYou cannot use AFP Indexer to define page groups in files such as these because a single sheet can belong to only one page group.\n2. You cannot define supplemental pages for pages in a page group that is created as a fixed-length page group.\nTo create page groups of fixed length:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. Click Tools ⇒ Other Page Groups ⇒ Create Fixed-Length Page Groups.\nYou might see a message that says the page groups and indexes might change or be invalid and asks if you want to continue. Click Yes.\nYou see the Create Fixed-Length Page Groups window.\n3. Select the number of pages in each page group in the Pages in each page group field.\n4. Click Header/Trailer Definition to specify which pages are header and trailer pages and then click OK.\n5. Click OK.\nIn the left pane and in the bottom pane, you see the page groups that have been defined based on the number of pages you specified.\nYou also see the pages that are included in each page group.\nIf you defined header and trailer pages and decided to keep the pages in the output, you see header pages preceding the page groups in\nthe left pane and trailer pages following the page groups. If you decided not to keep the header and trailer pages in the output, you do\nnot see those pages in the left pane.\n6. Verify that the correct page groups have been created:\n1. Check that the number of pages is correct in each page group.\n2. Select page groups in the left pane to see the first page in a few of the page groups and verify that the correct boundaries were\ncreated.\n3. If the page groups are incorrect, either repeat the steps to recreate the fixed-length page groups, or use triggers to create page\ngroups of variable length.\nWhen you create page groups using triggers, the page groups of fixed length are removed.\nParent topic: Creating page groups\n1 of 1"}]}