{"doc_name": "aiw_sdk_pages.sets.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_pages.sets.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4346, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Pages in sets - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / Pages in sets\nPages in sets\nWhen the batching method is Pages in sets, the hot folder or SFTP input device submits one or more jobs after a set of PDF files with a specified\npage count is received by the in put device. This method is only valid for PDF files.\nFor a set to be complete, all of these conditions must be true:\nA file matching the value in the Data patterns property is present.\nIf a value is entered for the Overrides patterns or JDF patterns properties, a file matching one or both of those values is present.\nIf there are any entries specified for File patterns, a file matching each value is present.\nThe hot folder or SFTP input device examines the PDF files as they arrive and determines how many pages they contain. The hot folder or SFTP\ninput device maintains a count of the total number of PDF pages in complete sets currently in the input device. When the total number of PDF\npages in complete sets matches or exceeds the value set for the Number of pages to batch property, the hot folder or SFTP input device submits\nthe sets as a group with one set in each child job. If the Create .zip file property is set to Yes, a single job containing all of the files in all of the\nsets is submitted in ZIP file format.\nThe set containing a PDF file that makes the total number of pages exceed the value set for the Number of pages to batch property is only\nincluded in the group if the Exceed pages to batch property is set to Yes. If the Exceed pages to batch property is set to No, this set remains in\nthe hot folder or SFTP input device as the first set for the next batch.\nIf a single set contains more pages than the value set for the Number of pages to batch property and the Exceed pages to batch property is set to\nYes, the set is submitted for printing, either as a batch with the rest of the sets that are waiting to print or as a batch that contains only one data\nfile. However, if the Exceed pages to batch property is set to No, the set cannot be submitted. Processing for the hot folder or SFTP input device\nstops until that input file is deleted, the value of the Number of pages to batch property is increased to at least the number of pages in the set,\nor the Exceed pages to batch property is changed to Yes so the set can be submitted.\nNote:\nThe Pages in sets batching method does not support sets with encrypted or password-protected PDF files. If a set with an encrypted or\npassword-protected PDF file is submitted to a hot folder or SFTP input device that uses the Pages in sets batching method, RICOH\nProcessDirector issues an error message because it cannot open the file to count the number of pages.\nWhen you use the Pages in sets batching method, set these input device properties as indicated:\nWorkflow: ParentNoPrint\nChild workflow: The workflow that is appropriate for the print files in the job.\nSubmit step: SubmitInputFiles\nCreate .zip file: If this property is set to Yes, all of the files are combined as a ZIP file and submitted as a single job. If this value is set to No, each\nset is submitted as a child job.\nNumber of pages to batch: The number of pages that the hot folder or SFTP input device waits to receive before submitting the files as a single\ngroup.\nExceed pages to batch: If this property is set to Yes, a PDF file that contains enough pages to make the total number of pages in the hot folder\nor SFTP input device exceed the value set for Number of pages to batch property will be submitted with the rest of the files. If this property is\nset to No, this file will remain in the hot folder or SFTP input device as the first set of pages for the next batch.\nData patterns: A pattern that matches PDF file names, such as .*pdf$ or .*PDF$.\nFile Patterns: A collection of patterns that can define files that are required to be included in a set.\nJDF patterns: One or more pattern-matching strings used to identify Job Definition Format (JDF) job tickets. If this property has a value specified,\na JDF job ticket is required for the set to be complete.\nOverrides patterns: One or more pattern-matching strings used to identify files that contain values for job properties.\nParent topic: Batching methods\n1 of 1"}]}