{"doc_name": "callcenter_o_runsamplewf.pdf", "doc_path": "data/raw/RPD-en-US/callcenter_o_runsamplewf.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2200, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Running the Electronic Presentment sample workflow - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Electronic Presentment / Running the Electronic Presentment sample workflow\nRunning the Electronic Presentment sample workflow\nThe Electronic Presentment feature provides a sample workflow that stores data in a sample repository.\nThe sample objects and files used in this workflow include:\nWorkflow: ElectronicPresentmentSample\nSample input device: ElecPresFolder\nSample history record notification: EPSampleHistory\nSample repository: ElecPresRepository\nSample PDF files: /aiw/aiw1/testfiles/ElecPresDemo.pdf and ElecPresDemo2.pdf\nSample PDF control file: /aiw/aiw1/testfiles/ElecPresDemo.ctl\nTo run the sample workflow:\n1. Log in to RICOH ProcessDirector.\n2. Click the Main tab.\n3. In the Printers portlet, select the Sample printer and click Actions ⇒ Enable.\n4. On the Input Devices portlet, select the ElecPresFolder hot folder input device and click Actions → Enable and Connect.\nThe first time you try this procedure, RICOH ProcessDirector immediately submits the ElecPresDemo.pdf and ElecPresDemo2.pdf jobs to the\nElectronicPresentmentSample workflow.\nWhen the jobs reach the ToMailroom step, which is based on the Wait step template, they are held for two minutes to simulate the time\nrequired to process jobs in the mailroom.\n5. In the Jobs table, find the jobs and check to see that the value in the Phase column for each job is Complete.\nThe ElecPresDemo.pdf and ElecPresDemo2.pdf files and their documents are now stored in the ElecPresRepository repository.\n6. Click the Archive tab.\n7. In the Search portlet, select the ElecPresRepository repository.\n8. Select Address block line 1 from the Property drop-down menu, = (equal to) from the Comparison drop-down menu, type Myrna Donald\nin the Value field, and click Search.\nThe Results table displays two statements for Myrna Donald.\nThe functions that store data in a repository, search for the data, and display it on the Archive page of the RICOH ProcessDirector user interface\nare part of the Archive feature.\nParent topic: Electronic Presentment\n1 of 1"}]}