{"doc_name": "aiw_c_PrepToSumbitWebservice.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_PrepToSumbitWebservice.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3060, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Preparing to submit jobs using web services - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit jobs using web services\nPreparing to submit jobs using web services\nRICOH ProcessDirector provides a REST web service utility that you can use to submit jobs. If you can configure your application to use REST web\nservices, you can use the submitFile utility to submit a file to a workflow or hot folder.\nDepending on the requirements of your web service application, you need either a Curl command or Request URL to invoke the web service. Use\nthe RICOH ProcessDirector REST API documentation to determine the correct syntax.\nTo prepare to submit a job using a web service:\n1. Decide how RICOH ProcessDirector receives the file for processing.\nYou can submit a file to RICOH ProcessDirector using a hot folder input device or you can submit directly to a workflow.\nSubmit files directly to a workflow when there is only one input file per job or you do not need to use the batching functions available in\nRICOH ProcessDirector.\nSubmit files to hot folders when you want to use the batching functions in RICOH ProcessDirector. You can only submit one file at a time\nwith the web service. If a job has multiple input files, including job tickets, list files, or other resources, you must invoke the web service\nfor each file.\nNote the name of the workflow or hot folder.\n2. Evaluate your web service application and see what information the application requires to submit a file to RICOH ProcessDirector.\nThe RICOH ProcessDirector REST API documentation provides both a Curl command and a Request URL. Either can be used depending on\nwhat your web service application requires.\n3. Use the RICOH ProcessDirector REST API documentation for the submitFile utility to help create the web service calls to submit your file.\nOpen a web browser and enter your RICOH ProcessDirector host name or IP address into the address bar. Add /restapi/ to the end of\nyour host name or IP address to access the REST API documentation. For example: http://hostname:15080/restapi/.\nOpen the util section and find POST /util/ submitFile/{objectType}/{name}.\n4. Update your web service application with the command or URL that you developed in previous step. Use the application to submit one or\nmore files to RICOH ProcessDirector.\n5. Verify that your web service application is configured correctly to submit a file to RICOH ProcessDirector.\nIf you submit to a hot folder, verify that the file is in the folder location in the hot folder. Connect and disable the hot folder if you want\nto check that the files are received in the correct directory without actually submitting the job. If you want the input device to submit the\njob, make sure it is both enabled and connected when your application submits the file.\nIf you submit to a workflow, verify that a job is created with the file you submitted. Make sure the workflow is enabled when you submit\nthe file.\nParent topic: Preparing for job submission\n1 of 1"}]}