{"doc_name": "vwb_HideAreas.pdf", "doc_path": "data/raw/RPD-en-US/vwb_HideAreas.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5665, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Creating hidden areas with AFP Enhancer - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Creating hidden areas with AFP Enhancer\nCreating hidden areas with AFP Enhancer\nYou can hide areas in AFP files that you do not want RICOH ProcessDirector to display or print. For example, you can hide an area that contains a\nbarcode before you create a new barcode in the same place.\nThe hidden area must be in a consistent position on every page and must be a consistent size. To determine the exact position and size of the\nhidden area, first print the sample AFP file on the production printer and measure where you want to place the top-left corner of the hidden area\non the printed page.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo create a hidden area:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the file does not contain page groups, use AFP Indexer to create page groups.\n3. Click Mode ⇒ AFP Enhancer.\n4. Navigate to the page where you want to create the hidden area:\nTo place a hidden area on the same page in every page group, navigate to that page in any page group.\nTo place a hidden area on multiple pages, navigate to one of the pages in any page group.\n5. Position your cursor at a corner of the hidden area. While pressing the left mouse button, draw a box the approximate size of the hidden\narea.\nIn a later step, you can specify the exact position and size of the hidden area.\n6. Right-click anywhere in the AFP file and click Hide Area.\n7. On the General tab, type a descriptive name for the area in the Hidden area name field.\nFor example, if the hidden area contains a barcode for a ZIP Code, the name could be “ZIP Code”.\n8. Select the color of the area in the Color field.\n9. Click the Rectangle tab.\n10. Specify the exact origin (top-left corner) of the hidden area in these fields. Specify the values in inches or millimeters.\nX\nThe horizontal distance of the left side of the hidden area measured from the left side of the logical page (not the physical sheet of\npaper). Decimal values (such as 2.5) are allowed. The X position cannot be greater than the width of the page.\nY\nThe vertical distance of the top of the hidden area measured from the top of the logical page (not the physical sheet of paper).\nDecimal values (such as 2.5) are allowed. The Y position cannot be greater than the height of the page.\nThe initial values of these fields are the X and Y distances of the top-left corner of the box that you drew.\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the page in the unrotated view.\n11. Specify the exact bottom-right corner of the hidden area in these fields. Specify the values in inches or millimeters.\nX-extent\nThe horizontal distance of the right side of the hidden area measured from the left side of the logical page (not the physical sheet of\npaper). Decimal values (such as 2.5) are allowed. The X-extent position cannot be greater than the width of the page.\nY-extent\nThe vertical distance of the bottom of the hidden area measured from the top of the logical page (not the physical sheet of paper).\nDecimal values (such as 2.5) are allowed. The Y position cannot be greater than the height of the page..\nThe initial values of these fields are the X and Y distances of the bottom-right corner of the box that you drew.\nNote: Specify the bottom-right corner of the hidden area in the unrotated view.\n12. Optional: Specify the Right Rectangle (CEL) values: the top-left and bottom-right corners of the hidden area on right-hand pages. Specify\nthe X, Y, X-extent, and Y-extent values in inches or millimeters.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Creating hidden areas with AFP Enhancer - Jenski - Test portal- RPD Linux\nNote:\nIf you do not specify values for the Right Rectangle (CEL) fields, AFP Enhancer uses the values in the Rectangle (CEL) fields for all\npages.\nUse values in both the Rectangle (CEL) and Right Rectangle (CEL) fields if 2–up is enabled and the Page Placement value is All Fronts\nLeft And Right.\n13. Specify the pages on which to place the hidden area in each page group.\n14. Optional: Specify a trigger using a CEL expression.\nExamples:\nYou want to place the hidden area on every document with two or more pages. Use this expression:\ntotal_pages_in_mp != 1\nYou want to place the hidden area on each document sent to California that has yes as the value of the Doc.Custom.PolicyDiscount\ndocument property. Use this expression:\nand(Doc.State == CA, Doc.Custom.PolicyDiscount == yes)\n15. Click the Preview tab.\n16. Optional: Change any combination of values for the X position, Y position, Width, and Height fields.\nThe Origin of area values show the X and Y positions of the upper-left corner of the hidden area you drew. The Width and Height values\nshow the horizontal and vertical distances from the upper-left corner to the bottom-right corner of the hidden area you drew.\nNote: The values on the Preview tab are used to display the hidden area in RICOH Visual Workbench. They do not change when you\nchange the values on the Rectangle tab. The values on both tabs are saved in the Visual Workbench control file. Only the values on\nthe Rectangle tab are exported to the EnhanceAFP control file and used to place the hidden area on the documents in the AFP file.\n17. Click OK.\nYou do not see any text or image data in the hidden area in each page group.\nParent topic: Working with sample AFP files\n2 of 2"}]}