{"doc_name": "aiwastartingstopping.pdf", "doc_path": "data/raw/RPD-en-US/aiwastartingstopping.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2263, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Starting and stopping servers - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / RICOH ProcessDirector servers / Starting and stopping servers\nStarting and stopping servers\nThe RICOH ProcessDirector base product and secondary servers can be configured to start and stop when the system they are installed on starts\nand stops. Application servers must always be started manually; they stop when the system they are installed on shuts down, but can also be\nstopped manually.\nYou might need to start or stop the base product, secondary servers, or application server without shutting down or restarting the system. You\nmust start and stop the base product and each remote secondary server individually.\nIn this section:\nStarting the base product and secondary servers\nRICOH ProcessDirector base product and secondary servers start automatically when the systems on which they are installed start. However, you\nmight need to start the base product or a secondary server without restarting the entire operating system.\nStarting an application server\nTo run processing steps on an application server, the application server must be running. If the application server is not configured as a service,\nyou must start the application server manually.\nStarting and stopping Docker and Podman container secondary servers\nDocker and Podman container secondary servers do not start and stop automatically when the computer they are installed on restarts or when\nyou run the startaiw or stopaiw commands. You must start and stop them separately.\nStopping the base product and secondary servers\nWhen you stop the RICOH ProcessDirector base product or a remote secondary server, you can stop the system with or without waiting for job-\nprocessing steps to complete. If you have the AFP Support feature installed, you can also choose whether to stop processes that were started by\nthe RICOH ProcessDirector printer driver component, by Download for z/OS, or by AFP Download Plus.\nStopping an application server\nYou can stop an application server through the Windows Start menu. Stopping the server prevents RICOH ProcessDirector from accessing any\nexternal programs on the Windows system.\nParent topic: RICOH ProcessDirector servers\n1 of 1"}]}