{"doc_name": "openingafpfiles.pdf", "doc_path": "data/raw/RPD-en-US/openingafpfiles.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5221, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Displaying sample AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Displaying sample AFP files\nDisplaying sample AFP files\nYou can open a sample AFP file in RICOH Visual Workbench. The sample AFP file must be representative of production AFP files that you want to\nenhance in the same way as the sample file.\nFor example, if the AFP file contains text that you want to use in an index tag or in barcode data, choose a sample file that contains that text in\nthe same position on the page as the production AFP files.\nYou can open one AFP file in RICOH Visual Workbench at a time. If an AFP file is already open, RICOH Visual Workbench automatically closes it\nand prompts you to save its control file if you have not already done so. After you open an AFP file, you can rotate the view, display selected\npages, display different views, and increase the display size.\nYou can display the properties of page groups, pages, text, and AFP objects (such as page segments and overlays) in the AFP file. Page-group\nproperties include the index tag values. Page properties include the type of AFP objects that are on the page, including page-level indexes. Text\nproperties include font information and the location (in inches or millimeters) of the text.\nNote:\nIf some text does not display correctly, you might need to identify the directory that contains the font resources to RICOH Visual\nWorkbench, or you might need to modify RICOH Visual Workbench font mapping.\nTo display a sample AFP file:\n1. Click File ⇒ Open AFP file. You see the Open window.\n2. Select the AFP file that you want to open and click Open.\nYou see the AFP file in the right pane of the user interface. You also see the Open Control File window with the message: Do you want\nto use an existing control file for this AFP file?\n3. Do one of these:\nTo create a control file, click No. If the AFP file contains index tags, you see the index tags in the bottom pane; otherwise, the bottom\npane is blank.\nTo display the file using an existing control file, click Yes. This is recommended if you have previously created a control file for this sample\nAFP file. You see the Open window:\n1. Select the control file that you want to use.\n2. Click Open. If the control file contains definitions for index tags, or if the AFP file contains index tags, you see the index tags in the\nbottom pane; otherwise, the bottom pane is blank.\nTo the left of the AFP file, you see the page structure of the file, which can contain page groups and pages. You might also see a resource\ngroup entry at the top of the page structure if the file contains inline AFP resources, such as overlays and page segments.\n4. To rotate the AFP file clockwise by 90 degrees, click View ⇒ Rotate by 90o. Click again to rotate another 90 degrees.\n5. To navigate in the AFP file, do one of these:\nClick anywhere in the AFP file and press the Page Up or Page Down key on your keyboard.\nDouble-click to select a page from the left pane.\nDouble-click to select a page group from the bottom pane.\n6. To hide or display the page structure in the left pane, click View ⇒ File View.\n7. To hide or display the indexes in the bottom pane, click View ⇒ Index View.\n8. To increase or decrease the display size of the AFP file, click View ⇒ Zoom ⇒ nnn (nnn is one of these percentages: 200, 175, 150, 125,\n100, 75, 50.)\nThe display size of the AFP file is increased or decreased by the percentage you select.\n9. To change units of measurement, do one of these:\nFor inches, click View ⇒ Units ⇒ Inches.\nFor millimeters, click View ⇒ Units ⇒ Millimeters.\n10. To display properties:\n1. Do one of these:\nIn the left pane, click a resource, page group, or page. Right-click and click Properties.\nClick Mode and a feature. Then:\n1. Click text or an object in the AFP file. You see a red box around the text or object you selected.\nNote:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Displaying sample AFP files - Jenski - Test portal- RPD Linux\nIf you cannot select an object, it is not enabled for selection. See Enabling object selection in sample AFP files.\n2. Right-click and then click Properties.\nA green box around a property value indicates that there is more text than what is displayed.\n2. To see the complete text for a value:\n1. Double-click the green box.\n2. Click OK.\n3. To close the Properties window, click X in the upper right corner.\n11. If text does not display correctly:\nIf the AFP file contains data that displays incorrectly, change the default code page to another code page (Resources ⇒ Modify Default\nEncoding). For example, an ASCII code page is IBM850(GID=850) and an EBCDIC code page is IBM500(GID=500).\nIf the AFP file refers to AFP fonts that are not inline, identify the directories that contain font resources to RICOH Visual Workbench\n(Resources ⇒ Specify Resource Directories).\nIf the AFP file refers to custom AFP fonts, create custom font-mappings in RICOH Visual Workbench.\n12. If an error occurs when opening or working with a file, click File ⇒ Reset, which closes the file and clears the cached resources from\nmemory. Open the file again.\nParent topic: Working with sample AFP files\n2 of 2"}]}