{"doc_name": "aiw00cmed.pdf", "doc_path": "data/raw/RPD-en-US/aiw00cmed.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2510, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Defining media objects - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring media / Defining media objects\nDefining media objects\nMedia objects represent the paper, forms, or envelopes that jobs are printed on. RICOH ProcessDirector uses them to schedule jobs to printers.\nRICOH ProcessDirector has two types of media object:\nSystem media\nRepresents the media that is specified for jobs and that can be used for all printers.\nPrinter media\nRepresents the media that is used with a specific printer.\nSystem media and printer media might have different names for the same physical media. If the media names are different, you can create a\nmedia mapping to indicate that they represent the same physical media. For most printer types, you set the Media to use property to specify\nwhich media names to send to that printer with jobs.\nRICOH ProcessDirector can create media objects automatically if your printer can detect media information. RICOH ProcessDirector also provides\nseveral system media objects. You can make modifications to the properties of any of these media objects and use them in the installation. You\ncan also copy them to create new media objects.\nIn this section:\nCreating media objects automatically\nIf you are using a Ricoh PDF printer or if your printers can detect media information and send it over SNMP or JMF, you can have RICOH\nProcessDirector create media objects automatically. The only printer type that cannot detect media information is a PCLOut printer. PCLOut\nprinters come with the AFP Support feature.\nCreating media objects manually\nWhen you need a media object that has several different properties from the supplied or existing media objects, you can create a new one.\nUsing supplied media objects\nRICOH ProcessDirector provides several predefined system media objects. You can modify the properties of the predefined media objects and use\nthem in your environment.\nCopying media objects\nYou can copy a media object so you can use it as a template for creating another media object. Copying media objects can save you time,\nespecially when you need to create several media objects with similar properties.\nUsing media with electronic forms\nMedia objects can include electronic forms. Electronic forms let you print jobs that previously required preprinted forms on plain paper. You\nassociate a PDF page representing the electronic equivalent of preprinted form data with each side of a media object.\nParent topic: Configuring media\n1 of 1"}]}