{"doc_name": "aiw00c21.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c21.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2959, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Using supplied input devices - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining input devices / Using supplied input devices\nUsing supplied input devices\nRICOH ProcessDirector provides several predefined input devices. If your print environment is simple and does not require many input devices,\nyou can modify the properties of the predefined input devices and use them in your environment.\nTo modify and use a supplied input device:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Input Devices.\n3. Select the input device that you want to modify.\n4. Click Properties.\n5. On all the tabs, change the required and optional properties that need to be adjusted to match your environment. Each input device must\nhave a unique path for its Folder location and Staging location properties.\nNote:\nIf you have the AFP Support feature installed and submit jobs to Download input devices:\nMore than one Download input device can use the same port number, but you can only enable one of the input devices with the\ncommon port number at any time.\nWhen Download for z/OS is running in multiple data set mode with Exit 15, each Download input device can receive jobs from\nonly one Download for z/OS functional subsystem application (FSA).\n6. Determine how you want the input device to assign the workflow for each job.\nWhen using SubmitInputFiles as the submit step for the input device, you can select one of these:\nSet the Child workflow initialization step property to Not set and set the Child workflow property to the name of an existing workflow to\nassign the same workflow to every job that this input device processes.\nSet the Child workflow initialization step property to SetJobTypeFromRules and use the Child workflow parsing rules property to specify\nthe name of the control file that can set the workflow from a value of an option of the print command.\nRICOH ProcessDirector provides a sample control file that is used to set the workflow: receive_lpd_pdf_jobtype.cfg. The AFP Support\nfeature provides these sample control files that are used to set the workflow: receive_jcl_jobtype.cfg and\nreceive_lpd_jobtype.cfg. The sample control files are installed in the /aiw/aiw1/samples/rules/ directory. You can copy a sample\ncontrol file to the /aiw/aiw1/control_files/rules/ directory and modify it to meet your needs, then update the value of the Child\nworkflow parsing rules property to point to your file.\nSet the Child workflow initialization step property to SetJobTypeFromFileName and use the Child workflow pattern property to specify the\nstring that RICOH ProcessDirector should look for in the input file name and use as the workflow name. If you use this method, you must\nmake sure that a workflow with the corresponding name exists.\n7. Click OK.\n8. To use the modified input device, select it and click Enable, then select it again and click Connect.\nParent topic: Defining input devices\n1 of 1"}]}