{"doc_name": "reportsPostgresql_c_ReportsCleanup.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_c_ReportsCleanup.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2453, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Removing expired data from the Reports database - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring to use Reports / Removing expired data from the Reports database\nRemoving expired data from the Reports database\nData collectors store valuable information about your printing operations. However, at some point, the information is no longer useful and can\nbe deleted. You can create a schedule for removing expired data from your database tables.\nDepending on how long you want to keep the data collected by each data collector, you must set up a retention period. When the retention\nperiod expires, the data is not deleted immediately. The expired data is deleted during the next scheduled process for removing expired entries.\nThe automatic process of removing the expired entries is scheduled to start at a specific date and time. You can also select how often this\nautomatic process runs, by setting an interval and a frequency.\nTo remove expired data from the Reports database:\n1. Click the Administration tab.\n2. In the left pane, click Reports ⇒ Data Collectors.\nTo check or set the retention period for the data collectors:\n1. Click one of the data collectors.\n2. Find Remove expired entries and set the value to On.\n3. Set the retention period for the database entries.\n4. Click OK.\n5. Repeat the steps for the remaining data collectors.\n3. In the left pane, click Reports ⇒ Database Settings to set the automatic schedule for removing all expired database entries.\n4. Use the Interval and Frequency properties to set how often to run the automatic process of removing the expired database entries.\n5. Use the Start date and time property to select when to start the schedule.\n6. Click SAVE.\nExample:\nYou create reports on the first work day of each month and want to remove expired information from the database on the fifth day of each\nmonth. To avoid increased processing load on your system, you want to run that process at 1:00 AM. To set up a schedule for removing expired\ndatabase entries once a month:\nSet a retention period for the individual collectors. After the retention period, the database entries are only marked as expired.\nOn the Database Settings page, set the Removal Schedule:\nSet the Interval to Month.\nSet the Frequency (months) to Every month.\nSet Start date and time to the fifth day of the next calendar month and the time to 1:00 AM.\nParent topic: Configuring to use Reports\n1 of 1"}]}