{"doc_name": "creatingwsdefavail.pdf", "doc_path": "data/raw/RPD-en-US/creatingwsdefavail.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4847, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating definitions for known white space - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Adding content to white space in AFP files\n/ Creating definitions for known white space\nCreating definitions for known white space\nYou can create a definition for white space that you know exists on the same page in all page groups.\nAreas with overlays, page segments, barcodes, and images are considered available white space and you can create a white space definition over\nthem. However, this is not recommended unless you want the content to merge with the existing content.\nThe white space area is only defined on the current page of the page group.\nNote:\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo create a known white space definition:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the file does not contain page groups, use AFP Indexer to create page groups.\n3. Click Mode ⇒ Whitespace Manager.\n4. Select the page in the page group where you want to define white space.\n5. Position your cursor at a corner of the area where you want to define white space. While pressing the left mouse button, draw a box the\napproximate size of the white space area. You can draw a horizontal, vertical, or square box.\nIn a later step, you can specify the exact position and size of the white space area.\n6. Right-click anywhere on the page and click Using known white space.\nIf a white space area is already defined on the page, you see an error message. Otherwise, you see the White space tab in the Using known\nwhite space window with the page you selected displayed in the Current Page field.\n7. Type a name for the white space definition.\nGive the definition a descriptive name to distinguish it from other definitions.\n8. From the drop-down list, select which page you want the white space area added to:\nThis page\nAdds the white space area to the current page.\nLast page\nAdds the white space area to the last page. You can only select this option if the current page is the last page in the page group. You\nmight want to create a Last page definition instead of This page when the page groups contain a variable number of pages and you\nwant the white space to always be on the last page.\nIf a selection is grayed-out, it is the only one available.\n9. Optional: On the Position tab, change the origin (top-left corner) and size (width and height) of the white space area in inches or\nmillimeters. Decimal values (such as 2.5) are allowed.\nFields on the Position tab shows the fields on the Position tab.\nFields on the Position tab\nField Value Description\nOrigin of area: X position Any decimal value, such The horizontal distance (in inches or millimeters) of the left side of the white\nas 2.5. The X position space area measured from the left side of the logical page (not the physical sheet\ncannot be greater than of paper).\nthe width of the page.\nNote: If you rotated the AFP file using the Rotate by 90o option on the\nView menu, specify the X position from the top-left corner of the logical\npage in the unrotated view.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating definitions for known white space - Jenski - Test portal- RPD Linux\nField Value Description\nOrigin of area: Y position Any decimal value, such The vertical distance (in inches or millimeters) of the top of the white space area\nas 2.5. The Y position measured from the top of the logical page (not the physical sheet of paper).\ncannot be greater than\nNote: If you rotated the AFP file using the Rotate by 90o option on the\nthe height of the page.\nView menu, specify the Y position from the top-left corner of the logical\npage in the unrotated view.\nSize of area: Width Any decimal value, such The horizontal width (in inches or millimeters) of the white space area measured\nas 2.5. The width of the in the unrotated view.\narea cannot be greater\nthan the width of the\npage.\nSize of area: Height Any decimal value, such The vertical height (in inches or millimeters) of the white space area measured in\nas 2.5. The height of the the unrotated view.\narea cannot be greater\nthan the height of the\npage.\n10. Click OK.\nYou see the defined white space area displayed as a colored box.\n11. Verify that the correct white space area has been defined:\n1. In the bottom pane, click the White spaces tab.\n2. Expand a page group and double-click the white space definition.\nYou see a rectangle box highlighting the white space area on the page you selected.\n3. If the white space area is incorrect, modify or delete it (Tools ⇒ Modify Definitions).\n12. Optional: To create another white space definition, go to step 4 and repeat the steps.\nParent topic: Adding content to white space in AFP files\n2 of 2"}]}