{"doc_name": "doc_c_xml_StepForDocProps.pdf", "doc_path": "data/raw/RPD-en-US/doc_c_xml_StepForDocProps.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2571, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Adding a step to convert XML elements into document properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Adding a step to convert XML elements into document properties\nAdding a step to convert XML elements into document properties\nYou can add a step based on the ApplyXSLTransform step template to a workflow to convert XML elements and their attributes into RICOH\nProcessDirector document properties.\nThe PDF Document Support feature or AFP Support feature is required to work with document properties.\nTo add a step to convert XML elements into document properties:\n1. Evaluate the XML files that provide input to the process. Make sure that you understand what information the files contain and how the\ninformation is organized.\nIf possible, ask the XML provider for the XML Schema Definition (XSD).\n2. To extract values for RICOH ProcessDirector document properties, identify the XML elements and attributes that supply values for the\nproperties.\n3. Use an XSLT tool (such as Altova MapForce) to create an XSLT style sheet.\nYou can convert XML elements into document properties in a property conditions file or in other files.\n4. Click the Workflow tab.\n5. Right-click a workflow that you want to use as a model and select Copy.\n6. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n7. Review the steps that are included in the workflow and the default values that they set.\n8. Determine where in the workflow you want to convert the XML elements into document properties.\nIf you want to convert XML elements into document properties in a property conditions file, place the ApplyXSLTransform step before the\nSetDocPropsFromConditions step that uses the file.\n9. Add the ApplyXSLTransform step to the workflow in the appropriate place and set values for the step properties:\nFor the XML input file property, specify the directory path and name of the XML file.\nFor the XSLT file property, specify the XSLT style sheet that you defined for the step.\nFor the Output file property, specify the directory path and name of the file that you want RICOH ProcessDirector to create.\nFor example, you want RICOH ProcessDirector to create a DocPropConditions.csv file in the spool directory for the job. Specify\n${getFileName(DocPropConditions,csv,write)}. For the Property conditions file property of the SetDocPropsFromConditions step,\nspecify ${getFileName(DocPropConditions,csv,read)}.\n10. Save and enable the workflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}