{"doc_name": "tt_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/tt_o_featov.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4592, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Automated Verification - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Automated Verification\nAutomated Verification\nThe Automated Verification feature lets you add barcodes to the documents in a print job. Cameras or barcode scanners read the barcodes to\ndetect documents that fail to complete a step in their workflow. You choose whether RICOH ProcessDirector automatically reprints any missing\ndocuments or an operator specifies an action to take for each missing document.\nNote: The feature only detects documents that are missing from a job. It does not detect pages that are missing from documents.\nThe Automated Verification feature adds an object, a step template, and a reconciliation method to RICOH ProcessDirector.\nPrerequisites\nTo use the Automated Verification feature, first install a feature that supports document processing:\nFor PDF files, install the PDF Document Support feature.\nFor AFP files, install the AFP Support feature.\nObject\nThe Automated Verification feature adds the barcode reader object. Barcode readers represent the cameras and barcode scanners in your system\nthat read barcodes on documents in a print job to verify that each document has been processed. Each camera or barcode scanner requires a\nbarcode reader object.\nEach barcode reader must have at least one barcode format object. To report the data that the camera or barcode scanner reads, the barcode\nformat must match the configuration of the camera or barcode scanner. The barcode format must include the Job number and a document\nproperty that is used to identify each document in a job.\nStep template\nThe Automated Verification feature adds the ReadBarcodeData step template. After one or more barcode readers report results, a step based on\nthe ReadBarcodeData step template checks whether all documents in a job have been detected. You can configure the step to process jobs in\nthese ways:\nAfter all the barcodes have been read, the step sends the job to the next step.\nAfter all the barcodes have been read, the step waits for an operator to do the Complete barcode step action.\nThe step waits a specified amount of time for the results file to be updated. The step then sends the job to the next step even if some\ndocuments have not been detected.\nReconciliation method\nBoth the PDF Document Support and AFP Support features support manual reconciliation. When a job completes the ReadBarcodeData step and\nenters the Reconcile step, the operator selects the Reconcile action to start manual reconciliation for the job. Then the operator uses the\nReconcile Job dialog in the RICOH ProcessDirector user interface to specify an action for each document in the job. To use manual reconciliation,\nset the Automatic reconciliation property on the Reconcile step to No.\nThe Automated Verification feature adds support for automatic reconciliation. When a job enters the Reconcile step, RICOH ProcessDirector\nautomatically reconciles the documents in the job and reprints any documents whose barcodes were not read. Operator action is required in\nthese situations:\nThe documents to be reprinted exceed the percentage allowed for the job in the Maximum documents to reprint % property.\nAny duplicate barcodes are read in the job.\nTo use automatic reconciliation, set the Automatic reconciliation property on the Reconcile step to Yes.\nAdditional information\nThe Automated Verification feature integrates with barcode readers that return data over an IP address and port using the TCP/IP Sockets\nprotocol. The feature does not support systems such as file-based inserters that exchange data by sending and receiving files across a network.\nTo determine the best camera or barcode scanner for the device you want to monitor, contact a Ricoh support representative.\nIn this section:\nUsage scenario: Verifying documents after insertion\nThis scenario describes the steps required to set up a camera or barcode scanner to read barcodes through the window on each envelope of a\njob as the envelopes exit the inserter. Some of these steps can be done at the same time.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:24 PM Automated Verification - Jenski - Test portal- RPD Linux\nAutomated Verification reconciliation methods\nDuring reconciliation, the system determines which documents in the job need to be reprinted because their barcodes were not read. The value\nof the Automatic reconciliation property tells the system whether to reconcile documents automatically, or manually with operator control.\nParent topic: Document processing features\n2 of 2"}]}