{"doc_name": "aiw_c_json_PrepToReceive.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_json_PrepToReceive.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2668, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Preparing to receive JSON - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to receive JSON\nPreparing to receive JSON\nAfter you receive a JSON file, you convert it to XML. How you process the XML files depends on the information in the JSON files and what you\nwant to do with the information.\nTo prepare to receive JSON:\n1. Evaluate the JSON files that provide input to the process. Make sure that you understand what information the files contain and how the\ninformation is organized.\nIf possible, ask the JSON provider for the JSON Schema.\n2. Decide how to process the XML files that you convert the JSON files into. RICOH ProcessDirector provides two step templates that\nmanipulate XML:\nA step based on the CreateJobsFromXML step template creates jobs from elements in an XML file that match an XPath expression. The\nstep submits the jobs to a workflow.\nA step based on the ApplyXSLTransform step template transforms XML into a file that specifies the values of RICOH ProcessDirector job or\ndocument properties. The step also transforms XML into another XML format.\nFor more information, see the related task about preparing to receive XML.\n3. Decide how to receive JSON files for processing.\nYou can submit JSON files to a hot folder input device or place a JSON file at a location from which the RICOH ProcessDirector server\nretrieves it.\nFor example:\nIf your JSON file contains multiple orders, and each order contains multiple items, submit the JSON files to a hot folder input device.\nIf your JSON file contains a list of book titles and the PDF files required to print each book, place the file at a convenient location. Update\nthe file whenever the book titles and print files change.\n4. If you submit JSON files to a hot folder, place a step based on the ConvertJSONToXML step template after the SetJobPropsFromTextFile and\nDetectInputDataStream steps.\nUse the default values for the JSON input file and XML output file.\n5. If you place a JSON file at a location from which it is retrieved, place a ConvertJSONToXML step before the first step that processes XML.\nFor example, place the ConvertJSONToXML step before the CreateJobsFromXML or ApplyXSLTransform step.\nSpecify the property values for the step:\nFor the JSON input file property, specify the directory path and name of the file with the JSON.\nFor the XML output file property, specify the directory path and name of the XML file that you want RICOH ProcessDirector to create.\n6. Compare the output file with the input file to see how RICOH ProcessDirector converted JSON into XML.\nParent topic: Preparing for job submission\n1 of 1"}]}