{"doc_name": "pdfw_c_plugin_docpropertydef.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_docpropertydef.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2048, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Document properties - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / PDF Document Support / RICOH ProcessDirector Plug-in for Adobe Acrobat\n/ Document properties\nDocument properties\nA document property is data, such as a customer name or postal code, extracted from a specific location on a page within a document. Using\ndocument properties, you can add markup based on variable information. For example, you can add a different image to documents sent to\ndifferent states or provinces.\nRICOH ProcessDirector Plug-in for Adobe Acrobat has an advanced address block parsing tool to help you extract city, state or province, postal\ncode, and other document properties from complex, variable line addresses. If you need to reprint documents in a job, you can use RICOH\nProcessDirector to search for document property values to find the specific documents you need to reprint.\nYou can define your own document property or select a RICOH ProcessDirector document property from a list. You can use RICOH\nProcessDirector document properties with functions provided by RICOH ProcessDirector document processing features.\nNote:\nWhen you use RICOH ProcessDirector Plug-in for Adobe Acrobat to define document properties, you select from a list of your RICOH\nProcessDirector document properties.\nYou must load your RICOH ProcessDirector document properties into RICOH ProcessDirector Plug-in for Adobe Acrobat to use them. A\nsample set of document properties is loaded in the Plug-in during the install process. After you install the Plug-in or any time that you\nchange RICOH ProcessDirector document properties, load the document properties into the Plug-in again.\nClick Ricoh ⇒ View Document Property Values to verify that document property values are extracted correctly.\nIf you want to use document property values with an external program, you can save the values to a tab-delimited text file.\nParent topic: RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}