{"doc_name": "ip5khfippdsubmit.pdf", "doc_path": "data/raw/RPD-en-US/ip5khfippdsubmit.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2392, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Defining a workflow to submit a file to an InfoPrint 5000 hot folder - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Workflows for printing / Printing PDF and PostScript files on the InfoPrint 5000 printer Models AS1 and AD1/2\n/ Defining a workflow to submit a file to an InfoPrint 5000 hot folder\nDefining a workflow to submit a file to an InfoPrint 5000 hot folder\nTo submit a print job to a hot folder on an InfoPrint 5000, you must create a workflow that uses the CopyToFolder step.\nTo define the workflow:\n1. Click the Workflow tab.\n2. Right-click the OutputPDF workflow and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Find and right-click the TransformJobIntoPDF step.\n5. Select Delete. You see a confirmation message. Click Yes.\n6. Connect the DetectInputDataStream step to the CopyToFolder step:\n1. Hover over the DetectInputDataStream step. Click and hold a highlighted section ( ) to make the connector appear.\n2. Drag the connector onto the CopyToFolder step, wait until a section of the step is highlighted, and release the mouse button.\n7. Right-click the CopyToFolder step and select Properties.\n8. Click External.\n9. Delete the contents of the External Command property and replace it with a one of these commands:\nIf you want to submit a print file to the hot folder, the command should look like this:\ncp ${getCurrentFile(${Job.InputDatastream})} /mnt/destinationHotFolder/${Job.ID}\nReplace destinationHotFolder with the name of the directory that the InfoPrint 5000 printer uses as a hot folder.\nNote:\nWhen you use this command, you cannot send the number of copies (or other job properties) to the printer. You must specify the\nnumber of copies on the printer.\nIf you want to submit a MIME package (containing a PDF file and a JDF job ticket), which specifies the number of copies to print, the\ncommand should look like this:\ncp ${getFileName(print,mjm,read)} /mnt/destinationHotFolder/${Job.ID}\nReplace destinationHotFolder with the name of the directory that the InfoPrint 5000 printer uses as a hot folder.\nNote:\nCopying a MIME package requires InfoPrint 5000 Code Level V2.9.112 or later.\n10. Click OK.\n11. Save and enable the workflow.\nParent topic: Printing PDF and PostScript files on the InfoPrint 5000 printer Models AS1 and AD1/2\n1 of 1"}]}