{"doc_name": "aiw00bannerbcode.pdf", "doc_path": "data/raw/RPD-en-US/aiw00bannerbcode.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2391, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Printing barcodes on AFP banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / AFP banner pages / Printing barcodes on AFP banner pages\nPrinting barcodes on AFP banner pages\nYou can print barcodes that represent the values of job properties, printer properties, and system settings on banner pages. For jobs sent to AFP\nprinters, you configure RICOH ProcessDirector to print the barcodes by adding or modifying entries in the control files installed in\n/aiw/aiw1/samples/banner_pages/ and /aiw/aiw1/control_files/banner_pages/, such as header.cfg.\nNote: Updates might overwrite files in the /aiw/aiw1/samples/banner_pages/ directory, but they do not overwrite files in the\n/aiw/aiw1/control_files/banner_pages/ directory. We recommend copying sample files into the\n/aiw/aiw1/control_files/banner_pages/ directory and making all your changes in the copied file.\nBefore you start this procedure, make sure you understand how to change the appearance of AFP banner pages.\nTo print a barcode on an AFP banner page:\n1. Log in to the primary computer as the RICOH ProcessDirector system user ( aiw1 is the default).\n2. Navigate to /aiw/aiw1/control_files/banner_pages/.\n3. Determine the control file that you want to add or modify barcode information for, and open the file with a text editor.\nLines that cause RICOH ProcessDirector to print barcodes on AFP banner pages use this format:\nFieldX FieldName;FieldType;[key];;;InchesFromLeft;InchesFromTop;Rotation;BarcodeType;\nHeight;Modifier;Asterisk;HRI;ModuleWidth;WideNarrowRatio;RowSize;NumberOfRows\nAll fields of the line that follow the field identifier are separated by semicolons (;). You cannot omit any of the fields except the\nModuleWidth, WideNarrowRatio, RowSize, and NumberOfRows fields.\nThese are examples of barcode entries in banner-page control files:\nField2 Barcode;JobTicketField;[JobID];;;2.25;1.0;0;3of9;0.625;1;no;none;;;;\nField100 Barcode2;JobTicketField;[Job.ID.Value];;;0.950;8.35;0;3of9;0.625;1;no;below;;;;;\n4. Save the control file.\nWhen you send jobs to this printer, make sure the correct configuration file values are specified for the Header page configuration file, Separator\npage configuration file, and Trailer page configuration file properties. You can set these values as job defaults on the workflow or on the job\nitself.\nParent topic: AFP banner pages\n1 of 1"}]}