{"doc_name": "barcode_data_tab.pdf", "doc_path": "data/raw/RPD-en-US/barcode_data_tab.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3186, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Data tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code barcodes - Jenski - Test portal- RPD …\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Creating barcodes\n/ Data tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code barcodes\nData tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code\nbarcodes\nOn the Data tab, you specify the data that AFP Editor encodes in the barcode symbol for Code 39, Data Matrix, Interleaved 2-of-5, PDF417,\nPOSTNET, and QR Code barcodes.\nFields on Data tab\nField Value Description\nText Any valid characters for The text that you want to encode in the barcode symbol. For example, you could use\nthe barcode type (see next a blank character to separate multiple index tags. (A blank is not a valid character in\ntable) all barcode types.) This value is the same in all page groups.\nIndex tag An index tag name The index tag whose value you want to encode in the barcode. For example, you\nmight want to encode a routing code that you previously indexed. The barcodes will\ncontain the value of the index tag in the page group. This value can be different in\neach page group, but is the same for all pages in a page group.\nProperty A property name The job property you want to encode in the barcode. The barcodes will contain the\nvalue of the job property. This value is the same in all page groups.\nInclude HRI Above barcode symbol Indicates that human-readable interpretation (HRI) is to be printed above the\nbarcode symbol. This field is visible only for barcode types that support HRI: Code 39\nand Interleaved 2-of-5.\nBelow barcode symbol Indicates that human-readable interpretation (HRI) is to be printed below the\nbarcode symbol. This field is visible only for barcode types that support HRI: Code 39\nand Interleaved 2-of-5.\nCode page encoding A defined code page The code page used to encode the barcode. You can only select an encoding from\nencoding the drop-down list for QR Code barcodes.\nThis table shows the characters that are valid for each type of barcode.\nValid characters for barcodes\nBarcode type Valid characters Total number of characters\nCode 39 (3-of-9 Code) 0123456789 0 to 50 characters\nABCDEFGHIJKLM\nNOPQRSTUVWXYZ\n- . $ / + %\nspace character\nData Matrix Any one-byte character, or binary 0 to 3116 characters\ndata\nInterleaved 2-of-5 0123456789 0 to 50 characters\nPDF417 Any one-byte character, or binary 0 to 2710 characters\ndata\nPOSTNET 0123456789 The number of digits depends on the barcode property selected on the Type\ntab:\nZIP Code: 5 digits\nZIP Code + 4: 9 digits\nAdvanced Bar Code (ABC): 11 digits\nVariable-length barcode: 0 to n digits (barcode receivers support at least 50\ndigits)\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Data tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code barcodes - Jenski - Test portal- RPD …\nBarcode type Valid characters Total number of characters\nQR Code Any one-byte character, or binary 0 to 3116 characters\ndata\nOther topics in this section:\nType tab\nData tab for IMBs\nPosition tab\nParent topic: Creating barcodes\n2 of 2"}]}