{"doc_name": "ws-step_c_CallRESTService.pdf", "doc_path": "data/raw/RPD-en-US/ws-step_c_CallRESTService.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6097, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Calling a REST web service from a workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Calling a REST web service from a workflow\nCalling a REST web service from a workflow\nTo call a REST web service, identify the parameters used to call the REST web service. Test the exchange of data between RICOH ProcessDirector\nand the application. Then add a step based on the CallRESTService step template to the workflow.\nTo call a REST web service from a workflow:\n1. Learn the requirements for communication with the REST web service for the application:\nThe values for authenticating with the application\nThe values for requesting data from the REST web service\nThe format of the data provided in the response\nRefer to the documentation for the application or consult with the company that hosts the application.\n2. To prepare RICOH ProcessDirector to communicate with the application, do these tasks:\nIf the application requires a security certificate, install the certificate on the RICOH ProcessDirector primary computer.\nIf your environment requires a proxy server to communicate with web services, set up the system to use it.\nFor more information, see the related tasks.\n3. Run a manual test that authenticates with the application and requests a response from the REST web service. Verify that the web service\nreturns the response that you want.\nMany browsers have plug-ins, such as Boomerang for Google Chrome, that test web service calls to REST clients.\n4. If the web service includes a payload, decide how you want to provide that information:\nYou can enter the payload as the value of the Request payload property.\nYou can store the payload in a text file that the CallRESTService step can access during job processing.\n5. Click the Workflow tab.\n6. Click the name of the workflow you want to modify.\n7. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n8. Review the steps that are included in the workflow and the default values that they set.\n9. Add a step based on the CallRESTService step template to the workflow in the appropriate place.\n10. Set values for the job properties.\n1. Set the Request URL property to the URL of the web service that the step calls.\nThe URL can use either the HTTP or HTTPS protocol.\n2. Set the Request method property to the value required by the web service.\n3. Set the Password property to the password that the step provides to the REST web service to authenticate with the application.\nYou enter the password as the value of this property. To provide the password to the REST web service, specify the\nJob.WebService.Password property as a symbol in the Request payload, Request header, or Request parameters property:\n${Job.WebService.Password}. To determine which property to use, refer to the documentation of the web service.\n4. Set the Request payload type property:\nTo specify the body of the web services request as the value of the Request payload property, select TEXT.\nTo specify the body of the web services request in a text file that the CallRESTService step can access during job processing, select\nFILE.\nNote:\nIf you do not specify a payload, RICOH ProcessDirector ignores the value of this property.\n5. If the web service includes a payload, set the Request payload property:\nIf you set the Request payload type property to TEXT, enter the payload as the value of this property.\nIf you set the Request payload type property to FILE, enter the full directory path, name, and extension of the text file as the value\nof this property.\nEnter the payload as the content of the text file.\nTo send the password in the payload, specify the Job.WebService.Password property as a symbol.\nIn this XML example, order ID is stored as the value of the Custom 3 job property ( Job.Info.Attr3). The payload includes the\npassword as the value of the <Token> element and order ID as the value of the <OrderID> element:\n<Token>${Job.WebService.Password}</Token><OrderID>${Job.Info.Attr3}</OrderID>\nThe step resolves the symbols when it calls the REST web service.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Calling a REST web service from a workflow - Jenski - Test portal- RPD Linux\n6. Set the values for the Request header and Request parameters properties, as required.\nEach header field or parameter is a keyword/value pair. Each pair must appear on a separate line and must be separated using a\ncolon (:) or equals sign (=).\nThe keyword and value can be multiple words. RICOH ProcessDirector uses the first colon or equals sign on each line to split the\nwords into the keyword/value pair.\nThis example contains two parameters: token and orderId. The value of each keyword is a RICOH ProcessDirector symbol. Each\nsymbol contains one of these properties: Job.WebService.Password and Job.Info.Attr3.\ntoken:${Job.WebService.Password}orderId:${Job.Info.Attr3}\nThe step resolves the symbols when it calls the REST web service.\n7. If your environment requires a proxy server to communicate with web services, set the Use proxy property to the correct proxy server.\n8. Set the Response file property to the full directory path and name of the file that RICOH ProcessDirector uses to store the response\nfrom the application.\nTypically this value is ${getFileName(print,json,write)} or ${getFileName(print,xml,write)}, depending on the\ntype of response that the application returns.\nAfter the response is stored in the file, other steps in the workflow can process the response.\n11. When you finish, click OK.\n12. Save and enable the workflow.\nWhen you finish setting up your workflows, test the exchange of data between RICOH ProcessDirector and the application.\nExample\nThe Web Services Enablement feature includes a supplied RestfulWebServiceWF workflow with a CallRESTService step.\nParent topic: Preparing to use workflows\n2 of 2"}]}