{"doc_name": "aiw_ws_overview.pdf", "doc_path": "data/raw/RPD-en-US/aiw_ws_overview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1945, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Web services in RICOH ProcessDirector - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Web services in RICOH ProcessDirector\nWeb services in RICOH ProcessDirector\nRICOH ProcessDirector provides web services that use Representational State Transfer (REST) software architecture principles so you can access its\nfunctions from other applications.\nRESTful web services send requests and receive results using the Hypertext Transfer Protocol (HTTP). Each web service has a Universal Resource\nIndicator (URI) associated with it. When you create requests, you modify the URI to include specific information about the object that you are\ninterested in or the action that you want to do. These modifications can be simple, such as inserting the name of a printer object into the URI, or\nhighly complex, such as using Extensible Markup Language (XML) to describe the criteria to use when searching for objects and how they should\nbe sorted when they are returned. If you code XML elements to include in your requests, they must be Universal Resource Locator (URL)-encoded\nbefore they are added to the URI.\nWith RICOH ProcessDirector, you can use web services to request information about print jobs and other objects in the system. You can also use\nthem to set properties and do actions such as enabling and disabling objects, modifying properties, and starting and stopping printers.\nIn this section:\nUsing RICOH ProcessDirector REST API documentation\nRICOH ProcessDirector provides REST APIs for web service integration. Interactive documentation is provided with these APIs and provides live\ntesting and information for each available API.\nUsage notes\nThe web services provided with RICOH ProcessDirector follow specific conventions. When you integrate web services with your application, refer\nto these usage notes to make sure that your implementation functions properly.\nParent topic: Product overview\n1 of 1"}]}