{"doc_name": "wpm_c_featov.pdf", "doc_path": "data/raw/RPD-en-US/wpm_c_featov.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1980, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM WPM Connect - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / WPM Connect\nWPM Connect\nWPM Connect lets you send AFP print jobs to WPM Web for additional processing.\nThis feature adds the SetWPMProperties step template to the list of supplied step templates. When added to a workflow, that step template lets\nyou specify values that RICOH ProcessDirector uses to create a User Information Page (UIP) for WPM Web. WPM Web can use that UIP to process\nthe print job.\nThe UIP is a type of banner page that is sent to WPM Web before the print job. The UIP is not printed like other banner pages. WPM Web\nautomatically accepts and interprets the UIP and uses the information it contains to set WPM properties.\nWhen you configure the SetWPMProperties step template, you must specify coded fonts that RICOH ProcessDirector should use to create the UIP\nfor both double-byte and single-byte characters. Make sure that those coded fonts are added to the code page mapping file for banner pages\nbefore you try to send a job to WPM Web. The code page mapping file for banner pages is stored in:\n/aiw/aiw1/control_files/banner_pages/\nAdd lines to map your SBCS and DBCS coded fonts to the IBM-930 or IBM-939 code pages. For example, add lines like these:\nX0H16N=IBM930\nX0G32F=IBM930\nX0H16U=IBM939\nX0M32F=IBM939\nAlso make sure that the coded fonts are stored in a directory that RICOH ProcessDirector searches for resources. For example, you can add the\ndirectory to the AFP resource path property for the printer object.\nAfter you create workflows that include steps based on the SetWPMProperties step template, you can define an AFP printer object that sends\nprint jobs to the WPM AFP Emulator. When you set the value of the Create User Information Page property for an AFP printer to Yes, RICOH\nProcessDirector creates the UIP and sends the UIP and the print job to WPM Web.\nParent topic: AFP datastream support\n1 of 1"}]}