{"doc_name": "cac_CMRToneTransfer.pdf", "doc_path": "data/raw/RPD-en-US/cac_CMRToneTransfer.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2511, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Tone Transfer Curve CMRs - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Color Management Resources / Types of CMRs / Tone Transfer Curve CMRs\nTone Transfer Curve CMRs\nTone transfer curve (TTC) CMRs are used to carry tone transfer curve information for an AFP print job, so you can modify the values of a\nparticular color component and adjust the appearance of some of the colors by increasing or decreasing the amount of ink used to emphasize or\nreduce the effects of dot gain on the final output.\nLike halftone CMRs, tone transfer curve CMRs are associated with print jobs specifically or generically. If they are specified generically, the print\nserver looks in the resource library for tone transfer curve CMRs that match the printer device type and model. If the print server finds an\nappropriate CMR, it sends the device-specific tone transfer curve CMR to the printer with the print job. If the print server does not find an\nappropriate tone transfer curve CMR, it sends the generic tone transfer curve CMR to the printer.\nIf a print job arrives at the printer requesting a generic tone transfer curve CMR, the printer compares the requested characteristics with the\ndevice-specific tone transfer curve CMRs that it has available. If there is a match, the print server or printer uses the selected device-specific tone\ntransfer curve CMR when it processes the print job. If the printer cannot find a good match for the generic tone transfer curve CMR, it ignores\nthe request and uses its default tone transfer curve CMR.\nThe Color Management Object Content Architecture (CMOCA) defines several generic tone transfer curve CMRs with different appearance\nvalues. You can use the appearance values to specify how to print your job with regard to the reported dot gain of the printer.\nGeneric tone transfer curves can be used to select these appearance values:\nDark\nThe output is adjusted to show a dot gain of 33% for a 50% dot.\nAccutone\nThe output is adjusted to show a dot gain of 22% for a 50% dot.\nHighlight Midtone\nThe output is adjusted to show a dot gain of 14% for a 50% dot. This appearance is often used to emphasize the brightest part of an\nimage.\nStandard\nThe output is adjusted just enough to account for the effects of dot gain, effectively counteracting the dot gain.\nIf you use AFP Resource Installer, it installs the generic tone transfer curve CMRs on your system automatically.\nParent topic: Types of CMRs\n1 of 1"}]}