{"doc_name": "ppfrsample_c_RunFormsForDocsWF.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_c_RunFormsForDocsWF.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 8264, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Running the sample workflow that uses electronic forms to print jobs with documents - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to use electronic forms / Running the sample workflow that uses electronic forms to print jobs with documents\nRunning the sample workflow that uses electronic forms to print jobs with documents\nThe ElectronicFormDocSample workflow demonstrates how to combine electronic forms with data in PDF files for jobs that contain documents.\nThe sample workflow prints some jobs by combining electronic forms with data. It prints other jobs on preprinted forms. The workflow is\ninstalled with the Preprinted Forms Replacement feature.\nThe workflow includes two branches:\nThe [1] Electronic branch sends jobs with Electronic in the job name through the CombinePDFWithForm step, which combines the electronic\nforms with the data. The jobs then go to the CountPages step. When the jobs reach the PrintJobs step, they are printed on plain paper.\nThe [2] Preprinted branch sends jobs that do not have Electronic in the job name directly to the CountPages step. Those jobs bypass the\nCombinePDFWithForm step and are printed on preprinted forms.\nThe sample objects and files used in this workflow include:\nWorkflow: ElectronicFormDocSample\nInput device: ElectronicFormDocFolder\nMedia objects:\nSummaryAndDetails\nThis media object specifies electronic forms for the first sheet of a statement with a summary on the front and details on the back.\nDetailsDuplex\nThis media object specifies electronic forms for sheets with statement details on both sides.\nDetailsAndOffers\nThis media object specifies electronic forms for the last sheet of a statement with details on the front and offers on the back.\nPDF files:\nElectronicDoc.pdf\nPreprintedDoc.pdf\nThese 866-page duplex jobs, which are identical except for their job names, contain 300 documents. Each document consists of a customer\nstatement with two, four, or six pages. All documents have a statement summary page followed by one to four pages of transaction details. If\nthe last page of a document does not have transaction details, offers are included on the last page.\nControl file for the IdentifyPDFDocuments and BuildPDFFromDocuments steps: ElectronicForm.ctl\nThis control file contains the page-exception data for the documents in the jobs.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Input Devices portlet, right-click the ElectronicFormDocFolder hot folder and select Enable and Connect.\nThe first time that you enable and connect the hot folder, RICOH ProcessDirector submits the ElectronicDoc.pdf and\nPreprintedDoc.pdf jobs to the ElectronicFormDocSample workflow.\nThe jobs move through the workflow and stop at the PrintJobs step. Both jobs are in the Device unavailable state, waiting for the Sample\nprinter to be enabled.\n3. Review the SummaryAndDetails, DetailsDuplex, and DetailsAndOffers media objects.\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Media.\n3. Right-click the SummaryAndDetails media object and select Properties.\n4. To view the electronic form for the front side, which contains the static portion of the statement summary page, click the blue Front\nof form link.\nThe PDF page used for the front of the form opens in a new browser tab.\n5. When you are finished viewing the form, close the tab.\n6. To view the electronic form for the back side, which contains the static portion of the statement details page, click the blue Back of\nform link.\nThe PDF page used for the back of the form opens in a new browser tab.\n7. When you are finished viewing the form, close the tab.\n8. Look at the value of the Media name for printing property.\nThe property is set to Current name.\n9. Right-click the DetailsDuplex media object and select Properties.\n10. View the electronic forms for the front and back of the media.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Running the sample workflow that uses electronic forms to print jobs with documents - Jenski - Test portal- RPD Linux\nBoth forms contain the static portion of the statement details page.\n11. Look at the value of the Media name for printing property.\nThe property is set to Current name.\n12. Right-click the DetailsAndOffers media object and select Properties.\n13. View the electronic forms for the front and back of the media.\nThe form for the front side contains the static portion of the statement details page. The form for the back side contains a page of\noffers (with static content).\n14. Look at the value of the Media name for printing property.\nThe property is set to Selected: Letter Plain.\n4. Review the PreprintedDoc.pdf job.\n1. Right-click the job and select View.\nYou see an 866-page job with 300 documents. Each document contains a customer statement with two, four, or six pages. You see\nonly the variable data for the statement summary and transaction details.\n2. Click Close.\n3. Right-click the job and select Page Exceptions.\nYou see a list of 265 page exceptions, for all the pages of all the documents in the job. The job requires three preprinted forms.\nMost page exceptions are for SummaryAndDetails media, which is used for the first two pages of each statement.\nIf a statement has four pages with a summary page and two pages of transaction details, DetailsAndOffers media is used for pages\n3–4.\nIf a statement has four pages with a summary page and three pages of transaction details, DetailsDuplex media is used for pages 3–\n4.\nIf a statement has six pages with a summary page and four pages of transaction details, DetailsDuplex media is used for pages 3–4.\nDetailsAndOffers media is used for pages 5–6.\n5. Review the ElectronicDoc.pdf job.\n1. Right-click the job and select View.\nYou see an 866-page job with 300 documents. Each document contains a customer statement with two, four, or six pages. You see\nboth the variable and static data for the statement summary and the transaction details. If the last page of a document does not\nhave any transaction details, you see the offers.\nLook at pages 1–4, the first document in the job. The electronic forms for the front and back of the SummaryAndDetails media\nhave been combined with pages 1–2. The electronic forms for the front and back of the DetailsAndOffers media have been\ncombined with pages 3–4.\nLook at pages 5–6, the second document in the job. The electronic forms for the front and back of the SummaryAndDetails media\nhave been combined with those pages.\nLook at pages 301–304, a four-page statement with a summary page and three pages of transaction details. The electronic forms\nfor the front and back of the SummaryAndDetails media have been combined with pages 301–302. The electronic forms for the\nfront and back of the DetailsDuplex media have been combined with pages 303–304.\nLook at pages 305–310, a six-page statement with a summary page and four pages of transaction details. The electronic forms for\nthe front and back of the SummaryAndDetails media have been combined with pages 305–306. The electronic forms for the front\nand back of the DetailsDuplex media have been combined with pages 307–308. The electronic forms for the front and back of the\nDetailsAndOffers media have been combined with pages 309–310.\n2. Click Close.\n3. Right-click the job and select Page Exceptions.\nYou see a list of 265 page exceptions, for all the pages of all the documents in the job.\nYou see SummaryAndDetails and DetailsDuplex in the list because their Media name for printing property is set to Current name. The\nCombinePDFWithForm step combines the electronic forms for SummaryAndDetails and DetailsDuplex media with the data and but\ndoes not change the media names.\nYou see LetterPlain in the list because the Media name for printing property of the DetailsAndOffers media is set to Selected: Letter\nPlain. The CombinePDFWithForm step combines the electronic forms for DetailsAndOffers media with the data and changes the\nDetailsAndOffers media name to LetterPlain.\nKeeping the SummaryAndDetails and DetailsDuplex media names associated with jobs lets a print shop use a different paper for those\nsheets. The print shop can also report paper costs to its management information system using those media names.\nParent topic: Setting up to use electronic forms\n2 of 2"}]}