{"doc_name": "pref_o_PropMapObj.pdf", "doc_path": "data/raw/RPD-en-US/pref_o_PropMapObj.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 2316, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Document property mappings - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Property mapping / Document property mappings\nDocument property mappings\nA document property mapping defines the relationship between the headings in a preferences file and the document properties defined in the\nsystem. Document property mappings are used by the ApplyPreferences step to add or change values in the document properties file (DPF) for\nthe job.\nWhen you define a document property mapping, you map headings in the preferences file to properties in the document properties file. Then\nyou specify one of these Usage values for that pair:\nIdentify document\nThis pair is used to find which documents to update in the DPF.\nIn the image below, the heading of Account number is mapped to the Member document property and the usage is set to Identify document.\nWhen the ApplyPreferences step runs, it reads the preferences file. For each row, it finds the value of the Account number, then searches the\ndocument properties file to find the entry that has the same value listed for the Member property.\nUpdate property\nThese pairs are used to update values in the document properties file. These properties might not have values in the document properties file\ninitially.\nIn the image below, the headings Email address and Output type are mapped to document properties with the same names. The Usage for\nboth pairs is set to Update property. When the ApplyPreferences step locates the entry in the DPF whose Member property matches an Account\nnumber value, it updates the Email address and Output type properties in the DPF for that entry with the values in the corresponding row of\nthe preferences file.\nYou must map at least two headings to document properties, one for each Usage type.\nThe values can be used by other steps in the workflow to group documents for common processing such as one set of documents to email and\nanother set of documents to print.\nThe same property mapping object can be used by multiple workflows as long as the preferences files contain the same headings. The order of\nthe headings can be different in each preferences file.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM Document property mappings - Jenski - Test portal- RPD Linux\nParent topic: Property mapping\n2 of 2"}]}