{"doc_name": "aiw_sdk_pages.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_pages.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3341, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / Pages\nPages\nWhen the batching method is Pages, the hot folder or SFTP input device submits one or more PDF files as a group, based on the number of\npages in the files that are received by the input device. This method is only valid for PDF files.\nThe hot folder or SFTP input device examines PDF files as they arrive and determines how many pages they contain. The hot folder or SFTP input\ndevice maintains a count of the total number of PDF pages currently in the input device. When the total number of PDF pages matches or\nexceeds the value set for the Number of pages to batch property, the hot folder or SFTP input device submits a group of files.\nThe PDF file that makes the total number of pages exceed the value set for the Number of pages to batch property is only included in the group\nif the Exceed pages to batch property is set to Yes. If the Exceed pages to batch property is set to No, this PDF file remains in the hot folder or\nSFTP input device as the first set of pages for the next batch.\nIf a single file contains more pages than the value set for the Number of pages to batch property and the Exceed pages to batch property is set\nto Yes, the file is submitted for printing, either as a batch with the rest of the PDF files that are waiting to print or as a batch that contains only\none file. However, if the Exceed pages to batch property is set to No, the file cannot be submitted. Processing for the hot folder or SFTP input\ndevice stops until that input file is deleted, the value of the Number of pages to batch property is increased to at least the number of pages in\nthe file, or the Exceed pages to batch property is changed to Yes so the file can be submitted.\nNote:\nThe Pages batching method does not support encrypted or password-protected PDF files. If an encrypted or password-protected PDF file\nis submitted to a hot folder or SFTP input device that uses the Pages batching method, RICOH ProcessDirector issues an error message\nbecause it cannot open the file to count the number of pages.\nWhen you use the Pages batching method, set these input device properties as indicated:\nWorkflow: ParentNoPrint\nChild workflow: The workflow that is appropriate for the print files in the job.\nSubmit step: SubmitInputFiles\nCreate .zip file: If this property is set to Yes, all input files that match the value set in the Data patterns property are combined as a ZIP file and\nsubmitted as a single job. If this value is set to No, all input files are submitted as child jobs.\nNumber of pages to batch: the number of pages that the hot folder or SFTP input device waits to receive before submitting the files as a single\ngroup.\nExceed pages to batch: If this property is set to Yes, a PDF file that contains enough pages to make the total number of pages in the hot folder\nor SFTP input device exceed the value set for Number of pages to batch property will be submitted with the rest of the files. If this property is\nset to No, this file will remain in the hot folder or SFTP input device as the first set of pages for the next batch.\nData patterns: a pattern that matches PDF file names, such as .*pdf$ or .*PDF$.\nParent topic: Batching methods\n1 of 1"}]}