{"doc_name": "aiw_o_mediamatching.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_mediamatching.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4653, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Media matching - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Media / Media matching\nMedia matching\nWhen RICOH ProcessDirector sends jobs to cut sheet printers, it must determine two things: what media a job should be printed on and what\nmedia is loaded in a printer. When RICOH ProcessDirector establishes that information, it can schedule jobs correctly.\nWhen a job is submitted with a job ticket, the job ticket usually includes information about the media that the job should be printed on. That\ninformation can include the product ID and name of the requested media, as well as properties of the media, such as size and color. The Media\nMatching setting determines how the system interprets that information to set the Media property for the job.\nNote:\nWhen a job has page exceptions, the system sets the job property for page exceptions the same way that it sets the Media property for\nthe job.\nMedia product IDs are used only with jobs sent to Ricoh PDF printers with a Data stream to send value of JDF/PDF. Some control units for\nRicoh PDF printers can be configured to use product IDs to select media.\nThe Media Matching setting also affects how the Media ready property for a printer is set. If a printer supports SNMP or JMF, it can send\ninformation about the media loaded in its trays to RICOH ProcessDirector. The system compares the information returned by SNMP or JMF with\nexisting media objects to find one that matches. If the Media to use property on the printer is set to Printer, RICOH ProcessDirector compares the\nnames to existing printer media. If it finds a match, the printer media must be mapped to its system media equivalent for jobs to print correctly. If\nthe Media to use property on the printer is set to System, RICOH ProcessDirector compares the names to existing system media.\nWhen it finds a match, the name of the matching media object is used for the value of the Media ready property for the input tray. If none of\nthe existing media objects match, RICOH ProcessDirector creates a media object of the correct type (system or printer), with the specified values\nand includes that media name in the value of the Media ready property.\nRICOH ProcessDirector provides two options for media management: Use media product ID or media name and Use the properties selected\nbelow.\nThe Use media product ID or media name option uses one of these media names as the value of the Media property for a job:\nThe name of the media object with the matching product ID specified in the job ticket.\nThe name of the media specified in the job ticket.\nThe option does not check any other media properties.\nRICOH ProcessDirector first checks whether the job ticket specifies a media product ID. If it does, RICOH ProcessDirector looks for a media\nobject with the same product ID. If RICOH ProcessDirector finds a match, it puts the name of the matching media object in the Media property\nfor the job. If RICOH ProcessDirector does not find a match, it looks for a media object with the media name specified in the JDF job ticket. If\nRICOH ProcessDirector finds a match, it puts the name of the matching media object in the Media property for the job.\nYou must use the Show Trays action on the printer object to specify the media loaded in the printer.\nWhen this option is selected, you can create media objects that have the same property values but different product IDs or names.\nThe Use the properties selected below option uses one or more media properties specified in the job ticket to determine the value of the Media\nproperty for the job. You can choose the media properties that are relevant to your operations. RICOH ProcessDirector examines the values of\nthe relevant media properties in the job ticket and finds a media object with matching values for those properties. If more than one media\nobject matches the specified properties, RICOH ProcessDirector uses more logic to choose the most appropriate value.\nIn addition, you must use this option if you want RICOH ProcessDirector to use SNMP or JMF to set the Media ready property for printers based\non the properties of the media, and create media objects if needed. If the printer does not return all the relevant properties for a media object,\nRICOH ProcessDirector cannot set the media in the input tray automatically. You must use the Show Trays action on the printer object to specify\nthe media loaded in the printer.\nWhen the Media property for a job and the Media ready property for printers are set, RICOH ProcessDirector can use those values to help\nschedule the job to the appropriate printer.\nParent topic: Media\n1 of 1"}]}