{"doc_name": "aiw_print_job.pdf", "doc_path": "data/raw/RPD-en-US/aiw_print_job.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2417, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Defining a workflow to print a job - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Workflows for printing / Defining a workflow to print a job\nDefining a workflow to print a job\nTo print a job on a printer, you must create a workflow that uses the PrintJobs step.\nTo define the workflow:\n1. Click the Workflow tab.\n2. Right-click an appropriate workflow, such as PDF, and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Right-click the PrintJobs step and select Properties.\n5. In the Scheduling tab, select a value for the Requested printer property.\nIf you know which printer you want to print the job, select it from the list.\nIf you want to schedule the job manually, select Not set. The job does not print until someone uses the Schedule action to assign the job\nto a printer.\nIf you want RICOH ProcessDirector to assign the job to the first available printer that matches the scheduling properties, select Any\nprinter. RICOH ProcessDirector uses properties such as Job size, Customer name, Media, and Finishing options to determine which\nprinters match the job's requirements when the job reaches the PrintJobs step.\nNote:\nIf you have more than one PrintJobs step in a workflow because you want to set the Requested printer using conditional rules,\nleave the Requested printer property on the PrintJobs step as Any printer and put an AssignJobValues step on each branch in the\nworkflow. Use the AssignJobValues step to set the Requested printer value as needed for each branch.\n6. If the value of the Create .zip file property for the hot folder input device that assigns jobs to this workflow is set to Yes, add a step based\non the BuildPDFFromZIP step template to the workflow before the first step that expects PDF input (for example, CreatePageRanges or\nPrintJobs ):\n1. In the workflow editor, click the side panel in the top right corner of the window.\n2. Go to Steps and expand the PDF/JDF group.\n3. Click the BuildPDFFromZip step template and drag it into the workflow editor. Place the step where you want it.\n4. If you want to rename the step, right-click the step. Select Properties, and then click General. For the Name property, type a name for\nthe new step and click OK.\n5. Connect the step to the other steps.\n7. Save the workflow.\nParent topic: Workflows for printing\n1 of 1"}]}