{"doc_name": "DefiningInserterControllers.pdf", "doc_path": "data/raw/RPD-en-US/DefiningInserterControllers.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3053, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Defining inserter controller objects - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Defining inserter controller objects\nDefining inserter controller objects\nInserter controller objects are the RICOH ProcessDirector objects that represent the inserter controllers in your installation. The inserter controller\nruns on another computer (for example, a Windows computer) and can manage one or more inserter devices.\nYou define at least one inserter controller object for each inserter controller. To specify different inserter controller properties, you create more\nthan one inserter controller object to represent one inserter controller. After you create an inserter controller object, you associate the\nappropriate inserter controller object with jobs.\nRICOH ProcessDirector provides sample inserter controller objects for several inserter manufacturers. You copy the supplied inserter controller\nobject for your inserter manufacturer and modify its properties. If a different inserter manufacturer makes the inserters in your installation, you\ncreate a new inserter controller object.\nTo modify the properties of the inserter controller object for your environment, or to create a new inserter controller object, you need\ninformation about the inserter controller:\nWhat reprint method does the inserter controller support: open-loop or closed-loop?\nIf the inserter controller uses a control file to control insertion:\nWhat is the format of the inserter control file: fixed-length record (FLR), comma-delimited (DEL), or XML? For FLR format, what encoding is\nused (ASCII or UTF-8)?\nDoes the inserter control file require a header record?\nWhich script should RICOH ProcessDirector use to send the inserter control files to the inserter controller?\nWhat are the full path names of the rules file (or files) that you have created to write inserter control files?\nIf the inserter controller writes results files after inserting jobs:\nDoes the inserter controller write a job-specific results file (that is, one results file for each job)?\nWhat is the format of the inserter results file: fixed-length record (FLR) or comma-delimited (DEL)?\nWhich script should RICOH ProcessDirector use to transfer inserter results file (or files) to RICOH ProcessDirector?\nWhat are the full path names of the rules files that you have created to interpret results files?\nIn this section:\nUsing supplied inserter controller objects\nRICOH ProcessDirector provides inserter controller objects for several inserter manufacturers. You copy the sample inserter controller object for\nyour inserters and modify its properties.\nCreating inserter controllers\nIf RICOH ProcessDirector does not supply an inserter controller object for your inserter controllers, you can create one.\nAssociating inserter controller objects with jobs\nYou can associate an inserter controller object with jobs. Each job can have one associated inserter controller object.\nParent topic: Configuring the system to use inserters\n1 of 1"}]}