{"doc_name": "pdfw_over_plugin_std.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_over_plugin_std.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3092, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM RICOH ProcessDirector Plug-in for Adobe Acrobat - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / PDF Document Support / RICOH ProcessDirector Plug-in for Adobe Acrobat\nRICOH ProcessDirector Plug-in for Adobe Acrobat\nRICOH ProcessDirector Plug-in for Adobe Acrobat is an Adobe Acrobat Professional plug-in that you use to define and display enhancements in a\nPDF file that represents the PDF files that are processed by the steps in your workflows.\nEnhancements include barcodes, OMR marks, images, hidden areas, and text. The enhancements you define in the PDF file are not saved in the\nPDF file; instead, they are saved in control files that you make available to a server used by RICOH ProcessDirector. RICOH ProcessDirector uses\nthe control files to apply the same enhancements to production PDF files when it processes them for printing.\nTo extend markup capabilities, RICOH ProcessDirector Plug-in for Adobe Acrobat provides page groups, document properties, and conditional\nprocessing.\nIn this section:\nPage groups\nA page group is a set of pages that make up a single document, such as a mailpiece or customer statement, within a PDF file. In RICOH\nProcessDirector Plug-in for Adobe Acrobat, a document is a page group. A single PDF file can contain many documents. If an entire PDF file is\ntreated as a single page group, the PDF file represents one document.\nDocument properties\nA document property is data, such as a customer name or postal code, extracted from a specific location on a page within a document. Using\ndocument properties, you can add markup based on variable information. For example, you can add a different image to documents sent to\ndifferent states or provinces.\nConditional processing\nWhen you add markup to a PDF file using RICOH ProcessDirector Plug-in for Adobe Acrobat, you can create conditional processing rules to place\nthe markup on specific pages.You also can use conditional processing rules to apply media and finishing options and to specify the pages from\nwhich RICOH ProcessDirector Plug-in for Adobe Acrobat and RICOH ProcessDirector extract document property values.\nMarkup\nRICOH ProcessDirector Plug-in for Adobe Acrobat supports five types of markup: barcodes, OMR marks, images, text, and hidden areas.\nControl files\nA control file saves your page group definition, document properties, conditional triggers, and markup independently of a PDF source file.\nControl files are templates that RICOH ProcessDirector uses to apply the same markup rules to the PDF files it processes.\nSample PDF files\nWhen working with RICOH ProcessDirector Plug-in for Adobe Acrobat, the goal is to mark up a PDF file that represents your production PDF files\nbut that is smaller than your production files, especially if your production PDF files are large (for example, over 1000 pages in length). With a\nsmaller file, you can work more quickly when adding markup and when using preview and viewing extracted document properties.\nParent topic: PDF Document Support\n1 of 1"}]}