{"doc_name": "tt_cfg_settingupavf.pdf", "doc_path": "data/raw/RPD-en-US/tt_cfg_settingupavf.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 9621, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Usage scenario: Verifying documents after insertion - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Automated Verification / Usage scenario: Verifying documents after insertion\nUsage scenario: Verifying documents after insertion\nThis scenario describes the steps required to set up a camera or barcode scanner to read barcodes through the window on each envelope of a\njob as the envelopes exit the inserter. Some of these steps can be done at the same time.\n1. Prepare the camera or barcode scanner hardware.\n1. Purchase the camera or barcode scanner and install it on the inserter.\nNote:\nFollow the instructions provided by the manufacturer when you install the camera or barcode scanner. Test the lighting\nconditions to be sure that the camera can read the barcode clearly. If light reflects off the plastic window, barcodes might not\nbe read. In addition, measure the location of the camera or barcode scanner to ensure it lines up with the placement of the\nbarcode on all the types of documents it scans.\n2. Connect the camera or barcode scanner to the network. Write down the IP address and port number that the camera uses.\n2. Understand and create your barcode format.\n1. Determine what type of barcode you want to use and how you want to format data in the barcodes that are added to your\ndocuments. The barcode format must contain the Job number job property and the Sequence in child job document property.\nDetermine how many characters you want to allocate to each of those properties and whether you want to include other information\nin the barcode.\nNote:\nAlthough the Job number is set at eight characters initially, you should include at least two more characters (.n) in the\nbarcode format. The job numbers of child jobs created for reprints have at least 10 characters. Be sure the barcode symbology\nyou use allows periods, because they are present in the job number of every child job created for reprints.\n2. Log in to RICOH ProcessDirector as an administrator and create the barcode format object. If you install only one camera and read all\nbarcodes in the same location on an envelope, one barcode format should be all you need for the system. If other data might be\nincluded in the barcode for other reasons and that data cannot easily be standardized across applications, you might need to create\nmore than one barcode format. However, the Job number and Sequence in child job properties must be in the same positions in the\nbarcode for all barcode formats used for the same barcode reader.\n3. If the print file is in PDF format, add barcodes to the print data.\n1. Follow the instructions in RICOH ProcessDirector: Installing Document Processing Features to install the plug-in on your Adobe\nAcrobat Professional system.\n2. Open the file in Adobe Acrobat Professional and activate the Ricoh plug-in.\n3. Define how document boundaries in the print file can be determined. These boundaries are the triggers that RICOH ProcessDirector\ncan use to know where one document ends and another begins.\n4. After document boundaries are set, define the area to place the barcode and its contents. Be sure that the placement matches what\nthe camera or barcode scanner expects to see. You can place the barcode only on the first page of each document since the camera\n(in this example) is reading through the envelope.\n5. For the first Content Type, select Job Property and a Content Value of Job.ID. Click Edit and select Pad with Character as the Modifier.\nType 0 for Character to Pad with, and specify at least three digits, to allow the handling of reprint jobs.\n6. Return to the Add barcode dialog and select Document Property for the next Content Type with a Content Value of\nDoc.SequenceInChild. Repeat the steps above to pad the value with 0s for at least the number of digits equal to the number of\ndocuments you expect to have in the job. For example: If you expect to have 9,999 documents in this job, enter 4 in the Minimum\nPadded Text Length field. If you expect to have 100,000 documents in this job, enter 6 in the Minimum Padded Text Length field.\n7. Save the control file created by the plug-in. Send the file to the RICOH ProcessDirector server in a directory that the RICOH\nProcessDirector system user can access.\n4. If the print file is in AFP format, add barcodes to the print data.\nImportant:\nFor AFP jobs, you must have page groups already defined to add barcodes. If your AFP files do not contain page groups, you can\nuse the AFP Indexer mode in RICOH Visual Workbench to add page groups.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:24 PM Usage scenario: Verifying documents after insertion - Jenski - Test portal- RPD Linux\nIf you want to use the Verification recipient property to identify your documents, you must have an index tag already in the AFP file that\nyou can map to the Verification recipient document property that the Automated Verification feature adds. The sample file provided\nalready has that property defined. To link your own index tag to the property:\n1. Open the AFP file in the RICOH Visual Workbench. Select the DPD plug-in.\n2. Double-click on the Verification recipient property name at the bottom of the window and supply the requested information in the\nDefine link options dialog.\n3. Save the control file created by RICOH Visual Workbench. Send the file to the RICOH ProcessDirector server in a directory that the\nRICOH ProcessDirector system user can access.\n4. To create the barcode, select the Enhance AFP mode and export an EnhanceAFP control file, which is used by the\nBuildAFPFromDocuments step. A sample control file named VerifyAFPbarcode.cfg is included in the /aiw/aiw1/testfiles directory\n(Linux) or the C:\\aiw\\aiw1\\testfiles directory (Windows). Use the comments in the file to specify the number of characters for\neach property to match your barcode format. Make sure that the location of the barcode matches where the camera or barcode\nscanner is focused.\n5. Create a barcode reader object.\nLog in to RICOH ProcessDirector as an administrator and create the barcode reader object to correspond to the camera or barcode scanner.\nUse the IP address, port, and barcode format you already created.\n6. The VerifySample workflow provided with RICOH ProcessDirector processes both PDF and AFP files through the Automated Verification\nworkflow. Starting with a copy of the VerifySample workflow, modify it to process your own print files:\n1. If your print file is PDF, on the IdentifyPDFDocuments step and on the BuildPDFFromDocuments, specify the control file you built using\nthe Acrobat plug-in.\n2. If your print file is AFP, on the IdentifyDocuments step, specify the control file you built using the RICOH Visual Workbench. On the\nBuildAFPFromDocuments step, specify the Enhance AFP control file that you previously created.\n3. On the ReadBarcodeData step, specify the barcode reader you set up earlier.\n4. Specify which document property this ReadBarcodeData step should update when the barcode reader receives information about the\nbarcodes on documents.\n5. Decide how you want to manage the completion of this step and how long you want to wait to be sure that all barcodes have been\nread.\n7. Create an input device that points to the workflow you created.\n8. To test the system, submit a job.\n1. Enable the workflow and connect the barcode reader, and make sure that the input device is connected and enabled.\n2. Submit the file to the input device.\n9. When the job reaches the ReadBarcodeData step, its state changes to Reading barcodes. The camera on the inserter reads the barcodes\nthrough the windows of the envelopes containing documents for the job.\nThe operator can select the Complete barcode step action on the Jobs table to see the percent of documents read. The dialog does not\nautomatically update, but the operator can close and reopen it - during a long-running job, for example - to check on progress.\n10. If the ReadBarcodeData step is configured to complete the step automatically when 100 percent of the documents have been seen or after\na period of inactivity, the job moves to the next step in the workflow without the operator intervening.\nIf the job does not move to the next step, the operator must select the Complete barcode step action for the job. That dialog shows the\npercent of documents read by the scanner and the number of documents that have not been read. The operator can choose to complete\nthe step even with the missing documents so that the job can go to the next step, often Reconcile.\n11. If the Reconcile step is configured to mark all missing documents for reprint automatically and submit the child job to a printer, a child job\ncontaining the reprints is created automatically. The original job moves to the next step in its workflow if no duplicate scans were detected.\nIf any documents were detected more than once, the job moves to the Waiting to reconcile state even if Automatic reconciliation is turned\non.\nIf Automatic reconciliation is turned off, the operator must select the Reconcile action on the job when it is in the Waiting to reconcile\nstate. On the Reconcile dialog, the operator can see a list of documents where the value of the Document status property that the step\nupdates is set to Attention or Duplicate. The operator can choose to reprint, pull, or accept ( Mark OK) one or more documents in the\nAttention or Duplicate state.\nWhen all the documents in the job have a status other than Attention or Duplicate, the Reconcile step is complete and the job moves to\nthe next step.\nParent topic: Automated Verification\n2 of 2"}]}