{"doc_name": "identifyingresourcedirectories.pdf", "doc_path": "data/raw/RPD-en-US/identifyingresourcedirectories.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2592, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Identifying AFP resource directories - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Identifying AFP resource directories\nIdentifying AFP resource directories\nIf the sample AFP file refers to AFP resources (fonts, page segments, and overlays) that are not located inline or in the default AFP resource\ndirectories, identify the resource directories that contain the resources so that RICOH Visual Workbench can display the sample AFP file correctly.\nYou can specify as many resource directories to RICOH Visual Workbench as necessary.\nRICOH Visual Workbench looks for AFP fonts, page segments, and overlays in these resource directories, in the order shown:\n1. Inline in the AFP file\n2. Resource directories specified to RICOH Visual Workbench, in the order the directories are specified\n3. Default resource directories, in this order:\n1. /aiw/aiw1/resources (on Linux) or C:\\aiw\\aiw1\\resources (on Windows)\n2. /usr/lpp/psf/reslib (on Linux) or C:\\usr\\lpp\\psf\\reslib (on Windows)\n3. /usr/lpp/afpfonts (on Linux) or C:\\usr\\lpp\\afpfonts (on Windows) fonts only\n4. /usr/lpp/psf/fontlib (on Linux) or C:\\usr\\lpp\\psf/fontlib (on Windows) fonts only\nIf you have mapped an AFP font to a Java font in a customized font-mapping file, RICOH Visual Workbench does not look for the AFP font inline\nor in the resource directories. It uses the Java font.\nThe resource directories that you specify are used until you specify different resource directories. However, when you open an AFP file again using\nan existing control file, RICOH Visual Workbench uses the resource directories that you had specified, if any, the last time you worked with that\nAFP file using the same control file.\nNote:\nFor accurate results when you use AFP Indexer, specify the same AFP resource directories that are in the AFP resource path property in\nRICOH ProcessDirector. (This property is typically specified in the PrintJobs step in the workflows that the production AFP jobs use.)\nTo identify AFP resource directories:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Resources ⇒ Specify Resource Directories.\n2. Click Add.\n3. Type a directory name in the Directory name field, or click Browse to select a directory.\n4. Click OK.\n5. To specify another resource directory, click Add again.\n6. To change the order of a directory in the list, select the directory and click Up or Down.\nThe directories are searched in the order they are listed.\n7. Click OK.\nParent topic: Working with sample AFP files\n1 of 1"}]}