{"doc_name": "aiw_o_pdfdocsupport_featov.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_pdfdocsupport_featov.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5246, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM PDF Document Support - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / PDF Document Support\nPDF Document Support\nThe PDF Document Support feature adds functions and objects that let you process individual documents in PDF jobs. The feature includes\nRICOH ProcessDirector Plug-in for Adobe Acrobat.\nThe plug-in lets you identify documents in a sample PDF file that represents your production PDF files. In the sample PDF file, you add markup\nsuch as barcodes and text to the documents, and you map data in the documents to document properties so that RICOH ProcessDirector can\nextract the data.\nObject\nPDF Document Support and AFP Support add the barcode format object. Barcode formats are used to interpret the data collected by a barcode\nscanner. You can define a barcode format that includes a document property that identifies each document in a job. Then you can scan the\nbarcode on a document to find the document in the system.\nYou can use a hand-held barcode scanner attached to the computer to reconcile documents. We recommend that you configure your barcode\nscanner to send a New Line signal after each scan.\nWorkflow phase\nPDF Document Support and AFP Support add the Assemble phase to the RICOH ProcessDirector workflow. The figure Document processing\nphase in the RICOH ProcessDirector workflow, shows how the Assemble phase fits into the workflow.\nNote: If you have customized phase names in your system, those phase names differ from the phase names in the diagram.\nDocument processing phase in the RICOH ProcessDirector workflow\nReceive Prepare Assemble Print Complete\nExisting phases\nNew phase\nStep templates\nPDF Document Support and AFP Support add step templates for processing documents within workflows:\nFor PDF Document Support, steps based on the IdentifyPDFDocuments and BuildPDFFromDocuments step templates apply your document\ndefinitions, data mappings, and other document changes made with RICOH ProcessDirector Plug-in for Adobe Acrobat to PDF jobs.\nFor AFP Support, steps based on the IdentifyDocuments and BuildAFPFromDocuments step templates apply your document definitions, data\nmappings, and other document changes made with RICOH Visual Workbench to AFP jobs.\nA step based on the SetDocPropsFromConditions step template lets you update the document properties file for a job based on other\ndocument and job property values. For example, you can group documents based on a particular postal code range, and then create separate\nchild jobs for the postal code groups.\nSteps based on the SortDocuments, SplitDocuments, and GroupDocuments step templates let you manipulate documents within a single file\nand output the documents as one or more new jobs.\nA step based on the EmailDocuments step template lets you email each PDF document in a job as an attachment to an individual email address.\nRICOH ProcessDirector can send email directly through the default SMTP server or indirectly through an email service provider.\nA step based on the SetDocPropsFromList step template lets you read one or more list files in a directory and set the value of a specified\ndocument property for each document in the document properties file for the job. You can use the value of the document property to group\ndocuments in a job for common processing. For example, using this step, you can provide a \"pull list\" of documents in a job. Using the pull list,\nyou can suppress documents from printing, divert them from inserting, or send them to an express mail service.\nA step based on the SetPropertiesForReconcile step template lets you use the Insert sequence document property to find documents on the\nReconcile Job dialog or the Documents portlet.\nA step based on the Reconcile step template lets an operator set an action to take for the documents in a job. You can place a Reconcile step\nafter a PrintJobs step in a workflow. When a job enters the Reconcile step, the operator selects the Reconcile action to reconcile a job manually.\nDuring manual reconciliation, the operator marks documents that are OK, any documents to be reprinted, and any documents to pull from the\njob without reprinting.\nA step based on the CreateReprints step template processes documents to be reprinted after reconciliation by creating a child job containing\nonly the reprints. The child job can be sent through the same workflow as the original job or through a different workflow.\nIn this section:\nProcessing PDF files that contain documents\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:21 PM PDF Document Support - Jenski - Test portal- RPD Linux\nThe PDF Document Support feature lets you manipulate the individual documents in a PDF file. For example, you can rearrange their output\norder or group them according to different envelope size requirements. You can find a specific document by searching for a document property\nin the PDF file.\nRICOH ProcessDirector Plug-in for Adobe Acrobat\nRICOH ProcessDirector Plug-in for Adobe Acrobat is an Adobe Acrobat Professional plug-in that you use to define and display enhancements in a\nPDF file that represents the PDF files that are processed by the steps in your workflows.\nParent topic: No-charge product enhancement features\n2 of 2"}]}