{"doc_name": "mcc_c_PlanForOrders.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_PlanForOrders.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5463, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Planning how to process orders from your MarcomCentral store - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral / Planning how to process orders from your MarcomCentral store\nPlanning how to process orders from your MarcomCentral store\nIn this procedure, you map MarcomCentral XML elements for orders and job tickets to RICOH ProcessDirector order and job properties. You\ndecide how to supply the information required for RICOH ProcessDirector to process the items in an order. You also decide what criteria to use to\nreport status to MarcomCentral.\nTo plan how to process orders from your MarcomCentral store:\n1. Review your MarcomCentral orders and decide which XML elements to map to RICOH ProcessDirector order and job properties.\nLater, you map the XML elements to order and job properties in an order property mapping object.\nFor reference, this table lists the MarcomCentral XML elements for orders that are mapped to RICOH ProcessDirector order and job\nproperties in the MarcomOrderSample property mapping object.\nXML element (XPath expression) Object type Property\n/Order/OrderNumber Order Order name (Order.Name)\n/Order/ID Order External order reference (Order.Reference)\n/Order/OrderDetails/OrderDetail/ Order Customer name (Order.Customer)\nUser/Name\n/Order/OrderDetails/OrderDetail/ Order Description (Order.Description)\nSKUDescription\n/Order/OrderDetails/OrderDetail/ Job Job copies requested (Job.Copies)\nQuantity\n/Order/OrderDetails/OrderDetail/ Job MarcomCentral order number\nOrderNumber (Job.Marcom.OrderNumber)\n/Order/ID Job MarcomCentral order ID (Job.Marcom.OrderId)\n/Order/OrderDetails/OrderDetail/ Job MarcomCentral job ticket (Job.Marcom.JobTicketId)\nID\n/Order/OrderDetails/OrderDetail/ Job MarcomCentral product type\nProductType (Job.Marcom.ProductType)\n/Order/OrderDetails/OrderDetail/ Job Job name (Job.Name)\nProductName\nKeep in mind this information about RICOH ProcessDirector properties as you think about your mappings:\nThese order properties are supplied with the Order Management feature:\nCopies (Order.Copies)\nCustomer (Order.Customer)\nDescription (Order.Description)\nDue date (Order.DueDate)\nExternal order reference (Order.Reference)\nOrder priority (Order.Priority)\nTime zone (Order.DueTimezone)\nThe values of Order priority, Customer, and Copies are copied into the corresponding job properties when a job is added to an order.\nIn addition to the supplied order properties, you can define custom order properties from the Administration tab to accommodate specific\nrequirements.\nTwo job properties for order information are supplied with the MarcomCentral Connect feature: MarcomCentral order number and\nMarcomCentral order ID.\nTwo job properties for job ticket information are supplied with the MarcomCentral Connect feature: MarcomCentral job ticket ID and\nMarcomCentral product type.\nFor a list of all job properties supplied with the base product, see the related reference about database property names for jobs.\nRICOH ProcessDirector supplies a variety of generic job properties that can store text, integers, and numbers (including fractional numbers\nsuch as 8.5 or 9.725). These properties have names like Custom 1, Custom Integer 1, and Custom number 1.\nIf one workflow processes order jobs and another workflow processes ticket jobs, you can use a custom job property for different\npurposes in each workflow. For example, you can use the Custom 1 property for the shipping address of an order in the workflow for\norder jobs. You can use the Custom 1 property for the SKU description in the workflow for ticket jobs.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Planning how to process orders from your MarcomCentral store - Jenski - Test portal- RPD Linux\nYou cannot use the same custom job property for different purposes within the same workflow. For example, you use the Custom 1\nproperty for the SKU description in the job ticket workflow. If you also use the Custom 1 property to provide packaging information in\nthe job ticket workflow, the packaging information overwrites the SKU description.\nIf you prefer to create your own custom job properties, so you can use properties whose names are more recognizable in your\nenvironment, you can define them on the Administration tab.\nCreate a table similar to the one below to record the MarcomCentral order elements to map to RICOH ProcessDirector order and job\nproperties. Add as many rows as needed.\nDatabase name of job property User interface name of job property XML element for order\nOrder.Reference MarcomCentral order ID ID\nJob.Marcom.OrderNumber MarcomCentral order number OrderNumber\nJob.Marcom.OrderId MarcomCentral order ID ID\nJob.Info.Attr1 Custom 1\nJob.Info.Attr2 Custom 2\nJob.Info.Integer1 Custom integer 1\n2. Decide what criteria to use to report status to MarcomCentral.\nConsider whether you want to report status only for some workflows or items. You can use any job property or combination of job\nproperties to trigger the notification to MarcomCentral.\nFor example, the sample MarcomCloseoutOrder notification reports status when an order is ready to ship and the state of the order job has\nchanged to Retained. The state of the order job does not change until the jobs for all the items in the order complete their processing.\nAfter you plan how to process orders, you are ready to prepare to call MarcomCentral web services.\nParent topic: Setting up to process orders from MarcomCentral\n2 of 2"}]}