{"doc_name": "aiw_t_configemail.pdf", "doc_path": "data/raw/RPD-en-US/aiw_t_configemail.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2096, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Configuring to send email during processing - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Email and progress updates / Configuring to send email during processing\nConfiguring to send email during processing\nYou can configure RICOH ProcessDirector to send email as a step in a workflow, or send email notifications when input device, printer or job\nevents occur.\nYou must install the PDF Document Support feature to use the EmailDocuments step. You can use the EmailDocuments step to send emails with\nindividual documents as attachments.\nYou must have an email server installed and configured to let RICOH ProcessDirector send email with it.\nTo configure to send email:\n1. Collect this information about your SMTP server:\nNetwork IP address or fully-qualified host name\nTCP port number (the standard port for SMTP is 25)\nType of security (SSL, TLS, or none) and the TCP port that the secure connection uses\nNote:\nRICOH ProcessDirector supports SSL v3 and TLS v1.2 connections without certificate authentication.\n2. If the SMTP server requires a user ID and password, create them on your SMTP server so RICOH ProcessDirector can log in to the SMTP\nserver to send email.\n3. Use the information from the previous steps to configure the RICOH ProcessDirector system properties for the SMTP server.\n1. Click the Administration tab.\n2. In the left pane, click Setting ⇒ System.\n3. On the Email/SMTP section, define the values for all SMTP and Email properties that RICOH ProcessDirector uses to communicate\nwith the SMTP server.\nNote:\nYou can also use the Alternate SMTP properties to communicate with the SMTP server if the SMTP server type property is set\nto Alternate for the SendEmail or EmailDocuments step template. You cannot use the Alternate SMTP properties for email\nnotifications.\nYou can now add the SendEmail or EmailDocuments step template to your workflows to send an email at different points during job processing,\nor define notification objects to send emails when input device, printer or job events occur.\nParent topic: Email and progress updates\n1 of 1"}]}