{"doc_name": "aiw00p4.pdf", "doc_path": "data/raw/RPD-en-US/aiw00p4.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2347, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Spacing a job on the printer - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Printers / Spacing a job on the printer\nSpacing a job on the printer\nIf you have a job on an AFP printer and need to reposition it to print again from an earlier page (backspace) or to skip pages and start printing at\na later page (forwardspace), you can use the Jump to job action.\nTo space a job on the printer:\n1. Using the job number shown under the printer icon, find the job in the Jobs table and make sure it is in the Print phase and the Printing\nstate.\n2. In the Printers Portlet, select the printer that is printing the job and click Stop. If the job consists only of a single copy, select Immediately. If\nthe job consists of multiple copies, select either Immediately or After the current copy prints.\nNote: Using the stop function on the printer console does not put the printer in the stopped state in RICOH ProcessDirector. You\nmust stop the printer using the RICOH ProcessDirector user interface.\n3. In the Jobs portlet, select the job that was printing on the printer that you just stopped.\n4. Click Actions ⇒ Jump to.\n5. On the Jump to a Location page, specify where you want to resume printing the job:\n1. If the job consists of a single copy, you can specify a page number. You can also select the number of sides to skip ahead or back up\nfrom the side on which the last page printed. Use the View function to see the last page that printed and to help select where to\nresume printing the job.\n2. If the job consists of multiple copies, you can only specify a page in the current copy. To back up or skip ahead to a page in a\ndifferent copy, you must specify which side of the job to jump to.\n3. If the Interrupt Message Page property for the printer is set to Yes, the printer prints a message page for the repositioning action and\nthe restart point might be off by one sheet. To avoid printing from the wrong position, set the Interrupt Message Page property to No\nor use the Resume printing at page control instead of the Back up or Skip ahead controls.\n6. Select whether you want RICOH ProcessDirector to do a non-process runout (NPRO) action before it resumes printing.\n7. Click OK.\n8. In the Printers Portlet, select the printer that is printing the job and click Start.\nParent topic: Printers\n1 of 1"}]}