{"doc_name": "aiw00o34.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o34.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3326, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Input device types - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Input device types\nInput device types\nInput devices receive input files, create jobs, and submit them to the RICOH ProcessDirector system for processing.\nInput devices accept individual or multiple input files and submit them for processing. The input device can process multiple files in either of\nthese ways:\nIt can collect the data and submit it as a single job.\nIt can submit each file as a child of a parent job.\nIf you have the AFP Support feature installed, RICOH ProcessDirector treats each data set as an input file. Multiple data sets can be submitted as\nsingle jobs or as child jobs.\nThe types of input devices are:\nHot folder\nHot folder input devices are directories that the system monitors. When a print job is copied or sent to a hot folder, the system notices it and\nbegins to process it.\nLPD\nLine printer daemon (LPD) input devices receive jobs that are submitted using the LPD protocol. LPD input devices specify a control file to\nchange LPD control file parameters for a job to a job properties file in property name=value format. For PDF jobs, the control file is\nreceive_lpd_pdf_jobtype.cfg. For AFP jobs, the control file is receive_lpd_jobtype.cfg.\nDownload\nDownload input devices receive data sets from Download for z/OS or AFP Download Plus. Download for z/OS and AFP Download Plus send\njob control language (JCL) parameters in a separate file with the job. Download input devices specify the control file,\nreceive_jcl_jobtype.cfg, to change JCL parameters for a job to a job properties file in property name=value format. This device type is\nonly available if the AFP Support feature is installed.\nREST web service\nREST web service input devices call a Representational State Transfer web service to retrieve XML or JSON files from an application. The input\ndevice can create a job containing the entire XML or JSON file, or it can examine the file using an XPath or JSONPath expression. If the input\ndevice finds XML elements or JSON objects specified by the expression, it can create a single job containing the entire file. Alternatively, it\ncan create one or more jobs, each containing a portion of the file. This device type is only available if the Web Services Enablement feature is\ninstalled.\nSOAP web service\nSOAP web service input devices call a Simple Object Access Protocol web service to retrieve XML files from an application. The input device\ncan create a job containing the entire XML file, or it can examine the file using an XPath expression. If the input device finds XML elements\nspecified by the expression, it can create a single job containing the entire file. Alternatively, it can create one or more jobs, each containing\na portion of the file. This device type is only available if the Web Services Enablement feature is installed.\nSFTP\nSFTP input devices poll using the SFTP protocol for files matching a file name pattern that you specify from a directory on an SFTP server. You\nmust supply a credential to permit the input device to access the server.\nRICOH ProcessDirector provides some predefined input devices of certain types that you can use as samples. A predefined input device is not\nprovided for SFTP.\nParent topic: System objects\n1 of 1"}]}