{"doc_name": "creatingbarcodes.pdf", "doc_path": "data/raw/RPD-en-US/creatingbarcodes.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5212, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating barcodes - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Creating barcodes\nCreating barcodes\nAFP Editor lets you create barcodes in AFP files.\nThe barcode must be in a consistent position on every page and must be a consistent size. If text, an image, or another barcode already exists in\nthe area where you want to create a barcode, first hide the area so that the existing text, image, or barcode does not print.\nTo determine the exact origin and size of the barcode area, work from a copy of the sample AFP file printed on the production printer. Measure\nwhere you want to place the top-left corner of the barcode area (X and Y positions) on the printed page from the top-left corner of the logical\npage. For BCOCA barcode objects, also measure the width and height of the area.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo create a barcode:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the file does not contain page groups or index tags for variable values (such as ZIP Codes) that you want to use in barcode data, use AFP\nIndexer to create page groups and index tags.\n3. Click Mode ⇒ AFP Editor.\n4. Navigate to the page where you want to create the barcode:\nTo place a barcode on the same page in every page group, navigate to that page in any page group.\nTo place a barcode on multiple pages (for example, on even pages in every page group), navigate to one of the pages in any page group.\n5. Position your cursor at a corner of the barcode area. While pressing the left mouse button, draw a box the approximate size of the barcode\narea. You can draw a horizontal, vertical, or square box.\nIn a later step, you can specify the exact position and size of the barcode area.\n6. Right-click anywhere in the AFP file and click Create barcode.\nYou see the Create Barcode window.\n7. On the Type tab, type a name for the area, select the type, and specify other properties.\nFor a description of the fields, see the information center topic about the Type tab.\n8. On the Data tab, specify the data to be encoded in the barcode symbol.\nFor a description of the fields, see the information center topic about:\nData tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code barcodes\nData tab for IMBs\n9. On the Position tab, specify the exact origin and size of the barcode area, the orientation of the barcode symbol within the area, and on\nwhich pages to place the barcode in each page group.\nFor a description of the fields, see the information center topic about the Position tab.\n10. Click OK.\nIf you have more than one barcode defined, you might see the Create Conditions between Definitions window. Click Yes if you want to\ncreate a condition for determining which barcode is used, and then click OK.\nIf you created an Intelligent Mail barcode (IMB), POSTNET, or QR Code barcode, you see the barcode symbol in the AFP file. If you created a\nCode 39, Data Matrix, Interleaved 2-of-5, or PDF417 barcode, you see a box surrounding the barcode area with the title of the barcode\narea in the orientation that you selected for the barcode symbol.\nNote: If you created a text IMB but do not see the barcode symbol, identify the resource directory that contains the AFP IMB font to\nRICOH Visual Workbench (Resources ⇒ Specify Resource Directories). The AFP IMB font is installed in the\naiw/aiw1/plugins/EditAFP (Linux) or C:\\aiw\\aiw1\\plugins\\EditAFP (Windows) directory.\n11. If you see an error message, the barcode is not created in any page group. In addition, no other barcodes or hidden areas are created. If\nthe Create Barcode window is open, correct the barcode properties. If the Create Barcode window is already closed, click Tools ⇒ Modify\nDefinitions to correct the properties.\n(In the Modify and Delete Definitions window, identifies the barcode with the error.)\nIf you included index tag values in the barcode data and the error message indicates that barcode data is too long or contains characters\nthat are not valid, you might need to modify the index tag to correct the problem.\nIn this section:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating barcodes - Jenski - Test portal- RPD Linux\nType tab\nOn the Type tab, you specify the name of the barcode area, the type of barcode that you want to create, and the properties of the barcode.\nData tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code barcodes\nOn the Data tab, you specify the data that AFP Editor encodes in the barcode symbol for Code 39, Data Matrix, Interleaved 2-of-5, PDF417,\nPOSTNET, and QR Code barcodes.\nData tab for IMBs\nOn the Data tab, you specify the data that AFP Editor encodes in the barcode symbol for Intelligent Mail barcodes (IMBs).\nPosition tab\nOn the Position tab, you specify the exact origin (top-left corner) and size (width and height) of the barcode area, and the orientation of the\nbarcode symbol within the barcode area. You can also specify on which pages in each page group to place the barcode.\nParent topic: Editing AFP files\n2 of 2"}]}