{"doc_name": "showingresources.pdf", "doc_path": "data/raw/RPD-en-US/showingresources.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2862, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Showing page information in sample AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Showing page information in sample AFP files\nShowing page information in sample AFP files\nYou can show the names of AFP resources (fonts, page segments, and overlays) that the current page in the AFP file refers to and sheet\ninformation for the currently displayed AFP page. For each resource, you can see whether RICOH Visual Workbench found the resource and\nwhere the resource was found.\nThe sheet information includes page placement and the medium map used on the page. (The medium map specifies formatting options, such as\nduplex options and overlays.)\nIf a resource, such as a font, is missing, identify the resource directory that contains the resource to RICOH Visual Workbench so that RICOH\nVisual Workbench can display the data correctly.\nTo see sheet information, you must specify form definition processing (Resources ⇒ Change Form Definition Settings).\nTo show page information:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Resources ⇒ Show Page Information.\n2. Click the Resources tab.\nYou see a table with these columns:\nReference Name: Name of the resource in the AFP file.\nType: Type of resource.\nResource name: Name of the resource that was found. If the resource was not found, the resource name is Unknown.\nLocation: Location of the resource: inline in the AFP document or in a resource directory. If the resource was not found, the resource\nname is Not found.\nNote: This table does not show form definitions, color management resources, and data object resources.\n3. Optional: To limit the number of resources shown in the table, do one of these:\nTo see only resources that were found, click Found.\nTo show only resources that were not found, click Missing.\n4. Click the Sheet tab.\nIf form definition processing is specified, you see:\nActive Medium Map: Name of the medium map used for the currently displayed AFP page.\nConstant Back: Whether the constant back is “Yes” or “No”.\nConstant Front: Whether the constant front is “Yes” or “No”.\nN_Up: Number of equal partitions on the side of a sheet.\nPage name: Identifier for the currently displayed AFP page.\nPage number: Number of the currently displayed AFP page.\nPartition: Number of equal-sized areas on the currently displayed AFP page.\nPlex: Whether printing is done on only one side of the sheet (Simplex) or both sides (Normal Duplex or Tumble Duplex).\nSheet copies: Number of copies of this sheet to be printed.\nSheet count: Number of this sheet in the total number of sheets to be printed.\nSheet side: Front or Back.\nOtherwise, you see the message \"Form definition and medium map processing is disabled.\"\n5. Click OK.\nParent topic: Working with sample AFP files\n1 of 1"}]}