{"doc_name": "mail_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/mail_o_featov.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4498, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Postal Enablement - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Postal Enablement\nPostal Enablement\nThe Postal Enablement feature lets you extract mailing address data from the documents in a job and prepare the data for processing by external\npostal software. After the postal software verifies the addresses and improves their quality, the Postal Enablement feature can process results\nreceived from the postal software to update the documents in the job.\nThe feature adds a collection of step templates and workflows to RICOH ProcessDirector.\nPostal Enablement does not provide postal software. You can use your choice of external postal software, for example, the TEC Mailing Solutions\nMailPreparer software or the Bell and Howell BCC Mail Manager software.\nYou can use steps based on existing RICOH ProcessDirector step templates to exchange data with postal software, or you can manually move\nfiles between RICOH ProcessDirector and the postal software.\nPrerequisites\nTo use the Postal Enablement feature, first install a feature that supports document processing:\nFor PDF files, install the PDF Document Support feature.\nFor AFP files, install the AFP Support feature.\nNew step templates\nPostal Enablement adds four step templates.\nSetPostalJobProps\nA step based on this step template lets you set job properties needed by postal software to determine how to process the mail piece\ninformation contained within the external document properties file.\nBuildExternalDocPropsFile\nA step based on this step template lets you extract document data from the document properties file and create a file with the document data\nand headings that you need to send to an external program. The file you create is called an external document properties file.\nMapExternalResultsFiletoDocProps\nA step based on this step template maps document properties that you select from an external results file to the document properties included\nin a modified results file. The external results file is produced by an external program.\nUpdateDocPropsFromExternalResultsFile\nA step based on this template merges the properties in the modified results file into the document properties file for the job.\nNew workflows\nPostal Enablement adds four sample workflows.\nPrintAndMailJob\nThis workflow collects document data to send to postal software and uses a step based on the RunHotFolderApplication step template to\nexchange files with the postal software. After receiving the output of the postal software, the workflow updates the document data and prints\nthe job for mailing.\nGroupDocsForPostalProcess\nThis workflow collects document data to send to postal software and updates the document data from the output of the postal software.\nUsing rules that you set up to interpret the data, the workflow produces child jobs for each type of mail that the postal software identified. The\nworkflow is configured to pass the child jobs to one of the next two workflows.\nProcessQualifiedDocuments\nThis workflow processes child jobs created by the GroupDocsForPostalProcess workflow if the documents in the job qualified for additional\npostal processing. The workflow sorts the documents, using the optimal method determined by the postal software, and passes the child jobs\nto the PrintForPostalProcess workflow.\nPrintForPostalProcess\nThis workflow prints the child jobs created by the GroupDocsForPostalProcess workflow. The child jobs contain qualified, nonqualified, and\nother types of mail. The workflow makes sure that the order of documents within each job is correct for each type of mail.\nIn this section:\nExtracting document properties for use with other programs\nWhen you use document processing features, documents inside your print jobs are given property values in addition to the properties that apply\nto the job as a whole. Document properties can include: number of pages in a document, name of the recipient, and account number among\nmany others. You can also define your own document properties that suit your requirements for accounting or other tracking purposes.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM Postal Enablement - Jenski - Test portal- RPD Linux\nDocument property values can be collected and extracted so you can use them outside of your print workflow system. In addition, document\nproperty values can be returned to the system so they can be used by later steps in the workflow.\nParent topic: Document processing features\n2 of 2"}]}