{"doc_name": "ppfrsample_c_AddFormsToMedia.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_c_AddFormsToMedia.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2669, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Adding electronic forms to media objects - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to use electronic forms / Adding electronic forms to media objects\nAdding electronic forms to media objects\nElectronic forms are pages in PDF files that you add to media objects. The CombinePDFWithForm or CombineAFPWithForm step combines the\nPDF page data with PDF or AFP job data to create a print file that you can print on plain paper.\nWhen you choose pages in PDF files to use as electronic forms, we recommend that the page size matches the page size of the job data.\nTo make a page in a multiple-page PDF file into an electronic form, you do not need to save the page as a separate PDF file. You can specify the\nmultiple-page PDF file when you add the electronic form to the media object. Then you select a page in the file.\nTo add electronic forms to media objects:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Media.\n3. Right-click a media object and select Properties.\n4. To add an electronic form to the front or back side of the media:\n1. Click the button for the Front of form or Back of form property.\n2. Go to the PDF file that contains the page that you want to use as an electronic form for the side that you selected. Then click Open.\n3. Select the page in the file by typing its number in the Use page field.\n4. Click Create form.\nTo view the form, click the blue link Front of form or Back of form.\nTo delete the form, click x to the right of the blue link.\n5. To add an electronic form to the other side of the media, repeat the steps.\n5. Set a value for the Media name for printing property based on how you want the CombinePDFWithForm or CombineAFPWithForm step to\nprocess jobs that request this media.\nTake your Management Information System (MIS) reporting needs into account. Consider how you want to track and charge for the media.\nTo leave occurrences of this media name for the entire job and for any page exceptions, select Current name.\nTo remove all occurrences of this media name from the entire job and from any page exceptions, select None.\nSelecting this value does not affect any occurrences of other media names.\nTo replace all occurrences of this media name for the entire job and for any page exceptions, select Selected. Then select a media name\nfrom the list of names for all media objects.\nSelecting this value does not affect any occurrences of other media names.\n6. Click OK.\nThe media object is now ready to use with the CombinePDFWithForm or CombineAFPWithForm step when an incoming job requests the media\nby name.\nParent topic: Setting up to use electronic forms\n1 of 1"}]}