{"doc_name": "cac_RenderingIntent.pdf", "doc_path": "data/raw/RPD-en-US/cac_RenderingIntent.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2581, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Rendering Intents - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / Color Management / Rendering Intents\nRendering Intents\nRendering intents indicate what you want a printer to do with colors that are outside its gamut.\nICC profiles support these rendering intents:\nPerceptual\nIf an image includes any colors that are out-of-gamut for the printer, the printer adjusts all the colors in the image, even those that are already\nin the gamut of the printer, so they are all in-gamut and maintain their color relationships to each other. The result is an image that is visually\npleasing, but is not colorimetrically accurate. The perceptual rendering intent is useful for general reproduction of images, particularly\nphotographs.\nSaturation\nIf a print job includes colors that are out-of-gamut for the printer, the printer replaces the out-of-gamut color with the nearest color in the\ngamut. It also adjusts the in-gamut colors so that they are more vivid. Saturation is the least used rendering intent, but it is useful for business\ngraphics, such as images that contain charts or diagrams.\nRelative colorimetric\nIf a print job includes colors that are out-of-gamut for the printer, the printer substitutes the nearest in-gamut color; in-gamut colors are not\nadjusted. Colors printed on papers with different media white points might not match visually. The media white point is the color of the paper\nthat the print job is printed on. For example, if you print an image on white paper, on off-white paper, and on blue paper by using the relative\ncolorimetric rendering intent, the printer uses the same amount of ink or toner for each one and the resulting color is technically the same.\nHowever, the images might seem different because your eyes adjust to the color of the background and interpret the color differently. This\nrendering intent is typically used for vector graphics.\nAbsolute colorimetric\nAll colors are mapped by using the same method as the relative colorimetric rendering intent, however, all colors are adjusted for the media\nwhite point. For example, if you print an image on white paper, on off-white paper, and on blue paper by using the absolute colorimetric\nrendering intent, the printer adjusts the ink or toner used for each one. The resulting color is technically not same, but the images might look\nthe same because of the way your eyes interpret them in relationship to the color of the paper. The absolute colorimetric rendering intent is\ntypically used for logos.\nParent topic: Color Management\n1 of 1"}]}