{"doc_name": "aiwcholdjob.pdf", "doc_path": "data/raw/RPD-en-US/aiwcholdjob.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2884, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Holding jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Holding jobs\nHolding jobs\nIf you do not want jobs to move through their workflow without human intervention, you can configure the workflows to hold jobs at a given\npoint. You can then have the operators do an action to release the jobs.\nFor example, if operators have to load different forms for each job, they can release jobs after they have loaded the correct forms on the printer.\nTo hold jobs, do one of these:\nSet the Requested printer property on a step based on the PrintJobs step template to Not set, so that all jobs that pass through that workflow\nreceive that value.\nThe default is that the Requested printer property is set to Any printer. As a result, jobs are automatically scheduled to the first available printer\nwhose scheduling properties match the values for the associated job properties. However, if Requested printer property is set to Not set, the\njobs wait for an operator to use the Schedule Job action to assign them to a printer. After the job has been scheduled, the Requested printer\nproperty is set and the job moves through the rest of its processing steps.\nSet the Stop when entering phase property on a step that is based on the SetJobPropsFromTextFile step template. When you add one of those\nsteps to a workflow, you select a phase as the value of the Stop when entering phase property. When a job reaches that phase, it stops and\nwaits without going through any of the processing steps in that phase.\nIf a job is stopped at the beginning of a phase, an operator can use the Continue action to resume processing of the job. The operator must\nalso make sure that the scheduling properties for the job match the scheduling properties for at least one printer and that the Requested\nprinter property is set to Any printer or to a specific printer so the job can be scheduled for printing.\nFor example, if you select the Print phase, a job moves through all the processing steps specified for the Receive and Prepare phases. Then it\nmoves to the Print phase, but it waits before starting any steps. The job state changes to Stopped. An operator can right-click the job and select\nContinue to start processing again.\nInclude a manual step in a workflow, so that jobs have to wait for an operator to indicate that the job is ready to move to the next processing\nstep.\nFor example, you can create a step based on the ManualStepWithAutoStart step template and name it Enter Purchase Order Number, then add\nit to the Prepare phase of a workflow. When a job arrives at this step, its status changes to Manual, Working. An operator can edit the job\nproperties to enter the purchase order number and then right-click the job and select Manual complete to complete the step and release the\njob.\nParent topic: Preparing to use workflows\n1 of 1"}]}