{"doc_name": "aiw_sdk_pattern.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_pattern.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 5952, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Pattern - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / Pattern\nPattern\nWhen the batching method is Pattern, the hot folder or SFTP input device copies one print file and its related files to the spool file directory for\nthe job as soon as it has all the required files. All these files must match the values set for the Data patterns property and the properties on the\nBatching tab of the input device properties notebook.\nWhen you use the Pattern batching method, set these input device properties as indicated:\nWorkflow: ParentNoPrint\nChild workflow: The workflow that is appropriate for the print files in the job.\nSubmit step: SubmitInputFiles\nCreate .zip file: No\nFor example, you might want to send a JDF job ticket file along with an overrides file and a data file for a job. If a job ticket input file ends in\n.jdf and should have spool file usage \"overrides\" and spool file type \"jdf\", you can associate those three patterns with each other. Using\nRICOH ProcessDirector regular expression syntax, you define a series of input file name patterns that a hot folder or SFTP input device will\nrecognize and include in the new job it creates. This table shows a simple example of files that can be processed together using pattern-\nmatching.\nExample\nSpool file matching file Example spool file\nData pattern File pattern File usage File type type name name Notes\n.*$ .*jdf$ overrides Other jdf abc000317.jdf /aiw/aiw1/spool JDF job ticket\n/default/100001\n43/10000143.ove\nrrides.jdf\n.*$ .*oth$ overrides Other txt abc00317.oth /aiw/aiw1/spool Overrides file\n/default/100001\n43/10000143.ove\nrrides.txt\n.*$ .*pdf$ print Data pdf abc00317.pdf /aiw/aiw1/spool PDF file\n/default/100001\n43/1000143.prin\nt.pdf\nYou can use the Data patterns property and the File Patterns property to create precise file name and file type matches. If you want to use parts\nof the pattern from the Data patterns field as part of a file pattern, surround those parts of the Data patterns expression in parentheses, forming\na backreference that you express in the File Patterns field with a backslash and a number. This table shows the results of pattern matching using\na backreference:\nTab Field Value Description\nBatching Data patterns (.*)\\.pdf The expression (.*) defines a backreference to the data file name\nwithout the extension. When a data file name matches this pattern,\nall the characters that match (.*) are assigned to backreference \\1.\nBatching File pattern \\1\\.jdf Matches the data file name, but changes the extension to .jdf.\nJob1.pdf and Job1.jdf are considered a match and are included in the\njob, but Job2.jdf does not match.\nIn a more complex example:\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:13 PM Pattern - Jenski - Test portal- RPD Linux\nTab Field Value Description\nBatching Data patterns (abc)(def)\\.pdf,.*- The data file must match one of these two comma-separated\n(12)-.*\\.pdf patterns.\nData pattern 1: \\1 = abc and \\2 = def\nThe expressions (abc) and (def) define backreferences to the\ndata file name. The extension must be .pdf.\nA data file that matches pattern 1 is abcdef.pdf.\nData pattern 2: \\1 = 12\nThe expression (12) defines a backreference requiring that the\ndata file is for the month of December (assuming the date\nformat of a data file is year-month-day. The extension must be\n.pdf.\nA data file that matches pattern 2 is 2011-12-02.pdf.\nBatching Overrides patterns \\1\\.oth The overrides file must be named abc.oth to match data\npattern 1.\nBatching File pattern 2011-(\\1)\\.jdf The file 2011-12.jdf matches data pattern 2.\nFile usage overrides\nFile type jdf\nRequired Yes\nSequence 1\nBatching File pattern \\2\\1\\.jdf The file defabc.jdf matches data pattern 1.\nFile usage overrides\nFile type jdf\nRequired Yes\nSequence 2\nBatching File pattern \\1\\.txt The file 12.txt matches data pattern 2.\nFile usage file\nFile type txt\nRequired No\nSequence 3\nTo edit the Batching tab:\nTo add a file pattern, type values in the fields on the Batching tab, and click Add. Type values in the fields and click Save.\nTo remove a file pattern, select the checkbox for that file pattern and click Remove.\nTo edit a file pattern, select the checkbox for that file pattern and click Edit. The values display in the file pattern entry fields; change them as\nneeded and click Save.\nIf you create two file patterns that are the same, or if a pattern's file type and usage match another pattern's file type and usage, a warning\nmessage displays, but you can still add the pattern. The first file pattern encountered is processed, based on the value of the Sequence\nproperty.\nTo cancel a change, click Cancel. The system cancels the last unsaved change.\nKeep these tips in mind as you set up patterns on the Batching tab:\nWe recommend that you define your patterns carefully, especially for required files, so that only one file matches the specified pattern. It is not\npossible to specify that more than one file must match a pattern; as soon as one required file matches the pattern, the system considers the\nrequirement met, and will start processing the job when at least one matching required file for each defined pattern is present in the hot folder\nor SFTP input device.\nRemember to click OK to save your changes before leaving the page. If you leave the page without saving your changes, the changes are\ndiscarded.\nThe rules that you specify in the table are processed in sequence order (from top to bottom); if any conflicting rows exist in your table, the first\npattern in the sequence will be used.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:13 PM Pattern - Jenski - Test portal- RPD Linux\nWhen you use the Pattern batching method, use these guidelines for the fields in the Advanced tab:\nUse the Overrides pattern field in the Advanced tab, not in the Batching tab.\nDo not use the JDF patterns field in the Advanced tab; define those patterns in the Batching tab.\nParent topic: Batching methods\n3 of 3"}]}