{"doc_name": "aiw_o_PositionalJobProperties.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_PositionalJobProperties.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2351, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Positional job properties - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Step templates, steps, and step chains / Positional job properties\nPositional job properties\nYou can place steps based on the same step template in a workflow multiple times. If the job properties associated with the step template take\ndifferent values for each step, they are positional properties.\nFor example, two different steps based on the RunExternalProgram step template can process jobs by running two different external programs.\nThe External command job property specifies the program that each step runs to process jobs.\nOther step templates share the same value for each job property across the steps in the same workflow. When you change the value of a job\nproperty for one step based on the step template, the value of the property for the other steps changes.\nFor example, a workflow has two branches, and each branch has a different RetainCompletedJobs step. The Requested printer job property\nspecifies the printer requested for the job. If you change the value of the Requested printer property for one step from PrinterBldg1 to\nPrinterBldg2, the value of the property for the other step changes to PrinterBldg2.\nIf you want two different branches of a workflow to print their jobs to a different printer, you must place a step based on the AssignJobValues\nstep template before each PrintJobs step. Set the values you want for each branch of the workflow on each AssignJobValues step. The value of\nthe Requested printer property in each AssignJobValues step overrides the Requested printer property value in the two PrintJobs steps.\nTo see the positional properties for a job in the jobs table on the Main page of the user interface, right-click the job and select Properties.\nOn each tab in the job property notebook, positional job properties are displayed under a heading that gives the names of the phase, workflow,\nand step.\nFor example, if a job in the PDF workflow has a RunExternalProgram step in the Prepare phase, the External command property is displayed\nunder this heading: Prepare - PDF - RunExternalProgram.\nNote:\nYou cannot set the values of positional properties using the Manage job defaults action in the Workflow editor.\nParent topic: Step templates, steps, and step chains\n1 of 1"}]}