{"doc_name": "aiw00c23.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c23.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2776, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Creating input devices - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining input devices / Creating input devices\nCreating input devices\nWhen you need an input device that has very different properties from existing input devices, you can create a new one.\nTo create an input device:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Input Devices.\n3. Click Add and choose the type of input device you want to create.\n4. On all the tabs, fill in the required and optional properties that need to be adjusted to match your environment.\nNote:\nFor LPD input devices, it is best to limit the input device name to 8 characters. Depending on the print command that you use, you\nmight have to create a print queue on the sending system with the same name as the input device. Some systems truncate print\nqueue names to 8 characters.\nFor input devices, RICOH ProcessDirector creates the directories that you specify as the Folder location and Staging location if they\ndo not already exist. If they do exist, make sure that the RICOH ProcessDirector system user ( aiw1 is the default) in the RICOH\nProcessDirector group ( aiwgrp1 is the default) owns these directories.\n5. Determine how you want the input device to assign the workflow for each job.\nWhen using SubmitInputFiles as the submit step for the input device, you can select one of these:\nSet the Child workflow initialization step property to Not set and set the Child workflow property to the name of an existing workflow to\nassign the same workflow to every job that this input device processes.\nSet the Child workflow initialization step property to SetJobTypeFromRules and use the Child workflow parsing rules property to specify\nthe name of the control file that can set the workflow from a value of an option of the print command.\nRICOH ProcessDirector provides a sample control file that is used to set the workflow: receive_jcl_jobtype.cfg,\nreceive_lpd_jobtype.cfg, or receive_lpd_pdf_jobtype.cfg. The sample control file is installed in the /aiw/aiw1/samples/rules/\ndirectory. You can copy that file to the /aiw/aiw1/control_files/rules/ directory and modify it to meet your needs, then update the\nvalue of the Child workflow parsing rules property to point to your file.\nSet the Child workflow initialization step property to SetJobTypeFromFileName and use the Child workflow pattern property to specify the\nstring that RICOH ProcessDirector should look for in the input file name and use as the workflow name. If you use this method, you must\nmake sure that a workflow with the corresponding name exists.\n6. Click OK.\n7. To use the new input device, select it and click Enable, then select it again and click Connect.\nParent topic: Defining input devices\n1 of 1"}]}