{"doc_name": "cac_ReplacePrintedForms.pdf", "doc_path": "data/raw/RPD-en-US/cac_ReplacePrintedForms.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6544, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Replacing pre-printed forms - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP color solution scenarios / Replacing pre-printed forms\nReplacing pre-printed forms\nA bank wants to reduce the amount of paper that it stores. If the bank eliminates some of the pre-printed forms that they use by printing some\nstatements on a color printer, they can use the same type of plain paper for various applications.\nOver the last five years, the bank has purchased ten smaller banks and is in negotiations for several others. The parent bank uses an AFP system\nto print statements in-house on pre-printed forms. All the pre-printed forms contain color logos. Some of them also contain background images\nor blocks of color that divide the page into regions. The existing system consists of:\nRICOH InfoPrint Manager, including the Page Printer Formatting Aid (PPFA) feature\nThree duplex InfoPrint 4000 lines\nTwo duplex InfoPrint 4100 lines\nPrint jobs are submitted as line data and RICOH InfoPrint Manager transforms them into AFP. AFP resources are stored in a central location. There\nare no color production printers in use.\nThe banks that were acquired handled printing in different ways. Some of them had their own print shops; some of them outsourced print to\nother companies. The print staff at the parent bank has spent a significant amount of time moving the printing operations of the acquired banks\nto their in-house print operation, starting with the ones that outsourced their print. Five of them have been converted. The print shop\nadministrators are starting to face some interesting issues:\nThe increased workload for the in-house operation means that they need to increase their print capacity.\nEach of the banks that the parent has purchased has maintained its own logo and branding. Each time one of the banks has been integrated\nwith print operations, it has brought with it at least five different pre-printed forms that need to be ordered and stored.\nEven though each kind of pre-printed form comes from the same vendor, the colors vary noticeably.\nThe acquired banks will eventually replace their old logos and forms with the logo and forms of the parent bank, but the dates are not yet\nplanned.\nWith the increase in the number of forms that must be stored, space is becoming a problem. The team knows that they have to expand printing\ncapacity, but they do not have space for a new duplex line. If they could eliminate some of the paper that they have to store, they could use that\nspace for the new line.\nThe solution\nThe Ricoh team proposes an AFP color solution to:\nTransform their pre-printed forms to simple color statements and eliminate the need for pre-printed forms, thus reducing the paper that needs\nto be stored.\nStreamline the process of moving the acquired banks to the parent bank’s logo and forms.\nOptimize resource management to maximize throughput.\nMake the colors more uniform from job to job.\nThe solution adds a duplex InfoPrint 5000 line and AFP Resource Installer to the existing system and updates the other components to add AFP\ncolor support. The bank can choose which applications to move to the color workflow, taking into consideration the fact that the throughput of\nthe InfoPrint 5000 line is less than that of an InfoPrint 4100 line. In addition, those print jobs cannot be run on the existing InfoPrint 4100 or\nInfoPrint 4000 printers, since those printers cannot print the required color elements.\nAs the printing staff becomes proficient in using the system, they can start to prepare more applications for an eventual move to color by\nmigrating them to use the high-quality grayscale function available on their InfoPrint 4100 printers. Then, when they are ready to add another\ncolor line (either by eliminating more paper storage or by replacing one of the InfoPrint 4000 lines), they can move those print jobs to the color\nprinters.\nSolution diagram for adding RICOH AFP Resource Installer and an InfoPrint 5000 printer\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:22 PM Replacing pre-printed forms - Jenski - Test portal- RPD Linux\nExisting system objects\nPre-press processing\nNew system objects PDF\nGet the PDF file of the preprinted sheet and background\ninstall it as a simple page PDF object. Image\nInstall the input profile for that object, if needed.\nUse PPFA to update the FORMDEF to call the\nobject as a medium overlay.\nColor resources (Input\nPPFA proflle, background\nImage)\nResource Management\nInfoPrint AFP\nResource\nInstaller\nAFP AFP\nResource Resource\nLibrary Library\nInfoPrint Manager\nIPDS exchange with printer to see if resources\nare already present; download those that are\nneeded (including all color profiles that have not\nbeen captured) along with job data.\nlnfoPrint 5000 printer\nDownloaded Captures\nresources resources\nImplementation\nTo implement the color solution, the bank printing staff works with the Ricoh team through several phases:\nPlanning the color solution\nDetermine where the resource library should be located so that it is accessible to all the applications that need to use it.\nDetermine which types of resources can or should be saved on the printer for reuse. For example, signature files should probably not be saved\non the printer; company logos and background images probably should be saved.\nInstalling and configuring the system\nInstall the InfoPrint 5000 printers.\nApply service updates to RICOH InfoPrint Manager and PPFA to add color support.\nInstall AFP Resource Installer.\nConfiguring resource management for optimal performance\nUse AFP Resource Installer to install the CMRs for the InfoPrint 5000 printers.\nGet the PDF file of the pre-printed form or use graphic art software to create a full page image to use as the background image.\nUse AFP Resource Installer to install the PDF or image as a data object resource and associate a color conversion CMR with it.\nConfigure RICOH InfoPrint Manager to recognize the resource libraries that AFP Resource Installer uses and to send print jobs to the new\nprinter.\nUse PPFA to create a form definition and page definition that calls the new data object resource.\nRefer to the object using the ID that you specified when you installed it.\nCopy any new form definitions or page definitions that you created into an existing resource library.\nTesting system operations\nCreate a print job that calls the form definition and page definition, and that points to the new resource libraries.\nSubmit the print job.\nCheck the color output.\nParent topic: AFP color solution scenarios\n2 of 2"}]}