{"doc_name": "cac_CMRModeInstr.pdf", "doc_path": "data/raw/RPD-en-US/cac_CMRModeInstr.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2553, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Instruction Processing Mode - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Color Management Resources / CMR Processing Modes / Instruction Processing Mode\nInstruction Processing Mode\nCMRs with the instruction processing mode refer to processing that is done to prepare the resource for a specific printer that uses a certain paper\nor another device. Generally, instruction CMRs refer to output data and are similar to ICC output profiles.\nThe instruction processing mode is used with color conversion, tone transfer curve, and halftone CMRs. In instruction processing mode, these\nCMRs indicate how the system must convert a resource so it prints correctly on the target printer. The manufacturer of your printer should\nprovide ICC profiles or a variety of CMRs that you can use. Those ICC profiles and CMRs might be installed in the printer controller, included with\nthe printer on a CD, or available for download from the manufacturer's website.\nIf you send a color AFP print job to a printer that supports AFP Color Management, color conversion and tone transfer curve CMRs in instruction\nprocessing mode can be associated with the job. When the printer processes the print job, it applies the CMRs in this order:\n1. Color conversion CMRs in audit processing mode to convert the resources into the ICC profile connection space (PCS).\n2. Color conversion and tone transfer curve CMRs in instruction processing mode to convert the resources into the color space of the printer.\n3. Halftone CMR in instruction processing mode to convert the job pages from their digital format into the pattern of dots that the printer\ncan produce.\nIn some cases, CMRs that are usually used as instruction CMRs can be used as audit CMRs. For example, if you send a very large print job to a\nhigh-speed printer, the images in the print job are converted into the color space of that printer by using a color conversion CMR with the\ninstruction processing mode. However, if you have to reprint part of the job on a different printer, the system must convert the print job into the\ncolor space of the second printer. In that case, the color conversion CMR of the first printer is used in the audit processing mode to move the\nimages back into the PCS. Then, the system uses a color conversion CMR of the second printer in instruction mode to convert the images into its\ncolor space.\nOther topics in this section:\nAudit Processing Mode\nLink Processing Mode\nParent topic: CMR Processing Modes\n1 of 1"}]}