{"doc_name": "pdfw_t_plugin_addbarcode.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addbarcode.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 14648, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Adding a barcode to a PDF file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Adding markup to a PDF file\n/ Adding a barcode to a PDF file\nAdding a barcode to a PDF file\nTo add a barcode to a PDF file, select the area where you want to place the barcode, specify a barcode type, and add content. You can limit the\nplacement of a barcode to specific pages in each page group by specifying a rule or typing page numbers.\nRICOH ProcessDirector Plug-in for Adobe Acrobat supports the following barcode types:\n2of5 (Interleaved 2 of 5)\nCode128\nCode39\nDatamatrix\nIMB (Intelligent Mail Barcode)\nQR code (Quick Response Code)\nRM4SCC (Royal Mail 4-State Customer Code)\nRMM (Royal Mail Mailmark)\nNote:\nIf you are creating child jobs, make sure that the barcode type supports periods. Child jobs have a period in the job number (for example,\n10000001.1). Automated Verification workflows create child jobs for open-loop reprints. The Postal Enablement\nGroupDocsForPostalProcess workflow creates a child job when the documents in the job qualify for more postal processing.\nYou can create a barcode from content within the PDF file. For example, if your processing extracts the customer account number for every\nmailpiece you print, you can create a barcode from the account number. You first create a document property for the account number. You can\nthen select that document property when defining the barcode content.\nIf you want to use text in the PDF file to trigger placement of a barcode on a specific page in a page group, you first create a conditional trigger\non that text and define a rule with the trigger as a condition. You can then select that rule when defining the barcode.\nTo add a barcode:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains a page group definition or define a page group.\n2. Use the left mouse button to draw a box where you want the barcode to print. You do not need to draw the box to the exact size of the\nbarcode.\nThe barcode is not resized to fit within the box. If you draw a box to the approximate size of the barcode, you can see its position relative\nto all the markup you add to the PDF file.\n3. Click Add Barcode.\n4. Type a Name for the barcode. Do not use spaces or special characters (such as @, #, $, or %) in the name. You can use periods and\nunderscores.\n5. Optional: Use the Location section of the definition window to change the placement of the barcode by entering new Horizontal and\nVertical coordinates. These coordinates specify the distance between the top left corner of the page and the top left corner of the barcode,\nbefore any rotation. If your manufacturing equipment has a specification for the location of the barcode, use these coordinates to set a\nprecise location.\nNote:\nWidth and Height change the size of the markup box but do not affect the location or size of the barcode.\n6. Select the clockwise Rotation (degrees). The reference point for rotating a barcode is its top left corner.\n7. Use the Placement Conditions section to specify the pages to place the barcode on. Do either of these steps:\nSelect Pages based on a rule, and then select a rule from the list. The default rule is All Pages. You can also:\nClick the icon to define a new rule.\nClick the icon to go to the Rules Manager.\nSelect Specify pages and type the pages in each page group that you want. You can:\nUse a hyphen to separate the first and last pages in a page range.\nUse a comma to separate page selections.\nType n to specify the last page.\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:17 PM Adding a barcode to a PDF file - Jenski - Test portal- RPD Linux\nExample: a PDF file has two page groups. The first has four pages, and the second has seven pages. Specifying pages 3–n places\nmarkup on pages 3–4 in the first page group, and pages 3–7 in the second.\n8. Use the Barcode Configuration section to define the mechanical attributes and type of the barcode.\n1. Use the Barcode Type list to select one of the following barcodes: 2of5, Code128, Code39, Datamatrix, IMB, QR code, RM4SCC, or\nRMM.\n2. Click the Settings button to set the mechanical attributes of the barcode.\nThe Table Barcode mechanical attributes describes the settings for each barcode type.\nBarcode mechanical attributes\nBarcode type Attribute and description\n2of5 and Code39 The unit of measure for the numeric attributes for these barcode types is millimeters.\nbarHeight This attribute determines the vertical height of each bar.\nchecksumMode This attribute determines the behavior of checksums.\nTo add the checksum to the message, enter: add\nTo check the checksum when rendering the barcode, enter: check\nTo disable checksum processing, enter: ignore\nTo enable the default barcode behavior, enter: auto\nmoduleWidth This attribute is the width of the narrow element.\nwidthFactor This attribute is the multiplier for the wide element or how many times wider it is than the\nnarrow element.\nCode128 The unit of measure for the numeric attributes for this barcode type is millimeters.\nbarHeight This attribute determines the vertical height of each bar.\nchecksumMode This attribute determines the behavior of checksums.\nTo add the checksum to the message, enter: add\nTo check the checksum when rendering the barcode, enter: check\nTo disable checksum processing, enter: ignore\nTo enable the default barcode behavior, enter: auto\nmoduleWidth This attribute is the width of the narrow element.\nDatamatrix The unit of measure for the numeric attributes of this barcode type is millimeters.\nmaxSize This attribute determines the maximum number of modules in both X and Y directions.\nminSize This attribute determines the minimum number of modules in both X and Y directions.\nmoduleWidth This attribute determines the size of each pixel element.\nshape The FORCE_SQUARE value forces the use of square symbols. No other values are supported.\nIMB and RM4SCC The unit of measure for the numeric attributes for these barcode types is millimeters.\nascenderHeight This attribute defines the height of both the ascender and descender sections of long\nbars.\nintercharGapWidth This attribute defines the width of each gap. The value you enter must be from 0.38\nthrough 0.63 and must be the same as the moduleWidth value.\nmoduleWidth This attribute defines the width of each bar and must be from 0.38 through 0.63.\ntrackHeight This attribute defines the height each short track or center bar and must be a value from 1.02\nthrough 1.52.\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:17 PM Adding a barcode to a PDF file - Jenski - Test portal- RPD Linux\nQR code The unit of measure for the numeric attribute of this barcode type (moduleWidth) is inches.\nencoding This attribute defines the encoding type of the QR barcode.\nTo specify UTF-8 encoding, enter: Auto\nTo specify that the Unicode data is output in that format, enter: Shift_JIS or another supported type\nof Shift JIS code points, such as sjis or x-sjis.\nNote:\nThe input data for the barcode must always be Unicode character points. Do not use Shift_JIS or\nany other non-Unicode input data.\nerrorcorrection This attribute defines the capability to restore the data in a damaged QR barcode.\nTo specify that 7% of the code can be restored, enter: L\nTo specify that 15% of the code can be restored, enter: M\nTo specify that 25% of the code can be restored, enter: Q\nTo specify that 30% of the code can be restored, enter: H\nmoduleWidth This attribute determines the size of each pixel element.\nversion Do not change this attribute; it is reserved for future use.\nRMM shape This attribute determines the type of barcode.\nTo specify a 2D Type 9 barcode, enter: square\nTo specify a 2D Type 29 barcode, enter: rectangle\nThe values for the attribute are not case-sensitive.\n9. Select one of the following from the Content Type list.\nNote:\nBecause RICOH ProcessDirector generates barcode content as it prepares a PDF file for printing, RICOH ProcessDirector Plug-in for\nAdobe Acrobat cannot always determine valid content for a barcode. For example, some barcodes cannot accept text or line\nbreaks. If you include invalid barcode content, the PDF file job might fail in the RICOH ProcessDirector BuildPDFFromDocuments\nstep.\nJob Property Select a job property whose value you want to include in the barcode.\nDocument\nSelect a document property whose value you want to include in the barcode.\nProperty\nStatistic Select a statistic whose value you want to include in the barcode.\nText Enter text that you want to include in the barcode.\nSelect this content type when you want to force a line break. The break occurs after the last character of the prior\nLine Break\nbarcode content.\nScript Only select this option on the advice of your software support representative.\n1. If you selected a document property, job property, or statistic Content Type, you can apply text modifier rules to the value of the\nproperty or statistic. Click the icon to display a Modify Text window for defining one or more modifier extraction rules to extract\nthe exact value you need.\n2. Enter text into the Text to Modify field. RICOH ProcessDirector generates or extracts statistics and properties as it processes each page\ngroup in production PDF files. Because these values are not available to RICOH ProcessDirector Plug-in for Adobe Acrobat, you must\nenter a text value that represents the values that RICOH ProcessDirector processes. The modifier rule is a template that is applied to\nall values of the content type that you selected. For example, you want to print only the last eight digits of customer account number,\nand you have stored the entire number into a document property. You select Document Property as the Content Type, and select the\naccount document property as the Content Value. You define two Remove Character text modifier rules to strip dashes and spaces\nfrom the number to make them all uniform. Then you define a Substring by Position rule to retain only the last eight digits. You do\nnot need to know any single value of a document property to create modifier rules. You need to know only the possible formats that\ncould occur in your PDF files.\n3. Choose one of these modifiers:\nContent modifiers\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:17 PM Adding a barcode to a PDF file - Jenski - Test portal- RPD Linux\nModifier Action\nRemove Character Type one character or a blank character (use the space bar to type a blank character) that\nyou want to remove from the value. The character is case-sensitive. Then select one of\nthese buttons:\nRemove all instances of the character\nThe specified character is removed from all positions in the value.\nFor example, an account number is: 324-1443255-11. You can type a - to remove all -\ncharacters from the value, producing 324144325511.\nRemove leading characters\nThe specified character is removed from the beginning of the value. For example, if you\ntype a blank character, all blank characters are removed from the beginning of the value.\nRemove trailing characters\nThe specified character is removed from the end of the value. For example, if you type a\nblank character, all blank characters are removed from the end of the value.\nRemove leading and trailing characters\nThe specified character is removed from the beginning and end of the value. For\nexample, if you type a blank character, all blank characters are removed from the\nbeginning and end of the value.\nSubstring by Position Select Beginning of Line or End of Line from the Starting From list. Select a number for\nFirst Position to indicate the location of the first character in the text value. Select a\nnumber for Number to Retain to indicate how many characters are retained.\nSubstring by Delimiter Type a character or a blank character in the Delimiter field to indicate where the text value\nis split into separate string segments. The character and the text string are case-sensitive.\nSelect Beginning of Line or End of Line from the Starting From drop-down menu.\nSelect a number for First Position to define the position of the delimiter in the text string.\nSelect a number for Number to Retain to define the number of text string segments to\nretain.\nThese examples show how to select text string segments by specifying a delimiter:\nFor the account number 324-1443255-11, you can use - as the delimiter to split the\nvalue into these three text strings: 324, 1443255, and 11. Select Beginning of Line. To\nselect the second and third text strings (1443255 and 11), select 2 for both First Position\nand Number to Retain.\nFor the mailing address Eldorado Springs CO 80025, you can use a blank\ncharacter as the delimiter to split the value into these four text strings: Eldorado, Springs,\nCO, and 80025. Select End of Line.\nTo select the zip code, select 1 for both First Position and Number to Retain.\nTo select the state, select 2 for First Position and 1 for Number to Retain.\nTo select the city, select 3 for First Position and 10 for Number to Retain. By specifying\n10 for Number to Retain, you can select city names with up to ten words.\nPad with Character Select Beginning of Line or End of Line from the Padding Location list. Enter a character or\na blank character as the padding character into the Character to Pad with field.\nEnter a number in the Minimum Padded Text Length field to define the minimum length of\nthe text string. If the number of characters in the text string is less than this minimum\nlength, padding characters are added until the text string equals the minimum length.\n10. To add a new content definition row, click the icon. After you have added all content types and modifier rules to the barcode, you can\nplace a check mark in the box next to a content type and use the up and down arrows to reorder the content. Use the icon to delete\nselected content.\n11. If you defined multiple lines of text and you want RICOH ProcessDirector Plug-in for Adobe Acrobat to remove lines that only contain white\nspace, click the Remove blank lines check box to select it.\n12. To create your barcode configuration, click OK.\n13. To verify that the barcode has the content and page placement you intended, click Ricoh ⇒ Preview.\n14. Optional: You can edit the barcode definition by double-clicking the barcode box or by right-clicking the box and clicking Edit.\n15. When you are ready to save all your enhancements to the PDF file, including the new barcode definition, click Ricoh ⇒ Save Control File.\n16. In the RICOH ProcessDirector BuildPDFFromDocuments step, specify the name and location of the control file that contains the barcode\ndefinition.\nParent topic: Adding markup to a PDF file\n4 of 4"}]}