{"doc_name": "aiw00p19.pdf", "doc_path": "data/raw/RPD-en-US/aiw00p19.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2661, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Disabling objects - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Disabling objects\nDisabling objects\nDisabling an object makes it unavailable to RICOH ProcessDirector. Objects include servers, notifications, media, and devices such as input devices\nand printers. Features might add other kinds of objects as well.\nA disabled input device can still be connected and receive input files.\nJobs that are already scheduled to a disabled printer still print on it, unless they are scheduled to a different printer.\nNote:\nShutting down a printer both disables it and releases it from RICOH ProcessDirector, while simply disabling it does not release it. Other\nprograms can send jobs to a shutdown printer, but not to a disabled printer that has not been shut down.\nTo disable an object:\n1. Do one of these:\nFrom the Main page:\n1. Find the object in its portal.\n2. Right-click the object and select Disable.\nFrom the Administration page:\n1. In the left pane, click the object type.\n2. In the table, right-click the object and select Disable.\n2. If you see a confirmation message, click Yes.\nNote:\nAfter RICOH ProcessDirector disables an input device or printer, the symbol next to it changes to the disabled symbol, which is a broken\norange arrow.\nAfter a system shutdown and restart, all the printers are disabled. If you want all the printers that were enabled before the shutdown to\nbe enabled after the system is restarted, you can change the Remember enabled status of printers property value to Yes on the\nAdministration ⇒ Settings ⇒ System page.\nWhen you disable a secondary server:\nThe server is still connected to the RICOH ProcessDirector primary server, so there is communication between them. You can still work\nwith that server through the web interface. For example, you can change properties and then enable the server again when you are\nready.\nThe server does not become idle immediately after it is disabled; it finishes the jobs that it is currently processing and sends results to\nRICOH ProcessDirector.\nRICOH ProcessDirector disables any printers that are associated with the secondary server. Any jobs in the system that are already\nassigned to printers on those servers still print, unless you move them to a different printer. RICOH ProcessDirector does not schedule\nadditional jobs to those printers.\nRICOH ProcessDirector changes the connection status of any input devices that are associated with a disabled secondary server to\nUnable to connect. RICOH ProcessDirector automatically connects the input device when you enable the secondary server again.\nParent topic: Managing system objects\n1 of 1"}]}