{"doc_name": "indexingafpfiles.pdf", "doc_path": "data/raw/RPD-en-US/indexingafpfiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2764, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Indexing AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files\nIndexing AFP files\nAFP Indexer can create page groups, define supplemental pages, and create indexes in AFP files so that the information can be used in RICOH\nProcessDirector to navigate to indexed pages in the file, exclude non-customer information from mailpieces, and reprint specified pages.\nIn this section:\nCreating page groups\nYou can create page groups in AFP files. Page groups organize AFP files into smaller, uniquely identifiable units. When you create page groups,\nany existing page groups defined in the AFP file itself are not used.\nDefining supplemental pages\nYou can define pages in an AFP file as supplemental pages when you do not want to include them in page groups. For example, header and\ntrailer pages, separator pages, and any page that should be excluded from a customer statement can be defined as supplemental pages.\nCreating index tags\nYou can create index tags in AFP files. When a file contains index tags, you can use the RICOH ProcessDirector viewer to navigate in the file to\nfind specific data viewer to navigate in the file to find specific data. You can also use the index tag values in barcode data, and to assign values to\ndocument properties.\nWorking with page-level indexes\nPage-level index tags are defined on individual pages in a page group rather than within the page group.\nModifying or deleting AFP Indexer definitions\nAfter you create triggers and index tags for page groups, pages in page groups, and supplemental pages, you can modify or delete any of them.\nUsing existing page groups and index tags\nIf page groups and index tags are defined in the AFP file instead of a Visual Workbench control file, you can choose whether to use the existing\npage groups in the AFP file and, if the page groups are nested, which level of page groups to use.\nEditing text for triggers and index tags\nWhen you create or modify a trigger or an index tag, you can edit the text value. You can also edit the text value for existing index tags that are\ndefined in the AFP file or the Visual Workbench control file.\nManaging comments\nYou can manage comments in the AFP Indexer portion of the RICOH Visual Workbench control file.\nAdding steps to index AFP files\nAfter you create page groups and index tags in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more workflows\nto create page groups and index tags in production AFP files that use the workflows. The step names the Visual Workbench control file that\ncontains definitions for the page groups and index tags.\nParent topic: Working with sample AFP files\n1 of 1"}]}