{"doc_name": "aiw_c_addwaitstep.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_addwaitstep.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3534, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Adding a step that makes a job wait - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Adding a step that makes a job wait\nAdding a step that makes a job wait\nYou can add a step based on the Wait step template to a workflow to cause a job to wait a set amount of time or until a specified time to\ncontinue processing.\nThere are various reasons to use the Wait step to pause a job. For example, you could:\nCreate a workflow that processes a job up to the point where a cancel decision is required from the customer.\nYou can set the wait period to the deadline for receiving the cancellation order and then have the job released automatically if the cancellation\norder does not arrive.\nCreate a workflow that pauses a job until a pull list arrives.\nYour customer often sends requests to suppress printing of some documents in a job. You have set a deadline of 9 AM with your customer to\nhave a pull list delivered that you can use to suppress printing of some documents. You can put a Wait step in the workflow just before the\nSetDocPropsFromList step that reads the pull list to automate processing.\nCreate a workflow that waits until an optimum time to send email documents to a third-party email service.\nYou might want to wait until after regular working hours to send a large number of email documents to the service to have them sent out\novernight. Insert the Wait step just ahead of the EmailDocuments step in the workflow.\nTo define a workflow with a Wait step:\n1. Click the Workflow tab.\n2. Right-click a workflow that you want to use as a model, and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Review the steps that are included in the workflow and the default values that they set.\n5. Determine where in the workflow you want the waiting period to occur. Add a step based on the Wait step template to the workflow in\nthe appropriate place and set values for the job properties.\nYou can set either a specific time for the wait period to end or a length of time for the wait period. You can use these properties to control\nthe waiting period:\nUse the Wait for property to designate a time period for the job to wait before processing continues.\nUse the Wait until property to set a specific time when the waiting period expires and processing resumes.\nSet the time zone with the Time zone property. The Time zone applies only if you use the Wait until property. The default value for the\nproperty is the time zone of the server that RICOH ProcessDirector is installed on.\nIf you set values for both Wait until and Wait for, the step calculates the end time for each option. You can choose whether to move the\njob to the next step when the first end time is reached or when the last end time is reached.\nFor example, a workflow contains a Wait step with these settings:\nWait until: 12:00 PM\nTime zone: Eastern Standard Time (EST)\nWait for: 3 hours\nA job reaches that step at 10:00 AM EST. The step determines that the two possible end times are:\nWait until: 12:00 PM EST\nWait for: 3 hours (1:00 PM EST)\nIf Complete step after is set to First occurs, the job moves to the next step at 12:00 EST. If Complete step after is set to Last occurs, the\njob moves to the next step at 1:00 PM EST.\nTo see the calculated time when the waiting period for a job ends, check the Wait step ends property on the Wait tab of the job property\nnotebook.\n6. Save the workflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}