{"doc_name": "InserterControlFiles.pdf", "doc_path": "data/raw/RPD-en-US/InserterControlFiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4513, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Inserter control files - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Inserter and Quadient Inserter Express / Inserter control files\nInserter control files\nFile-based inserter controllers use an inserter control file to control the insertion of the documents in the job. RICOH ProcessDirector can create\nan inserter control file for each job and send it to the inserter controller before the job is inserted.\nSome inserters use two control files for each job. In this case, RICOH ProcessDirector can create two control files for each job. The first and\nsecond control files can have different formats and content.\nNote:\nThe Quadient Inserter Express feature only supports the use of one inserter control file.\nThe contents of the control file vary, depending on the requirements of the inserter. The file contains an optional header record, which usually\ncontains information about the entire job, and a record for each document in the job. The record for each document contains information\nrelated to insertion, such as which bins of the inserter should deliver inserts for the document, whether the document should be diverted to a\nspecial output bin, and so on.\nRICOH ProcessDirector can write control files in any of these output formats:\nFixed-length record (FLR): The fields in each record have a fixed length, with no delimiter between each field.\nComma-delimited (DEL): The fields in each record are separated by a comma.\nExtensible Markup Language (XML): The file is in XML format.\nThe Encoding property lets you specify if the data should be encoded using ASCII or UTF-8. When the format is FLR, use UTF-8 if any properties\nhave multi-byte character set encoding.\nBecause inserter control files vary in format and content, you create these files for each type of inserter:\nRules file: Defines the fields in each record (except for the header record) of the inserter control file and specifies the value to put in each field\nof the record. This file is required. RICOH ProcessDirector uses the rules file to write the inserter control file records. Typically, RICOH\nProcessDirector writes one record for each document in a job. The records follow the header record (if any). In each field, you can put static text\n(such as blanks or zeroes) or the value of a RICOH ProcessDirector property (such as the Document number property).\nHeader rules file: Defines the fields in the header record and specifies the value to put in each field of the record. RICOH ProcessDirector uses\nthe header rules file to write the header record at the top of the inserter control file. Typically, RICOH ProcessDirector creates one header record\nin an inserter control file. Some inserters generate several XML elements in the header, but these elements occur only once in the XML output\nfile. In each field, you can put static text (such as characters, blanks or zeroes) or the value of a RICOH ProcessDirector property (such as the Job\nnumber property). This file is required only if the inserter control file format specifies a header record.\nRICOH ProcessDirector provides sample rules files that you can modify for your installation. With the Quadient Inserter Express feature, you\nreceive sample files for Quadient inserters. With the full Inserter feature, you receive sample files for a wider variety of inserters.\nOn the Send command property for the inserter controller object, you specify a command or script that RICOH ProcessDirector runs to send the\ninserter control file (or files) to a directory where the inserter controller can read the control file. The directory can be on the same computer or\non a different computer. RICOH ProcessDirector names the inserter control file as specified on the send command or script. The file name can\ninclude the value of any job property, such as the Job number or Inserter job name property. (By default, the inserter job name is the job number;\nhowever, you can specify another value in the Inserter job name property.) For example, if the job number is 10000023, the file name can be\n10000023 or Kern10000023. The file extension can be any value.\nRICOH ProcessDirector provides several scripts that you can use to send the control file to the inserter controller. Or, you can use another script\nthat accepts the same parameters as the provided scripts. For information about using the scripts, see the related Task topics.\nParent topic: Inserter and Quadient Inserter Express\n1 of 1"}]}