{"doc_name": "aiw_c_xml_DefineWorkflow.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_xml_DefineWorkflow.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3508, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Defining workflows to process XML - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Defining workflows to process XML\nDefining workflows to process XML\nTo process XML jobs, you define one or more workflows that manipulate the XML.\nBefore you define XML workflows:\nRead the usage scenario for processing orders in an XML file. That scenario uses four workflows to process XML.\nEvaluate the XML files that provide input to the process and decide how many workflows are required to process the XML. See the related topic\nabout preparing to receive XML.\nIf your company uses a proxy server and your workflow has a DownloadFile step, set up RICOH ProcessDirector to use the proxy server.\nTo define workflows to process XML:\n1. On the Workflow page, add the first workflow.\n2. After the SetJobPropsFromTextFile step, add a step based on the DetectInputDataStream step template.\n3. If the workflow creates jobs from XML, add one or more steps based on the CreateJobsFromXML step template.\nSet these properties:\nFor the XML input file property:\nUse the default value if the XML file is in the spool directory for the job.\nSpecify the directory path and file name if the XML file is at another location.\nFor the XPath expression to create jobs property, specify the XPath expression that you defined for the step.\nFor the Workflow for new jobs property, select the workflow that the CreateJobsFromXML step submits the new jobs to.\nFor the Create as child job property:\nTo create child jobs, select Yes.\nFor example, create child jobs for items in an order.\nTo create independent jobs, select No.\nFor example, do not create child jobs for independent orders.\nFor Stop when no matching elements:\nSelect Yes if every XML input file has one or more elements that match the XPath expression. You want the job to go into error when\nthe step does not find any elements that match.\nFor example, a CreateJobsFromXML step creates an XML job for each order in an XML input file. Every XML input file has one or more\norders. You want the job to go into error when the step does not find any order elements.\nSelect No if some XML input files have no elements that match the XPath expression. You want the job to continue to the next step in\nthe workflow when the step does not find any elements that match.\nFor example, a CreateJobsFromXML step creates an XML job for each print item in an order. Orders can have print items, promotional\nitems, or both. You want the job to continue to the next step in the workflow when the step does not find any matching elements for\nprint items.\nFor the Name for new job property, specify the value to use for the Name property of the jobs that the step creates.\n4. If the workflow converts XML data to another format, add one or more steps based on the ApplyXSLTransform step template.\nAs a guideline, add an ApplyXSLTransform step to the workflow that a CreateJobsFromXML step submits jobs to.\nThe ApplyXSLTransform step can convert XML elements into RICOH ProcessDirector job or document properties that other steps in the\nworkflow use.\n5. To use a URL to download files for processing, add a step based on the DownloadFile step template.\n6. Add the steps required for your process.\nFor example, add the steps required to process PDF files.\n7. Save the workflow.\n8. To add the next workflow, repeat the steps for adding the first workflow.\n9. When you finish adding workflows, test them.\nParent topic: Preparing to use workflows\n1 of 1"}]}