{"doc_name": "whitespace_overview.pdf", "doc_path": "data/raw/RPD-en-US/whitespace_overview.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5905, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM White space - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / Whitespace Manager / White space\nWhite space\nWhite space is the area on a page that does not contain any text. You can define white space in AFP files by choosing known white space on a\npage or by searching for the first available white space in a page group.\nWhen Whitespace Manager searches for white space on a page, it looks on the logical page for areas without text blocks. Areas with overlays,\npage segments, barcodes, and images are considered available white space.\nWhen you create a white space definition, you use these options to select the pages in the page group where you want the white space defined:\nThis page\nThis and following pages\nLast page\nFor known white space definitions, you can create one area of known white space for each page in a page group using This page or Last page.\nThis equates to a total of n definitions, where n is the number of pages in a page group. For white space definitions from a search, you can\ncreate one area of white space for each page in a page group using This page, one area of white space using This and following pages, and one\narea of white space using Last page. This equates to a total of n + 2 definitions. Therefore, the maximum number of white space definitions that\nWhitespace Manager lets you create is:\n2n + 2\nFor example, if a page group has three pages, you can create 3 definitions for known white space and 3 + 2 definitions for white space\ndefinitions from a search. Therefore, the maximum number of white space definitions allowed is:\n(2 x 3) + 2 = 8\nIf you try to create more than the allowed number of white space definitions on a page, you see the message \"No more white space definitions\nare allowed for this page.\"\nWhen you create a white space definition, you also choose the origin and size of the area for the white space. If you are searching for available\nwhite space on a page, you decide on a minimum width and height for the white space area that you want Whitespace Manager to look for (at\nleast 0.5 inches or 12.7 millimeters). Whitespace Manager searches for the largest white space area on a page that meets the minimum\ndimensions specified. When Whitespace Manager finds white space that meets the specifications on that page, it stops the search.\nWhite space definition results shows how Whitespace Manager creates white space definitions based on the page options that you select.\nWhite space definition results\nWhite space definition Page option Result\nKnown white space This page Whitespace Manager creates a white space definition on the current page of\nthe page group and displays the white space as a colored box. If a white space\ndefinition was previously found on the page from a search, the known white\nspace definition takes precedence and is displayed in the user interface. This\noption is only available if a known white space area has not been defined on\nthe current page.\nLast page Whitespace Manager creates a white space definition on the last page of the\npage group and displays the white space as a colored box. If a white space\ndefinition was previously found on the page from a search, the known white\nspace definition takes precedence and is displayed in the user interface.\nYou might want to create a Last page definition instead of This page when the\npage groups contain a variable number of pages and you want the white\nspace to always be on the last page.\nThis option is only available if the current page is the last page in the page\ngroup and a known white space area has not been defined on the page.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:24 PM White space - Jenski - Test portal- RPD Linux\nWhite space definition Page option Result\nWhite space from a search This page Whitespace Manager creates a white space definition on the current page of\nthe page group and displays the white space as a colored box unless:\nA known white space area is already defined on the page.\nNo white space area meets the specified dimensions.\nThis option is only available if white space from a search has not already been\ndefined using This page.\nThis and following Whitespace Manager searches the current page and all pages that follow in\npages the page group, creates a definition on the first page where it finds white\nspace, and then displays the white space as a colored box. It does not display a\nwhite space box if:\nA known white space area is already defined on a page.\nNo white space area meets the specified dimensions.\nNotes:\n1. This option is only available if white space from a search has not already\nbeen defined using This and following pages.\n2. You must display each page in the page group to see if a white space\nbox is created on a page.\nLast page Whitespace Manager creates a white space definition on the last page of the\npage group and then displays the white space as a colored box unless:\nA known white space area is already defined on the page.\nNo white space area meets the specified dimensions.\nYou might want to create a Last page definition instead of This page when the\npage groups contain a variable number of pages and you want the white\nspace to always be on the last page.\nThis option is only available if the current page is the last page in the page\ngroup and if white space from a search has not already been defined using\nLast page.\nKeep in mind that not all the white space definitions that you create are displayed in the user interface because Whitespace Manager follows\nthese rules for determining which white space definition is displayed on a page:\nOnly one white space definition is displayed per page.\nA known white space definition is displayed before white space that was defined from a search.\nIf you delete a known white space definition, white space defined from a search can be displayed on a page.\nParent topic: Whitespace Manager\n2 of 2"}]}