{"doc_name": "aiw00configautoprinter.pdf", "doc_path": "data/raw/RPD-en-US/aiw00configautoprinter.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2135, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Configuring printers to automatically match media - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring media / Configuring printers to automatically match media\nConfiguring printers to automatically match media\nIf your printer can detect media information and send it over SNMP or JMF, you can have RICOH ProcessDirector automatically match the media\nrequested by a job with the media ready in the input trays for your printers.\nAutomatically matching media is useful only for printer controllers with direct print queues. If a controller queues jobs for later printing, the\nmedia in the printer’s input trays might change between the time when the job is sent to the print queue and when the job is printed.\nThis procedure does not apply to PCLOut printers. PCLOut printers come with the AFP Support feature.\nTo configure a printer to automatically match media:\n1. Automatically define all the media objects you need.\nIf your printer cannot send RICOH ProcessDirector all the information needed to create your media objects, you cannot configure the\nprinter to automatically match media.\n2. Turn on automatic media matching:\n1. In the Printers portlet, select the printer. Click Actions ⇒ Properties.\n2. In the left pane, click Show all tabs to expand the notebook.\n3. If the printer is using SNMP to detect media information, make sure the Use SNMP and Get tray information from printer properties\non the SNMP tab are both set to Yes.\nSkip this step if you are configuring a Ricoh PDF printer that supports using JMF to detect media information. RICOH ProcessDirector\nuses JMF with those printers.\n4. In the Scheduling area, set the Media supported property to Ready media objects.\nThis setting limits the media that the printer supports to only that media that is loaded on the printer.\n5. In the Printers portlet, select the printer. Click Actions ⇒ Show Trays.\nWhen RICOH ProcessDirector sends a job to a printer, the printer examines the media properties specified for the job. If media in an input tray\nmatches the properties, the printer prints the job.\nParent topic: Configuring media\n1 of 1"}]}