{"doc_name": "aiw_ConfigMediaForTotalFlowPrint.pdf", "doc_path": "data/raw/RPD-en-US/aiw_ConfigMediaForTotalFlowPrint.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4368, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Configuring media for a Ricoh TotalFlow printer - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Configuring to send jobs to a printer that uses RICOH TotalFlow Print server / Configuring media for a Ricoh TotalFlow printer\nConfiguring media for a Ricoh TotalFlow printer\nRICOH ProcessDirector can detect the paper that is loaded on a Ricoh TotalFlow printer and can be configured to create media objects\nautomatically to represent that paper. Then, it can use media as a scheduling criteria and only schedule jobs to the printer when the correct\npaper is loaded. However, you must do more configuration to make sure that the media names are the same on the printer and in RICOH\nProcessDirector.\nNote:\nRICOH ProcessDirector can only detect the paper that is currently loaded. It does not import the entire paper catalog.\nTo configure media for a Ricoh TotalFlow printer:\n1. Load paper on the printer.\n2. In RICOH ProcessDirector, click the Administration tab.\n3. In the left pane, click Media ⇒ Media Settings.\n4. In the Media Matching section, make sure that the Use the properties selected below option is selected.\nThis setting lets RICOH ProcessDirector use the media values reported by the printer over SNMP to determine what media is loaded. If the\nvalues do not match any existing media objects, RICOH ProcessDirector creates media objects automatically.\nNote:\nIf your jobs specify media by product ID or name, you can change the Media Matching setting back to Use media product ID or\nmedia name after you complete this procedure.\n5. Select the properties that you use to schedule jobs to printers based on the media that is ready. For example, if your job tickets specify\nmedia using paper width and weight, select Media width and Media weight.\nThis setting has no effect on the media properties that the Ricoh TotalFlow printer reports to RICOH ProcessDirector. The printer always\nreports all media properties that are set.\n6. Click SAVE.\n7. In the left pane, click Devices ⇒ Printers.\n8. Find and right-click the Ricoh TotalFlow printer. Select Properties.\n9. Click the SNMP tab.\n10. Make sure the Use SNMP property is set to Yes. If it is not, change that value to Yes.\n11. Make sure the Get tray information from printer property is set to Yes.\n12. Click OK\n13. Right-click the Ricoh TotalFlow printer and select Show Trays.\nRICOH ProcessDirector connects with the printer and retrieves information about the media that is loaded. It compares the values for\nwidth, length, weight, color, and type to the media objects that exist in RICOH ProcessDirector. If no media exists with those values, it\ncreates a media object with that information.\nNote:\nIf the Media to use property of the printer is set to System, RICOH ProcessDirector creates a system media object. If the Media to\nuse property is set to Printer, RICOH ProcessDirector creates a printer media object.\nRICOH ProcessDirector does not get the media name from the printer. A new name is derived from the properties of the media. In\nthe next step, you change the media name in RICOH ProcessDirector so that it matches the name in the printer paper catalog.\n14. Click CLOSE.\n15. In the left pane, select Media ⇒ Printer Media or Media ⇒ System Media, depending on the value of the Media to use property for the\nRicoh TotalFlow printer.\n16. Right-click the media that was created and select Rename.\n17. Enter the name that the Ricoh TotalFlow printer paper catalog for this media uses.\nOnly include the name from the media catalog. When you click OK, RICOH ProcessDirector adds the name of the printer and a period to\nthe beginning of the media name.\n18. Click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Configuring media for a Ricoh TotalFlow printer - Jenski - Test portal- RPD Linux\n19. Click the media that you renamed.\n20. Find the Send media name in job ticket property and change it to Yes.\n21. Click OK.\n22. If you changed the Media Matching setting from Use media product ID or media name to Use the properties selected below, click Media ⇒\nMedia Settings and change it back, then click OK.\nNow, RICOH ProcessDirector only schedules jobs to the Ricoh TotalFlow printer when the Requested media value for a job matches the Media\nready value on the printer.\nParent topic: Configuring to send jobs to a printer that uses RICOH TotalFlow Print server\n2 of 2"}]}