{"doc_name": "rep_c_EnhanceAFP.pdf", "doc_path": "data/raw/RPD-en-US/rep_c_EnhanceAFP.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2065, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Enhancing AFP files for Archive - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Archive feature / Enhancing AFP files for Archive\nEnhancing AFP files for Archive\nMost AFP files that are submitted to RICOH ProcessDirector need to be enhanced before you can store the documents or information about their\nprocessing history in the AFP files in a repository.\nIf you plan to use AFP Indexer to enhance AFP files, you must purchase and install the AFP Support feature.\nTo enhance AFP files for use with the Archive feature:\n1. If the AFP file does not have page group triggers (which identify the start of each document in a job) or index tags defined for the\ndocument data that you want to extract, use AFP Indexer to add that information:\n1. Open the AFP file in the RICOH Visual Workbench.\n2. Select IndexAFP.\n3. Define the triggers that identify document boundaries.\n4. Add index tags for the document property data that you want to extract.\n2. Use the Document Property Designer (DPD) mode to link each document property that you want to use to search for documents in a\nrepository:\n1. Open the AFP file in the RICOH Visual Workbench and select the DPD mode.\n2. Double-click the document property name at the bottom of the window.\n3. Supply the requested information in the Define link options dialog.\nWhen a document property is linked to an index tag, the value of the document property is the same as the value of the indexed\ndata.\nFor more information, see the topics related to RICOH Visual Workbench and Document Property Designer.\n3. Save the control file created by RICOH Visual Workbench and send it to the RICOH ProcessDirector server in a directory that the RICOH\nProcessDirector system user has access to.\nThe control file contains Document Property Designer definitions.\nNote: When you configure your Archive workflows, specify the name of the Visual Workbench control file in each step based on the\nIdentifyDocuments or BuildAFPFromDocuments step template.\nParent topic: Setting up the Archive feature\n1 of 1"}]}