{"doc_name": "ConfiguringInserterResultsFiles.pdf", "doc_path": "data/raw/RPD-en-US/ConfiguringInserterResultsFiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2570, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Configuring inserter controllers to write results files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Configuring inserter controllers / Configuring inserter controllers to write results files\nConfiguring inserter controllers to write results files\nYou must configure the inserter controller to write results files that contain the information that RICOH ProcessDirector needs to identify the job\nand the documents in the job.\nThe requirements differ, depending on whether the results files are job-specific (one results file for each job) or non-job-specific:\nJob-specific results files: The file name of each results file must be unique for each job in the system associated with the inserter controller. We\nrecommend that the file name of the results file contain the value of a job property whose value is unique for each job in the system, such as\nthe Job number or Inserter job name property. (By default, the inserter job name is the job number; however, you can specify another value in\nthe Inserter job name property.) For example, if the job number is 10001023, the name of the results file could be 10001023 or Kern10001023.\nNote:\nRICOH ProcessDirector can put the value of the Job number or Inserter job name property in the filename of the inserter control file that\nit sends to the inserter controller. When you create the inserter controller object, you specify the file name of the inserter control file in\nthe Send command property, and the file name of the results file in the Receive command property.\nEach record in the results file must contain the value of one of these document properties to identify the document to which the record applies:\nDocument number\nInsert sequence\nNote:\nRICOH ProcessDirector can put the values of the Document number and Insert sequence properties for each document in the inserter\ncontrol file.\nNote:\nThe Quadient Inserter Express feature only supports job-specific results files.\nNon-job-specific results files: Each record must contain the value of this document property to identify the document to which the record\napplies:\nDocument number\nRICOH ProcessDirector requires the document number because the document number is unique for each document in the system.\nNote:\nRICOH ProcessDirector can include the Document number property for each document in the inserter control file or, for non-file-based\ninserters (such as Gunther inserters), in a barcode on the first page of each document.\nParent topic: Configuring inserter controllers\n1 of 1"}]}