{"doc_name": "aiw_c_addsteps_ProcessDeletedJobs.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_addsteps_ProcessDeletedJobs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1843, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Adding steps to process deleted jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Adding steps to process deleted jobs\nAdding steps to process deleted jobs\nYou can add steps to your workflow that process deleted jobs before removing them from the system.\nFor example, you can add steps that record information about the jobs for audit purposes before they leave the system.\nTo add steps to process deleted jobs:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Add the steps that process the deleted jobs.\nIf you want to process all jobs before you delete them, you can add the steps between the RetainCompletedJobs step and the RemoveJobs\nstep.\nImportant:\nMake sure that you include a RemoveJobs step. Without that step, the jobs remain in the system.\n5. Set the Step restart type to Delete on the first step that processes the deleted jobs.\nFor example, you add 3 steps, in this order, to process deleted jobs: WriteJobLog, CopyToFolder, and RemoveJobs. Set the Step restart type\nto Delete on the WriteJobLog step.\nImportant:\nDo not give more than one step in your workflow a Delete step restart type. If you do, RICOH ProcessDirector sends deleted jobs to\nthe first step in the workflow with a restart type of Delete.\n6. Save and enable the workflow.\nWhen an operator deletes a job, RICOH ProcessDirector sends it to the step with a restart type of Delete.\nParent topic: Preparing to use workflows\n1 of 1"}]}