{"doc_name": "pdfw_c_ConfigurePDFDocuments.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_ConfigurePDFDocuments.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4494, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Setting up to use documents in PDF jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Configuring the PDF Document Support feature / Setting up to use documents in PDF jobs\nSetting up to use documents in PDF jobs\nTo use documents in PDF jobs, you define how to identify the documents, map data in the documents to RICOH ProcessDirector document\nproperties, and add markup to the documents. Finally, you save the setup information in a RICOH ProcessDirector Plug-in for Adobe Acrobat\ncontrol file.\nYou map data in the documents to document properties supplied with RICOH ProcessDirector or to custom document properties that you define.\nDefine the custom document properties and load them to RICOH ProcessDirector Plug-in for Adobe Acrobat before you map data.\nNote:\nThis procedure gives general setup instructions. For detailed instructions, see the related topics.\nTo set up to use documents in PDF jobs:\n1. Open a PDF file in Adobe Acrobat Professional and click Ricoh ⇒ Select to make RICOH ProcessDirector Plug-in for Adobe Acrobat the\nactive tool.\n2. Define page groups, which identify the start of each document in a job:\n1. Draw a box around the text you want to use to define text-based page groups, or anywhere to define page groups that are not\nbased on text.\n2. Select Define Page Group from the pop-up menu.\n3. Select one of the options from the Page Groups list.\n4. Click OK.\n5. Click Ricoh ⇒ View Page Group Navigator and verify that the documents in the PDF file have been defined correctly.\n3. Map data in the documents to document properties:\n1. Left-click just above the top left corner of the data to capture. Drag the mouse to draw a box around the data.\nMake the box large enough to capture the longest occurrence of the data in your PDF files. Some characters in a PDF file have a\nlarger white-space buffer than other characters.\n2. Select Define Document Property from the popup menu.\nYou see the captured data in the Selected Text area of the dialog.\n3. Select a RICOH ProcessDirector document property from the list.\n4. Use the Placement Conditions section to specify the pages to extract the document property data from.\nFor example, to extract the document property data from the first page of each document, select Pages based on a rule, and then\nselect First Front Only.\n5. Click OK to create the document property.\n6. Click Ricoh ⇒ View Document Property Values and scroll through several page groups in your PDF file to verify that RICOH\nProcessDirector Plug-in for Adobe Acrobat extracted the correct document property values for each page group.\n7. To map data in the documents to another document property, repeat the steps above.\n4. Add markup, such as barcodes, OMR marks, images, hidden areas, and text:\n1. Left-click to specify the top left corner of the new markup. Drag the mouse to draw a box.\nFor hidden areas, the box specifies the area. For barcodes, OMR marks, images, and text, the box specifies the upper left corner. The\nbox does not specify the area that contains the barcode, OMR mark, image, or text.\n2. Select an option such as Add Barcode from the popup menu.\n3. Supply the requested information.\n4. Click OK to create the markup.\n5. Save your page group definition, document properties, and markup in a control file:\n1. Click Ricoh ⇒ Save Control File.\n2. Give the control file a name or accept the default value.\n3. Click Save.\nYou see a confirmation message.\n4. Click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Setting up to use documents in PDF jobs - Jenski - Test portal- RPD Linux\n6. Send or copy the control file to a directory on the primary computer that the RICOH ProcessDirector system user has access to.\nWhen you create workflows that process PDF jobs containing documents, specify the name and location of the control file in each step based on\nthe IdentifyPDFDocuments or BuildPDFFromDocuments step template.\nNote:\nIf you get unexpected results when you process a PDF 2.0 file with a step based on the IdentifyPDFDocuments step, do one of these:\nUse the version of the RICOH ProcessDirector Plug-in for Adobe Acrobat supplied with RICOH ProcessDirector version 3.6 and above to\nupdate the control file. Remember to copy the control file to the correct location for RICOH ProcessDirector to use it.\nPlace a step based on the OptimizePDF step template in the workflow before the IdentifyPDFDocuments step.\nParent topic: Configuring the PDF Document Support feature\n2 of 2"}]}