{"doc_name": "aiwcstextstephot.pdf", "doc_path": "data/raw/RPD-en-US/aiwcstextstephot.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5385, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Setting up step templates for external steps that use hot folders - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / External steps / Setting up step templates for external steps\n/ Setting up step templates for external steps that use hot folders\nSetting up step templates for external steps that use hot folders\nUse this process to set up a step template for external steps that use hot folders to pass input and output between RICOH ProcessDirector and\nthe external program.\nTo set up a step template for an external step:\n1. Click the Workflow tab.\n2. In the left pane, click Step templates.\n3. Right-click the RunHotFolderApplication step template and select Copy.\n4. Specify a name and description for the new step template.\n5. Click Hot Folder.\n6. Update the Sending folder property.\nThe value of this property is the name of the input hot folder for the external program. RICOH ProcessDirector places the job in this folder\nto submit it to the external program.\nNote:\nThe value must be the name of a folder that exists. RICOH ProcessDirector does not create the folder.\nThe folder must be accessible to both RICOH ProcessDirector and the external program. It can be:\nIn the RICOH ProcessDirector shared file system, /aiw/aiw1/, on the computer that has the primary server installed.\nIn a file system that is shared using file sharing software, such as Samba.\nEven if the folder is on a Windows system, specify the path using Linux format. For example, if the folder is C:\\Sending, type\n/Sending.\nIf this value is null, no file is copied and the step waits.\n7. Update the File to send property.\nThe value of this property is a symbol formula that resolves to the name of the file that RICOH ProcessDirector sends to the external\nprogram.\nNote:\nThe default value is getAbsoluteFileName(print, pdf, read), which returns the name of the PDF print file in the spool\ndirectory. If the PDF print file does not exist in the spool directory when the external program runs, an error occurs.\n8. Update the Retrieval folder property.\nThe value of this property is the name of the output hot folder for the external program. RICOH ProcessDirector retrieves the job from this\nfolder after the external program has processed it.\nNote:\nThe value must be the name of a folder that already exists. RICOH ProcessDirector does not create the folder.\nThe folder must be accessible to both RICOH ProcessDirector and the external program. It can be:\nIn the RICOH ProcessDirector shared file system, /aiw/aiw1/, on the computer that has the primary server installed.\nIn a file system that is shared using file sharing software, such as Samba.\nEven if the folder is on a Windows system, specify the path using Linux format. For example, if the folder is C:\\Retrieval, type\n/Retrieval.\nWhen you set the Clean up retrieval folder property to No, the file that the step retrieves can be in the retrieval folder when a job\narrives at the step. The step retrieves the file and puts the file specified by the File to send property in the sending folder. The step\nthen sends the job and the retrieved file to the next step in the workflow. The step does not wait for a new file to be placed in the\nretrieval folder.\n9. Update the Retrieval pattern property.\nThe value of this property is the pattern-matching string that RICOH ProcessDirector uses to identify the output files to retrieve from the\noutput hot folder of an external program.\nFor example, the value ${Job.ID}.* matches any file whose file name is the same as the job ID, with any file extension.\n10. Update the Retrieved file property.\nThe value of this property is a symbol formula that resolves to the name that RICOH ProcessDirector uses to rename the retrieved file.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Setting up step templates for external steps that use hot folders - Jenski - Test portal- RPD Linux\n11. Update the Clean up retrieval folder property.\nWhen a job enters the step, this value tells RICOH ProcessDirector whether to remove any file in the retrieval folder whose file name\nmatches the Retrieval pattern.\n12. Update the Application log file property.\nThe value of this property is the folder where the external program writes log files. This value can be blank.\n13. Update the Poll interval property.\nThe value of this property is the interval in seconds at which RICOH ProcessDirector checks the output hot folder for completed jobs.\n14. Update the File size verification count property.\nThe value of this property is the number of times that RICOH ProcessDirector polls the output hot folder and finds a file that has not\nchanged in size. RICOH ProcessDirector then decides that the file is complete.\n15. Update the Timeout interval property.\nThe value of this property is the time limit in minutes for retrieving a job from the output hot folder of an external program. If the job has\nnot been received or is not complete when the time limit is reached, the job is in error.\nNote:\nMake the timeout interval longer than the poll interval times the file verification count.\nIf the timeout interval is 0, RICOH ProcessDirector waits forever.\n16. Click OK.\n17. Update any settings on the Tuning tab to run the step on the computers where the external program is installed.\n18. Select the new step template and click Enable.\nParent topic: Setting up step templates for external steps\n2 of 2"}]}