{"doc_name": "sla_settingupexpwork.pdf", "doc_path": "data/raw/RPD-en-US/sla_settingupexpwork.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2279, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Defining expected work - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up Deadline Tracker / Defining expected work\nDefining expected work\nExpected work represents jobs that are expected to arrive before a specific time or during a particular interval. You set up expected work objects\nand associate them with input devices so the input devices can monitor for the work that is supposed to arrive and warn you when that work is\nlate.\nTo define expected work:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Expected Work.\n3. Click Add.\nAfter you add your first expected work object, you can copy it instead of adding an object.\n4. Fill in values for the required and optional properties.\nTo see information about any of the properties, click the icon next to the property name.\n5. Click OK.\n6. Associate the expected work object with one or more input devices:\n1. Disable and disconnect the input device.\n2. Open the property notebook for the input device.\n3. On the General tab, find the Associated expected work property and choose one or more expected work objects.\n4. Click OK.\n5. Enable and connect the input device.\nThe input device does not start monitoring for expected work until the start date and time that you selected when you created the\nexpected work object. After that date and time, the input device starts monitoring and reporting status at the chosen intervals.\nYou can export entries in the Expected work table to a Comma-Separated Values (CSV) file. Click the button in the top right corner of the\npage and select Export table to CSV. The exported list contains only entries for expected work objects that match all the filters that are set. For\nexample, you type statements in the filter field . The list in the CSV file contains only the entries for expected work with statements in the\nexpected work name or description. The entries are sorted by expected work name.\nNote:\nYou can set up a notification object to send an email when expected work for an input device is late.\nIf you have the Web Service Enablement feature, you can set up a notification object to issue a SOAP or REST web service call when\nexpected work for an input device is late.\nParent topic: Setting up Deadline Tracker\n1 of 1"}]}