{"doc_name": "tt_o_BarcodeReaderObj.pdf", "doc_path": "data/raw/RPD-en-US/tt_o_BarcodeReaderObj.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1830, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Barcode readers - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Barcode readers\nBarcode readers\nBarcode readers represent the cameras and barcode scanners in your Automated Verification installation that read barcodes on documents in a\nprint job to verify that each document has been processed.\nYou must create one barcode reader for each camera or barcode scanner. The same combination of IP address and port can only be used by one\nbarcode reader.\nYou associate the barcode reader with one or more barcode formats. The barcode format identifies where the Job number and Sequence in child\njob properties are found in the barcode on each document. You use two different barcode formats if a barcode reader must read two different\ntypes of barcodes. The Job number and Sequence in child job properties must be in the same position in the barcode for all the barcode formats\nused by this barcode reader.\nBarcode readers can be disconnected manually from the Barcode reader portlet on the Main page. However, they might become disconnected if\nthe camera or barcode scanner is powered off or cannot be reached on the network. If the barcode reader is not connected to RICOH\nProcessDirector when some barcodes are read, the information about those documents is not available and might need to be read again.\nIf the barcode reader scans a barcode that it cannot recognize using any of the available barcode formats, an alert is shown in the Barcode\nReaders portlet to indicate that an invalid scan was detected. Use the barcode reader log to investigate the problem. Use the Clear Alert action to\nremove the alert from the barcode reader in the portlet.\nRICOH ProcessDirector provides a predefined barcode reader that you can use as a sample.\nParent topic: System objects\n1 of 1"}]}