{"doc_name": "ConfiguringDirectories.pdf", "doc_path": "data/raw/RPD-en-US/ConfiguringDirectories.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2324, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Configuring inserter controllers to communicate with RICOH ProcessDirector - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Configuring inserter controllers / Configuring inserter controllers to communicate with RICOH ProcessDirector\nConfiguring inserter controllers to communicate with RICOH ProcessDirector\nFile-based inserter controllers must read control files from RICOH ProcessDirector, and inserter controllers that write results files must send the\nresults files to RICOH ProcessDirector.\nRICOH ProcessDirector can send inserter control files to any directory on the primary computer or to any directory on a separate computer, such\nas the computer where the inserter controller runs. You must configure the inserter controller to read the control file for each job from this\ndirectory.\nRICOH ProcessDirector can receive inserter results files from any directory on the primary computer or from any directory on a separate computer.\nYou must configure the inserter controller to write its results files to this directory. The directory for the inserter results files can be different from\nthe directory for inserter control files.\nFor example, if the inserter controller runs on a Windows system, you can create two shared directories on the Windows system—one directory\nfor inserter control files and another for inserter results files.\nWhen you create the inserter controller object, you specify commands in these properties:\nSend command: The command or script to send inserter control files to the inserter controller\nReceive command: The command or script to receive job-specific results files from the inserter controller\nPolling command: The command or script to receive non-job-specific results files (such as Gunther results files) from the inserter controller\nIn the commands, you specify the directories where inserter control files are written and inserter results files are received. If the directories are on\na separate computer from RICOH ProcessDirector, login credentials to that computer must be included in the command.\nFor information about the parameters in which you specify the directory name and login information, see the related task topic for using\nsupplied scripts.\nParent topic: Configuring inserter controllers\n1 of 1"}]}