{"doc_name": "aiwdoc_i_t_editdocdefpropsfile.pdf", "doc_path": "data/raw/RPD-en-US/aiwdoc_i_t_editdocdefpropsfile.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5944, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Naming custom document properties in more than one language - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Naming custom document properties in more than one language\nNaming custom document properties in more than one language\nTo define user interface names and descriptive information for your custom document properties in more than one language, you edit a\nlanguage-specific version of the docCustomDefinitions.properties file for each language. After you update your custom document\nproperties, RICOH ProcessDirector displays the user interface names and descriptive information for the custom document properties in each\nlanguage.\nIn a single-language environment, the preferred method of defining user interface text for custom document properties is to use the caption and\ndescription attributes of the docProperty element in the docCustomDefinitions.xml file. If you are using a single language and all custom\ndocument property descriptive text is defined in docCustomDefinitions.xml, do not edit the docCustomDefinitions.properties file.\nTo name custom document properties in more than one language:\n1. Make a working copy of the docCustomDefinitions.properties file for each language:\nThe first time that you name custom document properties in more than one language, make one copy of the sample\ndocCustomDefinitions.properties file for each language except your default language. Navigate to this directory:\n/aiw/aiw1/samples/config on Linux\nC:\\aiw\\aiw1\\samples\\config on Windows\nCopy the docCustomDefinitions.properties file to a working directory.\nName each file docCustomDefinitions_language.properties. For example:\ndocCustomDefinitions_de.properties (German)\ndocCustomDefinitions_en.properties (English)\ndocCustomDefinitions_es.properties (Spanish)\ndocCustomDefinitions_fr.properties (French)\ndocCustomDefinitions_it.properties (Italian)\ndocCustomDefinitions_ja.properties (Japanese)\ndocCustomDefinitions_pt.properties (Brazilian Portuguese)\nImportant:\nDo not create a docCustomDefinitions_language.properties file for your default language.\nMake sure each file is owned by the RICOH ProcessDirector system user and group (aiw1 and aiwgrp1 are the defaults).\nWhen you name additional document properties in more than one language, navigate to this directory:\n/aiw/aiw1/config on Linux\nC:\\aiw\\aiw1\\config on Windows\nCopy each docCustomDefinitions_language.properties file to a working directory.\n2. Edit each file to add your new custom document properties.\nThe entry for each custom document property has three lines:\nShort caption\nUser interface name\nDescription\nThese lines add two custom document properties with the database names Doc.Custom.AccountNumber and Doc.Custom.StatementDate\nto the docCustomDefinitions_es.properties file:\nDoc.Custom.AccountNumber.Short=Número de cuentaDoc.Custom.AccountNumber=Número de\ncuentaDoc.Custom.AccountNumber.Description=Número de cuenta del\nclienteDoc.Custom.StatementDate.Short=Fecha de extractoDoc.Custom.StatementDate=Fecha de\nextractoDoc.Custom.StatementDate.Description=Fecha en que se creó el extracto\nKeep a backup copy of each edited file for recovery purposes.\n3. If you did not create the file in Latin-1 or Unicode format, run the native2ascii utility to convert the file to Unicode Latin-1 format.\nOn Linux, the native2ascii utility is at /opt/infoprint/ippd/jre/bin.\nOn Windows, the native2ascii.exe utility is at C:\\Program Files\\Ricoh\\ProcessDirector\\jre\\bin.\nFor more information, see the related topic about considerations for a system with more than one language in the information center.\n4. Make sure that each docCustomDefinitions_language.properties file uses the ISO-8859-1 character encoding format (codepage).\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Naming custom document properties in more than one language - Jenski - Test portal- RPD Linux\nIf your files use a different format, such as Shift JIS or UTF-8, convert them to ISO-8859-1 format before placing them in the configuration\ndirectory.\n5. Copy each edited file to the configuration directory:\n/aiw/aiw1/config on Linux\nC:\\aiw\\aiw1\\config on Windows\nImportant:\nDo not delete the docCustomDefinitions.properties file. The system requires a file with that name in the configuration\ndirectory.\n6. Make the custom document properties that you have named in multiple languages available to RICOH ProcessDirector:\n1. Run the docCustom utility.\nThe first time that you run the docCustom utility, it creates the Custom Document Properties feature and adds it to Feature Manager.\nWhen you run the utility again, it adds an updated Custom Document Properties feature to Feature Manager.\n2. Use Feature Manager to install or update the Custom Document Properties feature.\n7. Load the RICOH ProcessDirector updated custom document properties to the tool you use to configure document properties:\nIf you have the PDF Document Support feature, load RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in for\nAdobe Acrobat.\nFor more information, see the related topic in the information center.\nIf you have the AFP Support feature, use one of these methods to start RICOH Visual Workbench:\nStart RICOH Visual Workbench from the RICOH ProcessDirector server.\nReplace the RICOH Visual Workbench application on your desktop:\nDelete the VisualWorkbench.zip file and all of the unzipped files.\nDownload the VisualWorkbench.zip file from the RICOH ProcessDirector user interface.\nUnzip the file, and start the new RICOH Visual Workbench desktop application.\nThe document properties are loaded automatically.\nIn this section:\nConsiderations for a system with more than one language\nIf you are using a language other than English on your system, or if you want to let users see user interface text for custom document properties\nin more than one language, you might need to do these tasks.\nParent topic: Configuring document processing features\n2 of 2"}]}