{"doc_name": "avanti_c_configforAvanti.pdf", "doc_path": "data/raw/RPD-en-US/avanti_c_configforAvanti.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5013, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\nSetting up RICOH ProcessDirector and Avanti Slingshot to exchange information\nAfter you read the Avanti Slingshot Connect overview topics, you can set up RICOH ProcessDirector and Slingshot to exchange information\nabout orders, jobs, and job processing. Do the configuration tasks described in this section.\nYou can configure RICOH ProcessDirector and Slingshot so that orders originate in Slingshot. For each order, Slingshot submits one or more PDF\njobs to RICOH ProcessDirector with a JDF job ticket. Do these tasks:\nConfigure Slingshot to submit jobs to RICOH ProcessDirector.\nSet up a RICOH ProcessDirector hot folder input device to process Slingshot jobs.\nAlternatively, you can configure RICOH ProcessDirector and Slingshot so that print jobs originate in RICOH ProcessDirector. For each job, RICOH\nProcessDirector sends order information to Slingshot. Do this task:\nModify a workflow to send order information to Slingshot.\nFor both configurations, do these tasks:\nDefine Avanti Slingshot Connect cost centers.\nAssign cost centers and job color to report to printers.\nSend job status information to Slingshot.\nModify a workflow so that it sends job information to Slingshot.\nAfter the initial configuration is complete, test it to make sure that RICOH ProcessDirector and Avanti Slingshot exchange information correctly.\nIn this section:\nConfiguring Slingshot to submit jobs to RICOH ProcessDirector\nAvanti Slingshot uses JDF Types to submit jobs to RICOH ProcessDirector. You create a JDF Type and assign it to each printer device that prints\nRICOH ProcessDirector jobs.\nSetting up a hot folder input device to process Slingshot jobs\nA hot folder input device that processes jobs submitted by Avanti Slingshot must have the same name as the Line Item specified on the Slingshot\nsales order and must use the JDF Batching method.\nModifying a workflow to send order information to Slingshot\nTo send order information to Avanti Slingshot, contact your Avanti support representative. Learn the values required to call the Slingshot web\nservice that receives order information from RICOH ProcessDirector. Then add a step based on the CreateOrderInSlingshot step template to your\nworkflow.\nDefining Avanti Slingshot Connect cost centers\nAvanti Slingshot Connect cost centers are essential for allocating the costs of time and materials. Entries in the avanti.cfg file in RICOH\nProcessDirector are tied to objects in the Avanti Slingshot system where the cost allocation occurs. You must use the External Device ID for each\ncost center in the avanti.cfg file. If you use the name of the cost center and that name is different from the External Device ID that is defined in\nSlingshot, RICOH ProcessDirector cannot report data correctly. The entries in the avanti.cfg file are known as cost centers in RICOH\nProcessDirector and are called External Device IDs in the Avanti Slingshot system. These IDs let RICOH ProcessDirector correctly allocate\ninformation to the Avanti Slingshot cost centers.\nAssigning a cost center and job color to report to a printer\nFor Avanti Slingshot to account correctly for the time a job spends on a RICOH ProcessDirector printer, you must assign a cost center to the\nprinter. Using the printer cost center, RICOH ProcessDirector reports the total pages or sheets printed on specific media by name and by product\nID (if a Product ID value is specified for the media). RICOH ProcessDirector also reports whether all the pages in a job were printed in full color or\nonly in a single color ink or toner, usually black.\nConfiguring to send job color information to Slingshot\nYou can send information about the color of the ink or toner used to print a job from RICOH ProcessDirector to Slingshot.\nSending ink usage data to Avanti Slingshot\nYou can configure RICOH ProcessDirector to collect ink usage data for jobs sent to specific printers. The data collected is sent back to Avanti\nSlingshot, along with the ink loaded in the printer for that specific job.\nSending job status information to Avanti Slingshot\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information - Jenski - Test portal- RPD Linux\nTo send job status information between Avanti Slingshot and RICOH ProcessDirector, you must define the URL of the Avanti Slingshot system to\nRICOH ProcessDirector.\nModifying a workflow to send job information to Slingshot\nTo send Avanti Slingshot the time required for the job to complete a single step or a series of steps, you must specify the Slingshot cost center\nand the milestone status for the single step or for the first and last steps in the series. By associating one or more steps with a cost center, you\nidentify all the time spent on processing by the cost center.\nParent topic: Configuring\n2 of 2"}]}