{"doc_name": "docafp_o_processing_documents.pdf", "doc_path": "data/raw/RPD-en-US/docafp_o_processing_documents.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4732, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Processing AFP files that contain documents - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP support for documents / Processing AFP files that contain documents\nProcessing AFP files that contain documents\nThe AFP Support feature lets you manipulate the individual documents in an AFP file. For example, you can rearrange their output order or group\nthem according to different envelope size requirements .You can find a specific document by searching for a document property in the AFP file.\nYou use the AFP Indexer mode of RICOH Visual Workbench to create named page groups and index tags in the original job data. Then you use\nthe Document Property Designer mode of the RICOH Visual Workbench to map the index tags to document properties that you want to use to\nlocate and manipulate documents. You use the AFP Enhancer mode to create barcodes and text and hide areas that contain unwanted content\nsuch as obsolete barcodes.\nThe RICOH Visual Workbench creates a control file containing those mappings.\nSteps based on AFP Support step templates extract information about the documents in an AFP file and store that information in a document\nproperties file, which is structured like a table. The document properties file lets RICOH ProcessDirector do operations on individual documents\nrather than only on the job as a whole.\nWhen you create a workflow to receive AFP files, you include a step based on the IdentifyDocuments step template. You specify the RICOH\nVisual Workbench control file that contains the page group definition and any document properties. This step builds a document properties file\nthat represents an inventory of all the documents in the job.\nTo process individual documents, you can add steps to the Assemble phase of the workflow based on these step templates:\nGroupDocuments lets you classify all the documents into groups based on up to six document properties. For example, if you had a file of 5000\ninsurance policy addenda documents, you could group all of them into all the combinations of policy type (auto or home) and state.\nSortDocuments lets you sort documents by up to six document properties. For example, you could alphabetize the policy addenda within each\ngroup so you would have all the auto policies in states A-Z followed by all the home policies in states A-Z.\nSplitDocuments lets you divide a large job into several smaller jobs based on the number of documents or the number of sheets in the smaller\njob.\nEach of these steps adds or changes information in the document properties file without changing the contents of the original AFP job. The\ndocument properties file that was created initially to identify all of the documents has more information added to it, such as the location of each\ndocument in the rearranged AFP file.\nAfter you define steps to manipulate the documents into the new grouping and order that you want, you include a step in the Assemble phase\nof the workflow that builds a new AFP file with the individual documents organized according to that ordering. You use a step based on the\nBuildAFPFromDocuments step template if you want to create a single output job based on the newly ordered documents. If, however, you want\nto create separate output jobs because you used the SplitDocuments step or you want to print each group of documents created by the\nGroupDocuments step separately, you instead use a step based on the CreateAFPJobsFromDocuments step template.\nTo allow for more complicated manipulation of the documents, you can build an Enhance AFP control file that defines text or barcode data to be\nadded to each document, or to identify text blocks or areas to be removed from each document. You specify the name of the control file\ncontaining these definitions when you create the BuildAFPFromDocuments or CreateAFPJobsFromDocuments step in the Assemble phase of a\nworkflow.\nThe remainder of the workflow that processes AFP jobs looks the same as if you did not have AFP Support installed—steps can enable\nrepositioning of the print job in case you need to recover from a paper jam or reprint selected documents, and a step based on the PrintJobs step\ntemplate manages the print processing. Steps in the Complete phase let you retain the job in RICOH ProcessDirector for an interval you specify,\nand then the job is deleted from the system when that interval expires.\nIf you want to view the values of document properties in the user interface or to search for a document based on a property value, include a\nWriteDocumentsToDatabase step in your workflow. This step saves document property values to the document database.\nParent topic: AFP support for documents\n1 of 1"}]}