{"doc_name": "aiw_ordermanagement.pdf", "doc_path": "data/raw/RPD-en-US/aiw_ordermanagement.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2565, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Order Management - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Order Management\nOrder Management\nThe Order Management feature introduces functions and objects that let you group individual jobs and process them together efficiently. The\nfeature supports both manual order creation and submission of orders from ordering systems that can output or export orders as XML files.\nThis feature adds two step templates, the Order object, and the Order property mapping object. It also includes sample objects as part of a usage\nscenario, which you can examine and copy as needed for use in your installation.\nObjects\nOrder\nAn Order is a container for jobs. Orders can be created manually (through the Submit Jobs portlet) or generated by an ordering system and\nsubmitted to an input device as an XML file. The XML file is interpreted and converted into one or more orders with one or more jobs in\neach order. You can set properties on an order, some of which are passed to all the jobs in it.\nNote:\nOrders have a default set of properties for information such as priority, time received, and due date. If you need to track other\ninformation, you can define custom order properties as well.\nOrder Property Mapping\nAn order property mapping defines which XML elements in the file created by the ordering system are used to identify orders and jobs and\nwhich are used to set properties.\nStep templates\nCreateOrdersFromFile\nA step based on this step template uses an order property mapping object to create orders with jobs inside them from the contents of an\nXML input file. The step submits the jobs to a specified workflow for processing.\nUpdateOrderValues\nA step based on this step template changes the order properties for the order associated with the job.\nSample objects\nOrderSample\nA sample workflow that you can examine and run to understand how the feature works. It receives an XML file from the OrderHotFolder\nand sends jobs to be processed by the OrderJobSample workflow.\nOrderJobSample\nA sample workflow that you can examine and run to understand how the feature works. It receives child jobs from the OrderSample\nworkflow and processes them.\nOrderHotFolder\nA sample input device with a pre-loaded sample order file. It submits the sample file to the OrderSample workflow for processing.\nOrderXMLSample\nA sample order property mapping object that is configured to process the sample Order.xml file and create an order and two jobs.\nParent topic: Advanced workflow features\n1 of 1"}]}