{"doc_name": "content_overview.pdf", "doc_path": "data/raw/RPD-en-US/content_overview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2150, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Content - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / Whitespace Manager / Content\nContent\nContent, such as images or text, is assigned to a white space area based on rules you define to place the content for specific customers,\nmarketing campaigns, or the best use of available space.\nThe Manage Campaigns window lets you determine what content is placed in defined white space by defining rules with conditions. Conditions\nare expressions that are used to evaluate whether index tags in a page group are true or false. You can use AFP Indexer to create index tags. In\naddition to text, these types of images can be displayed as content:\nGIF\nJPEG\nPage segment (PSEG)\nImages must use an RGB colorspace; they cannot use a CMYK colorspace. You cannot include other image types, such as TIFF or PNG.\nYou decide what content is placed in a defined white space (text, image, or both) and then decide whether the content is always placed or\nplaced according to rules that you create. The rules are a string of conditions separated by \"and\" or \"or\" operators. If the condition is \"true\",\nyou can specify that one type of content is assigned to the white space. If the condition is \"false\", you can specify that another type of content is\nassigned or no content is assigned.\nYou can also change the font and position of text and the position of images. When you define an image, you can enter the location of the file\nwhere the image resides. Then, if you need to periodically change the image placed in the white space, you can change the image in the file\ninstead of changing the content definition.\nFor example, you have defined white space across the top of the first page of a statement. You want the text \"Vacation Time!\" always displayed\nin the white space, a sunny beach scene displayed to all customers in Colorado and Kansas, and an image of a snow-capped mountain scene\ndisplayed to all other customers. If an index tag named \"Address\" contains the state where the customer lives, the conditions you create would\nlook like this:\nParent topic: Whitespace Manager\n1 of 1"}]}