{"doc_name": "modifyingfonts.pdf", "doc_path": "data/raw/RPD-en-US/modifyingfonts.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2207, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying font mappings from text blocks - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Mapping fonts for AFP files / Modifying font mappings from text blocks\nModifying font mappings from text blocks\nAfter you create character set, coded font, or code page mappings from text blocks in an AFP file, you can modify or delete the font mappings.\nTo modify or delete a font mapping:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. Click Resources ⇒ Modify Font Mapping.\n3. Select the name of a font mapping.\n4. Do one of these:\nClick Modify or double-click. You see the Modify Font Mapping window. Do one of these, depending on which font mapping type you\nselected:\nFor Character Set, do one of these:\nSelect a different global identifier from the drop-down list. You can click Show Common to view which character sets currently use the\nselected global identifier and then click X in the upper right corner to close the window.\nClick Add to create a new global identifier:\n1. Type a 1- to 5- digit identifer in the Global Identifier field.\n2. Click Show CharSets to view which character sets currently use the selected global identifier. Click X in the upper right corner to\nclose the window.\n3. Modify the point size.\n4. Select a family name and style for the Java font from the drop-down lists.\n5. Click OK.\nThe family name and style for the Java font are updated.\nFor Coded Font, edit the AFP character set name, AFP code page name, or both.\nFor Code Page:\n1. Select a different global identifier from the drop-down list.\n2. Click Show Common to view which code pages currently use the selected global identifier. Click X in the upper right corner to\nclose the window.\nThe Java character set name is updated.\nClick OK. The font mapping is modified.\nClick Delete or press the Delete key on your keyboard. The font mapping is removed.\n5. To close the Modify Font Mappings window, click X in the upper right corner.\nThe font mapping is updated in the control file. To keep the font mapping changes, save the control file before exiting the AFP file.\nParent topic: Mapping fonts for AFP files\n1 of 1"}]}