{"doc_name": "hidingareas.pdf", "doc_path": "data/raw/RPD-en-US/hidingareas.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4060, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Creating hidden areas - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Creating hidden areas\nCreating hidden areas\nYou can hide areas in AFP files that you do not want RICOH ProcessDirector to display or print. For example, you might hide an area that contains\na barcode before you create a new barcode in the same place.\nThe hidden area must be in a consistent position on every page and must be a consistent size. To determine the exact position and size of the\nhidden area, first print the sample AFP file on the production printer and measure where you want to place the top-left corner of the hidden area\non the printed page.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo create a hidden area:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. If the sample AFP file does not contain page groups, use AFP Indexer to create page groups.\n3. Click Mode ⇒ AFP Editor.\n4. Navigate to the page where you want to create the hidden area:\nTo place a hidden area on the same page in every page group, navigate to that page in any page group.\nTo place a hidden area on multiple pages, navigate to one of the pages in any page group.\n5. Position your cursor at a corner of the hidden area. While pressing the left mouse button, draw a box the approximate size of the hidden\narea.\nIn a later step, you can specify the exact position and size of the hidden area.\n6. Right-click anywhere in the AFP file and click Hide area.\n7. Type a descriptive name for the area in the Hidden area name field.\nFor example, if the hidden area contains a barcode for a ZIP Code, the name could be “ZIP Code”.\n8. Specify the exact origin (top-left corner) of the hidden area in these fields. Specify the values in inches or millimeters.\nX position\nThe horizontal distance of the left side of the hidden area measured from the left side of the logical page (not the physical sheet of\npaper). Decimal values (such as 2.5) are allowed. The X position cannot be greater than the width of the page.\nY position\nThe vertical distance of the top of the hidden area measured from the top of the logical page (not the physical sheet of paper).\nDecimal values (such as 2.5) are allowed. The Y position cannot be greater than the height of the page.\nThe initial values of these fields are the X and Y positions of the top-left corner of the box that you drew.\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the page in the unrotated view.\n9. Specify the exact size of the hidden area in these fields. Specify the values in inches or millimeters.\nWidth\nThe horizontal width of the hidden area. Decimal values (such as 2.5) are allowed. The width of the area cannot be greater than the\nwidth of the page.\nHeight\nThe vertical height of the hidden area. Decimal values (such as 2.5) are allowed. The height of the area cannot be greater than the\nheight of the page.\nThe initial values for these fields are the width and height of the box that you drew.\nNote: Measure the width and height from the origin of the hidden area in the unrotated view.\n10. Select one of these options to place the hidden area:\nPage n: Place the hidden area on page n of each page group (n is the page where you drew the box for the hidden area). You cannot\nchange this page number. If the page number is incorrect, click Cancel and draw the box for the hidden area on the correct page.\nMultiple pages: Place the hidden area on:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Creating hidden areas - Jenski - Test portal- RPD Linux\nAll pages\nAll pages in each page group\nEven pages\nThe even pages in each page group (pages 2, 4, 6,...)\nOdd pages\nThe odd pages in each page group (pages 1, 3, 5,...)\n11. Click OK.\nYou do not see any text or image data in the hidden area in each page group.\nParent topic: Editing AFP files\n2 of 2"}]}