{"doc_name": "aiw_RESTAPI.pdf", "doc_path": "data/raw/RPD-en-US/aiw_RESTAPI.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5312, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Using RICOH ProcessDirector REST API documentation - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Web services in RICOH ProcessDirector / Using RICOH ProcessDirector REST API documentation\nUsing RICOH ProcessDirector REST API documentation\nRICOH ProcessDirector provides REST APIs for web service integration. Interactive documentation is provided with these APIs and provides live\ntesting and information for each available API.\nThe REST API documentation includes many APIs that an application can use to integrate with RICOH ProcessDirector. You can use the REST API\ndocumentation and testing interface to test your parameter settings. When you use the interface to test web services, you access the RICOH\nProcessDirector primary server. Actions such as creating, deleting, and enabling objects are executed on the primary server and are reflected in\nthe RICOH ProcessDirector user interface. As a result, we suggest creating objects specifically for testing purposes.\nThese steps demonstrate how to request the log files for an object using REST APIs. These steps log you in to RICOH ProcessDirector, request the\nlog files for the Sample printer, and log you out.\n1. Open a web browser and enter your RICOH ProcessDirector host name or IP address into the address bar. Add /restapi/ to the end of\nyour host name or IP address to access the REST API documentation. For example, http://hostname:15080/restapi/\n2. In the users section and find POST /users/login.\n3. Click Try it out.\n4. Log in to RICOH ProcessDirector by entering your RICOH ProcessDirector credentials:\nFor the name parameter, enter your RICOH ProcessDirector user name.\nFor the pwd parameter, enter the password associated with your RICOH ProcessDirector user name.\n5. Click Execute.\nThe REST API documentation uses the values you enter to build a Curl command and a Request URL. Then it submits the request to the\nrequest URL and logs you in.\nRICOH ProcessDirector sends a response indicating whether you successfully logged in. The response includes additional information\nincluding the token and the actions that this User ID is allowed to do.\n6. In the Response Body box, find and copy the token value.\n7. In the objects section, scroll down until you find POST /objects/log/{objectType}/{name}.\n8. Click Try it out.\n9. Retrieve the log messages for the Sample printer by entering these parameters:\n1. For the token parameter, paste the token you copied above.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:21 PM Using RICOH ProcessDirector REST API documentation - Jenski - Test portal- RPD Linux\n2. For the objectType parameter, type Printer.\nThe values for objectType are case-sensitive. You can use the web service POST /util/objecttypes to get a list of object types available\non your system. The web service POST /util/objecttypes is found in the util section.\n3. For the name parameter, type Sample.\n10. Click Execute.\nThe log entries for the Sample printer are returned in the Response Body box.\nThe Curl and Request URL values are also returned.\n11. In the users section find POST /users/logout/{name}.\n12. Click Try it out.\n13. Log out of RICOH ProcessDirector:\nFor the token parameter, paste the token you copied above.\nFor the name parameter, enter your RICOH ProcessDirector user name.\n14. Click Execute.\nYou are logged out of RICOH ProcessDirector.\nExample values are included with certain APIs. With example values you can update the sample code and modify it for testing.\nThese steps demonstrate how to use a REST API to connect a hot folder using an example value. These steps log you in to RICOH\nProcessDirector, set the Input Device to accept files from HotFolderPDF, and log you out.\n15. Open the REST API interface as above.\n16. In the users section and find POST /users/login.\n17. Click Try it out.\n18. Log in to RICOH ProcessDirector by entering your RICOH ProcessDirector credentials:\nFor the name parameter, enter your user name.\nFor the pwd parameter, enter the password associated with your user name.\n19. Click Execute.\n20. In the Response Body box, find and copy the token value.\n21. In the objects section, scroll until you find POST /objects/{objectType}/connect.\n22. Click Try it out.\n23. Connect HotFolderPDF by entering these parameters:\n1. For the token parameter, paste the token you copied above.\n2. For the objectType parameter, type InputDevice.\nThe values for objectType are case-sensitive. You can use the web service POST /util/objecttypes to get a list of object types available\non your system. The web service POST /util/objecttypes is found in the util section.\n3. For the body parameter, click Edit Value. Example text displays in a code box. Replace the word “string” with “HotFolderPDF”.\nMake sure the double quotes are around the name of the object.\n24. Click Execute.\nThe properties and settings for HotFolderPDF are returned in the Response Body box. The Response Code and Response Headers are also\nreturned.\n25. In the users section find POST /users/logout/{name}.\n26. Click Try it out.\n27. Log out of RICOH ProcessDirector:\nFor the token parameter, paste the token you copied above.\nFor the name parameter, enter your RICOH ProcessDirector user name.\n28. Click Execute.\nYou are logged out of RICOH ProcessDirector.\nParent topic: Web services in RICOH ProcessDirector\n2 of 2"}]}