{"doc_name": "aiw_sdk_list.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_list.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2469, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM List - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / List\nList\nWhen the batching method is List, the hot folder or SFTP input device submits one or more files as a group, based on the contents of a list file\nthat is received by the input device.\nThe hot folder or SFTP input device looks for a text-based list file containing a list of all the files that make up the job. When the hot folder or\nSFTP input device finds a list file, it reads the list and looks for all the files; as soon as it finds all the files, it submits them as a single job. The files\nprint in the order specified in the list file.\nThe list file must meet these criteria:\nThe file name must match the pattern specified in the List patterns property. The default pattern matches files that have the extension .lst.\nEach file in the print job must be on a separate line in the list file.\nThe file names listed in the list file must include only file names, not path information; all files must be in the same directory.\nThe contents of the list file might look like this:\nafpinput1.afp\nafpinput2.afp\nafpinput3.afp\ninputfile.afp\nWhen you use the List batching method, set these input device properties as indicated:\nWorkflow: ParentNoPrint\nChild workflow: The workflow that is appropriate for the print files in the job.\nSubmit step: SubmitInputFiles\nCreate .zip file: If this property is set to Yes, all input files that match the value set in the Data patterns property are combined as a ZIP file and\nsubmitted as a single job. If this value is set to No, all input files are submitted as child jobs.\nList patterns: A pattern that matches some part of the file name of your list files.\nBy default, this value is the regular expression .*lst$.\nData patterns: A pattern that matches some part of the file name of your print files. For hot folder or SFTP input devices, the default value is\nthe regular expression: .*$. That pattern matches all file names.\nIf a print file is listed in the list file, but the file name does not match the Data patterns value, the input device does not identify the file as a\nprint file. Because a listed print file appears to be missing, the input device waits for it and does not create the job.\nOverrides patterns: if you use overrides files, a pattern that matches some part of the file name of your overrides files.\nParent topic: Batching methods\n1 of 1"}]}