{"doc_name": "aiw_creating_customprop.pdf", "doc_path": "data/raw/RPD-en-US/aiw_creating_customprop.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2770, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Creating and activating custom properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Creating and activating custom properties\nCreating and activating custom properties\nIf none of the existing job, document, or order properties meet your specific needs, you can define custom properties that are tailored to your\nspecifications. After these properties are activated, you can use them just as you would any other property.\nImportant: We recommend not recreating any document properties that have been defined in the docCustomDefinitions.xml file.\nTo create and activate a custom property:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Custom properties.\n3. Click Add.\n4. Select either Document Property, Job Property, or Order Property.\n5. Configure the custom property by setting all the values.\nTo find more information about the custom properties values, click the ? button next to a field.\nImportant:\nThe third section of the database name must be different for each custom property. For example, you cannot use both\nDoc.Custom.Test and Job.Custom.Test. You must change one of the database names to use something unique, such as\nDoc.Custom.Test1.\n6. To activate the custom property, click the switch at the top of the dialog.\nNote:\nAll custom properties must be activated before they can be used in steps, workflows, input devices, jobs, and so on.\n7. To save the changes and close the dialog, click OK.\nImportant: When activating or deactivating a custom property, we recommend doing these actions:\nLog out of RICOH ProcessDirector.\nRefresh the browser window and clear your browser cache.\nLog in to RICOH ProcessDirector.\n8. Test the property using different scenarios in a testing environment.\nWe recommend trying the new property in a small number of places that represent your intended usage, to ensure that the property\nfunctions as you intend it to.\nWhile you can deactivate a custom property to change its configuration, that process affects existing uses of the property. When a custom\nproperty is deactivated, all connections to any objects where the custom property was added are lost. The custom property is removed from\nany objects it was previously connected to. Any commands or processes based on the custom property might not function properly. For\nexample, connector rules that use the property fail to evaluate correctly.\nAfter you make your changes, you reactivate the custom property. You need to add the custom property to the objects it was removed\nfrom.\nNote: When a custom property is reactivated:\nThe property is not added back to jobs that it was removed from.\nProcesses and commands that include the property should start to function correctly again.\nParent topic: Configuring\n1 of 1"}]}