{"doc_name": "BarCodeFormatObject.pdf", "doc_path": "data/raw/RPD-en-US/BarCodeFormatObject.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4591, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Barcode format objects - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Barcode format objects\nBarcode format objects\nBarcode format objects help RICOH ProcessDirector interpret barcodes that you scan while jobs are processing. When your barcode format\nobjects are configured correctly, you can scan a barcode and use the information in it to find a document in RICOH ProcessDirector.\nFor example, an operator must reprint documents that are damaged during insertion. The operator uses the Reconcile action and selects By\nbarcode scan in the Search for documents area. Then, the operator selects the name of the barcode format and scans the barcodes that are\nprinted on the damaged documents. The barcodes include the value of the Document number property and the barcode format identifies where\nto look in the barcode to find that value. When all the documents are scanned, RICOH ProcessDirector displays the list of documents on the\nReconcile dialog so the operator can reprint them.\nBarcode formats are used:\nIn the Documents portlet on the Main page. Select By barcode scan and click Edit ( ).\nOn the Reconcile Job dialog as described in the example.\nWhen you define a barcode format object, you list the job and document property values that are included in your barcodes. For each property,\nyou must also specify:\nThe starting position of the property value in the barcode. The first character that the camera or barcode scanner reads is position 1.\nThe length of the property value in the barcode.\nNote:\nThe barcode format must match the configuration of the camera or barcode scanner hardware. If the camera or barcode scanner is\nconfigured to read only one property in the barcode, in the barcode format specify that this property starts in position 1. For example, a\ndocument property starts in position 10 in the full barcode. The camera or barcode scanner is configured to read only characters 10\nthrough 25. In the barcode format, specify that the document property starts in position 1.\nThese job and document properties are useful for finding documents in the system:\nDocument number\nThe number that RICOH ProcessDirector assigns to each document.\nJob number\nThe number that RICOH ProcessDirector assigns to a job.\nInsert sequence\nThe position of the document in the job.\nInserter job name\nThe inserter job name for the job.\nSequence in child job\nThe sequence of the document in the child job. If the job is the original job, the value is the same as the Sequence in original job property. Use\nthe child property to account for changes that occurred in other steps such as sorting or splitting a job.\nThe barcode format identifies only the RICOH ProcessDirector properties in the barcode. It does not identify any other data in the barcode.\nSome barcodes contain values for multiple job or document properties. However, a barcode format only has to interpret entries for the properties\nthat are required for the current task. You have to define the job or document properties that you want to use when you search for a document.\nFor the Inserter feature: If the barcode contains a value for the Document number property, the barcode format does not need to define any\nother job or document property in the barcode. The document number identifies each document in the system. If the barcode format contains\nthe Document number property, RICOH ProcessDirector ignores any other job and document properties in the barcode format.\nFor the Automated Verification feature:\nThe barcode on each document must include the values of the Job number and Sequence in child job properties. The barcode format must\nidentify where the values for those two properties are located in the barcodes.\nYou must plan for the child jobs created for reprints. Make sure that the barcode symbology you use allows the period character ( . ). Every child\njob that is created for reprinting includes at least one period character. If you install only one camera or barcode scanner and read all barcodes\nin the same location on an envelope, one barcode format should be all you need for the system. If other data is included in the barcode and\nthat data is not easy to standardize across applications, you might need to create more than one barcode format. However, the values of the\nJob number and Sequence in child job properties must be in the same positions in the barcode for all barcode formats used for the same\nbarcode reader.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:21 PM Barcode format objects - Jenski - Test portal- RPD Linux\nParent topic: System objects\n2 of 2"}]}