{"doc_name": "aiw00ao.pdf", "doc_path": "data/raw/RPD-en-US/aiw00ao.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4329, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Managing system objects - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects\nManaging system objects\nThe RICOH ProcessDirector system includes a variety of objects that you might need to work with, including servers, notifications, media, and\ndevices such as input devices and printers. Features might add other kinds of objects.\nIn this section:\nViewing object properties\nThe properties of an object are the characteristics that a user defined, or the status information that RICOH ProcessDirector supplied. Objects\ninclude servers, notifications, media, and devices such as input devices and printers. Features might add other kinds of objects as well.\nUpdating object properties\nYou can update the properties that define the characteristics of an object. Objects include servers, notifications, media, and devices such as input\ndevices and printers. Features might add other kinds of objects.\nDeleting objects\nYou can delete an object if it is no longer needed. Objects include servers, notifications, media, and devices such as input devices and printers.\nFeatures might add other kinds of objects as well.\nExporting objects\nTo reuse objects on another RICOH ProcessDirector system, you can export them for use on the other system. On the other system, you then\nimport the objects. Examples of objects are input devices and printers.\nViewing object logs\nYou can view the log for an object to see messages about its operations, such as property or state changes. Objects include servers, notifications,\nmedia, and devices such as input devices and printers. Features might add other kinds of objects as well.\nEnabling objects\nEnabling an object makes it available to RICOH ProcessDirector. Objects include servers, notifications, media, and devices such as input devices\nand printers. Features might add other kinds of objects as well.\nDisabling objects\nDisabling an object makes it unavailable to RICOH ProcessDirector. Objects include servers, notifications, media, and devices such as input devices\nand printers. Features might add other kinds of objects as well.\nCompiling a list of objects and their properties\nYou can compile a list of objects and the properties that define their characteristics. To compile the list, you export the entries in an object table\nto a Comma-Separated Values (CSV) file.\nRICOH ProcessDirector servers\nA RICOH ProcessDirector system is made up of the primary server and, if needed, one or more application and secondary servers.\nInput devices\nRICOH ProcessDirector supports various types of input devices. You can do a variety of tasks for input devices, such as enabling, disabling,\nconnecting and disconnecting them.\nInput files\nInput files are the data files that are sent to the RICOH ProcessDirector input devices defined for the installation. Input files include the files that\ncontain job data as well as trigger files, list files, and other files that might be submitted with the data files. You can group input files into\nbatches to submit them as a job.\nBarcode readers\nBarcode readers are the system representations of your cameras and barcode scanners. You can do a variety of tasks for barcode readers, such as\nconnecting and disconnecting them.\nOrders\nOrders allow you to efficiently group multiple jobs together to be processed as a single order. This feature simplifies the handling of multiple jobs,\nmaking sure that all jobs within an order are managed together and completed in a coordinated manner.\nPrinters\nPrinters are the RICOH ProcessDirector representations of your printer devices. You can do a variety of tasks for printers, such as starting,\nstopping, enabling, and disabling them.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Managing system objects - Jenski - Test portal- RPD Linux\nWorking with data in the Reports database\nAfter you collect data using the Reports feature, you can access that data and use it as input to your business intelligence software.\nRepositories\nYou can work with repositories to do a variety of tasks.\nCreating and editing notes\nYou can create, edit, and delete messages in RICOH ProcessDirector to communicate status across shifts, announce system maintenance, or any\nother messages you need to post in the application. Your coworkers can respond with reactions and replies to facilitate dynamic conversations.\n2 of 2"}]}