{"doc_name": "aiw_OrdPropMap.pdf", "doc_path": "data/raw/RPD-en-US/aiw_OrdPropMap.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4848, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Creating an order property mapping - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Configuring to receive orders / Creating an order property mapping\nCreating an order property mapping\nOrder property mapping objects define the relationships between elements in the XML file and the properties defined in the system. The\nrelationships determine how the CreateOrdersFromFile step identifies orders and the jobs they contain, and sets property values for both the\norders and jobs.\nBefore you begin, generate a sample order XML file using your order management system. Try to create a file that includes representative\nsamples of the jobs you usually process. For example, include:\nOrders with multiple jobs\nOrders with different types of jobs\nMultiple orders in one XML file\nHigh Priority or Rush orders\nWhen you have the XML file, open it in a text editor and review the structure. Identify the XML tags that indicate where each order begins, and\nthen inside each order, where each job begins.\nNote:\nDifferent types of orders (and jobs) can use different XML elements. Make note of all the elements that identify the beginning of an order\nor job.\nIf you cannot include all types of orders in one file, export multiple XML files.\nIn addition, review the elements that include information about orders or jobs, such as a due date, number of copies, or the order identifier in\nthe ordering system. Decide which values you want to use in RICOH ProcessDirector as order or job properties and which RICOH ProcessDirector\nproperties they correspond with.\nIf the existing order properties do not fulfill your requirements, you might need to define custom order properties from the Administration tab to\nsupport the specific needs.\nAfter you have reviewed the file, make sure that it is available to upload.\nTo create an order property mapping:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Property Mappings.\n3. Click Add in the top right corner, and select Order Mapping.\n4. In section 1, enter a name for the object and choose the time format that is used in the sample XML file.\n5. In the Sample order XML file field, find the sample file that you exported and reviewed, and click Open.\nRICOH ProcessDirector opens the file and reads the structure. It uses the contents to populate the fields in sections 2 and 3.\nNote:\nIf you exported more than one sample file, select one now and work through the rest of the procedure. You can update the\nproperty mapping with the other files later.\n6. In section 2, IDENTIFY ORDERS AND JOBS:\n1. In a field under XML element (XPath expression), select an XML element that you identified as the beginning of an order. Under\nRepresents, choose Order.\n2. In the next row, under XML element (XPath expression), choose an element that represents jobs inside the order from the previous\nstep. Under Represents, choose Job.\nNote:\nYou must include at least two XML elements in this section: one to identify orders and one to identify the jobs within that\ntype of order. The XML element identifying jobs must be a child of the XML element identifying the order.\nOrders cannot contain orders, so the XML element representing an order cannot be a child of another order element.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:13 PM Creating an order property mapping - Jenski - Test portal- RPD Linux\n3. If you found more than one element that indicates the beginnings of orders or jobs, add more rows to this section. Click to the\nright of any row and select the XML element and object type for each order and job identifier you found.\nNote:\nTo delete an identifier, click to the right of the row you want to delete.\n4. Continue with section 3 after you add all the order and job identifiers.\n7. In section 3, MAP ELEMENTS TO PROPERTIES:\n1. Refer to the list of elements whose values you want to use in RICOH ProcessDirector and their corresponding properties that you\ncreated before you started the procedure. In the first row, under XML element (XPath expression), choose one of the elements. Under\nObject type, choose Order or Job.\n2. Under Property, select the RICOH ProcessDirector property to use to store the value.\n3. Repeat these steps for each element you want to use as an order or job property. To add more mapping rows, click to the right\nof any mapping. To delete a mapping, click to the right of the mapping you want to delete.\nNote:\nIf the element that you want to use is not visible in the list, you can type the full XPath expression for that element.\n8. Click OK.\nIf you exported more than one sample XML file from your ordering system, open the property mapping you just created and repeat this process\nfrom step 4. Choose a different sample file and add the identifiers and mappings specific to that file.\nParent topic: Configuring to receive orders\n2 of 2"}]}