{"doc_name": "aiw00o5.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o5.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2830, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Workflow phases - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Workflow phases\nWorkflow phases\nRICOH ProcessDirector has several distinct workflow phases. These phases help to organize the path that jobs take through the system. Jobs can\nflow through all the phases or through a few of the phases. The addition of features to the base RICOH ProcessDirector product might add\nadditional phases to the workflow. The default phase names can be changed to better match the functions that you perform in that phase.\nSteps in the phases do the actual phase work. The workflow determines which phases the job passes through and the order of the steps in each\nphase.\nThe processing phases in the base product are:\nReceive phase\nIn the Receive phase, the RICOH ProcessDirector system accepts input files for processing. Each job is assigned a workflow, which defines\nthe phases and steps that process the job. Steps in the Receive phase also set the initial values of job properties for use by later steps in the\nworkflow.\nFor example, RICOH ProcessDirector might queue the job to the first step of the Prepare phase or queue the job directly to the Print phase.\nAfter the Receive phase queues the input file, it becomes a job on the RICOH ProcessDirector system.\nPrepare phase\nThe Prepare phase composes, transforms, and indexes the job to create printable pages. You can also instruct RICOH ProcessDirector to run\nexternal programs during the Prepare phase to further condition or interpret the job.\nAssemble phase\nIf you have the PDF Document Support or AFP Support feature, the Assemble phase organizes documents prior to a phase such as Print that\nproduces the physical documents.\nPrint phase\nThe Print phase routes and sends the job to an available printer, monitors printing status, and reports print completion. It can include a\nmanual quality check, which can let the operator make printer adjustments prior to reprinting the job. It might also send the job to an\nexternal program for customized processing.\nInsert phase\nIf you have the Inserter feature, the Insert phase communicates with the inserter controller and reconciles the job after it completes\ninsertion.\nComplete phase\nAfter jobs have completed all other processing, they arrive in the Complete phase. The Complete phase manages the retention period for\njobs; it deletes jobs that have no retention periods or whose retention periods have expired. For jobs that consist of a parent job and one or\nmore child jobs, the Complete phase makes sure that no additional actions take place until all the related jobs reach the Complete phase. In\nthe Complete phase, you can also invoke external programs on completed jobs. For example, an external program can copy the jobs to an\narchive system.\nParent topic: Product overview\n1 of 1"}]}