{"doc_name": "aiw00co.pdf", "doc_path": "data/raw/RPD-en-US/aiw00co.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 10681, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Configuring - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring\nConfiguring\nConfiguration tasks for RICOH ProcessDirector include adding and setting properties for objects such as input devices, as well as more advanced\ntasks such as setting up external programs.\nIn this section:\nSetting system properties\nSystem properties apply to the overall RICOH ProcessDirector environment, which includes the primary server and any application/secondary\nservers. Some of the properties apply to all the jobs that RICOH ProcessDirector creates.\nPreparing for job submission\nYou can submit jobs to RICOH ProcessDirector using different mechanisms, such as the LPD protocol, FTP, SCP, file copying, or the Submit Jobs\nportlet on the Main page. You can group and track related individual jobs as orders, making sure that all jobs within an order are managed\ntogether and completed in a coordinated manner.\nImporting WSDL files\nA Web Service Description Language (WSDL) file describes how a SOAP web service is called, including the parameters it accepts and the data\nstructures it returns. You import WSDL files for all SOAP web services that you call to communicate with an application. RICOH ProcessDirector\ncreates SOAP request objects from SOAP operations in each WSDL file.\nPreparing to retrieve REST web services input\nTo retrieve input from a REST web service for an application, identify the parameters used to call the REST web service. Test the exchange of data\nbetween RICOH ProcessDirector and the application. Then define and configure a REST web service input device.\nPreparing to retrieve SOAP web services input\nTo retrieve input from a SOAP web service for an application, identify the parameters used to call the SOAP web service. Test the exchange of\ndata between RICOH ProcessDirector and the application. Then define and configure a SOAP web service input device.\nDefining input devices\nInput devices are the RICOH ProcessDirector objects through which RICOH ProcessDirector receives jobs.\nDefining printer objects\nPrinter objects represent the printers in your environment that receive print jobs from RICOH ProcessDirector.\nCreating barcode formats\nYou can create a barcode format object for each barcode that has a different format. The barcode format identifies the values of job and\ndocument properties in the barcode.\nConfiguring the system to use inserters\nInserters are devices that insert printed documents and additional inserts (such as marketing materials) into envelopes. You can create workflows\nthat can help you automate the insertion of documents. The system can write and send an inserter control file for each job to the inserter\ncontroller, read the inserter results file for each job, and automatically (or with operator control) reprint any documents that were damaged\nduring insertion.\nConfiguring media\nRICOH ProcessDirector has several media settings that you can use to help standardize the media names across printers. For Ricoh PDF Printers,\nyou can also configure RICOH ProcessDirector to use product IDs to match media. After you configure media, the media requested by a job can\nbe reliably matched with media available in the printer selected to print the job.\nDefining locations\nLocations represent the places where printers are located.\nPreparing to use workflows\nA workflow defines a set of steps that a job follows through the system. When you define a workflow, you specify what phases and, within\nthose phases, what steps the job passes through during processing.\nCopying objects from another system\nTo reuse objects from another RICOH ProcessDirector system, you can use the other system to export them. On this RICOH ProcessDirector\nsystem, you can import the objects rather than recreating them manually.\nCreating and activating custom properties\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:11 PM Configuring - Jenski - Test portal- RPD Linux\nIf none of the existing job, document, or order properties meet your specific needs, you can define custom properties that are tailored to your\nspecifications. After these properties are activated, you can use them just as you would any other property.\nApplying custom values\nYou can easily apply values that your Ricoh support representative provides for customizing the system, such as custom halftone names and\nprinter models.\nAFP resources in RICOH ProcessDirector\nWhenever you view or print an Advanced Function Presentation (AFP) file or convert a line data job to AFP, RICOH ProcessDirector most likely\nencounters references to AFP resources such as overlays, page segments, and fonts. If those resources are sent inline with the job, RICOH\nProcessDirector uses the inline resources. If they are not inline, RICOH ProcessDirector must know where to find them on your system to be able\nto display, print, or convert the job correctly.\nSetting up user exit programs\nRICOH ProcessDirector can call user exit programs that can modify the AFP print file for a job before or after it prints. Authorized users can\nmodify and compile the sample exit programs that RICOH ProcessDirector provides or they can write their own. RICOH ProcessDirector provides\nsample exit programs in the /usr/lpp/psf/exits (Linux) or C:\\Program Files (x86)\\Ricoh\\PSF\\exits (Windows) directory.\nBanner pages\nBanner pages can be printed at the beginning and end of a job to help distinguish one job from the next. If the AFP Support feature is installed,\nAFP print jobs can also include banner pages between copies of a multi-copy job. Banner pages usually include identifying information about the\njobs, such as the job ID, file name, and the time the job was submitted.\nEmail and progress updates\nYou can send an email during job processing, with the SendEmail step or with a notification object.\nNotifications\nYou can configure these types of notifications and use the copy function to create additional notifications.\nConfiguring control files for job audit information\nRICOH ProcessDirector creates audit files that provide information about a specific job when it deletes the job from the system. Control files that\nuse RICOH ProcessDirector symbol notation determine the values that RICOH ProcessDirector writes to the audit files for a job.\nConfiguring to send jobs to Ultimate Impostrip®\nTo send jobs to Ultimate Impostrip®, you must configure the Ultimate Impostrip® program, the primary computer, and some system settings,\nthen tune the RunImpostripOnJob step template and add it to a workflow.\nSetting up the FusionPro Connect feature\nAfter you read the FusionPro Connect overview topics, set up to send jobs to FusionPro for processing by doing the configuration tasks described\nin this section.\nSetting up datastream transforms\nYou can configure RICOH ProcessDirector to transform input data files to formats that your printers can print.\nSetting up Deadline Tracker\nAfter you read the Deadline Tracker overview topics, set up Deadline Tracker by doing the configuration tasks described in this section.\nConfiguring to use Reports\nAfter you read the Reports overview and usage scenario, configure to use Reports by doing the tasks described in this section.\nSetting up to send data to RICOH Predictive Insight\nThe RICOH Predictive Insight settings let you configure the system to send data to RICOH Predictive Insight.\nSetting up RICOH ProcessDirector and Avanti Slingshot to exchange information\nAfter you read the Avanti Slingshot Connect overview topics, you can set up RICOH ProcessDirector and Slingshot to exchange information\nabout orders, jobs, and job processing. Do the configuration tasks described in this section.\nSetting up the Quadient Inspire Connect feature\nAfter you read the Quadient Inspire Connect overview topics, you can set up Quadient Inspire Connect by doing the configuration tasks\ndescribed in this section.\nSetting up to use electronic forms\nAfter you read the Preprinted Forms Replacement overview topics, set up to use electronic forms by doing the configuration tasks described in\nthis section.\nConfiguring document processing features\nTo configure document processing features, you define the custom document properties you need and then update them to make them\navailable to the system. Using RICOH ProcessDirector Plug-in for Adobe Acrobat for PDF files or RICOH Visual Workbench for AFP files, you set up\nto use documents in your PDF or AFP jobs. You configure your PDF or AFP workflows to process documents. Finally, you make adjustments to\nmaximize document processing performance on your system.\nSetting up to pull documents from a job\nYou can set up to pull documents from a job, or suppress documents from printing, by doing the configuration tasks described in this section.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:11 PM Configuring - Jenski - Test portal- RPD Linux\nSetting up to reconcile jobs manually\nYou can reconcile the documents in a job manually, accounting for all documents that processed successfully and reprinting all damaged\ndocuments. You also can account for all documents that are pulled from the job.\nSetting up to exchange data with web services\nYou can set up to exchange data with web services by running the sample workflow. After you examine how the sample workflow is set up, see\nthe related topics that explain how to set up web service input devices and notifications. You can also examine the related topics on step\ntemplates.\nSetting up to process orders from MarcomCentral\nAfter you read the MarcomCentral Connect overview topic, run the sample workflows for processing orders retrieved from MarcomCentral. After\nyou understand how the sample SOAP web service input device, sample workflows, and sample SOAP web service notification work, you can do\nthe configuration tasks.\nSetting up the Archive feature\nAfter you read the Archive overview topics, you can set up Archive by doing the configuration tasks described in this section.\nSetting up the Postal Enablement feature\nReview the overview topics related to Postal Enablement, then run the sample workflows to see how the supplied step templates and workflows\ncan work together. When you feel comfortable with the concepts, define one or more workflows to send jobs to your postal processing software\nand test them to make sure that they function correctly.\nSetting up the Automated Verification feature\nAfter you read the Automated Verification overview topics, run the VerifySample workflow. You can then set up Automated Verification by doing\nthe configuration tasks described in this section.\nSetting up the Preference Management feature\nAfter you read the Preference Management overview topics, you can set up Preference Management by doing the configuration tasks described\nin this section.\n3 of 3"}]}