{"doc_name": "pdfw_t_plugin_addmediafinish.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addmediafinish.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3871, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Selecting media and finishing options - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Media and finishing\n/ Selecting media and finishing options\nSelecting media and finishing options\nYou can select media and finishing options for specific pages in each page group by specifying a rule or typing page numbers. For example, you\ncan specify that pages 1–4 of each page group are stapled. You can also specify that the first page of each page group prints on gold paper.\nTo select media and finishing options:\n1. Click Ricoh ⇒ Media and Finishing and then click the icon.\n2. Select a media option on the Paper substitution list or a stapling option on the Subset finishing list.\nNote:\nThe media options are the names of RICOH ProcessDirector media objects specified in the media.zip file (or the media.xml file\nfrom an older version of RICOH ProcessDirector).\nIf you do not see all the media defined in RICOH ProcessDirector, load an updated media.zip file.\n3. Use the Placement Conditions section to specify the pages for the media or finishing option. Do either of these steps:\nSelect Pages based on a rule, and then select a rule from the list. The default rule is All Pages. You can also:\nDefine a new rule by clicking the icon.\nGo to the Rules Manager by clicking the icon.\nSelect Specify pages and type the pages that you want. Media and finishing options are applied to these pages in each page group. You\ncan:\nUse a hyphen to separate the first and last pages in a page range.\nUse a comma to separate page selections.\nType n to specify the last page in each page group.\nFor example, a PDF file has two page groups. The first has four pages, and the second has seven pages. Specifying pages 3–n places\nmarkup on pages 3–4 in the first page group, and pages 3–7 in the second.\n4. Click OK.\nThe option that you specified appears on the media and finishing list.\n5. If you have multiple options for paper substitution or subset finishing, select the new option. Use the up and down arrows to move it into\nthe proper position in the ordered list of options.\nRICOH ProcessDirector Plug-in for Adobe Acrobat applies the page-level options to the PDF file in the order that they appear on the list,\nfrom top to bottom. If two page-level options specify conflicting selections for the same page (for example, two different types of media),\nRICOH ProcessDirector Plug-in for Adobe Acrobat applies the option that is lower on the list.\n6. To verify that RICOH ProcessDirector Plug-in for Adobe Acrobat has applied media and finishing options to the intended pages:\n1. Click Ricoh ⇒ Preview.\nIf a page has media and finishing options, you see an annotation labeled Print Operations in the upper right corner.\n2. To see the media name and finishing option, hover the mouse pointer over Print Operations.\nFor example:\nMedia = Blue LetterStapling = Top left (#1)\n(#1) indicates the sequence of the page in the finishing option. If you specify stapling for pages 5–8, page 5 is #1 and page 8 is #4.\nAs an alternative, click Comment on the Adobe Acrobat toolbar. In the Comments pane, you see a comment for each page with\nmedia and finishing options.\nNote:\nThe Show electronic forms preference determines whether Preview shows how sample files look when the data is combined\nwith electronic forms defined for the media that the files use. Set the preference to Yes to see the data combined with the\nforms.\n7. When you are ready to save all your enhancements to the PDF file, including the new media and finishing options, click Ricoh ⇒ Save\nControl File.\n8. In the RICOH ProcessDirector BuildPDFFromDocuments step, specify the name and location of the control file that contains the media and\nfinishing definitions.\nParent topic: Media and finishing\n1 of 1"}]}