{"doc_name": "aiw02cmt.pdf", "doc_path": "data/raw/RPD-en-US/aiw02cmt.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2564, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Color mapping table source and output files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / AFP resources in RICOH ProcessDirector / Color mapping table source and output files\nColor mapping table source and output files\nA color mapping table is a printer resource object that defines a translation from certain Mixed Object Document Content Architecture\n(MO:DCA) structured fields to new color structured fields that newer printers use.\nUse color mapping tables to adjust highlight and OCA colors on printers such as the InfoPrint 5000. You can also use a color mapping table to\nmap highlight colors into richer colors on a color printer like the InfoPrint Color 130 Plus printer. To apply color to black and white documents,\nyou must create color mapping table source and object files using the AFP architecture reference.\nYou can define translations from non-color fields to color, old color fields to new color fields, and from new color fields to different new color\nfields. Therefore, you can use existing applications and documents with new color fields without changing the applications or documents. You\ncan use various color mappings with a single document to print the document using color in different ways without changing the original\ndocument.\nThe cmt utility creates color mapping tables from configuration files. It lets you create color mappings in a variety of different color modes that\nare defined through the ColorSpace parameter. For example, you can use the Highlight value when adjusting highlight and OCA colors on\nprinters such as the InfoPrint 5000 and InfoPrint C900 AFP.\nThe sample configuration file, /usr/lpp/psf/config/cmt.cfg (Linux)C:\\Program Files (x86)\\InfoPrint\\PSF\\config\\cmt.cfg\n(Windows), contains user-defined specifications. The cmt utility created a MO:DCA sample color mapping table, named cmtsampl, from the\nsample configuration file.\nIn this section:\nParts of a color mapping table\nA color mapping table consists of a base part, a set of source groups, and a set of target groups. The base part identifies the color mapping table\nwith a type of reset or normal.\nCreating a color mapping table (example)\nThis example shows how to create a color mapping table to print an Advanced Function Presentation (AFP) file that contains pie charts in the\ncolor green.\nOther topics in this section:\nIdentifying AFP resource directories to RICOH ProcessDirector\nSearch order for AFP resource extensions\nJob properties and AFP form definitions\nParent topic: AFP resources in RICOH ProcessDirector\n1 of 1"}]}