{"doc_name": "aiw00bannerbppv.pdf", "doc_path": "data/raw/RPD-en-US/aiw00bannerbppv.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3997, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Identifying properties for banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / Identifying properties for banner pages\nIdentifying properties for banner pages\nUpdate the banner_page_property_values.cfg configuration file to define the properties that you can include on banner pages. The\nconfiguration file defines the elements that can print on banner pages, including properties of jobs, orders, printers, load plans, and other\nobjects, system settings, and text strings.\nNote: Updates might overwrite files in the /aiw/aiw1/samples/banner_pages/ directory, but they do not overwrite files in the\n/aiw/aiw1/control_files/banner_pages/ directory. We recommend copying sample files into the\n/aiw/aiw1/control_files/banner_pages/ directory and making all your changes in the copied file.\nWhen RICOH ProcessDirector assigns a job to a printer, it generates the jobnumber.banner_attributes.txt file in the spool directory for the\njob. This file contains the properties notebook names and job-specific resolved values for all the properties that the\nbanner_page_property_values.cfg file contains.\nTo update the properties for banner pages:\n1. Log in to the primary computer as the RICOH ProcessDirector system user ( aiw1 is the default).\n2. Navigate to: /aiw/aiw1/control_files/banner_pages/\n3. Open the banner_page_property_values.cfg file with a text editor.\n4. Add entries to or delete entries from the file, as required for the installation.\nEach entry in the file has two lines. The first line contains text strings and database property names, separated by commas. Database\nproperty names are delimited with brackets ([]). The second line expresses the first line as a symbol formula. For example:\nThis example defines a job property. The symbol name is the same as the job property name.\n[Job.Copies]\n${Job.Copies}\nThis example defines an order property. The symbol name is the same as the order property name.\n[Order.ID]\n${Order.ID}\nThis example defines a printer property:\n[Printer.AFP.Overlay]\n${Printer.AFP.Overlay}\nThis example defines a system setting:\n[WorkflowSystem.Transform.ServerAddress]\n${WorkflowSystem.Transform.ServerAddress}\nThis example defines a barcode that includes an initial text string, two job properties, and a final text string:\nSO,[Job.ID],[Job.TotalSheets],2009\n${Customer.BarCode}\nThis example defines a property of the load plan associated with the job. The ampersand (&) indicates that the properties are nested.\n&[Job.Insert.LoadPlan.ID] [LoadPlan.Media]\n${Job.Insert.LoadPlan.ID} ${LoadPlan.Media}\nThis example defines a single instance of a job property that can have different values for different phases and steps. The example\nresolves to one value:\n[Job.External.Command.Prepare.RunExternalProgram]\n$[Job.External.Command.Prepare.RunExternalProgram]\nThis example defines all instances of a job property that can have different values for different phases and steps. This example can resolve\nto several values:\n[Job.External.Command]\n$[Job.External.Command]\nWhen RICOH ProcessDirector assigns a job to a printer and generates the jobnumber.banner_attributes.txt file, it resolves entries from\nthe configuration file. Depending on settings in the individual banner page configuration files, such as\n/aiw/aiw1/control_files/banner_pages/header.cfg (for AFP banner pages) or\n/aiw/aiw1/control_files/banner_pages/header.jrxml (for PDF banner pages), it can resolve entries like this:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:10 PM Identifying properties for banner pages - Jenski - Test portal- RPD Linux\n[Job.Copies.Value]\n1\n[Job.Copies.NameAndValue]\nJob copies requested: 1\n[Customer.BarCode.Value]\nSO10000007112009\n[Customer.BarCode.NameAndValue]\nSO: SO Job number: 10000007 Total sheets: 11 2009: 2009\n[Order.ID.Value]\nO-10004\n&[Job.Insert.LoadPlan.ID] [LoadPlan.Media.Value]\nA4\n5. Save the configuration file. All the properties that the file defines are now available to use with banner pages.\nParent topic: Banner pages\n2 of 2"}]}