{"doc_name": "aiw_c_alternatesmtp.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_alternatesmtp.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2550, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Setting up the system to use an alternate email server - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Email and progress updates / Setting up the system to use an alternate email server\nSetting up the system to use an alternate email server\nYou can set RICOH ProcessDirector to use an alternate email server to send jobs or documents instead of using the default server.\nRICOH ProcessDirector sends email using several mechanisms:\nNotifications\nEmails created by notifications must use the default email server.\nJobs\nJobs or pages from jobs are sent by the SendEmail step in a workflow.\nDocuments\nYou must install the PDF Document Support feature to use the EmailDocuments step. Emails with documents attached are created by an\nEmailDocuments step in a workflow.\nEmails sent by workflows might contain more sensitive data or be larger in volume (many separate document emails from a large job). Specifying\nan alternate email server allows you to route those types of emails differently than the notification emails.\nTo set up the system to use an alternate email server:\n1. Click the Administration tab.\n2. Select Settings ⇒ System and scroll down to the Email/SMTP section.\n3. In the Alternate SMTP server field, type the address of your SMTP server.\n4. In the Alternate SMTP port field, type the port number for the alternate SMTP server. Check with your network administrator to make sure\nthis port is open.\n5. In the Alternate SMTP user name field, type the user name that RICOH ProcessDirector uses if it has to log in to the alternate SMTP server.\nNote:\nYou might have multiple user names for your SMTP account, for example, one for administrator and one only for outbound emails.\nMake sure you select the correct user name to use for outbound emails.\n6. In the Alternate SMTP password field, type the password for the SMTP user name that you entered above.\n7. Optional: Depending on the type of security that the SMTP server uses, fill in the correct field for the port, Alternate email SSL port or\nAlternate email TLS port. This port is used to create a secure and encrypted link between the alternate SMTP server and RICOH\nProcessDirector. Check with your network administrator to make sure this port is open.\nNote:\nDepending on how your SMTP server is set up, either an SSL port, TLS port, or neither port are used. An SSL port and TLS port\ncannot be used at the same time. Check your alternate SMTP server settings to make sure which port is used.\n8. Click SAVE.\nParent topic: Email and progress updates\n1 of 1"}]}