{"doc_name": "creatingindexes.pdf", "doc_path": "data/raw/RPD-en-US/creatingindexes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3793, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating index tags for text blocks - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating index tags\n/ Creating index tags for text blocks\nCreating index tags for text blocks\nYou can create an index tag for text in an AFP text block. You can edit the text in the block to remove unwanted characters, such as blanks or\nspecial characters.\nNotes:\n1. If the AFP file does not contain page groups, create page groups. Otherwise, to create an index tag on a page outside a page group, see\nCreating index tags on supplemental pages.\n2. In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo create an index tag for a text block:\n1. In RICOH Visual Workbench, open a sample AFP file that contains the text you want to index. Then click Mode ⇒ AFP Indexer.\n2. Click the text that you want to use to mark specific data in each page group. The text blocks you can select are defined in the AFP file,\nfrom one character to the entire line of text. You see a red box around the text you selected.\n3. Right-click anywhere on the page and click Create Index Tag. You see the Create Index Tag window with the text to index in the Edited\nindex value field.\n4. Use the default code page encoding or select an encoding from the drop-down list if the text displays incorrectly.\n5. Type a descriptive name for the index tag in the Index tag name field. For example, if you select “Joe Smith” for the index tag, the name\ncould be “Customer name”.\n6. Decide whether you want to use the entire text value to create the index tag or specify part of the text. You can edit the text block to\nreduce the number of characters you use for the index value (you cannot increase the characters in a text block). To select part of the text\nas the index tag:\n1. Click Edit index value.\n2. Edit the index value in the Edit Value window.\nFor example, if the account number is one text block, 01-345678, you can create an index value with part of the account number,\nsuch as 345678.\n3. Click OK.\n7. Make sure Page group is selected as the index type.\nYou also see the index type Page within page group, which is used to create an index tag on an individual page in a page group. See\nCreating page-level indexes.\n8. Click the Advanced tab to change the threshold to look for a text value that is in slightly different positions on some pages. You can select\na range from 1/100 to 1 inch or from 1 to 25 millimeters.\nAlthough text might appear to be present in the same location on each statement, slight position variations can occur in the AFP file. The\nthreshold defines how far the text can be from the original location and be considered an index tag. For example, a threshold value of 12\nindicates that the index tag can be located within .12 of an inch or 12 millimeters, either vertically or horizontally. Usually the default\nthreshold value of 10 is sufficient (10 for inches or 2 for millimeters).\nKeep in mind that if you increase the threshold above the default value, you might create an index tag you did not expect because the\nmatch is only done on location, so the first text block found in the threshold range is used as the index tag.\n9. Click OK. You see the index tags listed in the bottom pane for each page group.\n10. Verify that the correct index tag has been created:\n1. Double-click the index tag in the bottom pane and verify that the correct page in the page group is displayed.\n2. If the index tag is incorrect, click Tools ⇒ Modify Definitions to modify or delete the tag.\nThe index tag is listed as a Page Group Definition under Page Group Indexes.\nParent topic: Creating index tags\n1 of 1"}]}