{"doc_name": "createwstrigger.pdf", "doc_path": "data/raw/RPD-en-US/createwstrigger.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3187, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating page groups when white space is found - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating page groups\n/ Creating page groups when white space is found\nCreating page groups when white space is found\nYou can create page groups when white space is found in an area. White space does not contain IOCA (Image Object Content Architecture)\nimage data. As an alternative, you can create page groups when IOCA image data is found in an area.\nA white space trigger is white space that occurs in a consistent location on the first page of all page groups. You define the start of each page\ngroup with the trigger.\nIf you create page groups using triggers, all existing page groups that are defined in the AFP file itself are ignored.\nTo create page groups when white space is found:\n1. In RICOH Visual Workbench, open a sample AFP file that contains the white space that you want to use to trigger page groups. Then click\nMode ⇒ AFP Indexer.\n2. To create the area, position your cursor at a corner of the area that contains the white space that you want to use to trigger page groups.\nWhile pressing the left mouse button, draw a box that includes the white space.\n3. Right-click anywhere on the page and click Create White Space Trigger..\nYou see the Trigger on White Space window.\n4. Type a descriptive name for the white space trigger in the WS Trigger definition name field.\n5. Choose when to start a page group:\nThe pels found option starts a new page group when the bounded area contains IOCA image data.\nThe pels not found option starts a new page group when the bounded area does not contain IOCA image data.\nNote: Text is not IOCA image data.\n6. Optional: Change the origin (top-left corner) and size of the bounded area in these fields. Decimal values (such as 2.5) are allowed. Specify\nthe origin and size in inches or millimeters.\nX position\nThe horizontal distance of the left side of the area measured from the left side of the logical page (not the physical sheet of paper).\nY position\nThe vertical distance of the top of the area measured from the top of the logical page (not the physical sheet of paper).\nWidth\nThe horizontal width of the area.\nHeight\nThe vertical height of the area.\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the logical page in the unrotated view.\n7. Click OK.\nIn the left pane and in the bottom pane, you see the page groups that have been defined based on the trigger. You also see the pages that\nare included in each page group.\n8. Verify that the correct page groups have been created:\n1. Check that the number of pages is correct in each page group.\n2. Select page groups in the left pane to see the first page in a few of the page groups and verify that the correct boundaries were\ncreated.\n3. If the page groups are incorrect, click Tools ⇒ Modify Definitions to modify or delete the trigger.\nThe trigger is listed as a Page Group Definition under Start Page Group Triggers .\nParent topic: Creating page groups\n1 of 1"}]}