{"doc_name": "pref_c_configforPrefMgmt.pdf", "doc_path": "data/raw/RPD-en-US/pref_c_configforPrefMgmt.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2236, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Setting up the Preference Management feature - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Preference Management feature\nSetting up the Preference Management feature\nAfter you read the Preference Management overview topics, you can set up Preference Management by doing the configuration tasks described\nin this section.\nAfter the initial configuration is complete, test your Preference Management workflows to make sure they work as you expect them to.\nIn this section:\nRunning the sample workflow for managing output preferences\nThe PreferencesSample workflow for applying processing preferences to jobs illustrates how to use a preferences file to control multichannel\ndelivery. The PreferencesSample workflow creates three child jobs each of which processes documents differently based on the value of the\nOutput type property.\nDefining document properties for use with a preferences file\nBefore RICOH ProcessDirector can use data about documents, you must define the data as RICOH ProcessDirector document properties.\nMaking a preferences file available to the system\nYou can make an external preferences file available to the system in several different ways. For example, you can submit a job and a preferences\nfile together to an input device, you can copy a preferences file to a directory on the primary computer for use with multiple jobs, or you can\ninstruct RICOH ProcessDirector to retrieve a preferences file from an external location.\nDefining document property mapping objects\nYou can use document property mapping objects to define the relationship between the headings in a preferences file and the document\nproperties defined for documents in a job. The relationship determines how the ApplyPreferences step uses their values during processing.\nSetting up a workflow that uses an external preferences file\nTo process documents based on information from an external preferences file, you set up a workflow that includes a step based on the\nApplyPreferences step template. Additional steps and conditional processing (or additional workflows) might be required to handle the\nprocessing for each document based on the preference information.\nParent topic: Configuring\n1 of 1"}]}