{"doc_name": "mcc_c_PrepToRetrieveOrders.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_PrepToRetrieveOrders.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3458, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Preparing to retrieve orders from MarcomCentral - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral / Preparing to retrieve orders from MarcomCentral\nPreparing to retrieve orders from MarcomCentral\nTo retrieve orders from a store at the MarcomCentral website, copy the MarcomReceiveOrders SOAP web service input device supplied with the\nMarcomCentral Connect feature. The Request URL and Request payload properties of the input device are set to call the Order MarcomCentral\nweb service and retrieve orders by date. Set other properties to values that work with your MarcomCentral store and RICOH ProcessDirector\nworkflows.\nBefore doing this procedure, make sure that you imported WSDL files and installed a security certificate. If your environment requires a proxy\nserver to communicate with MarcomCentral, make sure that you set up the system to use it. For more information, see the related tasks.\nTo prepare to retrieve orders from MarcomCentral:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Input Devices.\n3. Copy the MarcomReceiveOrders input device and give it a new name.\n4. On the General tab, set the Polling interval property to the time that you want the input device to wait between web service calls.\nMake sure that the polling interval meets the MarcomCentral terms of service. If the terms limit calls to the MarcomCentral system to a\nmaximum of 1 every 5 minutes, set the value to 5 minutes or more.\n5. On the Request tab:\n1. Set the Use proxy property to the proxy server (if any) that you use to communicate with the web service.\n2. Set the Time zone offset property to the offset in hours between Coordinated Universal Time (UTC) and the time zone that the\nMarcomCentral web service uses.\nFor example, if the MarcomCentral web service uses Pacific Standard Time to compute dates and times, set the property to -8.\nNote:\nMake sure that you change this property when a MarcomCentral location that hosts the web service changes between\nstandard and daylight savings time. Otherwise, you can lose the orders placed during the lost or gained hour.\nTo retrieve orders, the input device uses symbols for two properties:\nWebService.CurrentRequestTime\nRICOH ProcessDirector sets the value of this property at the start of the polling interval.\nWebService.LastSuccessRequestTime\nWhen the input device successfully communicates with the application, RICOH ProcessDirector sets the value of this property\nto match the value of the WebService.CurrentRequestTime property. A successful communication results in a response code\n200, even if no data is received that creates a job.\n3. Set the SOAP request property to the GetOrdersByDate SOAP request that you imported.\nIf you prepended MyStore to the names of the SOAP requests when you imported them, set the property to MyStore-\nGetOrdersByDate.\n4. Use the default values for all other properties on the Request tab.\n6. On the Authentication tab:\n1. Set the Static credential property to your MarcomCentral order token.\n2. Leave the values of all other properties blank.\n7. When you finish editing the properties, click OK.\nAfter you define a workflow to process MarcomCentral orders, right-click the input device and select Properties. On the General tab, set the\nChild workflow property to the name of the workflow that you defined.\nParent topic: Setting up to process orders from MarcomCentral\n1 of 1"}]}