{"doc_name": "enhancingafpfiles.pdf", "doc_path": "data/raw/RPD-en-US/enhancingafpfiles.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5005, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Working with sample AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files\nWorking with sample AFP files\nYou can use RICOH Visual Workbench to enhance a sample AFP file.\nThe sample AFP file should be representative of production AFP files that users submit to RICOH ProcessDirector for processing. RICOH\nProcessDirector can then make the same enhancements to production AFP files when it prepares them for processing.\nTo enhance AFP files, first you open a sample AFP file in RICOH Visual Workbench and make enhancements to it. RICOH Visual Workbench adds\ninformation about the enhancements to a control file. Then, you add a step that names the control file to the workflows for production AFP files\nthat are similar to the sample AFP file. RICOH ProcessDirector uses the information in the control file to enhance the production AFP files in the\nsame way you enhanced the sample AFP file.\nIn this section:\nDisplaying sample AFP files\nYou can open a sample AFP file in RICOH Visual Workbench. The sample AFP file must be representative of production AFP files that you want to\nenhance in the same way as the sample file.\nCreating and updating control files\nWhen you open a sample AFP file to enhance it, RICOH Visual Workbench can either create a control file or update a control file that you created\npreviously. The control file contains definitions that tell RICOH ProcessDirector how to enhance production AFP files that are similar to the sample\nAFP file.\nIdentifying AFP resource directories\nIf the sample AFP file refers to AFP resources (fonts, page segments, and overlays) that are not located inline or in the default AFP resource\ndirectories, identify the resource directories that contain the resources so that RICOH Visual Workbench can display the sample AFP file correctly.\nMapping fonts for AFP files\nIf RICOH Visual Workbench does not display a custom AFP font correctly in the sample AFP file, you can map the font to a comparable Java font\nof the same point size and style, and you can change how particular code points map to Unicode code points.\nEnabling object selection in sample AFP files\nYou can change which AFP objects (text, overlays, page segments, barcodes, images) are selectable in the sample AFP file that is currently open.\nShowing page information in sample AFP files\nYou can show the names of AFP resources (fonts, page segments, and overlays) that the current page in the AFP file refers to and sheet\ninformation for the currently displayed AFP page. For each resource, you can see whether RICOH Visual Workbench found the resource and\nwhere the resource was found.\nSpecifying a form definition\nYou can specify whether RICOH Visual Workbench displays the AFP file with a form definition. You can use an inline form definition or a default\nform definition from a specified directory.\nConfiguring and running a set of filters\nYou can configure and run a set of filters, in a specific order, to process large AFP files quickly and efficiently.\nCreating barcodes with AFP Enhancer\nAFP Enhancer lets you create barcodes in AFP files.\nCreating text with AFP Enhancer\nYou can create text on a specified page of each page group in an AFP file and specify its font and size. For example, you can add page numbers\nor you can add text so that the information in a barcode is also printed as readable text.\nCreating hidden areas with AFP Enhancer\nYou can hide areas in AFP files that you do not want RICOH ProcessDirector to display or print. For example, you can hide an area that contains a\nbarcode before you create a new barcode in the same place.\nModifying or deleting AFP Enhancer definitions\nAfter you create barcodes, text, or hidden areas, you can modify or delete any of them.\nEditing AFP files\nThe AFP Enhancer mode of RICOH Visual Workbench and the AFP Editor plug-in to RICOH Visual Workbench let you create barcodes and text,\nand hide areas that contain unwanted content (such as obsolete barcodes) in AFP files.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:15 PM Working with sample AFP files - Jenski - Test portal- RPD Linux\nIndexing AFP files\nAFP Indexer can create page groups, define supplemental pages, and create indexes in AFP files so that the information can be used in RICOH\nProcessDirector to navigate to indexed pages in the file, exclude non-customer information from mailpieces, and reprint specified pages.\nAdding content to white space in AFP files\nWhitespace Manager can find areas of available white space in AFP files and then fill the white space with content, such as images or text.\nCustomizing properties for AFP files\nYou can use Document Property Designer to customize document and job properties for AFP files by linking the properties to index tags. Index\ntags are also called Tagged Logical Elements (TLEs). In addition, you can define link options for the properties and edit the index tag values.\nParent topic: Configuring document processing features\n2 of 2"}]}