{"doc_name": "aiw00a18.pdf", "doc_path": "data/raw/RPD-en-US/aiw00a18.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3668, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Updating object properties - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Updating object properties\nUpdating object properties\nYou can update the properties that define the characteristics of an object. Objects include servers, notifications, media, and devices such as input\ndevices and printers. Features might add other kinds of objects.\nBefore you update the properties of some objects, make sure that the object is disabled.\nBefore you update the properties of a workflow, note that:\nYou can change job default properties in the workflow while jobs are still in the system. However, those values are not changed in existing jobs\nthat use the workflow. To apply the new values, process the job again from a step before all the steps that use the updated properties.\nIf you add or remove steps or connectors in a workflow that has jobs in it, any jobs in the system that were being processed by that workflow\ncan only be restarted at the beginning of the workflow.\nIf you add steps in a workflow that has jobs in it, values set for any properties added to the job by those steps are applied to the jobs that are\nactive in the workflow. Values changed on any properties that were already set in the workflow are updated when you select the Process again\naction.\nIf you delete steps in a workflow that has jobs in it, any property values set by the deleted steps remain set on the job and are still used by\nconnectors as the job moves forward in the workflow.\nIf you add or delete connectors in a workflow that has jobs in it, all changes to the connectors are applied to the jobs as they move forward in\nthe workflow.\nTo update the properties of an object:\n1. Open the properties notebook for the object:\nFrom the Main page:\n1. Find the object in its portal.\n2. Click the name of the object.\nFrom the Administration page:\n1. In the left pane, click the object type.\n2. In the table, click the name of the object.\nNote:\nTo update the properties for multiple jobs, find the jobs in Jobs portlet, select the jobs you want to update, and click Update\nMultiple.\n2. Select or type new values for the properties as needed.\n3. To see information about any of the properties, click the icon next to the property name.\n4. Click OK.\nTo view and change the properties of multiple jobs:\n1. In the Jobs table, select the jobs you want to work with and select Update Multiple.\n2. Select a property you want to change from the list. Then select or type new values for the property.\n3. To add an additional property, click the plus sign to the right of your last entry.\n4. To delete a property, click the minus sign to the right of the entry you want to delete.\n5. Click OK.\nTo set the default values for job properties in a workflow without editing steps:\n1. Open a workflow.\n2. Right-click on the workflow editor and select Manage job defaults.\n3. Find the property you want to change and specify the new value.\n4. If the property is not in the list, use the Add a property field to select the property and its value.\n5. If you want to remove the value from a property in the list, hover over the property in the list and select the X that appears to the right of\nthe value field.\n6. After you complete your changes, click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Updating object properties - Jenski - Test portal- RPD Linux\nNote:\nFor some updates for printers to take effect, RICOH ProcessDirector disables and shuts down the printer, then starts up and enables the printer\nautomatically.\nFor some updates for input devices to take effect, you must disconnect the input device and then connect it again.\nParent topic: Managing system objects\n2 of 2"}]}