{"doc_name": "rep_o_scen_ReprintDocument.pdf", "doc_path": "data/raw/RPD-en-US/rep_o_scen_ReprintDocument.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3503, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Usage scenario for storing documents to satisfy requests for reprints - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Archive / Usage scenarios for Archive\n/ Usage scenario for storing documents to satisfy requests for reprints\nUsage scenario for storing documents to satisfy requests for reprints\nIn this scenario, a commercial printer prints and mails account statements for a bank once a month. When customers request reprints of their\nbank statements, the bank wants the commercial printer to satisfy those requests for up to four years after the statements are printed. The bank\nalso wants to save the production history for jobs that are stored, so they can confirm that those statements were printed when the original job\nwas processed.\nCurrently the commercial printer runs 500 jobs a day and uses a RetainCompletedJobs step in the workflow to retain jobs for three days.\nRetaining the jobs longer than three days would make jobs difficult to find in the Jobs table and might cause performance issues with the print\nproduction system. For example, if the commercial printer retained jobs for three months, the Jobs table would have 45,000 jobs.\nAn administrator at the commercial printer creates a repository with a retention period of four years. The administrator then defines a history\nrecord notification object that records job state information whenever the Current job state property changes to Complete. Then to minimize the\nnumber of notifications that are recorded, he sets a condition so the history record is only saved when the Current step equals PrintJobs.\nThe administrator adds a step based on the StoreInRepository step template after the PrintJobs step in the PDF print workflow, but before the\nRetainCompletedJobs step, and saves the print file. The administrator specifies both job and document properties in the StoreInRepository step.\nThe job properties are Customer name, Custom 2 (which stores the cycle date), Time submitted, and Workflow. The document properties are\nVerification recipient, Account number, and Postal code. The Administrator also sets the Store history records property to Yes. The commercial\nprinter’s staff can use any combination of the job and document properties to search for and retrieve documents and information about their\nprocessing history.\nThe pre-press department uses RICOH ProcessDirector Plug-in for Adobe Acrobat to identify documents in a PDF file and define the document\nproperties. The staff then submits the job to the PDF print workflow.\nWhen the job completes the StoreInRepository step, the job and its print completion timestamp are stored in the repository. Three days after the\njob is run, it is deleted from the Jobs table.\nIn August 2014, eight months after a job is run, the commercial printer receives a request from the bank to reprint a document with Account\nNumber 1122345687. The print department supervisor searches the repository for a document with a value of DEC2013 for the Custom 2 job\nproperty and a value of 112234568 for the Account number document property. The Results table lists the document that matches those\nproperty values.\nThe supervisor displays the detailed information about the document. On the History tab, he confirms that the document found is the correct\ndocument. He then submits the statement to a reprint workflow that only has steps related to printing.\nParent topic: Usage scenarios for Archive\n1 of 1"}]}