{"doc_name": "reportsPostgresql_UploadData.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_UploadData.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3684, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Uploading data using data transmitters - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring to use Reports / Uploading data using data transmitters\nUploading data using data transmitters\nYou can use data transmitters to extract property values captured and stored by data collectors in the Reports database, then send them to\nanother application.\nData transmitters query the Reports PostgreSQL database, gather the required information, and use the REST protocol to send it to another\napplication. The data transmitter creates a comma-separated value (CSV) file that contains the property values.\nBefore you do the steps in this procedure, determine which database tables to extract and when and how often you want to extract the\ninformation.\nImportant: This procedure applies only to REST Transmitters. To upload data for RICOH Predictive Insight, see Setting up to send data to\nRICOH Predictive Insight.\nYou can configure each data transmitter to extract and send values from different tables. When enabled, the data transmitters run according to a\nschedule.\nTo upload data using data transmitters:\n1. Learn the requirements for communication with the REST web service for the application:\nHow to authenticate with the application\nThe values to specify for the REST authentication and transmission requests\nThe format of the data expected in the response\n2. To prepare RICOH ProcessDirector to communicate with the application, do these tasks:\nIf the application requires a security certificate, install the certificate on the RICOH ProcessDirector primary computer.\nIf your environment requires a proxy server to communicate with web services, set up the system to use it.\n3. Set up a credential object to use with the data transmitter. Data transmitter objects use Static or Session credentials to authenticate with\nthe application.\n4. Define a data transmitter object:\n1. Click the Administration tab.\n2. In the left pane, click Reports ⇒ Data Transmitters.\n3. Click Add and select REST Transmitter.\n5. Review the current values for the properties and make any required updates on all the tabs.\nTo see information about any of the properties, click the question mark button next to the property name.\n6. When all the settings are configured correctly, click the switch at the top of the General tab to enable the data transmitter.\nNote:\nData transmitters must be enabled to extract and send data. If you enable one or more data transmitters while data collection is\ndisabled or no data has been stored in the selected database tables, the data transmitters do nothing. When the data transmitters\nand data collectors are enabled, if data collectors start to capture data, the data transmitters start to send information on the\nspecified schedule.\nYou can create and enable a data transmitter even when the data collectors are disabled.\nIf the data collector was never enabled and there is no data stored in the selected database tables, an error message is displayed.\n7. Click OK.\n8. Use the one-time transmission function to test the exchange of information between RICOH ProcessDirector and the application.\n1. In Reports ⇒ Data Transmitters, right-click the transmitter and select One-time Transmission.\n2. To test data transmission, select the Specific Range option and fill in the values for the start and end date.\n3. Click OK.\n9. If the transmission is successful, check the receiving application to be sure that the data arrived as you expected it to. Or, if the transmission\nfails, right-click the data transmitter and select View Log to see information about which tables failed and why.\nParent topic: Configuring to use Reports\n1 of 1"}]}