{"doc_name": "avanti_r_SendingInfoToAvanti.pdf", "doc_path": "data/raw/RPD-en-US/avanti_r_SendingInfoToAvanti.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2044, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Sending job status information to Avanti Slingshot - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Sending job status information to Avanti Slingshot\nSending job status information to Avanti Slingshot\nTo send job status information between Avanti Slingshot and RICOH ProcessDirector, you must define the URL of the Avanti Slingshot system to\nRICOH ProcessDirector.\nNote:\nFor a typical implementation of Slingshot, you do these steps to exchange information with RICOH ProcessDirector. Your implementation\nof Slingshot can have steps that differ from these steps.\n1. Log in to the Avanti Slingshot Client.\n2. Navigate to System Setup ⇒ General and double-click JDF type.\n3. Select the Connection Options tab.\n4. In the JMF HTTP URL field, specify the URL for the RICOH ProcessDirector server:\nhttp://yourserver:15080/aiwservices/v1/jmf\nReplace yourserver with the IP address or host name of your RICOH ProcessDirector server.\n5. Copy the URL from the JMF Return HTTP URL field to the clipboard. The JMF Return HTTP URL looks similar to\nhttp://AvantiServer:8081/servoy-service/rest_ws/avanti_jdf/jmf_inbound_processing/params?\nUsername=UserName&Password=password\n6. Log in to RICOH ProcessDirector.\n7. Navigate to Administration ⇒ Settings ⇒ Avanti Slingshot\n8. Paste the URL from the JMF Return HTTP URL field into the Avanti URL field and click OK.\nImportant:\nIf you change the Avanti Slingshot client password, you must update the JMF Return HTTP URL with the new password and copy\nthe JMF Return HTTP URL into the Avanti URL field in RICOH ProcessDirector. For example, if you updated your password to\nMyPassword, and your current URL is http://AvantiServer:8081/servoy-\nservice/rest_ws/avanti_jdf/jmf_inbound_processing/params?Username=UserName&Password=password,\nchange Password=password at the end of the URL to Password=MyPassword.\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n1 of 1"}]}