{"doc_name": "pdfw_c_plugin_workwithinserts.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_workwithinserts.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2030, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Working with page inserts - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with page inserts\nWorking with page inserts\nThe Inserts Manager dialog shows information about page inserts from other PDF files. You can add, edit, and delete page inserts. You also can\nset the order in which RICOH ProcessDirector adds the inserts to the documents in a job when the BuildPDFFromDocuments step runs.\nThe Inserts Manager dialog provides this information for each page insert:\nThe PDF file column shows the directory path to the PDF file on the RICOH ProcessDirector primary server.\nThe Insert location column shows whether the pages are inserted before or after the pages in the documents.\nThe Pages column shows which pages in each PDF file are inserted.\nThe Rule column shows the name of the rule that RICOH ProcessDirector uses to determine which documents in a job receive the inserts when\nthe BuildPDFFromDocuments step runs.\nThe Sides column shows whether the insert is one-sided, two-sided, tumbled, or that the setting is inherited from the job.\nTo add a page insert, click the icon.\nTo work with a page insert, select it. Click the icon to modify the page insert or the icon to delete it.\nRICOH ProcessDirector adds the inserts to the documents in a job in the order that they appear on the Inserts Manager list, from top to bottom.\nTo revise the order in which inserts are added to the documents, select an insert. Click the icon or the icon to move the insert up or down\nthe list.\nIn this section:\nInserting pages from other PDF files\nIn a PDF file, you can insert pages from other PDF files before each document that matches the placement conditions, after each document that\nmatches the placement conditions, or both. The inserted pages increase the number of pages in each document, and you can apply markup to\nthem.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}