{"doc_name": "linkingproperties.pdf", "doc_path": "data/raw/RPD-en-US/linkingproperties.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5200, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Linking custom properties to index tags - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Customizing properties for AFP files\n/ Linking custom properties to index tags\nLinking custom properties to index tags\nYou can use RICOH Visual Workbench to link document or job properties to index tags in a sample AFP file.\nWhen a property is linked to an index tag, RICOH ProcessDirector steps assign the value of the index tag in a production AFP file to the property\nin a workflow. For example, if the value of the index tag is a ZIP code, the value of the document property is also the ZIP code.\nYou can link more than one property to the same index tag. For example, you might want to link one document property to one portion of an\nindex tag value and link another document property to another portion of the same index tag value. For example, an address line might contain\nboth a city and state or country. If the index tag contains both the city and the country, you can make separate document properties of City and\nCountry.\nYou can also link several index tags to the same property. For example, if you have an index tag named “routing code” and an index tag named\n“postal code”, you can map both index tags to the property “mail code”. You can use the same Visual Workbench control file for several jobs\nthat use different index tag names for the same property; however, the system expects that only one of the index tags will be in a particular\ndocument. If more than one index tag occurs in a document, the system assigns the property value based on the first occurrence.\nYou do not need to link all properties to index tags, and you do not need to link all index tags to properties. RICOH ProcessDirector displays the\nvalue of an unlinked property as Not set.\nThese symbols indicate the status of each document property and index tag:\nThe unlinked ( ) symbol indicates the property or index tag is unlinked.\nThe linked ( ) symbol indicates the property or index tag is linked.\nBefore you can link document properties to index tags:\nOpen a sample AFP file in RICOH Visual Workbench. The sample file must contain page groups and the index tags that you want to link to\ndocument properties. Use the AFP Indexer mode of RICOH Visual Workbench to create page groups and index tags.\nAs the RICOH ProcessDirector system user (aiw1 is the default), create a directory to store the control file containing the links. We recommend\nthe /aiw/aiw1/control_files/workbench (Linux) or C:\\aiw\\aiw1\\control_files\\workbench (Windows) directory, because files in this\ndirectory are backed up when you use the aiwbackup process. This directory and any files you create should be owned by the RICOH\nProcessDirector system user or a member of the RICOH ProcessDirector group (aiwgrp1 is the default), with the same permissions (775) as the\ncontrol_files directory.\nTo link a property to an index tag:\n1. In RICOH Visual Workbench, click Mode ⇒ Document Property Designer.\nIf the Document Property Designer mode is the only mode that is available, this mode is selected automatically.\n2. Click Tools ⇒ Link Properties.\nIn the window that displays, properties are listed in a table, in alphabetical order by property name; document properties precede job\nproperties. To sort the properties in a different order, click the column heading. Click once to sort in ascending order; click twice to sort in\ndescending order.\n3. In the Link Properties window:\n1. Select a property and select the index tag that you want to link to the property.\nOptional: You can select more than one index tag to link to a single property, or select more than one property to link to a single\nindex tag.\n2. Click Link.\n4. Optional: In the Define Link Options window, define the link options for the property.\n5. Click OK.\n6. To link other properties to index tags, repeat steps 3 to 5.\n7. Click OK.\nYou see the properties and linked index tags listed on the Document Properties tab and the Job Properties tab in the bottom pane.\n8. To save the Visual Workbench control file that contains information about how the properties are linked to index tags, do one of these:\nTo save a new control file, click File ⇒ Save control file as. Select the directory you created above and type the name of the control file in\nthe File name field, and then click Save. Remember where you saved the control file because you must specify the location of the control\nfile when you configure the steps that identify documents in AFP files. The default extension for control files is .ctl. The file is an XML\nfile.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Linking custom properties to index tags - Jenski - Test portal- RPD Linux\nTo save an updated control file, click File ⇒ Save control file.\nIf you used AFP Indexer to define the index tags, you should use the same control file for the document and job properties.\nNote: When you add a step to the workflow, you can reference the control file name using symbol notation if the name of the\ncontrol file for the job matches a value of a job property, such as the job name.\nParent topic: Customizing properties for AFP files\n2 of 2"}]}