{"doc_name": "aiw_gmc_configforprintnetPDF.pdf", "doc_path": "data/raw/RPD-en-US/aiw_gmc_configforprintnetPDF.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2034, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Configuring to work with Quadient Inspire Designer for PDF print jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Quadient Inspire Connect feature / Configuring to work with Quadient Inspire Designer for PDF print jobs\nConfiguring to work with Quadient Inspire Designer for PDF print jobs\nQuadient Inspire Connect makes it easier to configure workflows that interact with Quadient Inspire Designer to generate or reformat PDF print\njobs.\nBefore you create RICOH ProcessDirector objects and start to configure them, make sure that Quadient Inspire Designer is listed in the PATH\nenvironment variable for the aiw1 user. If you cannot edit the PATH, you must include the full path to Quadient Inspire Designer in the External\ncommand property wherever it appears.\nEach workflow requires these system objects:\n1. An appropriate hot folder input device:\nFor a workflow that uses a WFD and one or more raw data files to generate a PDF file, set these hot folder Batching properties:\nBatching method: List\nData patterns: .*wfd$\nList patterns: .*lst$\nOverrides patterns: a pattern that matches the extensions of the raw files you expect to use.\nFor a workflow that accepts a WFD and a PDF file, then sends them to Quadient Inspire Designer to be reformatted or modified, set these\nhot folder Batching properties:\nBatching method: Pattern\nData patterns: .*pdf$\nFile pattern: .*wfd$\nSpool file usage: gmc\nFile pattern required: Yes\nSpool file type: wfd\nFile pattern sequence: 1\nNote: After adding the values for File pattern, Spool file usage, File pattern required, Spool file type, and File pattern sequence,\nmake sure you click the Add button.\n2. A step based on the ComposePDF step template.\n3. A workflow that includes that step.\nIn this section:\nDefining a workflow to send PDF jobs to Quadient Inspire Designer\nCopy and customize one of the PDF workflows to create a workflow that sends jobs to Quadient Inspire Designer.\nParent topic: Setting up the Quadient Inspire Connect feature\n1 of 1"}]}