{"doc_name": "CustomizingDocumentProperties.pdf", "doc_path": "data/raw/RPD-en-US/CustomizingDocumentProperties.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3468, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Using inserter document properties in workflows - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Using inserter document properties in workflows\nUsing inserter document properties in workflows\nThe inserter features provide several document properties that you can use.\nYou can create rules files that put the values of supplied and custom document properties in inserter control files. For example, you want to tell\nthe inserter controller which inserter bins deliver inserts for each document in a job. If each document contains values for inserter bins, you map\nthe values to the Bin triggers document property. Then, you add the Bin triggers property to the rules file for the inserter control file.\nInserter operators can use the supplied and custom document properties to identify damaged documents that need to be reprinted during\nmanual reconciliation. For example, you map the customer name in each document to the Mail recipient document property. When the inserter\ndamages a mailpiece, your inserter operator uses the Mail recipient property to find and reprint the document associated with the customer\nname that shows in the address window.\nInserter document properties lists the document properties supplied with the inserter features.\nInserter document properties\nProperty (field Length\nname) Property (database name) Description Type (characters)\nBin triggers Doc.Insert.BinTriggers Identifies which inserter bins deliver inserts character 64\nfor the document. For example,\nYYYYYNNNNN or 1111100000 can mean\nthat bins 1 through 5 deliver inserts, and\nbins 6 through 10 do not. You can use this\nproperty in the rules file for the inserter\ncontrol file to control which bins deliver\ninserts.\nDivert Doc.Insert.DivertBin Specifies the number of the inserter output character 64\nindicator bin to which the document is diverted after\ninsertion. (Diverting a document to a special\noutput bin lets the operator manually\ninspect it for quality or treat it in a special\nway.) You can use this property in the rules\nfile for the inserter control file to control\nwhether the document is diverted.\nMail recipient Doc.Insert.MailRecipient Specifies the name of the person to whom character 64\nthis document is mailed. Inserter operators\ncan use this property to find documents to\nmark for reprint during manual\nreconciliation.\nOriginal Doc.Insert.OriginalBarCode Contains the data in the original barcode character 256\nbarcode that controls insertion of the document. You\ncan use the value of this property in the\nEnhance AFP control file (for AFP files) or a\nBuild PDF control file (for PDF files) to\ninclude the original barcode data in any new\nbarcodes that you create to control\ninsertion.\nFor PDF files, use RICOH ProcessDirector Plug-in for Adobe Acrobat to map data in documents to inserter document properties and to save the\ncontrol files that RICOH ProcessDirector uses. For more information, see the topics related to RICOH ProcessDirector Plug-in for Adobe Acrobat.\nFor AFP files, use the AFP Indexer and Document Property Designer modes of RICOH Visual Workbench to map data in documents to inserter\ndocument properties. Use RICOH Visual Workbench to save the control files that RICOH ProcessDirector uses. For more information, see the\ntopics related to RICOH Visual Workbench, AFP Indexer, and Document Property Designer.\nParent topic: Configuring the system to use inserters\n1 of 1"}]}