{"doc_name": "tt_c_CreatingBarcodeReaders.pdf", "doc_path": "data/raw/RPD-en-US/tt_c_CreatingBarcodeReaders.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1875, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Creating barcode readers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature / Creating barcode readers\nCreating barcode readers\nBarcode readers represent the cameras and barcode scanners in your system that read barcodes on documents in a print job to verify that each\ndocument has been processed. Each camera or barcode scanner requires a barcode reader.\nTo create a barcode reader:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Barcode Readers.\n3. Click Add.\n4. To add one or more barcode readers:\n1. In the Name field, type the name you want to name the barcode reader.\n2. In the IP address field, specify the IP address or host name that RICOH ProcessDirector uses to connect to the camera or barcode\nscanner you want to use with the barcode reader.\n3. In the Port field, specify the port that RICOH ProcessDirector uses to connect to the camera or barcode scanner.\nOnly one barcode reader can use a given combination of IP address and port.\n4. In the Description field, type a description of the barcode reader.\nFor example, the description could include details of where the camera or barcode scanner is placed.\n5. In the Barcode format field, select the barcode format you want this barcode reader to use.\nEach barcode reader must have at least one barcode format, although a barcode reader can have more than one barcode format. The\nbarcode formats must match the barcodes that are on the printed documents that the barcode reader is set to read. If more than one\nbarcode format is specified, the properties in the barcode must be in the same position in the barcode for all the barcode formats.\n6. In the Barcode reader location field, select a location to associate with the barcode reader.\n5. Click OK.\nParent topic: Setting up the Automated Verification feature\n1 of 1"}]}