{"doc_name": "rep_o_runsamplewf.pdf", "doc_path": "data/raw/RPD-en-US/rep_o_runsamplewf.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3017, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Running the Archive sample workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Archive feature / Running the Archive sample workflow\nRunning the Archive sample workflow\nThe Archive feature provides a sample workflow that you can examine and run to understand how the feature works. The sample includes a\nrepository, a hot folder input device with a pre-submitted PDF file, a supplied history record notification, and a workflow that includes the\nStoreInRepository step.\nThe sample objects used in this workflow are:\nRepository: SampleRepository\nHot folder input device: RepositoryFolder\nSample print job: Repository.pdf\nWorkflow: RepositorySample\nHistory record notification: SampleHistoryRecord\nReview the properties for each object before you start the procedure to see how they interact.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Printers portlet, right-click the Sample printer and select Enable.\n3. In the Input Devices portlet, right-click the RepositoryFolder hot folder input device and select Enable and Connect.\nThe first time you try this procedure, RICOH ProcessDirector immediately submits the Repository.pdf job to the RepositorySample workflow.\n4. In the Jobs table, find the job and check to see that the value in the Phase column is Complete.\nThe Repository.pdf file and its documents are now stored in the SampleRepository repository.\n5. Click the Archive tab.\n6. In the Repository to search list, select the SampleRepository and the Any are true value for the Search criteria. You can choose to do either\na job search or a document search.\nFor a job search, select Customer name (job) from the Property drop-down, = from the Comparison drop-down, type RicohSample in\nthe Value field and click Search.\nFor a document search, select Member number from the Property list, like from the Comparison list, type 6883% in the Value field, and\nclick Search.\nNote:\nThe % character is a wildcard representing zero or more characters beyond those already entered. Wildcards can be used only\nwith like and unlike comparisons.\n7. After you have found the job or document, you can select an item and choose an action:\nTo view the job or document, click View file.\nTo submit the job or document back into the RICOH ProcessDirector system, click Submit file, select a workflow, and click OK.\nTo review the property values and any history information stored with the job, click Show details.\nTo see a report that contains all the values and any history information stored with one or more jobs or documents, click View detailed\nreport.\nTo export the property values and any history information to a comma-delimited file, click Export to CSV.\nTo export a report that contains the property values and any history information in a PDF file, click Export to PDF.\nTo run the example again, copy the sample file to the hot folder. The sample file, Repository.pdf, is in the aiw/aiw1/testfiles directory.\nParent topic: Setting up the Archive feature\n1 of 1"}]}