{"doc_name": "modifyingtriggers.pdf", "doc_path": "data/raw/RPD-en-US/modifyingtriggers.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2171, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying triggers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Modifying or deleting AFP Indexer definitions\n/ Modifying triggers\nModifying triggers\nYou can modify page group, supplemental page, and page-level trigger definitions. When you modify a trigger, the boundaries of the page\ngroups might change.\nNote:\nBe careful modifying triggers if you have made other enhancements to the sample AFP file. For example, if you have created index tags\nand you modify the page group triggers, the index tags might become invalid. In addition, other types of definitions in the control file\n(for example, barcodes created with AFP Editor) might not work properly if they are based on the page groups or index tags created with\nAFP Indexer.\nIn RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nTo modify a trigger definition:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the definitions for the triggers. Then click Mode ⇒\nAFP Indexer.\n2. Click Tools ⇒ Modify Definitions.\nYou see the Modify and Delete Definitions window.\n3. Select the name of the trigger that you want to modify.\n4. Click Modify, or double-click.\nYou see the Modify Trigger window.\n5. To edit the trigger value, click Edit trigger. Edit the trigger value in the Edit Value window and click OK.\n6. Click the Advanced tab to change the text threshold, the method for matching the trigger, or both:\nSelect a range from 1/100 to 1 inch or from 1 to 25 millimeters for the text threshold.\nSelect the method used to match the trigger–on the trigger string value and the text block position, or on the position only.\n7. Click OK.\nIn the left pane and in the bottom pane, you see the page groups that have been defined based on the trigger value. You also see the\npages that are included in each page group.\n8. To close the Modify and Delete Definitions window, click X in the upper right corner.\nParent topic: Modifying or deleting AFP Indexer definitions\n1 of 1"}]}