{"doc_name": "pref_c_DefinePropMapObj.pdf", "doc_path": "data/raw/RPD-en-US/pref_c_DefinePropMapObj.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1852, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Defining document property mapping objects - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Preference Management feature / Defining document property mapping objects\nDefining document property mapping objects\nYou can use document property mapping objects to define the relationship between the headings in a preferences file and the document\nproperties defined for documents in a job. The relationship determines how the ApplyPreferences step uses their values during processing.\nTo define a document property mapping object:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Property Mappings.\n3. Click Add ⇒ Document Mapping.\n4. In the General section, enter values for the properties as needed.\nMake sure the value you select for the File type property matches the format of the preferences file.\n5. In the Property Mapping section:\n1. Enter a heading from the preferences file and select the document property that corresponds to that heading.\n2. Select a value for Usage.\nThe properties with the Usage value set to Identify document are used to locate documents in the job.\nThe properties with the Usage value set to Update property are updated by the ApplyPreferences step with values from the\npreferences file.\n3. To add an additional mapping, click the plus sign ( ) to the right of your last entry.\n4. To delete a mapping, click the minus sign ( ) to the right of the entry you want to delete.\nYou must have at least two entries in the Property Mapping section, one used to identify documents in the job and one designated as a\nproperty whose value is updated by the ApplyPreferences step.\nThe order of the headings in the list does not have to match the order of the headings in the preferences file.\n6. Click OK.\nParent topic: Setting up the Preference Management feature\n1 of 1"}]}