{"doc_name": "ave_Pipeline_filters.pdf", "doc_path": "data/raw/RPD-en-US/ave_Pipeline_filters.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 5984, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Standard filters - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP support for documents / RICOH Visual Workbench / Pipeline Manager / Standard filters\nStandard filters\nAFP Visual Environment contains these standard filters:\n1. Count Objects\nCounts the number of AFP Objects in the file. Select Object Identifier from the list. The value is returned to the console output.\nParameters:\nObject Identifier\nMandatory parameter. You must select one object type from the Supported Objects table.\n2. Count Structure fields\nCounts the number of AFP structure fields in the file. Select Structure field Identifier from the list. The value is returned to the console output.\nParameters:\nStructure field Identifier\nMandatory parameter. You must select one structure field type from the Supported structure fields table.\n3. Create Document Index File\nCreates an AFP Document Index File. The output file is offset based. This filter should go at the end of the filter chain list.\nParameters:\nDocument Index file name\nMandatory parameter. Save location of the output document index.\nForm Definition file name\nOptional parameter. Path to an input form definition.\n4. Create External Resource Group\nCreates and External Resource Group from the in-line resource group and external resource directories. It requires a fully qualified Resource\nGroup file name. It also allows you to specify an optional external resource directory and form definition file name.\nParameters:\nResource group file name\nMandatory parameter. Path to the output resource group.\nExternal resource directory\nOptional parameter. Path to an external resource directory.\nForm Definition file name\nOptional parameter. Path to an input form definition.\nAdditional External resource directory\nOptional parameter. Can be added using the Create another instance of this parameter button.\nNote: It extracts only form definitions, code-pages character sets, and coded fonts. Other resource types (for example: overlay, page\nsegments) are not included.\n5. Create Page Sheet Map\nCreates an ACIF style Page or Sheet map. It requires a Page or Sheet Map file name. It also allows you to specify an optional form definition file\nname. An error message is displayed if the specified form definition is not found.\nParameters:\nPage sheet map file name\nMandatory parameter. Path to the output.\nForm Definition file name\nOptional parameter. Path to an input form definition.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:21 PM Standard filters - Jenski - Test portal- RPD Linux\n6. Cut AFP Objects\nRemoves AFP Objects from the file. Select the Object Identifier from the list. It allows you to specify an optional Object name with matching\nparameters.\nParameters:\nObject Identifier\nMandatory parameter. You must select one object type from the Supported Objects table.\nObject Name\nOptional parameter. If we want to delete only with the specified object name.\nNote:\nAn asterisk (*) in front specifies “ends with”.\nAn asterisk (*) in at the end specifies “starts with”.\nAn asterisk (*) on both sides specifies “contains”.\nRange\nOptional parameter. You can use it to specify how many elements we should cut. This parameter is in the form of “first:last” where the first\nvalue starts at zero (0). An ‘e’ stands for “end”. For example, 0:7 means the first eight objects. 0:e means from the beginning to the end of\nthe file.\n7. Cut AFP Structured Fields\nRemoves AFP Structure fields from the file. Select a type structure field from the list that should be removed. You can specify how many using the\nRange option.\nParameters:\nStructure field Identifier\nMandatory parameter. You must select one structure field type from the Supported structure fields table.\nRange\nOptional parameter. You can use it to specify how many elements should be cut. This parameter is in the form of “first:last” where the first\nvalue starts at zero (0). An ‘e’ stands for “end”. For example, 0:7 means the first eight objects. 0:e means from the beginning to the end of\nthe file.\n8. Ensure Even Number Pages in Page Group\nAdds a blank page to groups with odd number of pages. Does not require any parameters.\n9. In-Line Resource\nAdds resources to the in-line resource group. You must supply the fully qualified resource file name and the actual resource name itself.\nParameters:\nResource file name\nMandatory parameter. Name and path of the resource on the disk.\nResource name\nMandatory parameter. Name of the resource that should be written in AFP.\n10. Remove Incomplete Pages\nRemoves incomplete pages, where a new page begins before the previous one is ended.\n11. Remove Page Groups\nRemoves all Page Groups and Page Group TLEs, but not any other data within the Page Group. There is also an optional Range parameter.\nParameters:\nRange\nOptional parameter. You can use it to specify how many elements should be cut. This parameter is in the form of “first:last” where the first\nvalue starts at zero (0). An ‘e’ stands for “end”. For example, 0:7 means the first eight objects. 0:e means from the beginning to the end of\nthe file.\n12. Validate AFP Structured Fields\nValidates the order and context of structured fields. Missing Begin Document (BDT) and End Document (EDT) Structured Fields are allowed.\nParameters:\nExit on Error\nOptional parameter. The customer can specify with a Boolean input parameter whether the validation should stop after the first error occurs\nor continue until the end.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:21 PM Standard filters - Jenski - Test portal- RPD Linux\n13. Write AFP Structured Fields\nDumps AFP Structured Field information. Information can be written to an external file. You can also write the output in Hexadecimal format\nwith the optional Show Hex selection.\nParameters:\nOutput file name\nOptional parameter. The name and path of the output file.\nShow Hex values\nOptional parameter. Use the Boolean values to show or hide the hexadecimal values of the AFP structure fields.\nParent topic: Pipeline Manager\n3 of 3"}]}