{"doc_name": "pdfw_t_plugin_addtext.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addtext.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 11200, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Adding text to a PDF file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Adding markup to a PDF file\n/ Adding text to a PDF file\nAdding text to a PDF file\nYou can add fixed text or variable text to a PDF file. You also can combine fixed and variable text in one text box. Fixed text is text that you type.\nVariable text is data from document properties, job properties, or statistics.\nTo add text:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains a page group or define a page group.\n2. Use the left mouse button to draw a box in the area where you want to add text.\nRICOH ProcessDirector Plug-in for Adobe Acrobat uses the upper left corner of the text box to position the text. All the text you specify is\nprinted at the size you specify, even if the text does not fit inside the box.\n3. Click Add Text.\n4. Optional: Use the Location section of the definition window to change the placement of the text by entering new Horizontal and Vertical\ncoordinates. These coordinates specify the distance between the top left corner of the page and the top left corner of the text box.\nNote: Width and Height change the size of the markup box but do not affect the location or size of the text.\n5. Type a Name for the text box. Do not use spaces or special characters (such as @, #, $, or %) in the name. You can use periods and\nunderscores.\n6. Select a value from the Align with enclosed text drop-down list:\nIf you want to align the text that you are adding with the first occurrence of existing text enclosed by the box you drew, select First\noccurrence. RICOH ProcessDirector Plug-in for Adobe Acrobat maintains that position each time that it adds the text.\nIf you want to align the text that you are adding with each occurrence of existing text enclosed by the box you drew, select Each\noccurrence.\nIf you do not want the text aligned, use the default value Disabled.\nAligning new text with enclosed text is the most precise way to replace existing text.\nNote:\nThe Align with enclosed text function works best when the new text and the existing text are in the same font. If the fonts are\ndifferent, RICOH ProcessDirector Plug-in for Adobe Acrobat aligns the baselines of the fonts.\nRICOH ProcessDirector Plug-in for Adobe Acrobat always aligns the first line of the new text with the first line of the existing text.\nIf the enclosed text is not left-justified, RICOH ProcessDirector Plug-in for Adobe Acrobat aligns the new text with the left-most line\nof the existing text.\n7. Select the clockwise Rotation (degrees). The reference point for rotating a text box is its top left corner.\n8. Use the Placement Conditions section to specify the pages to place the text on. Do either of these:\nSelect Pages based on a rule, and then select a rule from the drop-down list. The default rule is All Pages. You can also:\nClick the icon to define a new rule.\nClick the icon to go to the Rules Manager.\nSelect Specify pages and type the pages in each page group that you want. You can:\nUse a hyphen to separate the first and last pages in a page range.\nUse a comma to separate page selections.\nType n to specify the last page.\nExample: a PDF file has two page groups. The first has four pages, and the second has seven pages. Specifying pages 3–n places\nmarkup on pages 3–4 in the first page group, and pages 3–7 in the second.\n9. Use the Font section to select the font, size, and color.\nThe font drop-down list includes all fonts available to Adobe Acrobat except for fonts that do not permit embedding in a PDF file.\nNote:\nTo make a font available to RICOH ProcessDirector Plug-in for Adobe Acrobat, install it in the Windows Fonts folder.\nRICOH ProcessDirector Plug-in for Adobe Acrobat does not support alternate letter forms, including ligatures, swashes, and letter\nforms that vary according to where they appear in a word. Right-to-left languages, such as Hebrew and Arabic, are rendered\nincorrectly. However, the font drop-down list shows all fonts installed in the Windows Fonts folder, including fonts for right-to-left\nlanguages and fonts with unsupported alternate letter forms.\nWhen a font is added to a control file, it is the user’s responsibility to make sure that the font is licensed on all machines that use\nthe control file to process a PDF document.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:17 PM Adding text to a PDF file - Jenski - Test portal- RPD Linux\n10. Define the content of the text you are adding:\n1. Select the first Content Type from the drop-down list. You can select as many of the following types as you need to define the text\ncontent:\nText markup content types\nContent Type Description\nText Type text that you want to print.\nDocument Property Select a document property whose value you want to print.\nJob Property Select a job property whose value you want to print.\nLine Break Select this content type to force a line break. The break occurs\nafter the last character of any prior text content.\nStatistic Select a statistic whose value you want to print.\nScript Only select this option on the advice of your software support\nrepresentative.\n2. Select the Content Value. The drop-down list has the available values for the selected Content Type.\n3. Optional: You can apply text modifier rules to the value of a document property, job property, or job statistic Content Type. Click the\nicon to define one or more text modifier rules to extract the exact value you need.\n4. Type text in the Text to Modify field. RICOH ProcessDirector generates or extracts statistics and properties as it processes each page\ngroup in the production PDF files. Because these values are not available to RICOH ProcessDirector Plug-in for Adobe Acrobat, you\nmust enter a text value that is representative of the values that RICOH ProcessDirector processes. The modifier rule is a template that\nis applied to all values of the content type that you selected. For example, you might need to print only the last four digits of a credit\ncard number, and you have stored the entire number in a document property. You select Document Property as the Content Type,\nand select the credit card document property as the Content Value. You define two Remove Character text modifier rules to strip\ndashes and spaces from the number to make them all uniform, and then you define a Substring by Position rule to retain only the last\nfour digits. You do not need to know any single value of a document property to create modifier rules, you need to know only the\npossible formats that could occur in your PDF files.\n5. Choose one of the following modifiers:\nContent modifiers\nModifier Action\nRemove Character Type one character or a blank character (use the space bar to type a blank character) that\nyou want to remove from the value. The character is case-sensitive. Then select one of\nthese buttons:\nRemove all instances of the character\nThe specified character is removed from all positions in the value.\nFor example, an account number is: 324-1443255-11. You can type a - to remove all -\ncharacters from the value, producing 324144325511.\nRemove leading characters\nThe specified character is removed from the beginning of the value. For example, if you\ntype a blank character, all blank characters are removed from the beginning of the value.\nRemove trailing characters\nThe specified character is removed from the end of the value. For example, if you type a\nblank character, all blank characters are removed from the end of the value.\nRemove leading and trailing characters\nThe specified character is removed from the beginning and end of the value. For\nexample, if you type a blank character, all blank characters are removed from the\nbeginning and end of the value.\nSubstring by Position Select Beginning of Line or End of Line from the Starting From list. Select a number for\nFirst Position to indicate the location of the first character in the text value. Select a\nnumber for Number to Retain to indicate how many characters are retained.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:17 PM Adding text to a PDF file - Jenski - Test portal- RPD Linux\nModifier Action\nSubstring by Delimiter Type a character or a blank character in the Delimiter field to indicate where the text value\nis split into separate string segments. The character and the text string are case-sensitive.\nSelect Beginning of Line or End of Line from the Starting From drop-down menu.\nSelect a number for First Position to define the position of the delimiter in the text string.\nSelect a number for Number to Retain to define the number of text string segments to\nretain.\nThese examples show how to select text string segments by specifying a delimiter:\nFor the account number 324-1443255-11, you can use - as the delimiter to split the\nvalue into these three text strings: 324, 1443255, and 11. Select Beginning of Line. To\nselect the second and third text strings (1443255 and 11), select 2 for both First Position\nand Number to Retain.\nFor the mailing address Eldorado Springs CO 80025, you can use a blank\ncharacter as the delimiter to split the value into these four text strings: Eldorado, Springs,\nCO, and 80025. Select End of Line.\nTo select the zip code, select 1 for both First Position and Number to Retain.\nTo select the state, select 2 for First Position and 1 for Number to Retain.\nTo select the city, select 3 for First Position and 10 for Number to Retain. By specifying\n10 for Number to Retain, you can select city names with up to ten words.\nPad with Character Select Beginning of Line or End of Line from the Padding Location list. Enter a character or\na blank character as the padding character into the Character to Pad with field.\nEnter a number in the Minimum Padded Text Length field to define the minimum length of\nthe text string. If the number of characters in the text string is less than this minimum\nlength, padding characters are added until the text string equals the minimum length.\n11. Click to add a new content definition row. After you have added all content types and modifier rules to the text you are adding to the\nPDF file, you can place a check mark in the box next to a content type and use the up and down icons to reorder the content. Use the\nicon to delete selected content.\n12. If you defined multiple lines of text and you want RICOH ProcessDirector Plug-in for Adobe Acrobat to remove lines that only contain white\nspace, click the Remove blank lines check box to select it.\n13. Click OK to create the text configuration.\n14. Click Ricoh ⇒ Preview to verify the text has the content and page placement you intended.\n15. Optional: You can edit the text definition by double-clicking its box or by right-clicking the box and clicking Edit.\n16. When you are ready to save all your enhancements to the PDF file, including the new text definition, click Ricoh ⇒ Save Control File.\n17. Move the control file to a directory location that RICOH ProcessDirector can access.\n18. In the RICOH ProcessDirector BuildPDFFromDocuments step, specify the name and location of the control file that contains the text\ndefinition.\nParent topic: Adding markup to a PDF file\n3 of 3"}]}