{"doc_name": "doc_o_scen_pull_latepay.pdf", "doc_path": "data/raw/RPD-en-US/doc_o_scen_pull_latepay.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 8312, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Usage scenario for pulling reminder notices from a job when late payments are received - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Usage scenarios for processing documents\n/ Usage scenarios for pulling documents from a job / Usage scenario for pulling reminder notices from a job when late payments are received\nUsage scenario for pulling reminder notices from a job when late payments are received\nIn this scenario, a service bureau prints reminder notices in a PDF print job for a client when customers miss payments. The service bureau holds\nthe print job until 3:00 PM. Between 1:00 PM and 3:00 PM, the client sends a pull list, which contains the account numbers of customers who\nhave made late payments. The service bureau suppresses the reminder notices for those customers from printing by extracting the reminder\nnotices from the print job.\nThe service bureau uses RICOH ProcessDirector Plug-in for Adobe Acrobat to identify the reminder notices as individual documents in the\nproduction PDF file for each job. The data in each reminder notice includes the account number.\nTo change the workflow so that it pulls reminder notices for the accounts on the pull list, an administrator at the service bureau configures\nRICOH ProcessDirector to support the new process.\nThe administrator:\nUses the Define Document Property function in RICOH ProcessDirector Plug-in for Adobe Acrobat to define the Doc.PullProp document\nproperty. To define the property, the administrator specifies the account number data that the IdentifyPDFDocuments step in the workflow\nextracts from each document in the PDF file for the job.\nIn this scenario, the administrator uses the values of the Doc.PullProp document property (that is, the account numbers) to determine the\ndocuments to be removed from the job. This property is supplied with all document processing features. As an alternative, the administrator\ncan define another document property, such as Doc.Custom.AccountNumber, in the docCustomDefinitions.xml file, and use that property\ninstead of Doc.PullProp.\nNote: If you define a custom document property, you must run the docCustom utility, update the Custom Document Properties feature,\nand load the updated RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in for Adobe Acrobat.\nUses the Save control file function in the plug-in to save the document property definition in the control file that identifies the reminder notices\nas individual documents.\nSends the control file to the RICOH ProcessDirector server.\nSpecifies the name of the control file as the value of the Identify PDF control file property for the IdentifyPDFDocuments step.\nAdds a Wait step to the workflow after the IdentifyPDFDocuments step and sets the value of the Wait until property to 3:00 PM.\nAdds a SetDocPropsFromList step to the workflow after the Wait step and sets values for the step properties:\nThe value of List file directory is /aiw/aiw1/clientfiles/pull.\nThe value of Delimiter is New Line.\nThe value of Columns in list file is Pull property. Pull property is the user interface name of the Doc.PullProp document property.\nIf the administrator had defined a Doc.Custom.AccountNumber document property to specify the account number data, the value of\nColumns in list file would be Doc.Custom.AccountNumber.\nThe value of Document property to set is Pull document. Pull document is the user interface name of the Doc.Pull document property.\nThe Doc.Pull property is supplied with all document processing features. It is a convenient choice for the value of the Document property to\nset document property. As an alternative, the administrator could create a custom document property and use it as the value of Document\nproperty to set.\nThe value of Value for matching documents is YES.\nThe value of Value for other documents is NO.\nAdds a Group Documents step to the workflow after the SetDocPropsFromList step and sets the value of the Group first property to Pull\ndocument.\nAdds a CreateJobsFromDocuments step to the workflow after the Group Documents step and sets the value of the Child workflow property to\nthe name of the current workflow.\nAdds conditional processing near the start of the workflow to process parent and child jobs differently. The new branch for child jobs lets them\nbypass the document identification steps.\nAdds a SetDocPropsFromConditions step at the start of the branch for child jobs.\nThe step assigns a value to a job property based on the value of the Pull document document property. The property conditions file sets the\nvalue of the Custom 1 job property to Pull or Print.\nCreates two workflow branches, one for child jobs with documents to be printed, and the other for child jobs with pulled documents. The rules\nfor the branches are:\nCustom 1 = Pull\nCustom 1 = Print\nAdds a SendEmail step to the branch for child jobs with pulled documents. The step sends the PDF file for the job to the client for verification\nthat the documents were pulled.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM Usage scenario for pulling reminder notices from a job when late payments are received - Jenski - Test portal- RPD Linux\nThe value of the Recipient address property is the email address of the person at the client company who requested PDF files for verification.\nThe value of the Attachments property is ${getCurrentFile(pdf)}.\nThe value of the Message property is These reminder notices were pulled from job ${Job.Name}.\nRejoins the two branches by connecting them to a WaitForRelatedJobs step.\nNote: The workflow in this usage scenario is similar to the PullPDFSample workflow. Examine that workflow to see all the steps, the\nconnectors to the branches, and the values of step properties.\nThe administrator enables the workflow and submits a job to it at 8:00 AM.\nThe job goes through the workflow branch for parent jobs and stops at the Wait step.\nAt 1:00 PM, the operator receives a pull list from the client and uploads it to the /aiw/aiw1/clientfiles/pull directory. The pull list contains\nsix account numbers:\n245876A270011H335698R520905B558721L875540R\nAt 2:50 PM, the operator receives a second pull list from the client and uploads it. The pull list contains two account numbers:\n445009S500112A\nAT 3:00 PM, RICOH ProcessDirector releases the job from the Wait step.\nThe job moves to the SetDocPropsFromList step. RICOH ProcessDirector :\nRetrieves the two pull lists from the aiw/aiw1/clientfiles/pull directory\n.\nExamines the values for the Doc.PullProp property in the document properties file in the spool file for the job.\nCreates a column of values for the Doc.Pull property in the document properties file.\nWhen the value of the Doc.PullProp property matches one of the eight account numbers in the pull lists, RICOH ProcessDirector sets the value\nof the Doc.Pull property to YES.\nIt sets the value of the Doc.Pull property for all other documents in the document properties file to NO.\nThe job moves to the Group Documents step, which places each document in one of two groups based on the value of the Doc.Pull property.\nThe job moves to the CreateJobsFromDocuments step, which creates a child job for each group of documents and submits the child jobs to the\nsame workflow.\nThe child jobs go through the workflow branch for child jobs.\nWhen the child jobs reach the SetDocPropsFromConditions step, RICOH ProcessDirector sets the value of the Custom 1 job property:\nFor the child job with the Doc.Pull property set to Yes, the Custom 1 job property is set to Pull.\nFor the child job with the Doc.Pull property set to No, the Custom 1 job property is set to Print.\nRICOH ProcessDirector sends the child jobs to the print branch or pull branch of the workflow based on the value of the Custom 1 job property.\nThe child job with pulled documents moves to the SendEmail step, and RICOH ProcessDirector emails the job to the client for verification. The\nchild job then moves to the WaitForRelatedJobs step.\nThe child job with documents to be printed moves to the WaitForRelatedJobs step after the PrintJobs step.\nWhen both child jobs arrive at the WaitForRelatedJobs step, RICOH ProcessDirector sends them to the RetainCompletedJobs step.\nParent topic: Usage scenarios for pulling documents from a job\n2 of 2"}]}