{"doc_name": "ws-inputdevice_c_PrepStatusREST.pdf", "doc_path": "data/raw/RPD-en-US/ws-inputdevice_c_PrepStatusREST.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5945, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Preparing to send status to REST web services - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Notifications / Web service notifications / Preparing to send status to REST web services\nPreparing to send status to REST web services\nYou can use notification objects to send status to a REST web service for an application. For example, you can create a notification object to monitor when a\njob enters the RetainCompletedJobs step in a workflow that processes orders. When that event happens, the notification object can send the application\ninformation about the job, such as the order number and customer name.\nTo prepare to send status to REST web services:\n1. Learn the requirements for communication with the REST web service for the application:\nThe values for authenticating with the application\nThe values for requesting data from the REST web service\nThe format of the data provided in the response\nRefer to the documentation for the application or consult with the company that hosts the application.\n2. To prepare RICOH ProcessDirector to communicate with the application, do these tasks:\nIf the application requires a security certificate, install the certificate on the RICOH ProcessDirector primary computer.\nIf your environment requires a proxy server to communicate with web services, set up the system to use it.\nFor more information, see the related tasks.\n3. Run a manual test that authenticates with the application and requests a response from the REST web service. Verify that the web service returns the\nresponse that you want.\nMany browsers have plug-ins, such as Boomerang for Google Chrome, that test web service calls to REST clients.\n4. Decide on the event that you want to trigger the notification and the conditions that determine when the notification calls the web service.\nIf you want to send a notification for an event that occurs only when a specific workflow processes a job, specify that workflow as a condition.\n5. Define a REST web service notification:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Notifications.\n3. Click Add ⇒ REST Web Service Notification.\nAs an alternative, you can copy the supplied RestfulWebServiceSampleNotify REST web service notification.\n6. On the General tab, type a name for the notification.\n7. On the Request tab:\n1. Set the Request URL property to the URL of the web service that you want to notify.\n2. Set the Request method property to the value required by the web service.\n3. For the value of the Request payload property, specify the body of the web services request that the input device submits to the application.\nIn this XML example, the payload contains two XML elements: <Token> and <OrderNumber>.\n<Token>${WSNotification.WebService.Credential}</Token> <OrderNumber>${Job.Info.Attr1}</OrderNumber>\nThe value for each element is a RICOH ProcessDirector symbol containing a property. If you are using a web service to authenticate with the\napplication, include the WSNotification.WebService.Credential property in a symbol. Replace the other element and property with the elements\nand properties that you want to send to the application. The notification resolves the symbols when it sends status to the REST web service.\n4. Set the values for the Request header and Request parameters properties, as required.\nEach header field or parameter is a keyword/value pair. Each pair must appear on a separate line and must be separated using a colon (:) or equals\nsign (=).\nThe keyword and value can be multiple words. RICOH ProcessDirector uses the first colon or equals sign on each line to split the words into the\nkeyword/value pair.\nThis example contains three parameters: token, orderNumber, and customerName. The value of each keyword is a RICOH ProcessDirector\nsymbol. Each symbol contains one of these properties: WSNotification.WebService.Credential, Job.Info.Attr1, and Job.CustomerName.\ntoken:${WSNotification.WebService.Credential}orderNumber:${Job.Info.Attr1}customerName:${Job.CustomerName}\nThe input device resolves the symbols when it sends status to the REST web service.\n5. If your environment requires a proxy server to communicate with web services, set the Use proxy property to the correct proxy server.\n8. On the Authentication tab, specify the values required to authenticate with the application.\nFor more information, see the related task about authenticating with a REST web service.\nIf the application does not require authentication, leave all the Authentication properties blank.\n9. On the Event tab:\n1. Choose the type of object to be monitored.\n2. Select the property, the action, and the value to monitor.\n3. To define another event, click + to the right of any event.\n4. To delete an event, click - to the right of the event you want to delete.\nFor example, to send a notification when the state of a job changes to Retained, select Current job state, Changes to, and Retained.\n10. On the Conditions tab:\n1. Select the property and the value that must be satisfied before any notifications are sent.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Preparing to send status to REST web services - Jenski - Test portal- RPD Linux\n2. To define another condition, click + to the right of any event.\nTo specify how the conditions are combined, select Any, All, or Custom.\n3. To delete a condition, click - to the right of the condition you want to delete.\nFor example, to send a notification only when a child job is in the ProcessWebOrders workflow, specify two conditions:\nWorkflow = ProcessWebOrders\nJob number like*.*\nTo apply the conditions only when a job meets both of them, select All.\n11. When you finish, click OK.\nWhen you finish setting up your input devices, notifications, and workflows, test the exchange of data between RICOH ProcessDirector and the application.\nExample\nExamine the supplied RestfulWebServiceSampleNotify REST web service notification.\nParent topic: Web service notifications\n2 of 2"}]}