{"doc_name": "cptoutputpdf_c_MappingMedia.pdf", "doc_path": "data/raw/RPD-en-US/cptoutputpdf_c_MappingMedia.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2602, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Mapping AFP or PostScript media names to RICOH ProcessDirector media names - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up datastream transforms / Configuring for the Advanced Transform feature\n/ Creating a workflow that transforms AFP or PostScript input to PDF output with media information\n/ Mapping AFP or PostScript media names to RICOH ProcessDirector media names\nMapping AFP or PostScript media names to RICOH ProcessDirector media names\nYou can create a media mapping file to map media names in the AFP or PostScript input to RICOH ProcessDirector media names. A step based\non the TransformToPDFWithMediaInfo step template uses the file when it transforms AFP or PostScript input into PDF output. The step creates a\nPDF file for the job and a JDF job ticket with media information, including page exceptions.\nTo map AFP or PostScript media names to RICOH ProcessDirector media names:\n1. Use a text editor to create the media mapping file.\nIf RICOH ProcessDirector media names include Unicode characters, create the file with an editor that saves text in UTF-8 format.\n2. On the first line, type the media name in the AFP or PostScript input followed by an equals sign (=) and the corresponding RICOH\nProcessDirector media name.\n3. Type each remaining media name in the AFP or PostScript input, one per line, followed by an equals sign (=) and the corresponding RICOH\nProcessDirector media name.\n4. You can add comment lines to the file. Start each comment line with a pound sign (#).\nFor example, you can add this comment as the first line in the file:\n# AFPorPSmedia=RPDmedia\n5. Save the file.\n6. Specify the full path and name of the file as the value of the Path to media mapping file property of the TransformToPDFWithMediaInfo\nstep.\nThis example maps four AFP or PostScript media names (A4, Letter, TRAY1, and TRAY2) to four RICOH ProcessDirector media names:\n# AFPorPSmedia=RPDmedia\nA4=A4 Plain\nLetter=Letter Color\nTRAY1=Letter Preprinted\nTRAY2=A3 Plain\nIf the file maps the same AFP or PostScript media name to different RICOH ProcessDirector media names, the system uses the last mapping of the\nAFP or PostScript media name. The RICOH ProcessDirector media name in the last mapping replaces the AFP or PostScript media name in the JDF\nfile.\nIf any media name in the JDF job ticket is not defined as a media object in RICOH ProcessDirector, the job goes into the error state. The Reason\nfor wait status value is No matching media.\nParent topic: Creating a workflow that transforms AFP or PostScript input to PDF output with media information\n1 of 1"}]}