{"doc_name": "aiw00c19.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c19.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3522, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Assigning workflows - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Assigning workflows\nAssigning workflows\nWhen an input file enters the RICOH ProcessDirector system, one of the first actions that the input device does is to assign a workflow to it. After\nthe input device assigns the workflow, the job can begin to move through the processing steps. There are several methods through which the\ninput device can assign the workflow. You configure the method to meet the requirements of the installation.\nUse one of these methods to assign the workflow:\nThe easiest way to assign a workflow to a job is to use the Child workflow property on the input device. When you set the Child workflow on\nan input device, the device assigns that workflow to every job that it processes. All input devices that RICOH ProcessDirector supplies use this\nmethod to assign the workflow for the data sets or input files that they receive.\nNote:\nJobs that consist of multiple input files are processed as child jobs of the parent job that groups them. The parent job takes the\nworkflow that is set by the Workflow property on the input device, while the child jobs take the workflow that is set by the Child\nworkflow property on the input device.\nYou can set the workflow for a job using a Child workflow initialization step on the input device. If you select this method, all jobs that arrive\non the input device pass through the initialization step you specify; the initialization step assigns the workflow. If your jobs have multiple input\nfiles, also set the Workflow initialization step property. Parent jobs pass through that initialization step to have their workflow assigned. RICOH\nProcessDirector provides these step templates that you can use for a workflow initialization step:\nThe SetJobTypeFromRules step template points to a control file that the input device can use to determine the workflow. The control file lists\njob parameters that accompany jobs when they are submitted, such as LPR control file parameters, and their corresponding RICOH\nProcessDirector properties. For example, you could edit the control file to map the value of the Copies LPR parameter to the value of the Child\nworkflow property. You specify the control file that the input device uses with the Child workflow parsing rules property on the input device.\nThe SetJobTypeFromFileName step template parses the file name of the input file to determine what workflow to assign. To use this step, you\nspecify text that always appears in the name of a certain type of input file and map it to a workflow. Use the Child workflow pattern property\nto define the string you want to use for the workflow.\nMake sure that you have created and enabled workflows with names that correspond to the strings you specify. These strings are case-\nsensitive.\nYou can set both the Child workflow and the Child workflow initialization step properties for an input device. If the Child workflow\ninitialization step property is set, the step tries to set the workflow using that method. If the step cannot set the workflow, it assigns the\nworkflow that the Child workflow property specifies. If that property has no value, RICOH ProcessDirector issues an error message. You can also\nset both the Workflow and the Workflow initialization step properties for an input device to assign the workflow for parent jobs. RICOH\nProcessDirector uses the same assignment hierarchy.\nParent topic: Preparing to use workflows\n1 of 1"}]}