{"doc_name": "tt_c_EnhancePDFVerification.pdf", "doc_path": "data/raw/RPD-en-US/tt_c_EnhancePDFVerification.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5927, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Enhancing PDF files for Automated Verification - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature / Enhancing PDF files for Automated Verification\nEnhancing PDF files for Automated Verification\nTo process PDF files for Automated Verification, use RICOH ProcessDirector Plug-in for Adobe Acrobat to enhance the files. The files must have a\npage group, which identifies documents, and a verification barcode that contains the Job number job property and the Sequence in child job\ndocument property.\nInstall RICOH ProcessDirector Plug-in for Adobe Acrobat by following the instructions in RICOH ProcessDirector: Installing PDF Document\nProcessing Features.\nTo enhance PDF files for use with Automated Verification:\n1. Open a PDF file in Adobe Acrobat Professional and click Ricoh ⇒ Select to make RICOH ProcessDirector Plug-in for Adobe Acrobat the\nactive tool.\n2. Draw a box around the text you want to use to define text-based page groups, or draw a box anywhere to define page groups that are not\nbased on text. Click Define Page Group.\nYou can define a page group based on text that appears repeatedly throughout the PDF file, or based on a fixed number of pages. For\nexample, if Page 1 appears on the first page of each document, you can use that text to define page group.\nOther:\nIf you use text to define the beginning of the page group, this text should appear in the same location on the first page of every\npage group.\nIf you are using a sample PDF file to define page groups, make sure that the content and location of the text you select are\nconsistent among the production PDF files.\n3. Follow the instructions for defining a page group in the plug-in help system or in RICOH ProcessDirector: Using RICOH ProcessDirector\nPlug-in for Adobe Acrobat.\n4. After you verify that the page groups are what you expect, use the left mouse button to draw a box where you want the verification\nbarcode to print. Click Add Barcode.\nThe upper left corner of the box specifies the upper left corner of the barcode. You do not need to draw the box to the exact size of the\nbarcode. The barcode is not resized to fit within the box. If you draw a box to the approximate size of the barcode, you can see its position\nrelative to other markup that you add to the PDF file.\nImportant:\nMake sure that sure the placement of the barcode matches what the camera or barcode scanner expects to see.\n5. Type a name for the barcode.\n6. Use the Placement Conditions section to specify the pages to place the barcode on.\nIf you want to place a barcode on the first page of each document, select Pages based on a rule, and then select All Front Pages.\n7. Use the Barcode Configuration section to define the mechanical attributes and type of the barcode.\nThe barcode type must support periods. Child jobs for reprints have a period in the job number (for example, 10000001.1).\n8. Add the Job number job property to the barcode:\n1. Select Job Property from the Content Type list.\n2. Select Job.ID for the Content Value.\n3. Click the icon to display a Modify Text window.\n4. For the Text to Modify value, type: 10000001\nThis value is an example of an 8–digit RICOH ProcessDirector job number. As RICOH ProcessDirector runs, it determines the actual\nvalue.\n5. Select Pad with Character from the Modify list.\n6. Select Beginning of Line for the Padding Location value.\n7. Type 0 for the Character to Pad with value.\n8. To pad the 8–digit job number with three zeroes, select 11 for the Minimum Padded Text Length value.\nYou see 00010000001 for the Modified Text value. The padded characters allow for up to 99 child jobs (for example, child job\nnumber 10000001.99) to handle reprints.\nImportant: The length that you specify by padding with characters must match the length of the barcode format that you\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Enhancing PDF files for Automated Verification - Jenski - Test portal- RPD Linux\ndefined in RICOH ProcessDirector.\n9. Click OK.\n9. Click the icon to add a new content definition row.\n10. Add the Sequence in child job document property to the barcode:\n1. Select Document Property from the Content Type list.\n2. Select Doc.SequenceInChild for the Content Value.\n3. Click the icon to display a Modify Text window.\n4. For the Text to Modify value, type 1\nThis value is an example of a Sequence in child job property value. As RICOH ProcessDirector runs, it determines the actual value.\n5. Select Pad with Character from the Modify list.\n6. Select Beginning of Line for the Padding Location value.\n7. Type 0 for the Character to Pad with value.\n8. Pad the document number with enough zeroes to account for the largest number of documents that you could have in a print job. If\nyou could have up to 9999 documents in a print a job, pad the Sequence in child job value with four zeroes. Select 4 for the\nMinimum Padded Text Length value.\nYou see 0001 for the Modified Text value.\nDo not underestimate the number of documents that you could have. If you could have between 10000 and 99999 documents in a\nprint job, select 5 for the Minimum Padded Text Length value.\nImportant: The length that you specify by padding with characters must match the length of the barcode format that you\ndefined in RICOH ProcessDirector.\n9. Click OK.\n11. Click OK.\n12. When you are ready to save your page group and verification barcode, click Ricoh ⇒ Save Control File.\n13. Give the control file a name or accept the default value. Click Save. You see a confirmation message. Click OK.\n14. When you configure your Automated Verification workflow, specify the name and location of the control file in the step based on the\nIdentifyPDFDocuments step template.\nFor more information about how to add a barcode, see the plug-in help system or RICOH ProcessDirector: Using RICOH ProcessDirector Plug-in\nfor Adobe Acrobat.\nParent topic: Setting up the Automated Verification feature\n2 of 2"}]}