{"doc_name": "aiw_c_createworkflow.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_createworkflow.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 9501, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Creating a workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Creating a workflow\nCreating a workflow\nRICOH ProcessDirector provides several sample workflows. To create a workflow, you can modify one of these workflows or, to create a\nworkflow that is similar to an existing workflow, you can copy the existing workflow and edit it. Also, you can create a new workflow that has\nonly two steps, SetJobPropsFromTextFile and RemoveJobs, with a connector between them.\nWe recommend that you plan your workflow before you create it. Outline the processing steps that your jobs pass through, and make sure that\nthe step templates required to create those steps exist. If any of the step templates that you need do not exist, create them before you create the\nworkflow.\nTo create a workflow corresponding to the processing steps that your jobs pass through, you can add steps to processing phases in the order that\nyou want RICOH ProcessDirector to do them.\nStep chains must have one entry point, a single step at the beginning of the step chain that all jobs process through. They can, however, have\nmultiple endpoints, or steps with no outbound connector. When a step chain is placed in a workflow, it might be connected to one or more\nsteps for jobs both entering and exiting the step chain. If the step chain has multiple endpoints, all of the end points continue processing\nfollowing the outbound connector. If there are multiple outbound connectors, each endpoint is evaluated against the connectors following the\norder of execution and the job proceeds down the correct path.\nNote:\nWe strongly recommend that all workflows begin with a SetJobPropsFromTextFile step and end with a RemoveJobs step.\nWhen they are added to a workflow, step chains are treated like steps. In all of the actions below, references to steps apply to step chains\nas well.\nIf files for data streams that a workflow does not support can enter the workflow, we recommend these best practices:\nAdd a DetectInputDataStream step after the SetJobPropsFromTextFile step.\nAfter the DetectInputDataStream step, add a branch with 1 step: FailWithMessage. Set the value of the Failure message property to\nUnexpected datastream encountered. On the connector from the DetectInputDataStream step to the next step in the\nworkflow, set a conditional processing rule that defines the input data streams. For example, specify that the Input data stream property\nequals PDF.\nTo create a workflow:\n1. Click the Workflow tab.\n2. In the left pane, click Workflows.\n3. Right-click a workflow that you want to use as a model and select Copy.\nNote:\nIf you want to start with a workflow that has two steps, SetJobPropsFromTextFile and RemoveJobs, with a connector between\nthem, click Add.\n4. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\nYou see the workflow's steps in the workflow editor.\n5. Review the steps in each phase of the workflow.\nThe default processing phases in the base product are Receive, Prepare, Print, and Complete. Some features add other phases such as\nAssemble or Insert.\nNote:\nThe default phase names can be changed to match the functions that you perform in that phase.\n6. Delete any steps that you do not need. Select the step and press the Delete key or right-click the step and select Delete.\n7. Add each new step or step chain:\n1. To add a step, click the side panel in the top right corner of the workflow editor and go to Steps; to add a step chain, go to Step\nChains.\nNote:\nTo include a step template or a step chain in your favorites list, click the gray star next to that item. It turns blue.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:12 PM Creating a workflow - Jenski - Test portal- RPD Linux\nTo see only your favorite step templates or step chains, click the star in the table's header row.\n2. Click a step template or step chain and drag it into the workflow editor. Place the step where you want it. If you add a step on a\nconnector, the connector will divide in two, one from the source to the new step and one to the destination step. The execution\norder of the connectors from the original source are preserved on the new connectors.\nIf you drop the step on top of a connector, the connector divides into two parts and the step is included in the workflow at that\npoint.\nIf you drop a step directly on top of another step, the dropped step replaces the existing step after you confirm that action. The\nexisting step is removed from the workflow.\nTo add another instance of an existing step in the workflow, right-click it and select Copy. Position your mouse where you want to\nplace the step, right-click and select Paste.\nNote:\nYou can use the same name for more than one step.\nWhen you add a step with the same name as an existing step in the same processing phase, RICOH ProcessDirector assigns\nthe new step a Step identifier property value. The value has a number at the end of the step name, for example,\nAssignJobValues2.\nEach time you add another step with the same name in the same phase, RICOH ProcessDirector increments the number by\none, for example, AssignJobValues3. You see the Step identifier property value in the step and job properties notebooks,\nmessages, and system logs.\n8. Connect the steps:\n1. Hover over the edge of the step that sends jobs to the new step. Click and hold a highlighted section ( ) to make the connector\nappear.\n2. Drag the connector onto the step that receives jobs from the new step and release the mouse button.\nNote:\nYou can attach the connector to the top, bottom, either side of the step, or release over the center of the circle.\nImportant:\nIf a step uses conditional processing, RICOH ProcessDirector uses the values specified in the Order of execution property of\neach connector to determine which connector to try first.\nIf a step sends jobs to three different steps, RICOH ProcessDirector first attempts to send each job through the connector with\nan Order of execution value of 1. If a job does not meet the conditions for that connector, RICOH ProcessDirector attempts to\nsend the job through the connector with an Order of execution value of 2. If a job does not meet those conditions either,\nRICOH ProcessDirector attempts to send the job through the next connector in the execution order.\nIf a connector processes all jobs that do not meet the conditions specified by the other connectors, make sure that connector\nhas the highest Order of execution value.\n9. Optional: To add an annotation:\n1. In the workflow editor, right-click to bring up the context menu and select Add annotation.\n2. Enter your comment and click the arrow icon to post the annotation.\nThe annotation is saved and visible on the workflow.\n10. Optional: To change the layout of the steps, click a step and drag it to a new position in the Workflow Editor. The connectors reposition\nthemselves as the step moves.\n11. Optional: To change the order of the steps, click the arrowhead on a connector and move it to a different step. Repeat until all of the\nconnectors follow the new route through your steps. Then, rearrange the steps on the Workflow Editor to match the progression of steps.\n12. Optional: To select a set of steps that are contiguous, press and hold the Shift key and drag your mouse to draw a box around the steps\nyou want to select. Release the mouse button.\nTo select a set of steps that are not contiguous, press and hold the Ctrl key. While holding Ctrl key, click on the steps you want to select.\nTo save a selected group of connected steps as a step chain, right-click on the highlighted area, and select Save as Step Chain.\nTo move the selected group, press the left mouse button down inside the box and drag the group to where you want to place it and lift\nthe mouse button up.\nTo delete the selected group, press the Delete key or right-click inside the box to bring up the context menu and select Delete.\n13. Specify property values for each step:\n1. Right-click the step and select Properties.\n2. On each tab in the properties notebook, fill in or edit values for any required properties.\nAn asterisk, *, indicates that a property is required.\n3. Fill in or edit values for any optional properties that you plan to use.\nYou can also specify default values for job properties without editing each step, using the Manage job defaults action. Right-click on\nthe Workflow editor and select Manage job defaults.\n4. When you are finished, click OK.\nNote:\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:12 PM Creating a workflow - Jenski - Test portal- RPD Linux\nRICOH ProcessDirector remembers the values that you enter for each step but does not save them until you save the\nworkflow.\n14. If a step sends jobs to multiple steps, right-click each connector from the sending step to a receiving step, and select Properties. Specify a\nconditional processing rule for the connector, and click OK.\n15. To save the workflow, right-click on the workflow editor and select Save workflow from the menu. You can save an incomplete workflow.\n16. When you are ready to use the workflow, to enable it right-click on the workflow editor and select Enable from the menu.\nRICOH ProcessDirector validates the workflow when you enable it. To be valid, only one step must start the workflow. That step does not\nreceive jobs from other steps. All other steps must have connections through which they receive jobs.\nNote:\nAlert ( ) icons show steps that do not meet the requirements.\nParent topic: Preparing to use workflows\n3 of 3"}]}