{"doc_name": "aiw_afpbanners.pdf", "doc_path": "data/raw/RPD-en-US/aiw_afpbanners.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2458, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM AFP banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / AFP banner pages\nAFP banner pages\nAFP banner pages include header, trailer, and separator pages. They can be used (in any combination) with AFP print jobs printed to AFP printer\nobjects. You can change the contents and appearance of those banner pages, as well as the fonts used to print them.\nIn this section:\nSetting up AFP printers to print banner pages\nRICOH ProcessDirector can print these types of banner pages with an AFP job: header pages, separator pages, and trailer pages. Header pages\nprint before the first data pages of a job. Separator pages print between copies of a multi-copy job. Trailer pages print after the last data pages\nof a job.\nUpdating the coded font and code page mappings for AFP banner pages\nFor jobs sent to AFP printers, you can update the banner_page_code_page_mapping.cfg configuration file to add custom coded font and code\npage mappings to use with banner pages. If you create your own coded fonts, you specify them in this file so that RICOH ProcessDirector can use\nthem. A sample banner_page_code_page_mapping.cfg file is installed in /aiw/aiw1/samples/banner_pages/ (Linux) or\nC:\\aiw\\aiw1\\samples\\banner_pages\\ (Windows) and in /aiw/aiw1/control_files/banner_pages/ (Linux) or\nC:\\aiw\\aiw1\\control_files\\banner_pages\\ (Windows).\nObtaining and using coded fonts for Japanese AFP banner pages\nRICOH ProcessDirector supports AFP banner pages that use double-byte character set (DBCS) characters in Japanese. You can install Japanese\nDBCS-coded fonts from CDs that RICOH ProcessDirector provides.\nChanging the appearance of AFP banner pages\nAfter an AFP printer is set up to print banner pages, each job must specify what the banner page for the job should look like. A control file\ndefines the appearance of the banner page. The control file might be set by the workflow, but you can change the banner-page control file for\nan individual job after it is in the system.\nPrinting barcodes on AFP banner pages\nYou can print barcodes that represent the values of job properties, printer properties, and system settings on banner pages. For jobs sent to AFP\nprinters, you configure RICOH ProcessDirector to print the barcodes by adding or modifying entries in the control files installed in\n/aiw/aiw1/samples/banner_pages/ and /aiw/aiw1/control_files/banner_pages/, such as header.cfg.\nParent topic: Banner pages\n1 of 1"}]}