{"doc_name": "fusionpro_o_runsamplewf.pdf", "doc_path": "data/raw/RPD-en-US/fusionpro_o_runsamplewf.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2189, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Running the FusionPro sample workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the FusionPro Connect feature / Running the FusionPro sample workflow\nRunning the FusionPro sample workflow\nThe FusionPro Connect feature provides a sample workflow that you can examine and run to understand how the feature works. The sample\nincludes a hot folder input device and a workflow that includes the RunFusionPro step.\nThe sample objects used in this workflow are:\nHot folder input device: FusionProFolder\nSample print job: FusionProSample.csv\nWorkflow: FusionProSample\nSample template: Ricoh Sample Template.zip\nReview the properties for each object before you start the procedure to see how they interact.\nTo run the sample workflow:\n1. Upload the sample template file provided by the FusionPro Connect feature:\n1. Log in to the machine where FusionPro is installed.\n2. Start FusionPro Server Dashoard.\n3. Go to Template Manager and select the Template tab.\n4. Go to Collected Template Zip file and click Browse to select: Ricoh Sample Template.zip\nThe sample template is stored in the /aiw/aiw1/samples/fusionpro folder.\n5. Set the Group name to Ricoh Sample Group.\n6. Set the Template name to Ricoh Sample Template.\n7. Optional. Enter a description for the selected template.\n8. Click Upload.\n2. Click the Main tab.\n3. In the Printers portlet, right-click the Sample printer and select Enable.\n4. In the Input Devices portlet, right-click the FusionProFolder hot folder input device and select Enable and Connect.\nThe first time you try this procedure, RICOH ProcessDirector immediately submits the job containing the FusionProSample.csv sample file\nto the workflow. If you need to submit the same file again, copy the sample CSV file to the hot folder again.\nThe workflow sends the job FusionPro where the CSV file is composed and converted to a PDF file. Next, the job is processed by the\nCountPages and CreatePagesRanges steps before being sent to the sample printer. After the jobs reach the PrintJobs or\nRetainCompletedJobs step, you can view the job to see or download the PDF file.\nParent topic: Setting up the FusionPro Connect feature\n1 of 1"}]}