{"doc_name": "aiw_C_StepChain.pdf", "doc_path": "data/raw/RPD-en-US/aiw_C_StepChain.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2032, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Creating a step chain - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Creating a step chain\nCreating a step chain\nIf you use the same set of connected steps in many of your workflows, you can create a step chain with those steps to use in your workflows.\nTo create a step chain:\nCreate a step chain manually:\n1. Click the Workflow tab.\n2. In the left pane, click Step Chains.\n3. Click Add.\n4. Fill in values for all the required fields and click CONTINUE.\n5. In the step chain editor, add and connect the steps you want to use.\n6. To save the step chain, click the menu in the upper right corner and select Save step chain.\n7. To exit the step chain editor, click the X in the upper right corner.\nCreate a step chain from steps in an existing workflow\n1. Click the Workflow tab.\n2. In the left pane, click Workflows.\n3. Open the workflow that contains the steps you want to make into a step chain.\n4. Press the Shift key and drag your mouse to draw a box around the steps you want to include in the step chain.\n5. If you want to remove some steps from the selection or add other steps that cannot be included in the box, use Ctrl click or Shift click to\ndeselect them.\n6. Right-click inside the box to bring up the context menu and select Save as step chain.\nAdd an annotation to a step chain:\n1. Click the Workflow tab.\n2. In the left pane, click Step Chains.\n3. Click a step chain that you want to open.\n4. In the step chain editor, right-click and select Add annotation from the menu.\n5. Enter your comment and click the arrow icon to post the annotation.\nThe annotation is saved and visible on the workflow.\n6. To save the step chain, click the menu in the upper right corner and select Save step chain.\n7. To exit the step chain editor, click the X in the upper right corner.\nNote:\nAfter you create a step chain and place it in a workflow, changes made to that step chain are not applied to the step chain in the\nworkflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}