{"doc_name": "aiw00c_PCLOutLimitations.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c_PCLOutLimitations.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3563, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Processing concerns when using PCLOut printers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Defining a workflow to print AFP data to a PCL printer / Processing concerns when using PCLOut printers\nProcessing concerns when using PCLOut printers\nThere are specific limitations to the support available when sending AFP jobs to PCLOut printers.\nPCLOut printers only support sending these data streams to the printer:\nPCL4\nPCL5\nPCL5c\nNote: PCL4 does not support printing graphics. If you need to print graphics, you must configure the PCLOut printer to output PCL5 or\nPCL5c.\nPCLOut printers convert jobs on a job-by-job basis. They do not create and save AFP resources (such as fonts, overlays, or page segments) from\nprevious jobs. In addition, if the print jobs include the page overlays or page segments, they are rendered after all the other objects are\nprocessed. This might cause issues when the order of the overlapping objects is critical.\nPCLOut printers do not support:\nUsing any printer-resident resources\nReusing printer resources (including fonts) from one job to the next\nSelecting output bins\nUsing custom media sizes\nUsing BCOCA BCD2 subset\nUsing GOCA Mapping Control Options, except for the Position and Trim options\nUsing default color mixing rules for foreground and background\nGenerating PCL6\nUsing full IS/3\nDuplex printing specified anywhere other than on the Duplex property of a PCLOut printer object\nPrinting color IOCA images\nUsing RICOH ProcessDirector symbols such as ${Job.Name} in the PCLOut printer command\nHow PCLOut printers use fonts\nYou must install one of these supported font types on your system so they can be used by the PCLOut printer:\n300 pel AFP fonts\nRelative-Metric AFP fonts\nAFP Outline fonts\nTrue Type/Open Type fonts\nBecause the PCL Secondary transfers data to the PCL printer character-by-character during job processing, you cannot examine the PCL data the\nsame way you might examine standard text or PCL data. As a result, you cannot scan the output data for certain text strings.\nPCLOut printer objects cannot:\nCommunicate with the printer to see if the job completes printing\nQuery fonts in the printer after the job has been sent to the printer\nBarcodes supported\nPCLOut printers only support these barcode types:\nX'01' - 3-of-9 code X'01' and X'02'\nX'02' - MSI X'01' through X'09'\nX'03' - UPC/CGPC, Version A X'00'\nX'05' - UPC/CGPC, Version E X'00'\nX'06' - UPC–Two-digit Supplemental X'00', X'01', and X'02'\nX'07' - UPC–Five-digit Supplemental X'00', X'01', and X'02'\nX'08' - EAN 8 (includes JAN short) X'00'\nX'09' - EAN 13 (includes JAN standard) X'00'\nX'0A' - Industrial 2-of-5 X'01' and X'02'\nX'0B' - Matrix 2-of-5 X'01' and X'02'\nX'0C' - Interleaved 2-of-5 X'01' and X'02'\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Processing concerns when using PCLOut printers - Jenski - Test portal- RPD Linux\nX'0D' - Codabar: modifier X'01' and X'02'\nX'11' - Code 128: modifier X'02', X'03’, and X’04’\nX'16' - EAN Two-digit Supplemental X'00' and X'01'\nX'17' - EAN Five-digit Supplemental X'00' and X'01'\nX'18' - POSTNET: modifier X'00' through X'04'\nX’1A’ - Royal Mail Postal\nX'1B’ - Japan Postal\nX’1C’ - DataMatrix\nX’1D’ - MaxiCode\nX’1E’ - PDF417\nX’1F’ - Australia Post Bar Code, modifier X'00' through X'08'\nX’20’ - QR Code\nX’21’ - Code 93\nX'22' - USPS Four-State (Intelligent Mail): modifier X'00' through X'03'\nX'23' - Royal Mail RED TAG: modifier X'00'\nX'24' - GS1 DataBar\nX'25' - Royal Mail Mailmark\nParent topic: Defining a workflow to print AFP data to a PCL printer\n2 of 2"}]}