{"doc_name": "definitionoperators.pdf", "doc_path": "data/raw/RPD-en-US/definitionoperators.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2357, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Creating conditions between barcode definitions - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Creating conditions between barcode definitions\nCreating conditions between barcode definitions\nWhen you define more than one barcode, you can create a condition between two barcodes that AFP Editor uses to determine which barcode is\ncreated in the AFP file.\nYou can use conditions to control when a barcode is added to a page group. For example, if some page groups contain POSTNET barcodes and\nsome page groups do not, you might want to add a new barcode to the page groups that do not have one. You can define a new barcode and\ncreate a condition so that whenever the POSTNET barcode is not found, the new barcode is added to the page group. Similarly, if you want to\nreplace an existing barcode in all page groups with a new barcode, you can define a condition so that whenever the old barcode is found, it is\nreplaced with the new barcode.\nTo create a condition between barcode definitions:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. Click Mode ⇒ AFP Editor.\n3. Create two barcodes if you do not already have two defined.\n4. Do one of these:\nAfter the second barcode is defined, click Yes when you are asked if you want to create a condition for this definition.\nClick Tools ⇒ Modify Definitions and then click Conditions on the Modify and Delete Definitions window.\nYou see the Create Conditions between Definitions window.\n5. From the drop-down list, select a barcode in the Select Definition 1 field.\n6. From the drop-down list, select one of these conditions in the Select Condition field:\nfails, run: If the first barcode definition cannot be created, use the second definition.\nsucceeds, run: If the first barcode definition can be created, use the second definition.\n7. From the drop-down list, select a barcode in the Select Definition 2 field.\n8. Click OK.\nThe condition is created and is listed on the Modify and Delete Definitions window, if it is open. If the Modify and Delete Definitions\nwindow is closed, click Tools ⇒ Modify Definitions to see the condition you just defined.\n9. To close the Modify and Delete Definitions window, click X in the upper right corner.\nParent topic: Editing AFP files\n1 of 1"}]}