{"doc_name": "cac_ColorConcepts.pdf", "doc_path": "data/raw/RPD-en-US/cac_ColorConcepts.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2593, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Color Printing Concepts - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / Color Printing Concepts\nColor Printing Concepts\nColor printing is significantly more complicated than black and white printing. If you understand some of the complexities, you can make the\ntransition from black and white printing to grayscale or color printing more smoothly.\nIn this section:\nColor Spaces and ICC profiles\nPresentation devices, such as computer monitors and printers, create colors differently. Because of these differences, colors must be described\ndifferently for each device. The different methods of describing colors are called color spaces. In addition, each device might have one or more\nInternational Color Consortium (ICC) profiles associated with it. ICC profiles are used when an image or another object is converted to the color\nspace of a different device.\nGamut and Rendering Intent\nEvery device has a gamut, a range of colors or shades of colors that it can display or print. Some devices have larger gamuts than others; some\ndevices have gamuts that are similar sizes, but that contain slightly different colors. When an image or a print job is created on a device with a\ngamut that is different from the printer, you can use a rendering intent to tell the printer how to adjust the colors that are outside the gamut of\nthe printer.\nColor Mixing and Calibration\nFour standard colors (cyan, magenta, yellow, and black) are blended to create all the colors in the gamut of a printer. A printer mixes colors by\nprinting four layers of a page or an image, one in each color. If the printer registration is not set correctly, the images do not line up properly and\nthe colors appear wrong. In addition, the printer must be calibrated to ensure that all its systems are functioning correctly and that it is in a\nknown good state.\nHalftones and Tone Transfer Curves\nHalftones are used to convert images (such as photographs, drawings, logos, or charts) from the continuous tones that you see on a monitor into\na pattern of dots that a printer can put on paper. Tone transfer curves are used to modify the values of a particular color component and thus\nadjust the look and feel of some of the colors. For example, you can apply a tone transfer curve to emphasize the brightest parts of an image.\nFile Size\nColor print jobs can have a file size that is much larger than black and white print jobs. The larger file size can lead to longer processing times\nand increased traffic on your network.\nParent topic: Color and Grayscale Printing\n1 of 1"}]}