{"doc_name": "InserterResultsFiles.pdf", "doc_path": "data/raw/RPD-en-US/InserterResultsFiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4497, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Inserter results files - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Inserter and Quadient Inserter Express / Inserter results files\nInserter results files\nAfter a job completes insertion, most inserter controllers write an inserter results file that contains the status of each document in the job after\ninsertion and other information related to insertion. RICOH ProcessDirector receives the inserter results file (or files) for each job from the inserter\ncontroller and interprets the information in the file to determine which documents to reprint and how to set job and document properties.\nFor example, RICOH ProcessDirector sets the Status document property to indicate the insert status of each document.\nInserter results files vary in format and content, depending on the inserter. RICOH ProcessDirector processes these types of inserter results files:\nResults files that are job-specific: each results file contains the results for only one job\nResults files that are not job-specific: each results file contains results for more than one job (such as Gunther results files)\nThe requirements for job-specific and non-job-specific control files differ as described below.\nA results file can contain one record for each document, with a status code that indicates the status of the document after insertion. Or, the\nresults file can contain a record only for each document that needs to be reprinted.\nRICOH ProcessDirector can read results files in any of these output formats:\nFixed-length record (FLR): The fields in each record have a fixed length, with no delimiter between each field.\nComma-delimited (DEL): The fields in each record are separated by a comma.\nBecause inserter results files vary in format and content, you must create these rules files:\nParsing rules files: Defines the fields in each record of the inserter results file.\nJob-properties rules files: Specifies how to set RICOH ProcessDirector job-property values. This file is used only with job-specific results files.\nDocument-properties rules files: Specifies how to set RICOH ProcessDirector document-property values.\nRICOH ProcessDirector provides sample rules files that you can modify for your installation. With the Quadient Inserter Express feature, you\nreceive sample files for Quadient inserters. With the full Inserter feature, you receive sample files for a wider variety of inserters.\nRequirements: The inserter results files must meet these requirements. The requirements differ, depending on whether the results files are job-\nspecific (one results file for each job) or non-job-specific:\nJob-specific results files: The file name of each results file must be unique for each job in the system associated with the inserter controller. We\nrecommend that the file name of the results file contain the value of a job property whose value is unique for each job in the system, such as\nthe Job number or Inserter job name property. (By default, the inserter job name is the job number; however, you can set another value in the\nInserter job name property.) You specify the file name for the results file in the Receive command property of the inserter controller object.\nExample: If the job number is 10001023, the name of the results file could be 10001023 or Kern10001023.\nEach record in the file must contain the value of one of these document properties to identify the document to which the record applies:\nDocument number\nInsert sequence\nNote:\nThe Quadient Inserter Express feature only supports job-specific results files.\nNon-job-specific results files: Each record in the file must contain the value of this document property to identify the document to which the\nrecord applies:\nDocument number\nRICOH ProcessDirector requires the document number because the document number is unique for each document in the system.\nOn the Receive command property for the inserter controller object, you specify a command or script that RICOH ProcessDirector runs to receive\nthe inserter results file for the job or, if the inserter results files are not job-specific, to receive all the inserter results files.\nRICOH ProcessDirector provides several scripts that you can use to receive the inserter results files from the system where the inserter controller\nwrites the files. Or, you can use another script that accepts the same parameters as the provided scripts.\nParent topic: Inserter and Quadient Inserter Express\n1 of 1"}]}