{"doc_name": "dt_o_scen_noserviceperiod.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_scen_noserviceperiod.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2667, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Adjusting Service Level Agreements for weekends and holidays - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker / Usage scenarios for Deadline Tracker\n/ Adjusting Service Level Agreements for weekends and holidays\nAdjusting Service Level Agreements for weekends and holidays\nWhen you negotiate your Service Level Agreements (SLAs), you use No-service periods for days you are closed, such as weekends and holidays.\nThe days that you are closed are not considered when calculating SLA deadlines.\nTo accommodate holidays, the administrator creates a No-service period. RICOH ProcessDirector accounts for the No-service period when it\ncalculates the SLA deadline and uses the correct deadline to track the status of the job against the SLA. No-service periods can only be used\nwhen tracking to a checkpoint. You cannot use No-service periods with the SetDeadline step or when tracking to a schedule.\nFor example:\nA customer has a 72-hour SLA, and submits a job at 1:00 PM Friday. Because you are closed Saturday and Sunday, the 72-hour SLA deadline is\n1:00 PM Wednesday.\nA customer has a 24-hour SLA, and submits the job at 4:30 PM on December 31. You are closed on January 1 for the New Year's holiday, so\nthe SLA deadline is 4:30 PM on January 2.\nTo add a No-service period for the New Year's holiday, the administrator:\nNavigates to the Objects section of the Administration tab and selects No-service period.\nAdds a new No-service period.\nNames the No-service period by typing New Years Day Holiday in the No-service period name field.\nAdds a description of the holiday in the Description field.\nSelects the day of the holiday in the Day field and month of the holiday in the Month field by setting Day to 1 and Month to 1 for January.\nSets the year of the holiday or leaves the Year field empty so that it repeats every year. In this scenario, the holiday repeats every year, so the\nYear field is left blank.\nNote:\nIf the No-service period changes from year to year, you must specify a year and make a separate No-service period for each year.\nSets the Start time of the holiday. In this scenario, the start time is set to 12:00 AM.\nSets the End time of the holiday. In this scenario, the end time is set to 11:59 PM.\nOnce set, this No-service period repeats every year for the New Year’s Day holiday. RICOH ProcessDirector calculates the job processing schedule\nfor when the business is closed. When the business opens on January 2, printing resumes with the SLA checkpoints adjusted to accommodate\nthe holiday.\nParent topic: Usage scenarios for Deadline Tracker\n1 of 1"}]}