{"doc_name": "aiw_sdk_time.sets.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_time.sets.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3721, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Sets by time - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / Sets by time\nSets by time\nWhen the batching method is Sets by time, the hot folder or SFTP input device submits one or more jobs containing complete sets of files that\narrive within a specified time period. The time period is determined by the values set for the Batching start date, Batching start time, Batching\ninterval, and Batching date or Frequency properties.\nFor a set to be complete, all of these conditions must be true:\nA file matching the value in the Data patterns property is present.\nIf a value is entered for the Overrides patterns or JDF patterns properties, a file matching one or both of those values is present.\nIf there are any entries specified for File patterns, a file matching each value is present.\nThe hot folder or SFTP input device waits until the date and time specified in the Batching start date and Batching start time properties, then\nsubmits one or more complete sets of input files at a specific time or time interval determined by the values set for the Batching interval and\nBatching date or Frequency properties. The hot folder or SFTP input device submits the sets as a group with one set in each child job. If the\nCreate .zip file property is set to Yes, a single job containing all of the files in all of the sets is submitted in ZIP file format. The files print in the\norder specified by their Last modified timestamp.\nNote:\nIf complete sets of files exist in the hot folder or SFTP input device prior to the initial date and time set in the Batching start date and\nBatching start time properties, those sets will be included in the first batch submitted by the input device.\nFor the Batching start time property, use the time zone of your browser. The value is displayed based on the time zone of the computer\nthat you use to open the user interface, but it is stored in a generic format. The hot folder or SFTP input device interprets the generic time\nformat based on the time zone of its parent server and creates batches at the specified time.\nWhen you use the Sets by time batching method, set these input device properties as indicated:\nWorkflow: ParentNoPrint\nChild workflow: The workflow that is appropriate for the print files in the job.\nSubmit step: SubmitInputFiles\nCreate .zip file: If this property is set to Yes, all of the files are combined as a ZIP file and submitted as a single job. If this value is set to No, each\nset is submitted as a child job.\nBatching start date: The date when the input device begins to use the Sets by time batching method.\nBatching start time: The time when the input device begins to use the Sets by time batching method.\nBatching interval: The time interval used to determine when or how often to submit a group of files.\nBatching date or Frequency: Used with the Batching interval property, this property specifies exact values for when or how often to submit a\ngroup of files.\nData patterns: A pattern that matches some part of the file name of your print files. For hot folder or SFTP input devices, the default value is\nthe regular expression: .*$. That pattern matches all file names.\nFile Patterns: A collection of patterns that can define files that are required to be included in a set.\nJDF patterns: One or more pattern-matching strings used to identify Job Definition Format (JDF) job tickets. If this property has a value specified,\na JDF job ticket is required for the set to be complete.\nOverrides patterns: One or more pattern-matching strings used to identify files that contain values for job properties.\nParent topic: Batching methods\n1 of 1"}]}