{"doc_name": "aiwctransjt.pdf", "doc_path": "data/raw/RPD-en-US/aiwctransjt.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3383, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Defining a workflow that sends jobs to be transformed - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Defining a workflow that sends jobs to be transformed\nDefining a workflow that sends jobs to be transformed\nTo send print jobs to the RICOH ProcessDirector Transforms or the Advanced Transforms to be converted to a different data stream, you must\ndefine a workflow that includes one or more data stream conversion steps.\nBefore you begin, determine which data stream formats you want to use with RICOH ProcessDirector and what program you plan to use to\nconvert the data streams. The RICOH ProcessDirector Transforms use different step templates than the Advanced Transforms. You can only use\nthe RICOH ProcessDirector Transforms if the AFP Support feature is installed.\nThese workflows supplied with the AFP Support feature include steps that send jobs to the RICOH ProcessDirector Transforms:\nTransform\nIncludes the TransformJobIntoAFP step.\nOutputPDF\nIncludes the TransformJobIntoPDF step.\nBoth steps look at the values of the Input data stream and Transform output data stream properties to determine which transform to use.\nBoth workflows include a step based on the DetectInputDatastream step template, which they use to determine the value of the Input data\nstream property. To use this workflow to process specific file formats, you can set a default value for the Input data stream property on the\nTransformJobIntoAFP or TransformJobIntoPDF step when you add it to the workflow. If you set a value on the step, you can delete the\nDetectInputDataStream step from the workflow.\nThe Advanced Transform feature provides the OutputAFP workflow, which includes steps based on the TransformWithAdvancedFeature and\nDetectInputDatastream step templates.\nThe DetectInputDatastream step determines the value of the Input data stream property for the job. In the supplied workflow, the value of the\nTransform input stream property in the TransformWithAdvancedFeature step is set to Use current, which causes the transform to use the value of\nthe Input data stream property as transform input stream. As a result, this workflow accepts any input data stream and converts it to the data\nstream indicated in the Transform output stream property. In this case, that value is AFP.\nThe TransformWithAdvancedFeature step template can be configured to accept various input data streams and create various output data\nstreams, depending on the advanced transforms that you have installed. If you want to convert job to a different data stream, when you can\ncopy the workflow, rename it, and change the value of the Transform output stream property. For example, if you want to accept any input data\nstream and convert it to PostScript, you could rename the workflow OutputPS and change the value of the Transform output stream property to\nPS.\nTo define a workflow that sends jobs to be transformed:\n1. Click the Workflow tab.\n2. Right-click one of Transform, OutputPDF, or OutputAFP workflows, and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Review the steps that are included in the workflow and the default values that they set.\n5. Add any other steps that you want to include in this workflow.\n6. Save the workflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}