{"doc_name": "rep_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/rep_o_featov.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3150, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Archive - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Archive\nArchive\nThe Archive feature lets you store jobs, documents, and job processing history in a repository and retrieve them by searching on job and\ndocument properties. For example, you might search for documents by job name, customer name, and account number. After you retrieve a job\nor document, you can view it, review the properties that were stored with it, check the production history, and submit the job or document to a\nworkflow for reprinting or other processing.\nThe feature has these major parts:\nA new repository object and two new step templates.\nA new type of notification object.\nPrerequisites\nTo use the Archive feature, first install a feature that supports document processing:\nFor PDF files, install the PDF Document Support feature.\nFor AFP files, install the AFP Support feature.\nNew repository object\nRepository objects hold job and document data and job processing history that you want to store for possible retrieval, including to submit again\nas a new job. When you retrieve the information, you can view the job, submit it again, or review detailed information about the job and its\nproduction history. You can create multiple repositories, each with a unique retention period. Each repository can be on the local system or a\nmounted drive anywhere in your network. To control who can retrieve files from a repository, you can associate the repository and its users with\na specific location.\nHistory record notifications\nThe Archive feature adds a new type of notification object called a history record notification. These objects monitor the system for changes to\nthe Current job state property. When that property changes, the history record notification captures the new state, the timestamp, and the\nworkflow, phase, and step that the job is in. This information can be then stored in the repository.\nUsing the information captured by the history record notification object, you can save the production time line of the job to answer questions\nabout job and document processing.\nNew step templates\nArchive adds the StoreInRepository step template. A step that is based on this step template stores a copy of any file selected by the File to store\nproperty in a repository with the job and document properties you specified. The job and document properties you select to store with the file\ncan be used to retrieve the job or document.\nYou can also use the Store history records property to have the step store the history records generated for the job by one or more history record\nnotification objects.\nArchive also adds the ExportFromRepository step template. A step that is based on this step template lets you export the properties from a\nrepository to a comma-delimited (CSV) file.\nIn this section:\nUsage scenarios for Archive\nThese scenarios show how the Archive feature might be used to improve your production processes by storing jobs, documents, and their history\nin a repository and retrieving them when needed.\nParent topic: Document processing features\n1 of 1"}]}