{"doc_name": "aiw_supconn_overview.pdf", "doc_path": "data/raw/RPD-en-US/aiw_supconn_overview.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4792, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM RICOH Predictive Insight Connect - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Integration features / RICOH Predictive Insight Connect\nRICOH Predictive Insight Connect\nThe RICOH Predictive Insight Connect feature lets you send data collected by the Reports feature in the PostgreSQL database to the RICOH\nPredictive Insight application in the cloud.\nThen, you can use RICOH Predictive Insight to build dashboards that present the historical data visually.\nPrerequisites\nBefore you can send data to RICOH Predictive Insight, you must:\nInstall the Reports feature. This feature is available in the Feature Manager and does not require a license.\nSet up the PostgreSQL database to start collecting the information.\nEnable data collectors to store the appropriate property values.\nAdd the WritePropsToReportsDatabase step template to any workflows that need to collect job and document properties as jobs process\nthrough them.\nRequest access to RICOH Account Administration, so you can configure a secure connection with Ricoh cloud applications.\nSystem objects:\nThis feature adds these object types:\nRicoh cloud credential\nThe RICOH Predictive Insight Connect feature adds the Ricoh cloud credential type. This type of credential is used to create a secure\nconnection with Ricoh cloud applications.\nRICOH Predictive Insight Data Transmitter\nRICOH ProcessDirector uses a special type of data transmitter, the RICOH Predictive Insight Data Transmitter. Based on the settings made in\nthe RICOH Predictive Insight Data Transmitter, you can specify what data should be sent and when to send it.\nConnecting and sending data\nTo connect and send data to RICOH Predictive Insight, RICOH ProcessDirector uses a Ricoh cloud credential and the RICOH Predictive Insight data\ntransmitter. The data that you send to RICOH Predictive Insight is stored in the PostgreSQL database by the RICOH ProcessDirector data collectors.\nThe data transmitter can send job, printer, device, or user property values captured by the data collectors based on a schedule you set.\nMost RICOH ProcessDirector features add job properties that can be captured for reporting purposes, such as SLA outcome from the Deadline\nTracker feature.\nYou can also send the job and document properties collected by the WritePropsToReportsDatabase step in workflows. The tables that are\nspecified within the step can be selected to be sent with the RICOH Predictive Insight data transmitter.\nRICOH Predictive Insight can display properties captured by the RICOH ProcessDirector data collectors using different widgets. The RICOH\nProcessDirector Connect Add-on includes a default RICOH ProcessDirector dashboard. The default RICOH ProcessDirector dashboard contains\nthese default widgets:\nTotal Print Volume\nShows the total printed number of sheets and pages daily.\nVolume by Printer\nShows the total printed number of sheets and pages for each printer.\nVolume by Customer\nShows the total number of sheets and pages printed for each customer. This uses the Customer name job property which is set in the\nworkflow for each job.\nVolume by Location\nShows the total number of sheets and pages printed at each location. This uses the Requested location job property which is set in the\nworkflow for each job.\nVolume by Printer Operator\nShows the total number of sheets and pages scheduled for printing by each user.\nTo customize your RICOH ProcessDirector dashboard, duplicate the default RICOH ProcessDirector dashboard, then edit the existing widgets or\nadd more widgets from the widgets library. For example, you can customize the Total Print Volume widget to show the number of documents\ninstead of pages or sheets. You can search for different values you want to display in the widget, then you can switch them on or off depending\non the data you want to see. You can share a duplicated dashboard with other users to view your collection of widgets.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:21 PM RICOH Predictive Insight Connect - Jenski - Test portal- RPD Linux\nFor more information about setting up a RICOH Predictive Insight dashboard and widgets, see the Working with Dashboards topic in the\nRICOH Predictive Insight help system.\nRICOH Predictive Insight Connect does not provide access to RICOH Predictive Insight. You must purchase a RICOH Predictive Insight subscription\nand the RICOH ProcessDirector Connect add-on separately. If you want to purchase additional viewer subscriptions for other company\nemployees, contact a Ricoh representative.\nTo create your own widgets in RICOH Predictive Insight, you must purchase the self-service add-on for each user and you must log in as a self-\nservice user. To purchase the self-service add-on, contact a Ricoh representative.\nParent topic: Integration features\n2 of 2"}]}