{"doc_name": "mail_c_EnhancePDF.pdf", "doc_path": "data/raw/RPD-en-US/mail_c_EnhancePDF.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5953, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Enhancing PDF files for Postal Enablement - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Postal Enablement feature / Enhancing PDF files for Postal Enablement\nEnhancing PDF files for Postal Enablement\nTo process sample PDF files for Postal Enablement, use RICOH ProcessDirector Plug-in for Adobe Acrobat to enhance the files. The files must have\na page group, which identifies documents, and document properties required for the external postal software. The files might have other\nmarkup, such as a barcode that contains updated address data from the postal software.\nInstall RICOH ProcessDirector Plug-in for Adobe Acrobat by following the instructions in RICOH ProcessDirector: Installing Document Processing\nFeatures.\nFor detailed information about the RICOH ProcessDirector Plug-in for Adobe Acrobat functions that you use in this procedure, such as Define\nMultiple Properties, Add Text, and Add Barcode, see RICOH ProcessDirector: Using RICOH ProcessDirector Plug-in for Adobe Acrobat.\nTo enhance PDF files for use with Postal Enablement:\n1. Open a PDF file in Adobe Acrobat Professional and click Ricoh ⇒ Select to make RICOH ProcessDirector Plug-in for Adobe Acrobat the\nactive tool.\n2. Draw a box around the text you want to use to define text-based page groups, or draw a box anywhere to define page groups that are not\nbased on text. Click Define Page Group.\n1. From the Page Groups drop-down menu, select Create fixed-length page groups or Begin page group when the selected text is\nfound.\nYou can define a page group based on a fixed number of pages or based on text that appears repeatedly throughout the PDF file. For\nexample, if Page 1 appears on the first page of each document, you can use that text to define page groups.\nOther:\nIf you use text to define the beginning of the page group, this text should appear in the same location on the first page of\nevery document.\nIf you are using a sample PDF file to define page groups, make sure that the content and location of the text you select are\nconsistent among the production PDF files.\n2. Click OK.\n3. Click Ricoh ⇒ View Page Group Navigator and verify that the documents in the PDF file have been defined correctly.\n4. To define document properties that correspond to the data required by your postal software, do one of these:\nIf the document properties that you need are listed in the table below, click Ricoh ⇒ Preferences. Click the Address tab and select Address\nlines 1–7 or U.S. addresses. Click Ricoh ⇒ Define Address Block and draw a box around the mailing address. Check to make sure that\neach document property has the proper value, and then click OK.\nThe Define Address Block function defines a set of document properties for mailing addresses. You can select either Address lines 1–7 or\nU.S. addresses.\nNote: You cannot change the mapping of the document properties in either set.\nAddress lines 1-7U.S. addresses\nDoc.Address.1 Doc.Address.FullName\nDoc.Address.2 Doc.Address.Other\nDoc.Address.3 Doc.Address.Secondary\nDoc.Address.4 Doc.Address.Primary\nDoc.Address.5 Doc.Address.City\nDoc.Address.6 Doc.Address.State\nDoc.Address.7 Doc.Address.ZipCode\nIf the document properties that you need are not listed in the table above, click Ricoh ⇒ Define Multiple Properties and draw a box\naround the mailing address.\nSelect the most complicated and longest address in the sample PDF file. For example, if addresses have from three to five lines, select an\naddress with five lines.\nYou can define a single document property for a line of text. Alternatively, you can define multiple document properties for a line of text\nby clicking the icon and defining text modifier rules to extract a portion of the data on the line. For example, you can extract the city,\nstate, province, or postal code and define it as a document property.\n5. When you are ready to save your page group definition and document properties, click Ricoh ⇒ Save Control File.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Enhancing PDF files for Postal Enablement - Jenski - Test portal- RPD Linux\n6. Give the control file a name or accept the default value. Click Save. You see a confirmation message. Click OK.\n7. Send the control file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access to.\nNote: When you create your Postal Enablement workflow, specify the name and location of the control file in each step based on\nthe IdentifyPDFDocuments step template.\n8. To clear the markup in the control file that you saved, click Ricoh ⇒ Clear Markup.\n9. Click Ricoh ⇒ Define Page Group and define the same page group that you defined in the control file that you specified in the step based\non the IdentifyPDFDocuments step template.\n10. If you want to replace the original mailing address data with updated data returned by the postal software, create a new control file. Do\nthese steps:\n1. Click Ricoh ⇒ Hide Area and draw a box around the mailing address.\nMake sure that the box covers all the addresses in the sample PDF file. Any portion of an address that extends beyond the box is not\ngoing to be covered.\n2. Click Ricoh ⇒ Add Text and define the content of the text by specifying document properties with updated data returned by the\npostal software.\n11. Optional: Click Ricoh ⇒ Add Barcode to define a barcode with the mailing address data returned by the postal software.\n12. When you are ready to save your markup, click Ricoh ⇒ Save Control File.\n13. Give the control file a name or accept the default value. Click Save. You see a confirmation message. Click OK.\n14. Send the control file to the RICOH ProcessDirector server in a directory that the RICOH ProcessDirector system user has access to.\nNote: When you create your Postal Enablement workflow, specify the name and location of the control file in each step based on\nthe BuildPDFFromDocuments step template.\nParent topic: Setting up the Postal Enablement feature\n2 of 2"}]}