{"doc_name": "aiw00import.pdf", "doc_path": "data/raw/RPD-en-US/aiw00import.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6234, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Copying objects from another system - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Copying objects from another system\nCopying objects from another system\nTo reuse objects from another RICOH ProcessDirector system, you can use the other system to export them. On this RICOH ProcessDirector\nsystem, you can import the objects rather than recreating them manually.\nYou can export and import objects such as input devices, workflows, printers, media objects, notifications, servers, step templates, user names,\ngroups, and locations. You can also export and import some objects added by features or extensions.\nImportant:\nWe recommend using the Migration Assistant when upgrading to a different computer to copy objects from one system to another. For\nadditional information see Using the Migration Assistant.\nDo not import objects added by a feature or extension that is not installed on this system.\nBefore you import an object that has the same name as an existing object of the same type, make sure that the existing object is\ndisabled. If the object is an input device, also make sure that it is disconnected. When you import the new object, the existing object is\nupdated to match the new one.\nBefore you import an input device or printer whose Parent server property has any value other than System, make sure that the parent\nserver has been added as a secondary server. Make sure that the secondary server has been enabled and connected to the primary server.\nIf you are using the Preprinted Forms Replacement feature, export the media.zip file before you import media objects with electronic\nforms. Follow the instructions in the help system for exporting media objects with electronic forms.\nWhen you import order property mapping objects, the file specified in the Sample order XML file property is not included in the export\npackage. You must copy the file to the new system manually after you import the object.\nSample XML files are stored in: /aiw/aiw1/mapping/proprty_mapping_object\nWhen you import step resources, the files that they refer to are not included in the export package. Copy the files referenced in the step\nresources from the export system to the import system manually. You must copy the files to the import system before you import the step\nresource objects.\nTo import all the step resources, copy the contents of /aiw/aiw1/StepResources from the export system into the same directory on\nthe import system.\nTo import specific step resources, open the XML file that you exported. Find the entry for each step resource that you exported and\nlocate the StepResource.File property. In that value, find the name of the RSC file associated with that step resource. For example, in\nthis value:\n<property name=\"StepResource.File\" value=\"{&quot;fileName&quot; :\n&quot;/aiw/aiw1/StepResources/1992052c6ef44a229b8b43d77232bf53.rsc1992052c6ef44a229b8b43d77232bf53.rsc&qu\not; , &quot,&quot;displayName&quot; : &quot;Ricoh_Export-2019-08-26_13-30-04.xml&quot;}\"/>\nThe file name is: 1992052c6ef44a229b8b43d77232bf53.rsc\nFind the file on the export system and copy it into the same directory on the import system.\nYou can export objects from a primary server running on one operating system and import them on a primary server running on a\ndifferent operating system.\nIf you export objects from Windows and import them on Linux, you need to manually update the paths for the paths or the configuration\nfiles.\nTo copy objects from another system:\n1. Click the Administration tab.\n2. In the left pane, click Utilities ⇒ Import Objects.\n3. In the File to import field, click Browse or drag file and find the file on the system, or drag and drop the XML file that contains the\nproperties of exported objects.\nThe default name of this file is Ricoh_Export_timestamp.xml. The administrator who exported the objects might have given the file a\ndifferent name.\nNote:\nIf you exported media objects with electronic forms, the name of the file is media.xml. It is in this directory:\n/aiw/aiw1\nThe file is automatically examined, and the objects are evaluated. If there are issues with any objects in the file, you see a dialog that lists\nthe import errors and warnings. Close the dialog and all the objects appear in the Objects to import table. Objects with errors or warnings\nare marked with an icon.\nRepeat this step for all the files you want to import. Objects from additional files are added to the table, so they can all be added at the\nsame time.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Copying objects from another system - Jenski - Test portal- RPD Linux\n4. Review the objects in the list. Select any object marked with a warning or error symbol and click Details to see additional information about\nthe warning or error. Follow the instructions in the description to resolve problems. You cannot import objects that are marked as errors.\n5. Select the objects that you want to import.\n6. Optional: To make sure that you do not update objects that exist, click Deselect existing objects.\n7. Click Import.\nIf the Import button is disabled, one or more selected objects are marked with the error icon. Click Deselect error objects to clear the\nselection for those objects and click Import again. The objects without errors are imported.\nReturn to the error objects to resolve the issues and try to import them again.\nNote:\nCredential objects might be contained in the file you import if they were included as references in workflows, step templates, input\ndevices, or transmitter objects. The imported credential objects cannot be used until you re-enter values for the User name and Password\nproperties on the imported system.\nIf an imported workflow refers to a step that does not exist on this system, RICOH ProcessDirector replaces the step with a placeholder\nstep named ReplacedStep. The original step name and step template name are available in the Step properties. The ReplacedStep acts\nlike the ContinueToNextStep step template, so it simply passes the job to the next processing step without changing it.\nContact your local Ricoh support representative if you receive an error message for step templates not containing a reference to an\nextension when importing objects.\nParent topic: Configuring\n2 of 2"}]}