{"doc_name": "tt_t_definettworkflow.pdf", "doc_path": "data/raw/RPD-en-US/tt_t_definettworkflow.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6700, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Defining a workflow that uses barcodes to track jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature / Defining a workflow that uses barcodes to track jobs\nDefining a workflow that uses barcodes to track jobs\nYou can define a workflow that reads barcodes on documents in a job. The workflow reconciles the documents with barcodes that were read\nagainst the total documents in the job. The workflow can reprint any documents that were not accounted for during reconciliation.\nBefore you create a workflow, make sure that you have completed these tasks:\nFor PDF jobs, use the RICOH ProcessDirector Plug-in for Adobe Acrobat to create a control file that identifies page groups.\nFor PDF jobs, use the RICOH ProcessDirector Plug-in for Adobe Acrobat to create a control file that generates barcodes to add to documents.\nFor AFP jobs, make sure that the jobs already contain page groups. If you want to use the Verification recipient property, use Document\nProperty Designer to make a Visual Workbench control file.\nFor AFP jobs, create a control file that generates barcodes to add to documents. Use the sample control file or the AFP Enhancer mode of\nRICOH Visual Workbench.\nTo define a workflow that uses barcodes to track jobs:\n1. Click the Workflow tab.\n2. Right-click a workflow that you want to use as a model, such as VerifySample, and select Copy.\nIf your workflow does not include IdentifyPDFDocuments, BuildPDFFromDocuments, ReadBarcodeData, Reconcile, and CreateReprints\nsteps, add them.\nNote:\nThe IdentifyPDFDocuments and BuildPDFFromDocuments steps are for PDF jobs. A workflow that processes AFP jobs must have\nIdentifyDocuments and BuildAFPFromDocuments steps instead. An EnableRepositioning step is also recommended for AFP jobs.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. If the workflow processes PDF jobs:\n1. Right-click the IdentifyPDFDocuments step and select Properties.\n2. On the PDF tab, find the Identify PDF control file property. Type the path to the control file containing the page groups that you\ncreated with RICOH ProcessDirector Plug-in for Adobe Acrobat.\n3. Click OK.\n4. Right-click the BuildPDFFromDocuments step and select Properties.\n5. On the PDF tab, find the Build PDF control file 1 property and type the path to the control file that you created with RICOH\nProcessDirector Plug-in for Adobe Acrobat to generate barcodes.\n6. Click OK.\n5. If the workflow processes AFP jobs:\n1. Right-click the IdentifyDocuments step and select Properties.\n2. On the AFP tab, find the Visual Workbench control file property and type the path to the control file that you created with Document\nProperty Designer.\nNote:\nThe Automated Verification feature requires that AFP jobs already contain page groups. If your jobs do not have page groups\ndefined, you can use AFP Indexer to add them.\n3. Click OK.\n4. Right-click the BuildAFPFromDocuments step and select Properties.\n5. On the Documents tab, find the Enhance AFP control file property and type the path to the control file. The control file is created\nusing the sample control file or the AFP Enhancer mode in RICOH Visual Workbench.\n6. Click OK.\n6. Right-click the ReadBarcodeData step and select Properties. On the Verification tab, update these properties:\n1. For the Barcode Reader property, select the barcode reader that is going to read the barcodes on the documents in this step.\n2. For the Complete step when all barcodes are read property, select Yes if you want jobs to move to the next step when all barcodes\nhave been read. Otherwise, select No.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Defining a workflow that uses barcodes to track jobs - Jenski - Test portal- RPD Linux\n3. For the Results file inactivity timer property, specify the amount of time that RICOH ProcessDirector waits for updates to the results\nfile before moving the job to the next step.\nFor example, you want RICOH ProcessDirector to wait 10 minutes before moving the job to the next step regardless of whether all\nbarcodes have been read. Specify 10 minutes and select No for the Complete step when all barcodes are read property.\n4. Select the Document status property (for example, Document status 1) that the step updates with OK when the barcode on a\ndocument is read.\nNote:\nIf 2 or more ReadBarcodeData steps process a job, we recommend that you set each Document status property to a different\nvalue.\n5. Select the Document scan time property (for example, Document scanned 1) that the step updates with the date and time when the\nbarcode on a document is read.\nNote:\nIf 2 or more ReadBarcodeData steps process a job, we recommend that you set each Document scan time property to a\ndifferent value.\n6. Click OK.\n7. Right-click the Reconcile step and select Properties. On the Reconcile tab:\n1. For the Automatic reconciliation property, select one of these values:\nSelect Yes if you want RICOH ProcessDirector automatically to reconcile and reprint documents whose barcodes were not found in\nthe ReadBarcodeData step.\nSelect No if you want an operator manually to reconcile documents whose barcodes were not found in the ReadBarcodeData step.\n2. For the Maximum documents to reprint (%) property, specify the maximum percentage of documents in a job that RICOH\nProcessDirector can schedule for reprint during automatic reconciliation. If more than this percentage of documents must be\nreprinted, RICOH ProcessDirector places the job in the Waiting to reconcile state for manual reconciliation by an operator.\n3. For the Requested reprint printer property, select the printer to reprint documents whose barcodes were not found.\n4. Click OK.\n8. Right-click the CreateReprints step and select Properties. On the Reconcile tab:\n1. For the Reprint workflow property, do one of these steps:\nSelect Not set if you want the reprint job to start over in the same workflow that the CreateReprints step is in.\nThe sample workflow checks whether a job is a reprint job. If it is, a branch omits steps that are not needed when reprinting\ndocuments.\nSelect the name of a different workflow if you want the reprint job to move to the first step in that workflow.\n2. Click OK.\n9. To make sure that the original job stays in the system until all the reprint jobs have completed, add a step based on the WaitForRelatedJobs\nstep template. Place the step before the RetainCompletedJobs step. The retention period does not start for any of the jobs until all\ndocuments from the original job have been accounted for in the reconciliation process.\n10. Save and enable the workflow.\nParent topic: Setting up the Automated Verification feature\n2 of 2"}]}