{"doc_name": "CreatingBarCodeFormats.pdf", "doc_path": "data/raw/RPD-en-US/CreatingBarCodeFormats.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4837, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating barcode formats - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Creating barcode formats\nCreating barcode formats\nYou can create a barcode format object for each barcode that has a different format. The barcode format identifies the values of job and\ndocument properties in the barcode.\nFor example, you create a barcode format for the barcode that identifies each document in a job. The operator then uses the Barcode scan action\nin the Documents portlet to scan this barcode on a document that was damaged during or after a process, such as insertion. The operator uses\nthe values of job and document properties in the barcode to find the document in the system and reprint it.\nBefore you can create a barcode format that identifies the values of RICOH ProcessDirector custom document properties, those properties must\nbe defined in the “Database properties” section of the docCustomDefinitions.xml file. If the properties are defined in the “Limited properties”\nsection, edit the file to move the properties to the “Database properties” section.\nTo create a barcode format:\n1. Click the Administration tab.\n2. In the left pane, click Objects ⇒ Barcode Formats.\n3. Click Add.\n4. Enter a name for the barcode format.\nThe operator selects the name of the barcode format from a list of barcode formats, so enter a name that is meaningful to the operator\n(for example, “PitneyBowes barcode” or “Verification barcode”).\n5. To add the values of one or more properties to the barcode format:\n1. Click Add.\nThe Add Barcode Format Property window is displayed.\n2. In the Property field, select the job or document property whose value you want to add.\nSome job and document properties have the same name. In the list, job properties are identified by (Job) after the property name.\nIf you have the Automated Verification feature, you must include Job number and Sequence in child job in the barcode format.\nIf you have the Inserter feature and the barcode contains a value for Document number, you do not need to include any other\nproperty in the barcode format.\n3. In the Property start field, specify the starting position of the property value in the barcode.\nThe first character in the barcode is position 1.\nThe barcode format must match how the camera or barcode scanner hardware is configured. If the barcode scanner is configured to\nread the value of only one property in the barcode, specify that this value starts in position 1 of the barcode. For example, the value\nof the Document number property starts in position 10 in the full barcode, but the barcode scanner is configured to read only\ncharacters 10 through 25. Specify that the value of the Document number property starts in position 1.\n4. In the Property length field, specify the length of the property value in the barcode.\nIf you selected the Job number property and the barcode could be placed on the documents in a child job, make sure that you\nspecify a length that accounts for the job number (eight characters), the period, and the number after the period (one or more\ncharacters).\n5. Make sure the Comparison type field is set to Equals.\nThe Prefix value was useful for finding a set of documents where the value of the selected document property starts with a common\nprefix. The preferred method for this type of document search is to search by property and use the Like or Contains comparison to\ndefine your desired range of values.\n6. Click OK.\n7. Repeat these steps for each property value that you want to add.\n8. To see the property values in positional order, sort the table by the Property start column.\n6. Optional: To delete a property value from the barcode format:\n1. In the property table, right-click the property whose value you want to delete and select Delete.\n2. In the confirmation dialog, click OK.\n7. Optional: To modify the start or length of a property value in the barcode format:\n1. In the property table, right-click the property whose value you want to modify and click Properties.\n2. Make the appropriate changes.\n3. Click OK.\n8. Click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating barcode formats - Jenski - Test portal- RPD Linux\nExample\nBarcode format for Automated Verification\nJob numbers for parent jobs always have eight digits. You expect some jobs to go through the reprint path up to nine times. You must\naccount for a job numbered 99999999.9, so you need 10 characters.\nNo job has more than 99999 documents.\nThe camera or barcode scanner reads the Job number property in position 1. The Sequence in child job property immediately follows the Job\nnumber property.\nFor the Job number property, specify:\nProperty start=1\nProperty length=10\nComparison type=Equals\nFor the Sequence in child job property, specify:\nProperty start=11\nProperty length=5\nComparison type=Equals\nParent topic: Configuring\n2 of 2"}]}