{"doc_name": "ConfiguringJobTypes.pdf", "doc_path": "data/raw/RPD-en-US/ConfiguringJobTypes.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 7467, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM AFP workflows for the Inserter feature - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / AFP workflows for the Inserter feature\nAFP workflows for the Inserter feature\nThe full Inserter feature provides sample workflows that contain the steps required to receive and prepare jobs for insertion, print them, send\ninserter control files to the inserter controller, read inserter results files, and reconcile jobs after they have completed insertion. You copy and edit\nthese workflows for your environment. Or, you add the steps in the workflows to your existing workflows.\nNote:\nIf you have customized phase names in your system, the phase names in this topic might not match the names in your system.\nIf the inserter controller specifies the open-loop reprint method, two workflows are required:\nOriginal workflow: This workflow is assigned to jobs entering the system. It contains steps in the Receive and Prepare phases.\nProduction workflow: This workflow contains steps in the Assemble, Print, Insert, and Complete phases.\nTwo workflows are required when you use the open-loop reprint method because RICOH ProcessDirector creates a child job that contains the\ndocuments to be reprinted. The child job starts processing at the beginning of the production workflow. Therefore, the production workflow\nshould contain only the steps that are needed to process the child job.\nIf the inserter controller specifies the closed-loop reprint method, only one workflow is required. The workflow includes all steps from the Receive\nphase through the Complete phase. Using two workflows is an option. For example, use two workflows if many jobs use common processing\nsteps in the Receive, Prepare, and Assemble phases, but different processing steps in the Print, Insert, and Complete phases.\nThe Inserter feature provides these AFP workflows:\nReceiveInsert_I: Contains steps in the Receive and Prepare phases. In the Assemble phase, it changes to the PrintInsert_I workflow.\nPrintInsert_I: Contains steps in the Assemble, Print, Insert, and Complete phases. It does not contain steps to write and send inserter control\nfiles.\nReceiveInsert_II: Contains steps in the Receive and Prepare phases. In the Assemble phase, it changes to the PrintInsert_II workflow.\nPrintInsert_II: Contains steps in the Assemble, Print, Insert, and Complete phases. It contains steps to write and send inserter control files\n(required for file-based inserters).\nNote:\nUse the ReceiveInsert_I and PrintInsert_I workflows only for inserters that do not require inserter control files.\nThis table lists the required and optional steps related to insertion in the original workflow.\nSteps in the original workflow\nStep template Required Brief description Notes\nReceive phase\nSetJobPropsFromTextFile Yes Set job properties using a\ntext file that accompanies\nthe input file.\nDetectInputDataStream No (see Detect the format of the This step is required if the\nNotes) input data stream. SetJobPropsFromTextFile step does not specify the\nformat of the input data stream.\nPrepare phase\nConvertLineDataJobIntoAFP No (see Convert line data into AFP This step is required if the input files contain line\nNotes) format. data or mixed-mode data.\nIndexAFP No (see Create AFP page groups and This step is required if the input AFP files do not\nNotes) index tags. already contain AFP page groups that define the\ndocument (mailpiece) boundaries. Use the AFP\nIndexer mode of RICOH Visual Workbench.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:14 PM AFP workflows for the Inserter feature - Jenski - Test portal- RPD Linux\nStep template Required Brief description Notes\nEditAFP No Create barcodes and hidden This step can create barcodes such as Intelligent\nareas. Mail (IMB) barcodes. The AFP Editor feature\nprovides this step template.\nNote:\nTo create barcodes for insertion that\ncontain document properties, specify an\nEnhance AFP control file in the\nBuildAFPFromDocuments step.\nUseInlineFormDefinition No (see Use an inline form definition This step is required for jobs that use inline form\nNotes) if one exists. definitions. However, you can include this step\neven if some jobs do not contain inline form\ndefinitions.\nEnableRepositioning Yes Map logical pages to\nphysical sheets.\nIdentifyDocuments Yes Map index tags to\ndocument properties and\ncreate the document\nproperties file.\nWriteDocumentsToDatabase Yes Write the documents in the This step assigns the unique Document ID that is\njob to the database. used to track the document.\nAssemble phase\nChangeJobType Yes (see Change to a new workflow. If you create only one workflow, do not include\nNotes) this step, and include all steps shown in the\nproduction workflow in this workflow.\nPrint phase\nInsert phase\nComplete phase\nRemoveJobs No Jobs do not go through this step if the\nChangeJobType step is in the workflow.\nThis table below lists required and optional steps related to insertion in the production workflow.\nSteps in the production workflow\nStep template Required Brief description Notes\nReceive phase\nSetJobPropsFromTextFile Yes Set job properties using a text Job properties that the original workflow\nfile that accompanies the input set remain set. A step or rules processing\nfile. in the production workflow can set new\njob properties. However, it cannot change\nthe values of job properties that were set\nin the original workflow.\nPrepare phase\nAssemble phase\nSetInsertProperties Yes Set inserter document\nproperties.\nBuildAFPFromDocuments Yes Build an AFP job. Also, apply The Enhance AFP control file can hide\nmodifications in the Enhance existing inserter control information (such\nAFP control file. as OMR marks) and create new barcodes\nfor insertion.\nPrint phase\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:14 PM AFP workflows for the Inserter feature - Jenski - Test portal- RPD Linux\nStep template Required Brief description Notes\nUseInlineFormDefinition No (see Notes) Use an inline form definition if This step is required if jobs contain inline\none exists. form definitions even if this step is also in\nthe original workflow.\nEnableRepositioning Yes Map logical pages to physical\nsheets.\nCreatePageRanges Yes Enable reprinting of a portion of\nthe job.\nPrintJobs Yes Send the job to the printer.\nInsert phase\nWriteInserterControlFile No (see Notes) Write an inserter control file for This step is required for file-based\nthe job. inserters.\nIf the inserter operator loads jobs before\nthey have finished printing, move the\nWriteInserterControlFile and\nSendInserterControlFile step before the\nPrintJobs step.\nSendInserterControlFile No (see Notes) Send the inserter control file to This step is required for file-based\nthe inserter controller. inserters.\nInsertJobs Yes Process the job for insertion. Select the inserter controller in this step.\nAlso, specify the inserter job name if it is\ndifferent from the RICOH ProcessDirector\njob number.\nReconcile Yes Determine which documents to Select manual or automatic reconciliation\nreprint. in this step. Also, select the printer to\nreprint any documents that are damaged\nafter insertion.\nCreateInserterReprints Yes Reprint documents in the same\njob (closed-loop reprint method),\nor create a child job that\ncontains the documents to be\nreprinted (open-loop reprint\nmethod).\nComplete phase\nRetainCompletedJobs No Keep the job in the system for\nthe specified retention period.\nRemoveJobs Yes Remove the job from the system.\nParent topic: Configuring the system to use inserters\n3 of 3"}]}