{"doc_name": "aiwacustomdevicesview.pdf", "doc_path": "data/raw/RPD-en-US/aiwacustomdevicesview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2218, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Customizing the Input Devices portlet - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Input devices / Customizing the Input Devices portlet\nCustomizing the Input Devices portlet\nYou can change the Input Devices portlet so it shows only the input devices that you work with frequently. You can also sort the devices\naccording to their properties and change the order in which the properties are displayed.\nTo customize the portlet:\n1. Optional: If the star ( ) icon in the header row of the table is blue, click it.\nThe star turns gray and the portlet shows all the devices that are defined in the system.\n2. Select the devices that you want to include in your list of favorites:\nTo include a device in your favorites list, click the gray star next to that device. It turns blue.\nTo remove a device from your favorites list, click the blue star next to the device. It turns gray.\n3. Sort the list of devices:\nClick a column heading to sort the devices in ascending order according to that column. Click the column heading again to sort the\ndevices in descending order.\n4. Reorder the properties displayed for the devices:\nTo change the order of the properties, click a column heading, drag it to a different position, and release the mouse button.\n5. To see only your favorite devices, click the star in the header row of the table.\n6. To change the properties that are displayed for each device:\n1. At the top right of the Input Devices portlet, click Settings ( ) and select Manage Columns.\n2. To add columns to the table, select the check box next to the property name.\n3. To remove columns from the table, clear the check box next to property name.\n4. To change the order of table columns using the mouse, select a property name and drag it to a new location. To reorder a selected\nproperty name using the keyboard, use the controls to the right of the name to move it to a new location.\nTo move the property name up one row, click .\nTo move the property name to the top of the list, click .\nTo move the property name down one row, click .\nTo move the property name to the bottom of the list, click .\n5. To save your changes, click OK.\nParent topic: Input devices\n1 of 1"}]}