{"doc_name": "pdfw_c_plugin_controlfiledef.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_controlfiledef.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2955, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Control files - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / PDF Document Support / RICOH ProcessDirector Plug-in for Adobe Acrobat\n/ Control files\nControl files\nA control file saves your page group definition, document properties, conditional triggers, and markup independently of a PDF source file.\nControl files are templates that RICOH ProcessDirector uses to apply the same markup rules to the PDF files it processes.\nNote:\nSaving your PDF source file by clicking File ⇒ Save or File ⇒ Save As does not save your RICOH ProcessDirector Plug-in for Adobe Acrobat\npage groups, document properties, or markup.\nTo use the RICOH ProcessDirector IdentifyPDFDocuments step in a PDF workflow, you must add the RICOH ProcessDirector Plug-in for Adobe\nAcrobat control file that defines page groups or document properties for that step. Any markup definition must be saved to one or more control\nfiles that are used by the RICOH ProcessDirector BuildPDFFromDocuments step.\nYou do not need to create separate control files for the page group, document properties, and markup definitions: all definitions can be saved in\none control file if that control file is added to both the IdentifyPDFDocuments and the BuildPDFFromDocuments steps. However, you might\nchoose to create multiple control files if you can apply one or more control files to different PDF workflows. For example each workflow might\nrequire its own document properties, but some workflows might require the same area to be hidden to cover OMR marks. For each workflow\nyou would save a separate control file that defines document properties, but save only one control file to hide OMR marks. In each workflow,\nyou would specify the workflow-specific control file that defines document properties. But in the step in each workflow that is based on the\nBuildPDFFromDocuments step template, you would specify the same control file that contains the hidden-area definition.\nNote:\nThe IdentifyPDFDocuments step uses one control file to create page groups and extract document properties. The\nBuildPDFFromDocuments step optionally uses one or more control files to apply markup and restructure a PDF file. (\nBuildPDFFromDocuments does not require a control file.) In order to preview markup, you must define a page group and the document\nproperty definitions whose values you use in markup content. If you save a page group or property definition to a control file that you\nadd to the BuildPDFFromDocuments step, RICOH ProcessDirector ignores those definitions. The BuildPDFFromDocuments step receives\npage grouping and document properties definitions from a workflow that includes the IdentifyPDFDocuments step.\nSee the help topics on RICOH ProcessDirector Plug-in for Adobe Acrobat control files and previewing markup for more information.\nParent topic: RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}