{"doc_name": "pdfw_t_plugin_hidearea.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_hidearea.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3371, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Hiding an area in a PDF file - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Adding markup to a PDF file\n/ Hiding an area in a PDF file\nHiding an area in a PDF file\nYou can hide an area of a PDF file by defining a cover block to keep an area on a page from being shown or printed when you process a\nproduction PDF file in RICOH ProcessDirector. You can limit the placement of a hidden area to specific pages in each page group by specifying a\nrule or typing page numbers.\nTypically you hide areas of a PDF file that contain images, text, barcodes, or other types of optical marks that are no longer needed. For example,\nif you want to replace an existing optical mark with a smaller Datamatrix barcode, you draw a box over the area that contains the old marks to\nhide them. You then place a new Datamatrix barcode on top of the hidden area. When RICOH ProcessDirector processes a PDF file with a hidden\narea, it blocks that area from having any ink applied, so the hidden area is the same color as the print media. When RICOH ProcessDirector\napplies markup to a PDF file, the BuildPDFFromDocuments step applies all hidden areas before applying other markup.\nTo hide an area:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains a page group or define a page group.\n2. Use the left mouse button to draw a box around the area of the PDF file that you want to hide.\n3. Click Hide Area.\n4. Optional: Use the Location section of the definition window to change the placement and size of the hidden area. The Horizontal and\nVertical coordinates specify the distance between the top left corner of the page and the top left corner of the hidden area. The Width and\nHeight specify the size of the hidden area.\n5. Type a Name for the hidden area. Do not use spaces or special characters (such as @, #, $, or %). You can use periods and underscores.\n6. Use the Placement Conditions section to specify the pages to place the hidden area on. Do either of these:\nSelect Pages based on a rule, and then select a rule from the drop-down list. The default rule is All Pages. You can also:\nClick the icon to define a new rule.\nClick the icon to go to the Rules Manager.\nSelect Specify pages and type the pages in each page group that you want. You can:\nUse a hyphen to separate the first and last pages in a page range.\nUse a comma to separate page selections.\nType n to specify the last page.\nExample: a PDF file has two page groups. The first has four pages, and the second has seven pages. Specifying pages 3–n places\nmarkup on pages 3–4 in the first page group, and pages 3–7 in the second.\n7. Click OK to create the hidden area definition.\n8. Click Ricoh ⇒ Preview to verify the hidden area has the page placement you intended.\n9. Optional: You can edit the hidden area definition by double-clicking the hidden area box or by right-clicking the box and selecting Edit.\n10. When you are ready to save all your enhancements to the PDF file, including the new hidden area definition, click Ricoh ⇒ Save Control\nFile.\n11. In the RICOH ProcessDirector BuildPDFFromDocuments step, specify the name and location of the control file that contains the hidden area\ndefinition.\nParent topic: Adding markup to a PDF file\n1 of 1"}]}