{"doc_name": "ConfiguringHeaderForInsertion.pdf", "doc_path": "data/raw/RPD-en-US/ConfiguringHeaderForInsertion.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2299, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Configuring banner pages for insertion - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Enhancing files for insertion / Configuring banner pages for insertion\nConfiguring banner pages for insertion\nYou can configure the banner pages for jobs to print the values of RICOH ProcessDirector properties related to insertion.\nFor example, on the job header page you want to print the name of the inserter that the operator loads the job on and the names of the\nmaterial to load in each inserter bin. These values are contained in inserter job properties.\nProperties related to insertion for job header and trailer pages lists some job properties related to insertion that you can include in banner\npages.\nProperties related to insertion for job header and trailer pages\nProperty (field\nname) Property (database name) Description\nInserter job name Job.Inserter.JobID The name that the inserter uses for the job. The default value is the\nRICOH ProcessDirector job number.\nInserter controller Job.InserterSystem.ID The name of the inserter controller object associated with the job.\nInserter name Job.Inserter.ID The name of the inserter for the job.\nLoad plan Job.Insert.LoadPlan.ID The name of the load plan associated with the job.\nLoad plan Job.Insert.LoadPlan.Comment The number of inserter bins followed by a list of the names of the\ncomment materials in the load plan that the operator should load into each\ninserter bin.\nYou can include the values of many other properties on banner pages in addition to the properties listed in the table. The banner page property\nconfiguration files, installed in /aiw/aiw1/control_files/banner_pages/, define the job properties, printer properties, and system settings\nthat you can include on banner pages. You can edit these files to add other properties.\nFor AFP jobs, edit the banner_page_property_values.cfg file.\nFor information about updating properties for AFP banner pages, see the RICOH ProcessDirector information center.\nFor PDF jobs, edit the header.jrxml and trailer.jrxml files.\nTo include inserter job properties (such as Job.Inserter.JobID) on banner pages, you add the properties to the banner page property configuration\nfile.\nParent topic: Enhancing files for insertion\n1 of 1"}]}