{"doc_name": "aiw_fusionpro_configconnection.pdf", "doc_path": "data/raw/RPD-en-US/aiw_fusionpro_configconnection.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1824, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Configuring RICOH ProcessDirector to work with FusionPro - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the FusionPro Connect feature / Configuring RICOH ProcessDirector to work with FusionPro\nConfiguring RICOH ProcessDirector to work with FusionPro\nTo work with FusionPro, you must connect RICOH ProcessDirector to FusionPro Server which is the composition engine that lets you create print\nfiles based on the input data files. To send the files to FusionPro Server, you can add the RunFusionPro step template to a workflow.\nBefore configuring the connection to FusionPro from RICOH ProcessDirector:\nYou must install a RICOH ProcessDirector application server feature on the machine where FusionPro is installed.\nSet the application server to run as a service on the machine where FusionPro is installed. The FusionPro service must run under the same user\nas the RICOH ProcessDirector application server.\nTo configure RICOH ProcessDirector to work with FusionPro:\n1. Log in to RICOH ProcessDirector.\n2. Click the Administration tab.\n3. In the left pane, click Settings ⇒ FusionPro Connect.\n4. Under FusionPro system, select the application server where FusionPro is installed. If you have not yet created the application server object,\nclick the plus sign ( ) to add it.\nNote:\nWhen creating the application server, set the value of the In general server pool property to No.\n5. Click Get templates to retrieve all templates available on FusionPro Server.\nThe FusionPro templates table displays all available templates and template groups.\nNote:\nIf there are any changes that might affect the connection to the machine where the application server is installed, you must reconfigure\nthe connection to the FusionPro server.\nParent topic: Setting up the FusionPro Connect feature\n1 of 1"}]}