{"doc_name": "aiwdoc_i_t_reactivate.pdf", "doc_path": "data/raw/RPD-en-US/aiwdoc_i_t_reactivate.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2612, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Updating custom document properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Updating custom document properties\nUpdating custom document properties\nWhenever you define new custom document properties or name custom document properties in more than one language, you update custom\ndocument properties to make your changes available to RICOH ProcessDirector.\nNote:\nOnly use this procedure for custom document properties defined in the docCustomDefinitions.xml file. If you created custom\nproperties using the Administration tab, this procedure is not required.\nBefore doing this task, verify that the syntax in the docCustomDefinitions.xml file is correct.\nTo update custom document properties:\n1. Log in to the primary server as the RICOH ProcessDirector system user.\nFor Linux, aiw1 is the default.\nFor Windows, log in to the Administrator account.\n2. Open a command line.\n3. Change directories.\nFor Linux, use cd /aiw/aiw1/bin.\nFor Windows, use cd C:\\aiw\\aiw1\\bin.\n4. Enter this command to run the utility:\ndocCustom\nThe Custom Document Properties feature EPK file is created and available in the Feature Manager.\n5. Close the command line.\n6. Log in to RICOH ProcessDirector.\n7. Click the Administration tab.\n8. In the left pane, click Utilities ⇒ Features.\n9. Select the check box for the Custom Document Properties feature.\n10. In the Available versions column for each feature, select the version of the feature you want to install.\n11. Click Install.\n12. Review the information in the confirmation window, then click OK to continue.\nThe features are installed, then RICOH ProcessDirector is restarted to finish the install process.\n13. Click DISMISS to close the Feature Manager browser tab.\n14. Check that your new document properties are defined on the system:\n1. Log in to RICOH ProcessDirector.\n2. In the Documents portlet on the Main page, click By property.\n3. Click the Edit ( ) button.\n4. Scroll through the Property list to see if it includes your new properties.\nIf you have the PDF Document Support feature installed and you change document property names in RICOH ProcessDirector, load a new\ndocument properties list into RICOH ProcessDirector Plug-in for Adobe Acrobat.\nIf you have the AFP Support feature installed and you change document property names in RICOH ProcessDirector, access RICOH Visual\nWorkbench from the RICOH ProcessDirector user interface. New document properties are loaded to RICOH Visual Workbench when it opens on\nyour workstation.\nParent topic: Configuring document processing features\n1 of 1"}]}