{"doc_name": "mail_c_extractdocprops.pdf", "doc_path": "data/raw/RPD-en-US/mail_c_extractdocprops.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4567, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Extracting document properties for use with other programs - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Postal Enablement / Extracting document properties for use with other programs\nExtracting document properties for use with other programs\nWhen you use document processing features, documents inside your print jobs are given property values in addition to the properties that apply\nto the job as a whole. Document properties can include: number of pages in a document, name of the recipient, and account number among\nmany others. You can also define your own document properties that suit your requirements for accounting or other tracking purposes.\nDocument property values can be collected and extracted so you can use them outside of your print workflow system. In addition, document\nproperty values can be returned to the system so they can be used by later steps in the workflow.\nNote: The Postal Enablement feature uses this process to extract document properties so they can be sent to external postal software and\nreturned to RICOH ProcessDirector. Examples below refer to Postal Enablement, but this function can be used to collect document property\nvalues for other purposes as well.\nDocument property processing flow\nDocument property processing flow shows the steps that you can use to identify and extract the document properties for a job, along with\nthe files that are used and produced by each step. Use these steps in this order:\nIdentifyDocuments or IdentifyPDFDocuments\nThese steps create the document properties file using a control file as a guide. For AFP jobs, the step uses the Visual Workbench control file; for\nPDF jobs, the step uses the Identify PDF control file.\nThe step places the document properties file in the job’s spool directory with the name jobid.original.dpf.\nWriteDocumentsToDatabase\nThis step reads the jobid.original.dpf and records the document property values in the database. It also makes a copy of the file, renames it\nto jobid.document.dpf, and places the file in the job’s spool directory.\nBuildExternalDocPropsFile\nThis step reads the jobid.document.dpf and builds a new text file, called the external document properties file. You can specify which\nproperties to include in the external document properties file and some basic formatting information.\nFor example, if you are using the Postal Enablement feature, you might want to extract address information for each document and send it to\nTECMailing’s MailPreparer software for address cleansing. As input, MailPreparer accepts a text file in comma-separated value (CSV) format.\nThat file can include a header row which lists the MailPreparer names for each property. Each row after that includes the document property\nvalues that correspond to those properties. You can configure the step to create the external document properties file in that format.\nWhen the step runs, it creates the external document properties file with the name that you specify. You can use this file as input for another\nprogram (such as MailPreparer) or you can use the file in other tasks outside the print workflow.\nTo import document property values and update them in the database so that other steps in the workflow can use them, use these steps in this\norder:\nMapExternalResultsFileToDocProps\nThis step receives a file called the external results file and interprets it, mapping the contents to RICOH ProcessDirector document properties.\nThe external results file can be in tab-delimited or CSV format.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM Extracting document properties for use with other programs - Jenski - Test portal- RPD Linux\nThe step can be configured to retain and map all of the information in the external results file or to retain and map select values. For example,\nthe external results file returned by MailPreparer contains over 80 values for each document. Your print workflow might only require 15 of\nthem. You can configure the step to retain and map the 15 values required and ignore the rest of them.\nThe result of this step is a modified results file. You can specify the file name and the directory that the file is stored in. This file is used as input\nfor the UpdateDocPropsFromExtResultsFile step.\nUpdateDocPropsFromExtResultsFile\nThis step reads the modified results file and updates the document properties file (jobid.document.dpf) in the job’s spool directory. Other\nsteps in the workflow can now make use of the updated property values.\nParent topic: Postal Enablement\n2 of 2"}]}