{"doc_name": "aiwcstextstepnothot.pdf", "doc_path": "data/raw/RPD-en-US/aiwcstextstepnothot.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6761, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Setting up step templates for external steps that use the command line or control files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / External steps / Setting up step templates for external steps\n/ Setting up step templates for external steps that use the command line or control files\nSetting up step templates for external steps that use the command line or control files\nUse this process to set up a step template for external steps that use the command line or a control file to pass parameters between RICOH\nProcessDirector and the external program.\nTo set up a step template for an external step:\n1. Click the Workflow tab.\n2. In the left pane, click Step templates.\n3. Right-click the RunExternalProgram step template and select Copy.\n4. Specify a name and description for the new step template.\n5. Click External.\n6. Update the External command property.\nThis is the actual command and any command-line parameters that RICOH ProcessDirector issues to run the external program. The\ncommand string can include RICOH ProcessDirector symbol notation:\nIn this example, the Linux cp command only copies the JobNumber.print.pdf file from the spool directory for the job when the source\nfile is newer than the destination file:\ncp -u ${getAbsoluteFileName(print, pdf, read)} /tmp/jobarchives\nNote:\n${getAbsoluteFileName(print, pdf, read)} is the RICOH ProcessDirector symbol formula that returns the name of the PDF print file\nin the spool directory. If the PDF print file does not exist in the spool directory when the external program runs, an error occurs.\nIn this example, the external program myprogram reads the JobNumber.print.pdf file from the spool directory and writes an updated\nversion of the file to the spool directory using redirection:\nmyprogram -i ${getFileName(print, pdf, read)} > ${getFileName(print, pdf, write)}\nNote:\n${getFileName(print, pdf, read)} is the RICOH ProcessDirector symbol formula that returns the name of the PDF print file in the\nspool directory. If the PDF print file does not exist in the spool directory when the external program runs, RICOH ProcessDirector\nreturns the name of the input file for the job, which is JobNumber.print.unknown. If that file does not exist in the spool\ndirectory, an error occurs.\nIn this example, the external program auditstatistics reads the JobNumber.overrides.text file from the spool directory and writes a new\nstatistics file JobNumber.statistics.text to the spool directory:\nauditstatistics inputfile=${getFileName(overrides, text, read)}\noutputfile=${getFileName(statistics, text, write)}\nIn this example, the external program line2afp uses a separate parameter file for which a corresponding RICOH ProcessDirector control\nfile exists if the AFP Support feature is installed. The control file specifies a RICOH ProcessDirector method that instructs the external\nprogram to write its output to the spool directory:\nline2afp parmdd=${getControlFileName()}\nNote:\n${getControlFileName()} is the RICOH ProcessDirector symbol formula that returns the name of the resolved control file. RICOH\nProcessDirector generates the control file from the control file template that you specify.\nThe control file can use the getChildFileName method to return the name of a child file so that the external program can write a\nfile to the children subdirectory in the spool directory. The external program must write the file names of child-job files in this\nformat:\nJobNumber.UsageType.DataType.n,Job.JobType=WorkflowName\nWorkflowName is the name of the workflow that the child job requires. The workflow must exist and it must be enabled.\nWhen you add a step based on the RunExternalProgram step template to a workflow, the properties that show [Receive] in the\njob defaults change to reflect the actual phase to which you add the step.\nIn this example, the external step uses the Windows copy command to write a copy of the JobNumber.print.pdf file from the spool\ndirectory to an archive directory on the Windows system:\ncopy ${getAbsoluteFileName(print,pdf,read)} d:\\archive\\pdf\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Setting up step templates for external steps that use the command line or control files - Jenski - Test portal- RPD Linux\nNote:\nThe Windows system must have either the base product or an application server installed. The application server must be\nconnected to the primary server.\nSpecify the Windows directory by using the native Windows format for the directory name.\nUse native Windows commands instead of SFU commands where appropriate; for example, use the copy command instead of the\ncp command. Not all SFU commands are available on Windows systems.\nDepending on the command, a directory on the Windows system might not need to exist. The command can create the directory\non the Windows system.\nMake sure that you tune the step template to only run on a Windows application server. Because of the different formats for\ndirectory names on Linux, a step based on this step template will fail if RICOH ProcessDirector tries to run the step on a non-\nWindows system.\n7. If you created a control file template for use with the external program, update the External control file template property. Set the value to\nthe directory location and name of the control file template. If the external program only receives its parameters as command line\narguments, delete any value for this property.\n8. Update the Valid return codes property.\nIn this context, a valid return code is any return code from the external program that does not require a user action. Separate multiple\nreturn-code numbers with commas. For any return code from the external program that the value for this property does not include,\nRICOH ProcessDirector moves the job to the error state. It also issues a message in the log for the job to alert you to a problem that the\nexternal program reported.\nFor example, if the value of the valid-return-codes property is 0,4, and the external program finishes with a return code of 16, RICOH\nProcessDirector issues a message similar to this:\nAIWI6073E External step cp /aiw/aiw1/spool/default/10000016/10000016.print.unknown /archive/directory finished with a return code of\n16, which is a defined as an error.\n9. If the installation has specific language requirements, you can also instruct the external program to return messages in a language that it\nsupports. The list for the External program language property lists the languages that RICOH ProcessDirector supports.\n10. Click OK.\n11. Update any settings on the Tuning tab to run the step on the computers where the external program is installed.\n12. Right-click the new step template and select Enable .\nParent topic: Setting up step templates for external steps\n2 of 2"}]}