{"doc_name": "aiw00c31.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c31.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3759, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Changing the appearance of AFP banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / AFP banner pages / Changing the appearance of AFP banner pages\nChanging the appearance of AFP banner pages\nAfter an AFP printer is set up to print banner pages, each job must specify what the banner page for the job should look like. A control file\ndefines the appearance of the banner page. The control file might be set by the workflow, but you can change the banner-page control file for\nan individual job after it is in the system.\nRICOH ProcessDirector provides twelve control files for various types of AFP banner pages. The set of control files includes one configuration file\nfor each type of banner page: header, separator, and trailer. It also includes control files for four printer hardware configurations: generic, narrow\nformat, wide format, and impact printer.\nThe control files are installed in /aiw/aiw1/samples/banner_pages/ on the primary computer. They use AFP coded fonts that RICOH\nProcessDirector provides. You can use the control files as they are or you can change them to meet your needs.\nNote: RICOH ProcessDirector also lets you specify your own coded fonts for use with AFP banner pages. If you want to use your own\ncoded fonts, review the information in the related task about mapping coded fonts before you do this procedure.\nTo change the appearance of AFP banner pages:\n1. Log in to the primary computer as the RICOH ProcessDirector system user ( aiw1 is the default).\n2. Navigate to /aiw/aiw1/samples/banner_pages/.\n3. Determine the control file that you want to edit and copy it to the /aiw/aiw1/control_files/banner_pages/ directory.\nNote: Updates might overwrite files in the /aiw/aiw1/samples/banner_pages/ directory, but they do not overwrite files in the\n/aiw/aiw1/control_files/banner_pages/ directory. We recommend copying sample files into the\n/aiw/aiw1/control_files/banner_pages/ directory and making all your changes in the copied file.\n4. Open the copied control file with a text editor.\nLines that begin with an asterisk (*) are comments that contain information and instructions. Lines that control the information that prints\non the banner page and the placement of the information use this format:\nFieldX FieldName;FieldType;[TicketKey];CodedFontForSingleByteChars;\nCodedFontForDoubleByteChars;InchesFromLeft;InchesFromTop;Rotation\nAll fields of the line that follow the field identifier are separated by semicolons (;). You cannot omit any of the fields in the line, except for\nthe CodedFontForDoubleByteChars field.\nThese are examples of various banner page entries for banner page text strings and values:\nField304 Customer;JobTicketField;[Job.CustomerName.NameAndValue];X0CR5M;XZE26F; 4.50;4.234375;0\nor\nField304 Customer;JobTicketField;[Job.CustomerName.NameAndValue];X0PCLR12;; 4.50;4.234375;0\nField402 PrintDate;ExitData;ExtDate;X0CR5M;XZE26F;2.250;6.34375;0\nField510 Dept1234;Literal;Department 1234 statistics;X0CR5M;XZE26F;2.55;2.234375;0\nNote: You can also include barcodes on banner pages for properties that have numeric values. Because the format of barcode\nentries in the control file is different, specifying barcodes on AFP banner pages is a separate task. See the related task links.\n5. Save the modified control file.\nNow, you can set the Header page configuration file, Trailer page configuration file, or Separator page configuration file property on a workflow\nor on an individual job to refer to the control file that you created or edited:\nOn a workflow, these properties are set by the PrintJobs step\nOn an individual job, these properties are set on the Banner Pages tab of the properties notebook for the job\nParent topic: AFP banner pages\n1 of 1"}]}