{"doc_name": "fusionpro_featov.pdf", "doc_path": "data/raw/RPD-en-US/fusionpro_featov.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1797, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM FusionPro Connect - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Integration features / FusionPro Connect\nFusionPro Connect\nThe FusionPro Connect feature lets you use FusionPro to compose documents based on predefined templates. FusionPro Connect uses FusionPro\nServer to process the records in a data file in the format you select.\nThis feature adds the RunFusionPro step template to the list of supplied step templates. When configured correctly, the step template produces\nprint files from any supported data file using the FusionPro composition engine.\nThe FusionPro Connect feature lets you select different templates for the composition of the output file. The templates are first created or\nuploaded in FusionPro and then made available in RICOH ProcessDirector. You can also include an imposition template created with FusionPro\nImposer which can help you arrange multiple pages on a sheet.\nWorking simulation\nFusionPro Connect provides a sample workflow called FusionProSample, a sample hot folder input device, and a sample FusionPro template. If\nyou connect RICOH ProcessDirector to your FusionPro Server, you can load the sample template and run the sample workflow.\nWhen you enable the sample input device, a sample CSV file is submitted to the workflow. The workflow sends the CSV file to FusionPro Server.\nThe FusionPro server processes the CSV file and composes the file into a PDF file, using the options set in the RunFusionPro step in that\nworkflow.\nSystem configuration\nTo work with RICOH ProcessDirector for Linux, FusionPro Connect must be installed on a computer running Windows Server 2019 or Windows\nServer 2022 that is configured as a RICOH ProcessDirector application server.\nParent topic: Integration features\n1 of 1"}]}