{"doc_name": "cac_CMRTypes.pdf", "doc_path": "data/raw/RPD-en-US/cac_CMRTypes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2001, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Types of CMRs - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Color Management Resources / Types of CMRs\nTypes of CMRs\nDifferent situations call for different types of CMRs. Some CMRs are created by product manufacturers so you can download and use them,\nwhile others are created by your printer or other color management software. If you have the appropriate information, you can also create CMRs\nyourself.\nSome CMRs are used to interpret input files (similar to the function performed by ICC input profiles), while others are used to prepare the final\nprint job output for a specific printer (similar to the function performed by ICC output profiles).\nIn this section:\nColor Conversion CMRs\nColor conversion (CC) CMRs are used to convert colors to and from the ICC profile connection space (PCS), a device-independent color space.\nYou can use them to prepare images for color or grayscale printing.\nLink Color Conversion CMRs\nLink color conversion CMRs combine the processing information required to convert an image directly from the color space of an input device to\nthe color space of the output device. Essentially, link color conversion CMRs replace a pair of color conversion CMRs.\nHalftone CMRs\nHalftone (HT) CMRs carry the information that a printer uses to convert print jobs into a pattern of dots that it can put on paper. Halftone CMRs\ncan be used with both color and grayscale print jobs.\nIndexed CMRs\nIndexed (IX) CMRs map indexed colors in the data to presentation device colors or colorant combinations.\nTone Transfer Curve CMRs\nTone transfer curve (TTC) CMRs are used to carry tone transfer curve information for an AFP print job, so you can modify the values of a\nparticular color component and adjust the appearance of some of the colors by increasing or decreasing the amount of ink used to emphasize or\nreduce the effects of dot gain on the final output.\nParent topic: Color Management Resources\n1 of 1"}]}