{"doc_name": "aiw_c_addingsteps_decryptPDF.pdf", "doc_path": "data/raw/RPD-en-US/aiw_c_addingsteps_decryptPDF.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1926, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Adding steps to decrypt PDF files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Adding steps to decrypt PDF files\nAdding steps to decrypt PDF files\nWhen RICOH ProcessDirector receives an encrypted PDF file, the file must be decrypted before it can be processed.\nFor example, add a step at the beginning of your workflow to process password-protected PDF files.\nTo add steps to decrypt PDF files:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name. If you do not disable the workflow while you edit\nit, jobs that use this workflow continue to move through steps. When you save, the workflow is momentarily disabled then enabled again.\nJobs that are processing in the workflow could move into error.\n4. Add a step based on the DecryptPDF step template to process the encrypted PDF files.\nAdd the step before the first step in the workflow that opens the PDF file to prevent any processing errors. Most workflow steps cannot\nprocess encrypted PDF files.\n5. In the Decryption password field, enter the password that was used when the PDF file was encrypted.\nIf the password changes with every job, provide a way for the operator to enter the password for each job. You can add a manual step to\nthe workflow before the DecryptPDF step and give it a name like EnterDecryptPassword. During processing, the job stops at that step. The\noperator opens the job property notebook and enters the Decryption password on the Decrypt PDF tab. Then the operator completes the\nmanual step so the password is available when the DecryptPDF step runs.\n6. Verify the location of the output file. By default, the decrypted PDF file becomes the print file in the spool directory of the job.\n7. Save and enable the workflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}