{"doc_name": "creatingpagegroups.pdf", "doc_path": "data/raw/RPD-en-US/creatingpagegroups.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6765, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating page groups with triggers - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating page groups\n/ Creating page groups with triggers\nCreating page groups with triggers\nYou can create page groups by defining one or more triggers. A trigger is a block of text that occurs in a consistent location on the first or last\npage of all page groups.\nYou define the start of each page group with a trigger. As an option, you can also define the last page of a page group with a trigger.\nLook through the sample AFP file to determine what text you want to use as the trigger to define page groups. The text must be in the same\nlocation on each page that you want to identify as a boundary for the page groups. The text can also have the same value on each page. For\nexample, you might select the customer's name, which appears in the same location on the first page of all customer statements. The name can\nbe used as a trigger to define the boundary of the page group if the next pages of the customer statements do not contain any text in the\nselected text block location. Keep in mind that the boundary is defined only when the text block cannot be found in the selected location, or the\nexact text block string cannot be found in the selected location.\nYou can create one or more triggers. AFP Indexer creates a page group if it finds all the triggers.\nNote:\n1. Some AFP files might be formatted so that two pages print side-by-side on the same physical sheet and are later cut into two\nseparate stacks. You cannot use AFP Indexer to define page groups in files such as these because a single sheet can belong to only\none page group. You cannot define two triggers that cause the left and right sides of the sheet to belong to different page groups.\n2. In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View\n⇒ Units.\nTo create page groups with triggers:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. Click the text that you want to use to mark the page group boundaries in the file.\nYou see a red box around the text you selected.\nThe text blocks you can select are defined in the AFP file, from one character to the entire line of text. For example, the text “Account\nSummary” might be defined as two text blocks. You can click either the “Account” or “Summary” text block to create a trigger.\n3. Right-click the text and click Create Trigger.\nYou might see a message that says the page groups might change or the index tags might be invalid and asks if you want to continue.\nClick Yes.\nYou see the Create Trigger window with the selected text in the Edited trigger field.\nNote:\nYou might need to use the scroll arrows to see the text in the Edited trigger field.\n4. Decide whether you want to use the entire text value as the page-group trigger or only part of the text. You can edit the text value to\nreduce the number of characters you use for the trigger value. To select part of the text as the trigger:\n1. Click Edit trigger.\n2. Edit the trigger value in the Edit Value window.\nFor example, if the page number is one text block, Page 1 of 4, you can create a trigger with the part of the page number that occurs\non the first page of each page group, such as Page 1. You would not use of 4 because not all page groups are 4 pages long–the first\npage of some page groups might contain text Page 1 of 2 or Page 1 of 3.\n3. Click OK.\n5. Select a trigger type:\nStart page group\nThe text block marks the start of the page group boundaries in the file. This trigger type is required.\nEnd page group\nThe text block marks the end of the page group boundaries in the file. This trigger type is optional.\nYou might see these trigger types; however, they are not used to create page groups:\nPage\nThe text block marks an individual page in a page group. See Creating page-level triggers.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating page groups with triggers - Jenski - Test portal- RPD Linux\nSupplemental page\nThe text block marks an individual page as a supplemental page. See Creating triggers for supplemental pages.\n6. Click the Advanced tab to change the text threshold, the method for matching the trigger, or both:\nSelect a range from 1/100 to 1 inch or from 1 to 25 millimeters for the text threshold. Although text might appear to be present in the\nsame location, slight position variations can occur in the AFP file. You can change the threshold to look for trigger text that is in slightly\ndifferent positions on some pages. The threshold defines how far the text can be from the original location and be considered a trigger.\nFor example, a threshold value of 12 indicates that the trigger can be located within .12 of an inch or 12 millimeters, either vertically or\nhorizontally. Usually the default threshold value is sufficient (10 for inches or 2 for millimeters).\nSelect the method used to match the trigger–on the trigger string value and the text block position, or on the position only:\nOn string and X,Y position\nThe trigger string value and horizontal and vertical position of the text block are matched. This is the default.\nOn string and X position\nThe trigger string value and horizontal position of the text block are matched.\nOn string and Y position\nThe trigger string value and vertical position of the text block are matched.\nOn X,Y position only\nThe horizontal and vertical position of the text block is matched.\n1. Select Trigger on string value changing to activate the trigger when the value changes from the value in the field where the trigger\nwas first defined.\n2. After you select Trigger on string value changing, select Trigger on any change in string to activate the trigger when the value\nchanges from any previous value in the field.\n7. Click OK.\nIn the left pane and in the bottom pane, you see the page groups that have been defined based on the trigger value. You also see the\npages that are included in each page group.\n8. Verify that the correct page groups have been created:\n1. Check that the number of pages is correct in each page group.\n2. Select page groups in the left pane to see the first page in a few of the page groups and verify that the correct boundaries were\ncreated.\n3. If the page groups are incorrect, click Tools ⇒ Modify Definitions to modify or delete the trigger.\nThe trigger is listed as a Page Group Definition under Start Page Group Triggers or End Page Group Triggers.\n9. Optional: To create an additional trigger, repeat the steps.\nMake sure you select the text for the trigger from the same page group as the initial trigger.\nParent topic: Creating page groups\n2 of 2"}]}