{"doc_name": "aiw_o_xml_scen_orders.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_xml_scen_orders.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 13293, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Usage scenario for processing orders in an XML file - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Jobs with XML files / Usage scenario for processing orders in an XML file\nUsage scenario for processing orders in an XML file\nIn this scenario, a printing company wants to process orders in XML files received from web-to-print sellers. Each XML file contains multiple\norders, and each order can include both print and promotional items, such as coffee mugs and baseball caps.\nIn this scenario, the RICOH ProcessDirector administrator uses a third-party tool (such as Altova MapForce) to create Extensible Stylesheet\nLanguage Transformations (XSLT) style sheets. For examples of XML input files, XPath expressions, XSLT style sheets, and RICOH ProcessDirector\noverrides files that work with this scenario, see the related reference.\nReviewing and preparing to process the XML\nThe RICOH ProcessDirector administrator reviews the contents of the XML files and decides how to process them.\n1. First the administrator identifies the XML elements that supply values for RICOH ProcessDirector job properties.\nIn the example XML input file, two XML elements supply information required to track each item in an order. The number attribute of the\norder element and the customername element supply the order number and customer name.\nFor print items, the printfile element supplies the URL of the PDF file to download and print.\nFor promotional items, the number attribute of the stock element supplies the location of the item in the warehouse.\nFor all items, the quantity element supplies the quantity ordered.\nThis table shows these five XML elements and the names of the corresponding RICOH ProcessDirector job properties.\nXML element Database name of job property User interface name of job property\n<order number> Job.Info.Attr1 Custom 1\n<customername> Job.CustomerName Customer name\n<printfile> Job.DownloadFile URL for download file\n<stock number> Job.Info.Attr2 Custom 2\n<quantity> Job.Copies Job copies requested\n2. The administrator breaks the process into five parts:\nCreate a separate XML job for each order.\nAssign the order values (order number and customername) to job properties.\nFrom each order, create a separate XML job for each item.\nAssign the item values (printfile, stock number, and quantity) to job properties.\nProcess print items and stock items in separate workflows.\n3. The administrator decides to define four workflows:\nThe ExtractOrdersFromXML workflow receives orders and makes separate jobs for each order.\nThe SplitOrderIntoPrintAndStockJobs workflow separates the items in each order into print and stock jobs.\nThe ProcessPrintJobs workflow processes print jobs.\nThe ProcessStockJobs workflow processes stock jobs.\nA step based on the CreateJobsFromXML step template creates jobs from elements in an XML file that match an XPath expression. The\nstep submits the jobs to a workflow.\n4. The administrator decides to use three CreateJobsFromXML steps, each with a different XML Path Language (XPath) expression:\nThe first step creates a separate XML job for each order.\nThe Order Jobs expression identifies the XML elements that match orders: /seller/order\nThe second step creates a separate XML job for each print item.\nThe Print Jobs expression identifies the XML elements that match print items: /order/item/printfile/ancestor::item\nThe third step creates a separate XML job for each promotional item.\nThe Stock Jobs expression identifies the XML elements that match promotional items: /order/item/stock/ancestor::item\nThe administrator assigns the CreateJobsFromXML steps to workflows:\nThe first step goes in the ExtractOrdersFromXML workflow. The step submits the XML jobs for each order to the\nSplitOrderIntoPrintAndStockJobs workflow.\nThe second and third steps go in the SplitOrderIntoPrintAndStockJobs workflow. The second step submits XML jobs for print items to the\nProcessPrintJobs workflow. The third step submits XML jobs for promotional items to the ProcessStockJobs workflow.\nA step based on the ApplyXSLTransform step template can transform XML into a RICOH ProcessDirector overrides file that specifies the\nvalues of job properties.\n5. The administrator decides to use three ApplyXSLTransform steps. Each step uses an XSLT style sheet. The administrator uses a third-party\nXSLT tool to create the XSLT style sheets.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:21 PM Usage scenario for processing orders in an XML file - Jenski - Test portal- RPD Linux\nThe first step uses the Order Jobs XSLT style sheet. It converts the name attribute of the order element and the customername\nelement into the Job.Info.Attr1 and Job.CustomerName job properties.\nThe step goes in the SplitOrderIntoPrintAndStockJobs workflow before the two CreateJobsFromXML steps.\nThe second step uses the Print Jobs XSLT style sheet. It converts the printfile element and the quantity element into the\nJob.DownloadFile and Job.Copies job properties.\nThe step goes in the ProcessPrintJobs workflow.\nThe third step uses the Stock Jobs XSLT style sheet. It converts the number attribute of the stock element and the quantity element\ninto the Job.Info.Attr2 and Job.Copies job properties.\nThe step goes in the ProcessStockJobs workflow.\n6. The administrator decides to use a DownloadFile step to download PDF files from a specified URL.\nBecause the printing company uses a proxy server to communicate with external websites, the administrator sets up RICOH ProcessDirector\nto use the proxy server.\nSetting up the input device and workflows\nThe administrator sets up a hot folder input device to receive XML files and four workflows to process them.\n1. The ExtractOrdersFromXML workflow creates a job for each order in the XML input file.\nAfter the SetJobPropsFromTextFile and DetectInputDataStream steps, the administrator adds the CreateJobsFromXML step. The\nadministrator sets the value of the XPath expression to /seller/order and the value of the workflow for new jobs to\nSplitOrderIntoPrintAndStockJobs. The administrator specifies that new jobs are not created as child jobs. Each order is an independent job.\n2. The SplitOrderIntoPrintAndStockJobs workflow receives each order job, creates XML files for print and promotional items, and submits\nthem as child jobs to the appropriate workflow.\nAfter the SetJobPropsFromTextFile and DetectInputDataStream steps, the administrator adds an ApplyXSLTransform step. The step uses the\nOrder Jobs XSLT style sheet.\nAfter the ApplyXSLTransform step, the administrator adds two CreateJobsFromXML steps:\nFor the first step, the administrator sets the value of the XPath expression to /order/item/printfile/ancestor::item and the\nvalue of the workflow for new jobs to ProcessPrintJobs.\nFor the second step, the administrator sets the value of the XPath expression to /order/item/stock/ancestor::item and the\nvalue of the workflow for new jobs to ProcessStockJobs.\nFor both steps, the administrator specifies that new jobs are created as child jobs. The administrator also specifies that the parent jobs\ncontinue to the next step when no child jobs are created. For example, child jobs are not created in the first CreateJobsFromXML step if\nan order job does not have any print items.\nAfter the second CreateJobsFromXML step, the administrator adds a step based on the WaitForRelatedJobs step template. This step holds\nthe parent jobs until all the child jobs for print and promotional items have been processed.\n3. The ProcessPrintJobs workflow receives each job for a print item, and prints the items.\nAfter the SetJobPropsFromTextFile and DetectInputDataStream steps, the administrator adds an ApplyXSLTransform step. The step uses the\nPrint Jobs XSLT style sheet.\nAfter the ApplyXSLTransform step, the administrator adds a step based on the DownloadFile step template to download the PDF file\nspecified by the value of the Job.DownloadFile property. The administrator sets the value of the Path to downloaded file property to\n${getFileName(print,pdf,write)} so that the PDF file is downloaded to the spool directory for the job.\nFollowing the DownloadFile step, the administrator adds the steps that the printing company uses to process PDF jobs.\nAfter the last step that processes the print jobs, the administrator adds a step based on the ManualStepWithAutoStart step template. This\nstep gives a shipping clerk time to add the print job to the order in the shipping department.\nAfter the ManualStepWithAutoStart step, the administrator adds a step based on the WaitForRelatedJobs step template. This step holds\neach job for a print item in an order until all the jobs in the order have been processed.\n4. The ProcessStockJobs workflow receives each job for a promotional item, and accounts for the time required to retrieve a promotional item\nfrom the warehouse.\nAfter the SetJobPropsFromTextFile and DetectInputDataStream steps, the administrator adds an ApplyXSLTransform step. The step uses the\nStock Jobs XSLT style sheet.\nAfter the ApplyXSLTransform step, the administrator adds a step based on the ManualStepWithAutoStart step template. This step gives a\nshipping clerk time to get the promotional item from the warehouse and add it to the order in the shipping department.\nAfter the ManualStepWithAutoStart step, the administrator adds a step based on the WaitForRelatedJobs step template. This step holds\neach job for a promotional item in an order until all the jobs in the order have been processed.\nThis figure shows the four workflows. The green lines show the workflow that each CreateJobsFromXML step submits XML jobs to.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:21 PM Usage scenario for processing orders in an XML file - Jenski - Test portal- RPD Linux\nReceive Prepare Print Complete\nExtractOrdersFromXML workflow\nReceive Prepare Print Complete\nSplitOrderIntoPrintAndStockJobs workflow\nReceive Prepare Print Complete\nProcessPrintJobs workflow\nReceive Prepare Print Complete\nProcessStockJobs workflow\nProcessing jobs through the workflows\nWhen the administrator enables the workflows and submits an XML file to the input device, RICOH ProcessDirector processes the job through\nthe four workflows.\nThe ExtractOrdersFromXML workflow receives the XML job from the input device and creates an XML file for each order element that matches\nthe Order Jobs XPath expression. The workflow submits each XML file as a job to the SplitOrderIntoPrintAndStockJobs workflow.\nThe SplitOrderIntoPrintAndStockJobs workflow does this processing:\nIt receives each order job.\nIt uses the Order Jobs XSLT style sheet to convert order number and customername elements and values into job properties and values.\nIt records the job properties and values in an overrides file.\nIt creates an XML file for each item element that matches the Print Jobs XPath expression. The workflow submits each XML file as a child job\nto the ProcessPrintJobs workflow. A copy of the overrides file is submitted with each child job.\nIt creates an XML file for each item element that matches the Stock Jobs XPath expression. The workflow submits each XML file as a child job\nto the ProcessStockJobs workflow. A copy of the overrides file is submitted with each child job.\nIt holds the parent job for each order until all the child jobs have been processed.\nThe ProcessPrintJobs workflow does this processing:\nIt receives each job for a print item.\nIt uses the Print Jobs XSLT style sheet to convert the printfile and quantity elements and values into job properties and values.\nIt records the job properties and values by overwriting the contents of the overrides file submitted with the job.\nIt uses the value of the Job.DownloadFile property to download the PDF file for each print item.\nIt prints the PDF file.\nIt waits while a shipping clerk checks the values of the Custom 1 (order number) and Customer name properties for the job. The clerk then\nadds the print item to the order in the shipping department.\nTo move the job to the next step in the workflow, the clerk uses the Manual complete action.\nIt holds each job for a print item until order processing is complete.\nThe ProcessStockJobs workflow does this processing:\nIt receives each job for a promotional item.\nIt uses the Stock Jobs XSLT style sheet to convert stock number and quantity elements and values into job properties and values.\nIt records the job properties and values by overwriting the contents of the overrides file submitted with the job.\nIt waits while a shipping clerk does these tasks:\nFinds the stock number of the item by checking the value of the Custom 2 property.\nGets the required number of promotional items from the warehouse.\nChecks the values of the Custom 1 (order number) and Customer name properties for the job.\nAdds the promotional items to the order in the shipping department.\nTo move the job to the next step in the workflow, the clerk uses the Manual complete action.\nIt holds each job for a promotional item until order processing is complete.\nWhen all the jobs for the print and promotional items in an order have reached the WaitForRelatedJobs step, order processing is complete.\nRICOH ProcessDirector moves the parent job for the order and all the child jobs for the items to the steps based on the RetainCompletedJobs\nstep template.\nParent topic: Jobs with XML files\n3 of 3"}]}