{"doc_name": "ppfrsample_t_ExportMediaZip.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_t_ExportMediaZip.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2716, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Exporting media with electronic forms - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Exporting objects / Exporting media with electronic forms\nExporting media with electronic forms\nTo reuse media objects with electronic forms on another RICOH ProcessDirector system, you can export them by copying the media.zip file to\nanother system. The Export Objects function exports media objects but does not export the electronic forms defined for media objects.\nRICOH ProcessDirector creates a media.zip file whenever you define, edit, rename, or delete a media object.\nTo export media with electronic forms:\n1. Log in to the primary computer.\n2. Go to this directory:\n/aiw/aiw1/share on Linux\nC:\\aiw\\aiw1\\share on Windows\n3. Copy the media.zip file to the system that you are exporting the media to.\n4. Log in to the RICOH ProcessDirector primary computer on that system and put the media.zip file in this directory:\n/aiw/aiw1 on Linux\nC:\\aiw\\aiw1 on Windows\n5. Extract the media objects from the media.zip file.\nExtracting the media objects:\nPuts a media.xml file in the same directory as the media.zip file.\nAdds all electronic forms defined for the media to this directory:\n/aiw/aiw1/constantforms on Linux\nC:\\aiw\\aiw1\\constantforms on Windows\nIf the constantforms directory has another version of an electronic form, the file extraction process asks if you want to replace the form.\nFor example, the constantforms directory could have copies of the sample forms installed with the Preprinted Forms Replacement feature.\nTo extract only forms that are not on the system where you are importing the media objects, choose the option to replace none of the\nfiles.\nTo replace all the forms on the system with the version of the forms in the media.zip file, choose the option to replace all the files.\n6. Make sure that the RICOH ProcessDirector system user and group ( aiw1 and aiwgrp1 are the defaults) have permission to read and modify\nthese files and directories:\nThe constantforms directory\nAll electronic forms in the constantforms directory\n7. Import the media objects:\n1. Click the Administration tab on the user interface of the system where you are importing the media objects.\n2. In the left pane, click Utilities ⇒ Import Objects.\n3. Click File to Import.\n4. Go to this directory:\n/aiw/aiw1 on Linux\nC:\\aiw\\aiw1 on Windows\n5. Select the media.xml file.\n6. Select the media objects that you want to import.\n7. To make sure that you do not update media objects that exist, click Deselect existing objects.\n8. Click Import.\nFor more information about importing objects, see the related task for copying objects from another system.\nParent topic: Exporting objects\n1 of 1"}]}