{"doc_name": "reportsPostgresql_c_CaptureDataForPostgreSQL.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_c_CaptureDataForPostgreSQL.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3755, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Configuring data collectors - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring to use Reports / Configuring data collectors\nConfiguring data collectors\nYou can use data collectors to capture property values and store them in tables in the Reports database. Each property is stored in a column in\nthe database table specified in each data collector.\nBefore you do the steps in this procedure, determine which property values to capture and when to capture them.\nNote:\nIf you are only collecting information by adding steps to your workflow, you do not have to configure the data collectors to capture job\nand printer properties.\nYou can configure each data collector to store the values for different properties. When enabled, the data collectors run at different times during\njob processing or when certain actions are executed. You can configure these data collectors:\nJob Step Duration\nCaptures information about how long each step was in the queued and processing states, as well as the total duration for each step to\ncomplete processing. The Job Step Duration data collector can also collect job properties at the completion of each step and when the\nworkflow completes.\nJob Step Progress\nCaptures job properties at the start and completion of each step in the workflow.\nJob Print Status\nCaptures job and printer properties when a job starts printing, when it finishes printing successfully, and when a job stops printing due to an\nerror.\nOrder Status\nCaptures order properties when an order is created, changes state, or is deleted.\nPrinter Status\nCaptures printer properties each time that the Enabled status or Printer status changes for any printer.\nUser Actions on Barcode Readers\nCaptures the barcode reader and user properties when a user does an action on a barcode reader.\nUser Actions on Input Devices\nCaptures the input device and user properties when a user does an action on an input device.\nUser Actions on Inserters\nCaptures the inserter controller and user properties when a user does an action on an inserter.\nUser Actions on Jobs\nCaptures the job and user properties when a user action does an action on a job.\nUser Actions on Printers\nCaptures the printer and user properties when a user does an action on a printer.\nUser Actions on Users\nCaptures the user and target user properties when a user does an action on a target user.\nWorkflow Step Collector\nRemoves the expired entries collected during the WritePropsToReportsDatabase step.\nTo configure data collectors:\n1. Click the Administration tab.\n2. In the left pane, click Reports ⇒ Data Collectors.\n3. Select one of the data collectors provided with RICOH ProcessDirector.\n4. Review the current values for the properties and make any required updates.\nTo see information about any of the properties, click the question mark button next to the property name.\n5. When all the settings are configured correctly, click the switch at the top of the dialog to enable the data collector.\nThe data capture starts when a data collection event occurs, for example, a job enters a step, printing starts, or the printer status changes\nwhen an input device is enabled.\nNote:\nData collection must be enabled for data collectors to store information in the database. If you enable one or more data collectors\nwhile data collection is disabled, the data collectors do nothing. When the data collection is enabled, enabled data collectors start\nto capture data when a data collection event occurs, for example, a job enters a step, printing starts, the printer status changes, or\nwhen an input device is enabled.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:18 PM Configuring data collectors - Jenski - Test portal- RPD Linux\n6. Click OK.\nParent topic: Configuring to use Reports\n2 of 2"}]}