{"doc_name": "aiw_avanti_mapping_ink.pdf", "doc_path": "data/raw/RPD-en-US/aiw_avanti_mapping_ink.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2963, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Sending ink usage data to Avanti Slingshot - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information / Sending ink usage data to Avanti Slingshot\nSending ink usage data to Avanti Slingshot\nYou can configure RICOH ProcessDirector to collect ink usage data for jobs sent to specific printers. The data collected is sent back to Avanti\nSlingshot, along with the ink loaded in the printer for that specific job.\nWhen a Ricoh continuous form printer is set up in RICOH ProcessDirector, you can specify which ink is loaded in the printer, using the names\ndefined in Avanti Slingshot. Then, when the ink usage data is sent back to Avanti Slingshot in the job ticket, the ink names match. To see the ink\nsettings, the printer must be added as a Ricoh TotalFlow Printer.\nTo send ink usage data to Avanti Slingshot:\n1. Make sure that the printer you want to use for collecting the ink usage is defined in RICOH ProcessDirector as a Ricoh TotalFlow Printer.\n2. Find the names of the ink used on this printer in the Avanti Slingshot client:\n1. Log in to the Avanti Slingshot client.\n2. In the left pane, go to Inventory ⇒ Items.\n3. In the Item - Table View panel, go to the Item Class list and select Inks.\n4. Identify the ink according to the item code and copy either the inventory item code from the Item Code field or the text from the\nDescription 1 field.\n3. Update the Ricoh TotalFlow printer with the names set in Avanti Slingshot:\n1. Log in to RICOH ProcessDirector.\n2. Go to Administration ⇒ Printers.\n3. Right-click an existing Ricoh TotalFlow Printer and select Properties.\n4. Go to the Avanti Slingshot section and fill in the ink names found in Avanti Slingshot under the Item Code or Description 1 fields.\nFor example, if for the black ink, the name in Avanti Slingshot under Description 1 is Black-RPD, you must enter the same ink\nname in the Black ink field from Ink Property Mapping under Avanti Slingshot in RICOH ProcessDirector. You can also match the ink\nnames according to the values in the Item Code field, but if the item code is not found, does not exist, or the field is empty,\nmatching the ink names is done according to the Description 1 field.\n4. To test if the configuration is correct, send a job to this printer to Avanti Slingshot. Compare the values sent from RICOH ProcessDirector\nwith the ones received in Avanti Slinghsot:\n1. Log in to RICOH ProcessDirector\n2. Right-click the job in the Jobs portlet and select View log.\n3. Find the ink information message and look for the ink name and amount value.\n4. Log in to the Avanti Slingshot client.\n5. Go to Production ⇒ Job View to select the job.\n6. In the Materials tab, look for the ink values under the Used column and compare with the values displayed in the job log in RICOH\nProcessDirector.\nParent topic: Setting up RICOH ProcessDirector and Avanti Slingshot to exchange information\n1 of 1"}]}