{"doc_name": "aiw00c15.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c15.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2142, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Configuring line data transform steps - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up datastream transforms / Transforming line data to AFP / Configuring line data transform steps\nConfiguring line data transform steps\nYou can incorporate the line data transform into a workflow by adding a ConvertLineDataJobIntoAFP step, then configuring it appropriately.\nThese workflows include the ConvertLineDataJobIntoAFP step: LineData and DownloadLineData.\nTo configure a line data transform step, you must define or edit a workflow that includes the step. If you define a workflow, use the\nConvertLineDataJobIntoAFP step template to add a step to the workflow.\nAfter you have created a ConvertLineDataJobIntoAFP step, you can edit the job default properties that it sets.\nTo configure a line data transform step:\n1. Click the Workflow tab.\n2. Click the name of the workflow that you want to edit.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Right-click the ConvertLineDataJobIntoAFP step and select Properties.\nYou see the properties for the step.\n5. Edit the properties of the step as needed.\nNote:\nClick the to open descriptions for the properties.\nFor additional assistance determining the correct values for the fields, particularly in creating the external control file template, the valid\nreturn codes, and the .parmdd parameter file, see AFP Conversion and Indexing Facility User's Guide (G550-1342).\nThe default file that displays in the External control file template field is only a sample file. You must edit it to fit your environment. During\nprocessing, RICOH ProcessDirector uses the template to create a control file for each job that passes through the step.\n6. When you finish editing the properties, click OK.\n7. Save and enable the workflow.\nParent topic: Transforming line data to AFP\n1 of 1"}]}