{"doc_name": "pdfw_t_configuringidentstep.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_configuringidentstep.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3056, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Configuring steps to identify documents in PDF files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Configuring the PDF Document Support feature / Configuring steps to identify documents in PDF files\nConfiguring steps to identify documents in PDF files\nIf you have installed the PDF Document Support feature, you can add a step in your workflows based on the IdentifyPDFDocuments step\ntemplate. You specify the RICOH ProcessDirector Plug-in for Adobe Acrobat control file that contains document properties and the page\ngrouping definitions. When RICOH ProcessDirector processes a PDF file using a workflow that includes an IdentifyPDFDocuments step, it\nidentifies the documents in the PDF file and extracts document property values.\nSteps that calculate values for document properties are based on the IdentifyPDFDocuments step template. The PDF Document Support feature\nand other document processing features provide workflows containing an IdentifyPDFDocuments step. If you use those supplied workflows or\ncreate your own workflows, you can configure an IdentifyPDFDocuments step in the workflow to specify the name of the RICOH ProcessDirector\nPlug-in for Adobe Acrobat control file that contains document property definitions.\nIf you add an IdentifyPDFDocuments step to a workflow, place the step after all steps that alter the PDF file. If you add the step before a step that\nalters the file, unexpected results can occur.\nIf you get unexpected results when you process a PDF 2.0 file with a step based on the IdentifyPDFDocuments step, do one of these:\nUse the version of the RICOH ProcessDirector Plug-in for Adobe Acrobat supplied with RICOH ProcessDirector version 3.6 and above to update\nthe control file. Remember to copy the control file to the correct location for RICOH ProcessDirector to use it.\nPlace a step based on the OptimizePDF step template in the workflow before the IdentifyPDFDocuments step.\nTo configure a step that identifies documents in PDF files:\n1. Click the Workflow tab.\n2. Right-click the workflow that contains the IdentifyPDFDocuments step and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Right-click the IdentifyPDFDocuments step.\n5. Select Properties and if necessary, change the properties for the step.\n6. On the PDF tab, for the Identify PDF control file property, type the path and file name of the RICOH ProcessDirector Plug-in for Adobe\nAcrobat control file that contains information about page grouping and document properties in the PDF files processed by this step, or use\nsymbol notation to refer to the control file. This file is required and was created by RICOH ProcessDirector Plug-in for Adobe Acrobat when\nyou defined document properties in a sample PDF using RICOH ProcessDirector Plug-in for Adobe Acrobat. The default extension for the\ncontrol file is .ctl.\n7. Click OK.\n8. Save the workflow.\nParent topic: Configuring the PDF Document Support feature\n1 of 1"}]}