{"doc_name": "aiw00o38.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o38.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2229, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Step templates, steps, and step chains - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Step templates, steps, and step chains\nStep templates, steps, and step chains\nStep templates are the basic building blocks for processing on the RICOH ProcessDirector system. A step template contains the code that does a\nspecific action, such as creating or removing a job. It can also define default job property values. When you add a step to a workflow, you select\na step template to use as the basis for the step.\nRICOH ProcessDirector provides several step templates that the supplied RICOH ProcessDirector workflows use. You can also use these step\ntemplates to create steps and step chains in your own workflows.\nStep chains are groups of connected steps that you can use in your workflows like a step template. If you use the same set of steps in many of\nyour workflows, you can create a step chain with those steps. You can then use the step chain instead of adding each step every time you create\na new workflow.\nFor example, you have a set of steps with logic that detects the data stream of the job, sends PDF files through an OptimizePDF step, sends AFP\nfiles through a transform to PDF, and then sends both PDF and AFP files through steps that count pages and extract document properties. You\ncould make a step chain of that set of steps and drop it into each workflow that you build. You might have to change the value of some\nproperties set on the steps for each workflow but you save yourself the time of adding the steps and connectors to each new workflow.\nIn this section:\nRunning the StepChainDemo sample workflow\nThe StepChainDemo workflow presents an example of step chain usage by showcasing how to group a collection of steps with a well-defined\nfunction. After you create a step chain, you can include it in other workflows, making the process easier and visually simplifying the workflow.\nPositional job properties\nYou can place steps based on the same step template in a workflow multiple times. If the job properties associated with the step template take\ndifferent values for each step, they are positional properties.\nParent topic: System objects\n1 of 1"}]}