{"doc_name": "pdfw_t_plugin_liveview.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_liveview.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 6035, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Previewing markup - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Previewing markup\nPreviewing markup\nAfter you add markup to a sample PDF file, you can preview markup placement. Previewing lets you verify that PDF files are going to print as\nexpected when RICOH ProcessDirector applies the markup that you saved to a control file. Preview also lets you verify that media and finishing\noptions are going to be applied to the intended pages.\nUsing preview with more than one control file\nIf you save more than one control file for markup, media, and finishing definitions, preview renders only the definitions contained in the loaded\ncontrol file. For example, you save a barcode definition in a control file called barcodes.ctl and an image definition in images.ctl. You can\nhave either barcodes.ctl or images.ctl loaded in RICOH ProcessDirector Plug-in for Adobe Acrobat. If you have barcodes.ctl loaded, you\npreview the placement and content of the barcode, but you cannot preview the image because you do not have images.ctl loaded.\nYou can include page group and document property definitions in any control file. If a page group is defined in a control file that is not loaded,\nyou cannot preview markup, media, and finishing with conditional placement rules based on page groups. If document properties are defined in\na control file that is not loaded, you cannot select those document properties as content for markup. If you want to preview as much markup as\npossible while using multiple control files, first save page groups and document properties to a control file, for example, pagegrouping.ctl.\nWhen you are ready to define markup, load pagegrouping.ctl, add the markup, and save the result to a new control file (for example,\nbarcodes.ctl). To define more markup and save it to a separate control file, first load pagegrouping.ctl. Add the markup (for example,\nimages), and save the result to a new control file (for example, images.ctl). By starting your markup definitions from a control file that contains\npage groups and document properties, you can preview markup, media, and finishing that use conditional placement rules and document\nproperties.\nIf you save all your enhancements in one control file, you can preview all markup, media, and finishing at once.\nNote:\nYou cannot edit, print, or save a preview file.\nYou must define a page group before you can preview markup.\nThe Pages to Process preference specifies the maximum number of pages that Preview processes. The greater the Pages to Process value,\nthe longer RICOH ProcessDirector Plug-in for Adobe Acrobat takes to preview markup added to a PDF file.\nThe Production Intent preference determines how RICOH ProcessDirector Plug-in for Adobe Acrobat interprets PDF files.\nThe Show electronic forms preference determines whether Preview shows how sample files look when the data is combined with\nelectronic forms defined for the media that the files use.\nWhen you define markup in a PDF file, you can use the values of job and document properties as content for markup and in conditional\nplacement rules. Preview uses values that are extracted from the PDF file. If you have markup that uses job or document properties that\nare not defined in the file, RICOH ProcessDirector Plug-in for Adobe Acrobat uses a unique static numeric value for each job or document\nproperty. If conditional placement rules use properties that are not defined in the file, usually Preview always applies or never applies\nmarkup based on those rules.\nIf your markup uses an image that the plug-in cannot find (for example, an image that is not on your local machine), preview does not\nrender the image. Instead, preview places a message that specifies the name of the missing image in the location specified for the image.\nYou cannot preview markup that is placed using a RICOH ProcessDirector Plug-in for Adobe Acrobat rule that evaluates\nStat.CurrentMedia.\nTo preview markup:\n1. Click Ricoh ⇒ Preview.\nRICOH ProcessDirector Plug-in for Adobe Acrobat generates and displays a new, temporary PDF file. Your sample PDF file remains open.\nThe temporary PDF file opens to the first page regardless of the page you are editing in the sample PDF file.\n2. When a page has media and finishing options, you see an annotation labeled Print Operations in the upper right corner. To see the media\nname and finishing option, hover the mouse pointer over Print Operations.\nAs an alternative, click Comment on the Adobe Acrobat toolbar. In the Comments pane, you see a comment for each page with media\nand finishing options.\n3. If electronic forms are defined for media used by sample files, you can see how the files look when the data is combined with the forms.\nTo see the electronic forms:\nMake sure that you exported the RICOH ProcessDirectormedia.zip file and loaded it to the correct directory on the system where you\ninstalled RICOH ProcessDirector Plug-in for Adobe Acrobat. For more information about loading media objects to the plug-in, see the help\nsystem or Ricoh ProcessDirector: Installing Document Processing Features.\nFor pages in your sample PDF file, select media that defines electronic forms. As an alternative, load a control file that you saved after\nselecting media that defines electronic forms.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Previewing markup - Jenski - Test portal- RPD Linux\nMake sure that the Show electronic forms preference is set to Yes.\nAlthough Preview lets you see how files look when the data is combined with the forms, the data and forms remain separate. RICOH\nProcessDirector combines the forms with the data in production PDF files when the CombinePDFWithForm step processes the files.\n4. When you have finished previewing the PDF file, you can close this temporary PDF file or leave it open.\nYou can update the temporary PDF file by clicking Ricoh ⇒ Preview.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n2 of 2"}]}