{"doc_name": "aiw_sdk_time.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_time.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2695, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Time - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / Time\nTime\nWhen the batching method is Time, the hot folder or SFTP input device submits one or more files as a group. Only files that match the Data\npatterns property and that arrive during the time period determined by the values set for the Batching start date, Batching start time, Batching\ninterval, and Batching date or Frequency properties are submitted.\nThe hot folder or SFTP input device waits until the date and time specified in the Batching start date and Batching start time properties, then\nsubmits one or more groups of input files at a specific time or time interval determined by the values set for the Batching interval and Batching\ndate or Frequency properties. The files print in the order specified by their Last modified timestamp.\nNote:\nIf files exist in the hot folder or SFTP input device prior to the initial date and time set in the Batching start date and Batching start time\nproperties, those files will be included in the first batch submitted by the input device.\nFor the Batching start time property, use the time zone of your browser. The value is displayed based on the time zone of the computer\nthat you use to open the user interface, but it is stored in a generic format. The hot folder or SFTP input device interprets the generic time\nformat based on the time zone of its parent server and creates batches at the specified time.\nWhen you use the Time batching method, set these input device properties as indicated:\nWorkflow: ParentNoPrint\nChild workflow: The workflow that is appropriate for the print files in the job.\nSubmit step: SubmitInputFiles\nCreate .zip file: If this property is set to Yes, all input files that match the value set in the Data patterns property are combined as a ZIP file and\nsubmitted as a single job. If this value is set to No, all input files are submitted as child jobs.\nBatching start date: The date when the input device begins to use the Time batching method.\nBatching start time: The time when the input device begins to use the Time batching method.\nBatching interval: The time interval used to determine when or how often to submit a group of files.\nBatching date or Frequency: Used with the Batching interval property, this property specifies exact values for when or how often to submit a\ngroup of files.\nData patterns: A pattern that matches some part of the file name of your print files. For hot folder or SFTP input devices, the default value is\nthe regular expression: .*$. That pattern matches all file names.\nParent topic: Batching methods\n1 of 1"}]}