{"doc_name": "dt_o_scenarios.pdf", "doc_path": "data/raw/RPD-en-US/dt_o_scenarios.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3417, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Usage scenarios for Deadline Tracker - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Deadline Tracker / Usage scenarios for Deadline Tracker\nUsage scenarios for Deadline Tracker\nThese scenarios show how to set deadlines, estimated durations, or both for a Deadline Tracker workflow.\nIn this section:\nTime of day deadline in a workflow scenario\nIn this scenario, all of the jobs in a linear PDF workflow must be printed by 5:00 pm on the day after they are received.\nTwo deadlines in a linear workflow scenario\nIn this scenario, a linear PDF workflow sends each job through an external program for the accounting department and then prints the job. You\nwant to set one deadline for the external program and another deadline for printing the job. You place two SetDeadline steps in the workflow.\nThe first SetDeadline step tracks the time required to complete the RunExternalProgram step. The second SetDeadline step tracks the time to\nprint each job after it completes the RunExternalProgram step.\nThree deadlines in a conditional workflow scenario\nIn this scenario, a conditional workflow has separate processing paths for PDF jobs, AFP jobs, and other jobs (PostScript and PCL). PDF jobs go\nthrough a time-consuming preflight step performed with the PitStop Connect Feature. AFP jobs go through a time-consuming accounting step\nthat runs an external program. Other jobs do not go through the time-consuming preflight or accounting steps. You want to set a different\ndeadline for each path: two hours for PDF jobs, 90 minutes for AFP jobs, and 30 minutes for other jobs. You place a SetDeadline step at the start\nof each path.\nEstimated durations for steps in a linear workflow scenario\nIn this scenario, a linear workflow has nine steps. You want to track whether a job is on time or behind schedule from the time that the job\nenters the workflow until it completes the PrintJobs step. The first two steps process a job immediately. Four steps each take five minutes to\nprocess a job. One step takes ten minutes to process a job. You set estimated durations for those seven steps. You do not set estimated durations\nfor the two steps that follow the PrintJobs step.\nDeadlines and estimated durations in a linear workflow scenario\nIn this scenario, a linear workflow has 10 steps. You want to track whether a job is on time or behind schedule from the time that the job enters\nthe workflow until it completes the PrintJobs step. The first three steps process a job immediately. Four steps each take 5 minutes to process a\njob. One step takes 10 minutes to process a job. You set estimated durations for those eight steps. You do not set estimated durations for the\ntwo steps that follow the PrintJobs step. You also want to know if a job does not meet its printing deadline. You place a SetDeadline step near\nthe start of the workflow.\nAdjusting Service Level Agreements for weekends and holidays\nWhen you negotiate your Service Level Agreements (SLAs), you use No-service periods for days you are closed, such as weekends and holidays.\nThe days that you are closed are not considered when calculating SLA deadlines.\nSetting up to monitor for expected work\nWhen you have recurring jobs, you can use the expected work function to check that the jobs have arrived on time at the correct input device.\nParent topic: Deadline Tracker\n1 of 1"}]}