{"doc_name": "aiw00c4.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c4.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 7049, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Defining printer objects - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects\nDefining printer objects\nPrinter objects represent the printers in your environment that receive print jobs from RICOH ProcessDirector.\nDifferent printer objects generate different output to send to the printer. RICOH ProcessDirector provides these printer objects:\nAFP printer\nUse the Print Services Facility (PSF) printer driver to convert AFP print jobs into the Intelligent Printer Data Stream (IPDS) format.\nAvailable if the AFP Support feature is installed.\nTASKalfa printer\nPrints PDF data with JDF job tickets.\nAvailable if the Cut Sheet Support for TASKalfa feature is installed.\nCustom PDF printer\nConverts PDF to PostScript.\nKodak PDF printer\nPrints PDF files, including jobs that have been converted to PDF format.\nAvailable if the Cut Sheet Support for Kodak feature is installed.\nPassthrough printer\nUsually prints data streams such as PostScript, PDF, and PCL without doing any file conversion.\nPCLOut printer\nUse the PSF printer driver to convert AFP print jobs into the IPDS format. Then they convert the IPDS format into Printer Command\nLanguage (PCL) format.\nAvailable if the AFP Support feature is installed.\nRicoh PDF printer\nPrints PDF data with JDF job tickets or PostScript data.\nRicoh TotalFlow printer\nPrints PDF data streams without doing any file conversions. Produces a MIME package containing the PDF data and JDF job ticket.\nXerox PDF printer\nPrints PDF files, including jobs that have been converted to PDF format.\nAvailable if the Cut Sheet Support for Xerox feature is installed.\nOptional features add more types of printer objects.\nRICOH ProcessDirector can get status on the job while it is printing by communicating directly with AFP printers and Ricoh PDF printers.\nFor Passthrough and PCLOut printers, RICOH ProcessDirector runs a command that is defined for the printer and monitors the response to the\ncommand. RICOH ProcessDirector cannot report status of the job that it sent.\nJobs are assigned to the printers using scheduling properties. Scheduling properties are job and printer properties that RICOH ProcessDirector\ncompares to determine whether a job can be sent to a printer. The table shows the default job scheduling properties and their corresponding\nprinter properties. If all the scheduling properties match, the job can be scheduled to the printer. Scheduling properties are added or deleted\nfrom this list by editing a scheduling properties configuration file.\nNote:\nA blank value for a job scheduling property matches all values for the corresponding printer property. A blank value for a printer\nscheduling property matches all values for the corresponding job scheduling property.\nScheduling properties\nJob property Printer property\nBinding, with Perfect selected Perfect binding capable\nBinding, with Ring or Ring and punch selected Ring binding capable\nCustomer name Customer name\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:11 PM Defining printer objects - Jenski - Test portal- RPD Linux\nJob property Printer property\nFold options Folding capable\nJob size (sheets) Printer job size (sheets) supported\nMedia Media supported\nPLE Media Media supported\nOutput bin Output bins available\nOutput format Output format\nPreset name Preset name\nPunch Punch capable\nRequested location Printer location\nStaple Staple capable\nPLE Staple Staple capable\nNote:\nAFP jobs can request that the printer use a specific preset. When an AFP job arrives at a printer that supports this function, the printer\nswitches to use that preset automatically. If your printer supports this function, do not use Preset name as a scheduling property; leave\nthe printer property blank. If the Preset name printer property is set to any value, the preset is not sent to the printer with the job.\nThe AFP Support feature provides these additional scheduling properties:\nAFP scheduling properties\nJob property Printer property\nJob class Printer class\nJob destination Printer destination\nJob form Printer form\nAnother way to print is to define a workflow that copies the print file to a directory defined as a hot folder for a printer. You do not need to\ndefine a printer object in this case because the workflow does not usually contain a PrintJobs step. Jobs that are processed with that kind of\nworkflow do not use scheduling properties because scheduling applies only to the PrintJobs step.\nIn this section:\nDefining Ricoh PDF printer objects\nRicoh PDF printer objects represent specific models of RICOH printers.\nDefining AFP printer devices\nAFP printer devices represent Intelligent Printer Data Stream (IPDS) printers. They print jobs in AFP format, including jobs that have been\nconverted to AFP format.\nDefining PCLOut printer devices\nPCLOut printer devices represent Printer Command Language (PCL) printers. They print jobs that are submitted in AFP format and converted to\nPCL format.\nDefining Passthrough printer objects\nPassthrough printer objects represent printers that can print jobs in formats such as PCL, PostScript, and PDF. Jobs are assigned to Passthrough\nprinters using these scheduling properties: Customer name, Job size, Location, Media, Output bin, Output format, Punch, Folding, Binding, and\nStaple. The AFP Support feature adds Class, Destination, and Form to the scheduling properties. Other scheduling properties may be defined in a\nconfiguration file. For Passthrough printers, RICOH ProcessDirector runs a command that is defined for the printer. RICOH ProcessDirector\nmonitors the response to the command, but cannot report status of the job that it sent.\nDefining Xerox PDF printer devices\nXerox PDF printer devices represent specific models of Xerox printers that can print PDF files using XRX and XPIF (Xerox Printing Instruction\nFormat) tickets. Jobs are assigned to Xerox PDF printers using scheduling properties.\nDefining Kodak PDF printer devices\nKodak PDF printer devices represent specific models of Kodak printers that can print PDF or Postscript files. Jobs are assigned to Kodak PDF\nprinters using scheduling properties.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:11 PM Defining printer objects - Jenski - Test portal- RPD Linux\nDefining TASKalfa printer devices\nTASKalfa printer devices represent Kyocera TASKalfa 15000c production printers with the EFI Printing System 50 option (EFI Fiery DFE). Jobs are\nassigned to TASKalfa printers using scheduling properties.\nDefining Custom PDF printers\nYou define a Custom PDF printer when you want to print to a PostScript printer that is not on the list of supported Ricoh PDF printers. These\nprinters include some Ricoh PostScript printers and PostScript printers from other manufacturers. Any printer with a PostScript Printer Description\n(PPD) file that describes its features and capabilities can be a Custom PDF printer.\nConfiguring to send jobs to a printer that uses RICOH TotalFlow Print server\nSending print jobs to a Ricoh TotalFlow printer requires specific configuration steps on the printer and in RICOH ProcessDirector.\nParent topic: Configuring\n3 of 3"}]}