{"doc_name": "pref_o_featov.pdf", "doc_path": "data/raw/RPD-en-US/pref_o_featov.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3734, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Preference Management - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Preference Management\nPreference Management\nThe Preference Management feature lets you update document property values with values from an external preferences file. These values can\nbe used to change the content of selected documents or to change the processing of those documents.\nFor example, you can create a preferences file that identifies customers who have chosen eco-friendly options. After you identify the customers,\nyou change their Output type to email so that they can receive their statements via email instead of by postal mail.\nThe ApplyPreferences step uses a document property mapping object to map the values from the preferences file to RICOH ProcessDirector\ndocument properties. The document property mapping object specifies document properties that identify documents to be updated. The values\nof those document properties must match values in the preferences file. Then, the object specifies which document properties are updated with\nvalues from the preferences file.\nThis no-charge feature is provided with the base product.\nPrerequisites\nTo use the Preference Management feature, first install a feature that supports document processing:\nFor PDF files, install the PDF Document Support feature.\nFor AFP files, install the AFP Support feature.\nStep template\nPreference Management provides the ApplyPreferences step template. A step based on this step template lets you specify a preferences file used\nto update one or more job or document property values.\nObject\nPreference Management provides the Document Property Mapping object. This object lets you map information from the preferences file to\ndocument properties in RICOH ProcessDirector, which are then used by steps to generate output files.\nIn this section:\nUsing information about documents\nAll document processing features collect and track information about individual documents in a job. RICOH ProcessDirector extracts the\ninformation (such as customer names and addresses) from data in the documents themselves. The Preference Management feature lets you use\nother information (such as favorite movies or document delivery preferences) about the individual or account associated with each document.\nThe documents themselves do not contain that information.\nUsage scenario for applying document markup based on a preferences file\nIn this scenario, a company changes their PDF print process to add a marketing offer to customer statements in a composed PDF file before\nprinting the statements. One of two different marketing offers can be added. The choice for each statement is based on the award level that a\ncustomer has attained. Because the award level is not part of the data on the statement, the company exports award levels from their customer\ndatabase into a text file that contains headers. That text file is used as a preferences file. The values in the file determine the offer applied to each\nstatement.\nUsage scenario for distributing statements based on a preferences file\nIn this scenario, a company changes their PDF print process to distribute statements to customers through multiple channels. Customers choose\nwhether their statements are printed, emailed, or displayed in their customer account on the company website. Because this information is not\npart of the data on the statement, the company exports the information from their customer database into a text file that contains headers. That\ntext file is used as a preferences file. The values in the file determine how each statement is distributed to the customer.\nParent topic: Document processing features\n1 of 1"}]}