{"doc_name": "tt_c_CustomVerifyRecipAFP.pdf", "doc_path": "data/raw/RPD-en-US/tt_c_CustomVerifyRecipAFP.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2762, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Customizing the Verification recipient document property for AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Automated Verification feature / Customizing the Verification recipient document property for AFP files\nCustomizing the Verification recipient document property for AFP files\nIf you have the AFP Support feature installed, you can customize the Verification recipient document property for AFP files that you process at\nyour installation. Operators can then use the Verification recipient property to identify documents that need to be reprinted during manual\nreconciliation.\nYour AFP files must contain page groups and the index tag information that you want to map to the Verification recipient property. If an AFP file\ndoes not have page groups and index tags, you can use AFP Indexer to add them.\nFor example, if you link the Verification recipient property to an index tag that contains the customer name, the operator can use the Verification\nrecipient property to find a document with the customer name that is displayed in the address window of the envelope of a damaged mailpiece.\nUse Document Property Designer to link the Verification recipient document property to an index tag in your AFP applications. When the\nVerification recipient document property is linked to an index tag, the value of the document property is the same as the value of the indexed\ndata. For PDF files, use RICOH ProcessDirector Plug-in for Adobe Acrobat to define document properties.\nNote: You see the values of the Verification recipient property in the Recipient column of the Documents table on the Reconcile Job\ndialog. The database name of the property is Doc.Verification.Recipient.\nTo customize the Verification recipient document property:\n1. Start RICOH Visual Workbench and open a sample AFP file that is representative of production jobs.\nThe AFP file must contain page groups and the index tag information you want to use for the Verification recipient property.\n2. To link the Verification recipient document property to an index tag in the AFP file, use the Document Property Designer (DPD) mode.\nDouble-click the Verification recipient property name at the bottom of the window and supply the requested information in the Define link\noptions dialog.\n3. Save the Visual Workbench control file.\nThe control file contains Document Property Designer definitions.\n4. When you configure your Automated Verification workflow, specify the name of the Visual Workbench control file in a step based on the\nIdentifyDocuments step template.\nFor more information, see the topics related to RICOH Visual Workbench and Document Property Designer.\nParent topic: Setting up the Automated Verification feature\n1 of 1"}]}