{"doc_name": "avanti_o_scen_RPDreceivesjob.pdf", "doc_path": "data/raw/RPD-en-US/avanti_o_scen_RPDreceivesjob.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4087, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Usage scenario for receiving jobs from Avanti Slingshot - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Integration features / Avanti Slingshot Connect / Usage scenario for receiving jobs from Avanti Slingshot\nUsage scenario for receiving jobs from Avanti Slingshot\nIn this scenario, a print shop creates a sales order with two jobs in Avanti Slingshot and sends the jobs to RICOH ProcessDirector for processing.\nRICOH ProcessDirector sends Avanti Slingshot the time required for preflight operations and printing.\nBefore any Avanti Slingshot jobs are sent to RICOH ProcessDirector, an administrator at the print shop uses the Avanti Slingshot Connect feature\nto configure RICOH ProcessDirector.\nThe administrator sets up hot folder input devices to receive jobs from Avanti Slingshot and submit them to RICOH ProcessDirector workflows.\nThe names of the two hot folders in this scenario are Statements and Mailer Inserts. They use the JDF Batching method.\nThe administrator modifies the RICOH ProcessDirector workflows to send information back to Avanti Slingshot. The names of the two workflows\nin this scenario are PDF and Insert. The PDF workflow prints jobs on regular paper and does not impose them. The workflow receives jobs from\nthe Statements hot folder. The Insert workflow prints jobs on special coated paper and imposes eight pages on each side of each sheet. The\nworkflow receives jobs from the Mailer Inserts hot folder.\nTo send external preflight information from each workflow to Avanti Slingshot, the administrator:\nAssigns the Preflight cost center to the RunExternalProgam and CreatePageRanges steps.\nGives the RunExternalProgam step a Slingshot milestone status value of In progress. The first time that RICOH ProcessDirector sees this value for\nthe Preflight cost center, it sends Avanti Slingshot the time that the step receives a job.\nGives the CreatePageRanges step a Slingshot milestone status value of Complete. The first time that RICOH ProcessDirector sees this value for\nthe Preflight cost center, it sends Avanti Slingshot the time when the job moves to the next step.\nThe administrator assigns an Avanti Slingshot cost center to each RICOH ProcessDirector printer that prints jobs received from Avanti Slingshot.\nThe printer in this scenario is the Ricoh Pro C901. The administrator assigns it the Ricoh Pro C901 cost center.\nThe administrator sets the Print unit to report value for the Ricoh Pro C901 printer to Pages.\nAfter the administrator has configured RICOH ProcessDirector, the print shop receives a new order to print 100,000 statements with advertising\ninserts.\nThe accounting staff creates a sales order in Avanti Slingshot with two line items:\nStatements\nMailer Inserts\nThe print shop supervisor:\nMakes sure that the Ricoh Pro C901 printer is specified on the section associated with each line item.\nUploads a PDF file for the statements to the Statements line item.\nUploads a PDF file for the inserts to the Mailer Inserts line item.\nTo create Avanti Slingshot jobs, the print shop supervisor releases the sales order with its two line items to production.\nTo print the jobs, the supervisor exports each job to RICOH ProcessDirector.\nAvanti Slingshot sends the statements job to the Statements hot folder. The hot folder submits the job to the PDF workflow.\nAvanti Slingshot sends the inserts job to the Mailer Inserts hot folder. The hot folder submits the job to the Insert workflow.\nAs each job moves through its workflow, RICOH ProcessDirector sends Avanti Slingshot the processing time required to do external preflight\noperations and to print the job.\nWhen each job finishes printing, the RICOH ProcessDirector sends Avanti Slingshot this information:\nThe amount of time the job spent on the printer.\nThe total pages printed on specific media.\nWhether the job was printed with CMYK ink or toner or only with black ink or toner.\nUsing this information, Avanti Slingshot computes the costs of preflight operations and printing for each job.\nParent topic: Avanti Slingshot Connect\n1 of 1"}]}