{"doc_name": "ws-inputdevice_c_PrepForSOAPInput.pdf", "doc_path": "data/raw/RPD-en-US/ws-inputdevice_c_PrepForSOAPInput.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 8011, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Preparing to retrieve SOAP web services input - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to retrieve SOAP web services input\nPreparing to retrieve SOAP web services input\nTo retrieve input from a SOAP web service for an application, identify the parameters used to call the SOAP web service. Test the exchange of\ndata between RICOH ProcessDirector and the application. Then define and configure a SOAP web service input device.\nTo prepare to retrieve SOAP web services input:\n1. Learn the requirements for communication with the SOAP web service for the application:\nThe values for authenticating with the application\nThe values for requesting data from the SOAP web service\nThe format of the data provided in the response\nRefer to the documentation for the application or consult with the company that hosts the application.\n2. To prepare RICOH ProcessDirector to communicate with the application, do these tasks:\nIf the application requires a security certificate, install the certificate on the RICOH ProcessDirector primary computer.\nIf your environment requires a proxy server to communicate with web services, set up the system to use it.\nImport WSDL files for all the web services that you plan to call.\nRICOH ProcessDirector creates SOAP request objects from SOAP operations in the WSDL file. You specify a prefix that RICOH\nProcessDirector adds to the names of the SOAP operations when it creates the objects. A SOAP request object lets RICOH ProcessDirector\ndetermine the SOAP version and other information required to make a correct call to the web service.\nFor more information, see the related tasks.\n3. Run a manual test that authenticates with the application and requests a response from the SOAP web service. Verify that the web service\nreturns the response that you want.\nMany browsers have plug-ins, such as Boomerang for Google Chrome, that test web service calls to SOAP clients.\n4. Decide how you want the SOAP web service input device to create jobs from the data in the response returned by the web service.\nEvery time the input device receives a response, it can create a job containing all XML data in the response.\nThe input device can examine the response using an XPath expression.\nIf the input device finds XML elements specified by the expression, it creates a job for each matching element. Each job contains the\nmatching element and all the elements nested within it. If the input device finds two or more elements, it can create independent jobs or\nchild jobs.\nIf the input device does not find matching elements, it does not create a job.\n5. Define a SOAP web service input device:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Input Devices.\n3. Click Add ⇒ SOAP web service.\n6. On the General tab:\nType a name for the input device.\nSet the Polling interval property to the time that you want the input device to wait between web service calls.\nAfter you define a workflow to process the XML jobs, set the Child workflow property to the name of that workflow.\nEnter values for other properties that you want to set.\n7. On the Request tab:\n1. Set the Request URL property to the URL of the web service that returns data that RICOH ProcessDirector uses to create one or more\njobs.\n2. For the value of the Request payload property, specify the body of the web services request that the input device submits to the\napplication.\nTo specify a credential or token and a time range that matches the value of the Polling interval property, use symbols for these\nproperties:\nUser interface\nDatabase name of property name of Remarks\nproperty\nRICOH ProcessDirector stores the web service credential or token in this\nWebService.Credential None\nproperty.\nRICOH ProcessDirector sets the value of this property at the start of the polling\nWebService.CurrentRequestTime None\ninterval.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Preparing to retrieve SOAP web services input - Jenski - Test portal- RPD Linux\nWhen the input device successfully communicates with the application, RICOH\nStatus tab:\nProcessDirector sets the value of this property to match the value of the\nTime of last\nWebService.LastSuccessRequestTime WebService.CurrentRequestTime property. A successful communication results\nsuccessful\nin a response code 200, even if no data is received that RICOH ProcessDirector\nrequest\ncan use to create jobs.\nIn this example, the payload includes these elements: <Token>, <TimeRange>, <Start>, and <End>. The value of each element\nis a symbol:\n<Token>${WebService.Credential}</Token><TimeRange> <Start>${WebService.LastSuccessRequestTime}\n</Start> <End>${WebService.CurrentRequestTime}</End></TimeRange>\nThe input device resolves the symbols when it polls for XML input.\n3. Set the SOAP request property to the SOAP request that RICOH ProcessDirector created when you imported the WSDL file.\nFor example, you want to use the GetOrdersByDate SOAP request. You prepended PrintShop to the names of the SOAP requests\nwhen you imported them. Select PrintShop-GetOrdersByDate.\n4. Select a value for the Create job from response property to specify how the input device creates jobs from the input:\nTo create a job every time the input device receives a response, select Always.\nTo examine the XML in the response and create a job each time that an XML element is found, select Only when response pattern\nmatches.\n5. If you selected Only when response pattern matches:\nSet the Response pattern to match property to the XPath expression that identifies the XML element that you want to use for each\njob.\nFor example, you want one job for each order, and the data in the response contains an order element. Enter the XPath expression\nthat represents the order element in the XML.\nSet the Create child jobs property to Yes if you want to create child jobs when the input device finds two or more matches. The\ninput device also creates a parent job without any data. If the input device finds one match, it creates an independent job.\nSet the Create child jobs property to No if you want to create independent jobs regardless of how many matches the input device\nfinds.\n6. If your environment requires a proxy server to communicate with web services, set the Use proxy property to the correct proxy server.\n7. Set the Time zone offset property to the offset in hours between Coordinated Universal Time (UTC) and the time zone used by the\nweb service.\nFor example, if the web service uses Pacific Standard Time, set the property to -8.\nNote:\nMake sure that you change this property when a location that hosts the web service changes between standard and daylight\nsavings time. Otherwise, during the lost or gained hour, you can lose the data that RICOH ProcessDirector uses to create jobs.\nIf the web service uses UTC, enter 0 or leave the field blank.\n8. On the Authentication tab, specify the values required to authenticate with the application.\nFor more information, see the related task about authenticating with a SOAP web service.\nIf the application does not require authentication, leave all the Authentication properties blank.\n9. Optional: On the Advanced tab, specify any optional properties for your environment.\n10. When you finish, click OK.\nWhen you finish setting up your input devices, notifications, and workflows, test the exchange of data between RICOH ProcessDirector and the\napplication.\nExample\nThe supplied RestfulWebServiceSample REST web service input device is similar to a SOAP web service input device. The MarcomCentral Connect\nfeature includes a supplied SOAP web service input device.\nIn this section:\nUsing a SOAP web service to authenticate with an application\nSOAP web service input device and notification objects can use a SOAP web service to authenticate with an application. RICOH ProcessDirector\nsupports both API key and session authentication. Input device objects authenticate when they poll for input. Notification objects authenticate\nwhen they send status to the application.\nParent topic: Configuring\n2 of 2"}]}