{"doc_name": "configuringidentifystep.pdf", "doc_path": "data/raw/RPD-en-US/configuringidentifystep.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2692, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Configuring steps to identify documents in AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Configuring steps to identify documents in AFP files\nConfiguring steps to identify documents in AFP files\nAfter you have linked document or job properties to index tags in a sample AFP file, you must configure the step that determines values for\ndocument or job properties in production AFP files. The step names the Visual Workbench control file that contains information about how\nproperties are linked to index tags.\nSteps that calculate values for properties are based on the IdentifyDocuments step template. Some RICOH ProcessDirector features provide\nworkflows containing an IdentifyDocuments step. If you use any of those supplied workflows, you can configure the IdentifyDocuments step in\nthe workflow to specify the name of the Visual Workbench control file. These are examples of workflows supplied with RICOH ProcessDirector\nfeatures:\nReceiveInsert_I (provided with the Inserter feature)\nSortAFP\nSortSplitAFP\nVerifySample (provided with the Automated Verification feature)\nIf you add an IdentifyDocuments step to another workflow, keep these tips in mind:\nThe same control file is used for the IndexAFP step, the EditAFP step, and the IdentifyDocuments step.\nThe IdentifyDocuments step must be after the IndexAFP step, if it is present, and all steps that update the AFP file.\nTo configure a step that identifies documents in AFP files:\n1. Click the Workflow tab.\n2. Copy a workflow that contains the IdentifyDocuments step.\n3. Right-click the IdentifyDocuments step and select Properties.\n4. If necessary, change the properties for the step in the right side of the window.\n5. If you previously linked properties to index tags, this step is required. Otherwise, it is optional. In the Visual Workbench control file field,\ntype the path and file name of the Visual Workbench control file that contains information about how properties are linked to index tags,\nor use symbol notation to refer to it. RICOH Visual Workbench created this control file when you linked properties to index tags. The\ndefault extension for control files is .ctl. If you do not specify a control file, IdentifyDocuments uses any page group information that is\nalready in the AFP file to identify documents, and no index tags in the AFP file are mapped to document properties.\n6. If the input AFP file does not already contain index tags and you use the AFP Indexer mode of RICOH Visual Workbench, add the IndexAFP\nstep before the IdentifyDocuments step.\n7. Click OK.\n8. Save and enable the workflow.\nParent topic: Preparing to use workflows\n1 of 1"}]}