{"doc_name": "aiw_OrderPropMap.pdf", "doc_path": "data/raw/RPD-en-US/aiw_OrderPropMap.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 3554, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Order property mappings - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Property mapping / Order property mappings\nOrder property mappings\nOrder property mappings are added by the Order Management feature to assist with processing XML order definitions generated by ordering\nsystems. The order property mapping defines which XML elements are used by the CreateOrdersFromFile step to identify orders and jobs and\nwhich ones are used to set properties.\nWhen you create an order property mapping, you define how RICOH ProcessDirector interprets XML elements in a sample file. RICOH\nProcessDirector can use XML elements in two ways:\nOrder and job identifiers\nOrder identifiers are the XML elements that indicate the start of the block of XML for each order included in a file from your ordering system.\nYour system might use the same element for the beginning of each order or it might use different elements, depending on the characteristics of\nthe orders.\nJob identifiers are the XML elements that indicate the start of the block of XML for each job inside an order. Job identifiers must be descendants\nof Order identifiers; this relationship tells RICOH ProcessDirector which jobs are part of each order.\nYou must include at least two XML elements: one to identify orders and one to identify the jobs within that type of order.\nProperty mappings\nProperty mappings are used to set RICOH ProcessDirector properties from XML elements. When you define a property mapping, you identify an\nXML element and which order or job property in RICOH ProcessDirector it corresponds to.\nThe same order mapping object can be used by multiple workflows as long as the XML files contain the same XML elements. The order of the\nXML elements can be different in each preferences file.\nExample\nThis image shows the contents of the sample Order.xml file included with the Order Management feature. Compare this XML with the image of\nthe user interface to help visualize the values in the XML element (XPath expression) columns.\nIn section 2 of the image below, you can see the XML elements that are defined as the order and job identifiers. When the CreateOrdersFromFile\nstep runs, RICOH ProcessDirector reads the file and finds each occurrence of these identifiers. It creates an order for each order identifier it\nlocates and a job for each job identifier in the orders.\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:21 PM Order property mappings - Jenski - Test portal- RPD Linux\nIn the section 3 of the image below, you can see XML elements from the sample file mapped to order and job properties. For example, the XML\nelement (XPath expression) /Order/Order/ID is mapped to the Order Name property, which is associated with the order object. When the\nCreateOrdersFromFile step runs, it reads the XML file and finds each occurrence of /Order/Order/ID. It then copies the value into the Order Name\nproperty for each order created.\nSimilarly, the XML element /Orders/Order/OrderDetails/OrderDetail/ID is mapped to the Job Name property. When the CreateOrdersFromFile step\nruns, it reads the XML file and copies the values into the Job name property for all the jobs created.\nIf the existing order properties do not fulfill your requirements, you might need to define custom order properties from the Administration tab to\nsupport the specific needs.\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:21 PM Order property mappings - Jenski - Test portal- RPD Linux\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:21 PM Order property mappings - Jenski - Test portal- RPD Linux\nParent topic: Property mapping\n4 of 4"}]}