{"doc_name": "ws-inputdevice_c_RunRestWebServWF.pdf", "doc_path": "data/raw/RPD-en-US/ws-inputdevice_c_RunRestWebServWF.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 8789, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Running the sample workflow for processing orders retrieved from REST web services - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring/Setting up to exchange data with web services/Running the sample workflow for processing orders retrieved from REST web services\nRunning the sample workflow for processing orders retrieved from REST web services\nThe RestfulWebServiceWF workflow shows how to process orders retrieved from REST web services that simulate a website for ordering books. A REST web service input device, a CallRESTService step, and a REST web\nservice notification exchange data using the web services. The workflow also gives examples of these steps: ConvertJSONToXML, ApplyXSLTransform, CreateJobsFromXML, and DownloadFile.\nThis workflow uses these sample objects and files:\nWorkflow: RestfulWebServiceWF\nInput device: RestfulWebServiceSample\nThe input device makes a GET call to retrieve JSON orders from a sample REST web service at http://localhost:15080/restapi/1.0/sample/order\nNotification: RestfulWebServiceSampleNotify\nThe notification makes a POST call to a sample web service at http://localhost:15080/restapi/1.0/sample/completeJobTicket\nJSON orders\nOne order is retrieved every 30 seconds from the sample web service.\nContents of sample order:\n{\"Order\": {\"orderId\": \"ORDnumber\", \"customername\": \"Ricoh\"}}\nEach order contains a randomly generated number, for example: 1238875463.\nPrint files: Brochure.pdf and Cover.pdf\nThese files are downloaded locally from http://localhost:15080/restapi/\nXSLT style sheet files:\norderToOverrides.xslt\njobticketToOverrides.xslt\nThe files are in the /aiw/aiw1/testfiles/restsample directory:\nNotification PDF files\nA notification PDF file is generated for each completed order. Each file is named ORDER-ORDnumber, for example: ORDER-ORD1238875463.\nTheCallRESTService step makes a GET call to retrieve JSON job tickets from a sample REST web service at http://localhost:15080/restapi/1.0/sample/jobTicket\nNote:\nThe sample web services are available locally. They return sample data in response to specific requests made by the sample input device, notification, and CallRESTService step. The web services do not support\nother requests.\nThe sample objects and files, including the RestfulWebServiceWF workflow, are installed with the Web Services Enablement feature.\nTo run the sample workflow:\n1. Click the Main tab.\n2. In the Printers portlet, right-click the Sample printer and select Enable.\n3. In the Input Devices portlet, right-click the RestfulWebServiceSample REST web service input device and select Enable and Connect.\nA job appears in the jobs table.\n4. Right-click the RestfulWebServiceSample input device and select Disable.\n5. Right-click the input device again and select Disconnect.\nNote: The sample input device polls for orders every 30 seconds and retrieves a JSON job. If you do not disable and disconnect the input device, a new job appears in the jobs table every 30 seconds.\nEach time the RestfulWebServiceSample input device retrieves a JSON job:\nThe job is sent through the Parent branch of the workflow.\nThe SetJobPropsFromTextFile step sets the Customer name property to RicohSample and the Custom 1 property to RicohCustom.\nThe ConvertJSONToXML step converts the job into XML.\nThe ApplyXSLTransform step uses the orderToOverrides.xslt XSLT style sheet to convert 2 XML elements into 2 RICOH ProcessDirector job properties in an overrides file:\nXML element Job property\norderId Job.Info.Attr3\ncustomernameJob.CustomerName\nContents of sample overrides file:\nJob.Info.Attr3=ORD1238875463Job.CustomerName=Ricoh\nThe step puts the overrides file in the spool directory for the job. RICOH ProcessDirector uses the values in the overrides file to set the values of the properties for the job.\nThe AssignJobValues step sets the value of the Job name property to ORDER-${Job.Info.Attr3}, for example: ORDER-ORD1238875463.\nThe CallRESTService step makes a GET call to one of the sample web services that simulate the website for ordering books. The step specifies order ID as the value of the Request parameters property:\norderId:${Job.Info.Attr3}.\nThe web service returns JSON job ticket information for the order to RICOH ProcessDirector.\nContents of sample job ticket information:\n{\"JobTicket\": [{ \"itemnumber\": \"1182563839\", \"copies\":\"4\",\"media\" : \"Letter Plain\",\"file\" : \"http://localhost:15080/restapi/Brochure.pdf\",\"type\" :\n\"Brochure\",\"title\" : \"RPDBestSeller\"}, { \"itemnumber\": \"1934194376\", \"copies\":\"4\",\"media\" : \"Letter Preprinted\",\"file\" :\n\"http://localhost:15080/restapi/Cover.pdf\",\"type\" : \"Cover\" ,\"title\" : \"RPDBestSeller\" }]}\nThe ConvertJSONToXML step converts the JSON job ticket information into XML.\nThe CreateJobsFromXML step uses the //JobTicket XPath expression to parse the XML job ticket information. The step finds 2 job tickets and creates 2 child jobs.\nContents of sample child jobs:\n<?xml version=\"1.0\" encoding=\"UTF-8\"?><JobTicket><copies>4</copies><file>http://localhost:15080/restapi/Brochure.pdf</file>\n<itemnumber>2112076335</itemnumber><media>Letter Plain</media><type>Brochure</type><title>RPDBestSeller</title></JobTicket><?xml version=\"1.0\"\nencoding=\"UTF-8\"?><JobTicket><copies>4</copies><file>http://localhost:15080/restapi/Cover.pdf</file><itemnumber>1418780325</itemnumber><media>Letter\nPreprinted</media><type>Cover</type><title>RPDBestSeller</title></JobTicket>\nThe step submits the 2 child jobs to the RestfulWebServiceWF workflow.\nThe rule on the [2] Child connector determines whether the jobs are child jobs by checking for a decimal point in the job number. The connector sends child jobs through the Child branch of the workflow.\nThe original JSON job continues through the Parent branch to the RunHotFolderApplication step. That step puts the JSON job in a hot folder: /aiw/aiw1/testfiles/restsample/sending\nOne of the sample web services that simulate the website for ordering books polls the hot folder for jobs. The web service processes each JSON job when it receives a request from the\nRestfulWebServiceSampleNotify notification. For more information, see the list item for the RetainCompletedJobs step.\nThe ApplyXSLTransform2 step uses the jobticketToOverrides.xslt XSLT style sheet to convert 6 XML elements for each child job into RICOH ProcessDirector job properties in an overrides file:\nXML element Job property\nfile Job.Info.Attr2\nitemnumberJob.Info.Attr1\ntype Job.Info.Attr4\ntitle Job.Info.Attr5\ncopies Job.Copies\nmedia Job.Media\nContents of sample overrides file:\nJob.Info.Attr2=http://localhost:15080/restapi/Brochure.pdfJob.Info.Attr1=1182563839Job.Info.Attr4=BrochureJob.Info.Attr5=RPDBestSellerJob.Copies=4Job.Med\nPreprinted\nThe DownloadFile step downloads the Cover.pdf and Brochure.pdf files from http://localhost:15080/restapi/ by setting the value of the URL for download file property to ${Job.Info.Attr2}.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Running the sample workflow for processing orders retrieved from REST web services - Jenski - Test portal- RPD Linux\nThe AssignJobValues2 step sets the values of 3 job properties:\nRequested printer: Sample\nInput data stream: PDF\nJob name: ${Job.Info.Attr5}-${Job.Info.Attr4}\nThe names of the child jobs for the Brochure.pdf and Cover.pdf files are now RPDBestSeller-Brochure and RPDBestSeller-Cover.\nThe OptimizePDF, CountPages, CreatePageRanges, and PrintJobs steps process and print the RPDBestSeller-Brochure and RPDBestSeller-Cover child jobs on the Sample printer.\nWhen each child job arrives at the RetainCompletedJobs step, the RestfulWebServiceSampleNotify web service notification makes a POST call to one of the sample web services at\nhttp://localhost:15080/restapi/1.0/sample/completeJobTicket. The value of the Request parameters property is:\njobTicket:${Job.Info.Attr1}jobId:${Job.ID}\nThe web service waits until all the child jobs for the original JSON job are in the Retained job state. The web service then creates a PDF file containing the job number and item number of each job ticket in the\norder. For example:\n10000001.2 with item number 278955095 has been processed10000001.1 with item number 913895452 has been processed\nThe web service puts the PDF file in the retrieval hot folder for the RunHotFolderApplication step: /aiw/aiw1/testfiles/restsample/retrieval\nThe RunHotFolderApplication step polls the hot folder, finds the PDF job, and sends the job to the next step.\nThe AssignJobValues step sets the value of the Input data stream property to PDF and sends the PDF job to the RetainCompletedJobs step.\n6. In the jobs table, right-click an ORDER-ORDnumber job and select View.\nThe viewer displays the PDF file. The information in the PDF file confirms that the 2 child jobs have been processed.\nParent topic: Setting up to exchange data with web services\n2 of 2"}]}