{"doc_name": "deletingindexes.pdf", "doc_path": "data/raw/RPD-en-US/deletingindexes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2819, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Deleting index tags - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Modifying or deleting AFP Indexer definitions\n/ Deleting index tags\nDeleting index tags\nYou can delete all index tags that were created with AFP Indexer, including page group, supplemental page, page-level, and NOP index\ndefinitions. You can also delete index tags that were created for specific lines in index areas and address areas, and intermediate lines and ZIP\nCodes in address areas.\nNote: Be careful deleting index tags if you have made other enhancements to the sample AFP file that depend on the index tags. For\nexample, do not delete an index tag if you used AFP Editor to create a barcode that contains the index tag value.\nTo delete an index tag:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the definitions for the index tags. Then click Mode ⇒\nAFP Indexer.\n2. Click Tools ⇒ Modify Definitions.\nYou see the Modify and Delete Definitions window with index tags.\nNote: You can only delete an index tag that is defined in the control file. If index tags are displayed in the bottom pane but not in\nthe Modify and Delete Definitions window, the index tags are defined in the AFP file itself. To delete all the index tags that are\ndefined in the AFP file, click Tools ⇒ Other Page Groups ⇒ Use Existing Page Groups.\n3. To delete an index tag that was created for a line in an index area or address area, or a ZIP Code in an address area:\n1. Select the index name for an index area or address area, and then click Modify.\nYou see the Modify Index Tags in an Area window or Modify Index Tags in an Address Area window. Do one or more of these:\nTo delete the index tags for specific lines, select the index tag in the Index tags for specific lines section (use the CTRL key to select\nmore than one index tag) and click Delete. The index tag is removed from the list.\nTo delete the index tags for intermediate lines in an address area, clear the Index intermediate lines field.\nTo delete the index tag for a ZIP Code in an address area, click the ZIP Code tab and remove the name of the index tag in the Name\nfield.\n2. Click OK.\nThe index tags are removed from the list in the bottom pane.\n4. To delete an index tag definition, including all index tags created for an index area or address area:\n1. Select the index definition you want to delete.\n2. Click Delete or press the Delete key on your keyboard.\nThe index tag definition is removed from the definitions list and, if it was a page group index, from the bottom pane.\n5. To close the Modify and Delete Definitions window, click X in the upper right corner.\nParent topic: Modifying or deleting AFP Indexer definitions\n1 of 1"}]}