{"doc_name": "rep_c_PlanForRetention.pdf", "doc_path": "data/raw/RPD-en-US/rep_c_PlanForRetention.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 13274, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Planning for retention of job and document data - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Archive feature / Planning for retention of job and document data\nPlanning for retention of job and document data\nBefore you configure the Archive feature, plan the best way to set up repositories to hold the job and document data that you want to store.\nYou should identify:\nThe files you need to store\nThe properties you need to store\nThe history information you need to store\nThe points in the workflow where you need to store the job and document data\nHow long you need to retain the job and document data\nWho should have access to the job and document data\nThe system on which the job and document data should be stored\nWhat search properties you need to retrieve job and document data after they are stored in a repository\nWhat job property values you need to preserve for use when the job is retrieved from a repository\nThis information helps you decide how many repositories you need. You can then create the repositories and add StoreInRepository steps to your\nworkflows.\nFiles\nEach StoreInRepository step can store one file for each job in one repository. You can store any type of file in your repositories. For example,\nyou can store PDF files, JDF job tickets, AFP files, PostScript files, or compressed files. You can store just property values or job history and no\nfile.\nIf you have the PDF Document Support feature installed, you can retrieve data, including a PDF job, a document from inside a job, or\ninformation about a job, from a repository and view it. If you have the AFP Support feature installed, you can retrieve and view the same\nkinds of data for AFP jobs. You cannot view the contents of jobs or documents in other types of files, though you can view property values\nand job history if you have chosen to store that information.\nYou can create repositories based on who you receive files from or how you use the files in your company. For example:\nA print shop might store files for each customer account in its own repository.\nAn in-house printing department might store files for each line of business in its own repository. One repository might store accounts\nreceivable jobs, and another repository might store accounts payable jobs.\nA company might store files for each call center in its own repository. Call center employees have quick access to the files they need to\nsupport customers.\nProperties\nYou can save the values of job and document properties with or without saving a job file or production history. You can also save the values\nof properties that are associated with a job, but are properties of other objects, and document data that is not defined as RICOH\nProcessDirector document properties.\nYou can use job and document properties to retrieve a job, document, or information about the job from a repository and view the\ninformation. Information about the job can include properties associated with the job, such as the model of the printer used to print the job,\nand document data returned to RICOH ProcessDirector after an external program processes the documents in a job.\nStoring properties takes much less space than storing jobs, so property repositories can be much smaller than repositories that store files.\nYou can specify properties to store based on how you use property information at your company. For example:\nA company might store the customer name, account number, and other information on each document printed as well as the number of\npages in the document and the model of the printer used to print the job. Storing job files containing the actual documents might not be\nnecessary.\nAn in-house printing department might store job files, job and document properties needed to retrieve the documents in each job file, and\npostal processing data (such as change of address information) returned by third-party mail software. Although the postal processing data\nis not defined as RICOH ProcessDirector document properties, department personnel can view the data when they retrieve a document\nfrom the repository.\nProduction History\nYou can save the production history of a job, with or without saving a job file. You can set up history record notifications to capture varying\nlevels of detail about job processing and then set the StoreInRepository step to store history records. For example, you can set up your\nnotifications to record every state change for every step in the workflow that processes the job. Or you can limit what you record by\nchoosing a particular state change, such as when the job state changes to Complete in the InsertJobs step or in the PrintJobs step.\nStoring job history takes less space than storing jobs or documents, so job history repositories can be much smaller than repositories that\nstore files or files and job history together.\nYou can create history record notifications based on how you use job history in your company. For example:\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:18 PM Planning for retention of job and document data - Jenski - Test portal- RPD Linux\nA print shop might want to be able to tell customers precisely when their jobs are received, printed, and ready for pickup.\nA company might want to create an audit trail for all processing performed for specific customers whose jobs are time-sensitive.\nWorkflows\nYou can save files, job history, or both in a repository by adding a step based on the StoreInRepository step template at any point in the\nworkflow. You can have multiple StoreInRepository steps in one workflow.\nIf you want to save jobs at different points in the same workflow, you can create a separate repository for each step. For example, you might\nstore jobs in one repository before you process them so you have a record of the files that you received from customers. You might store\njobs in another repository after you print them with added production information such as postal barcodes. The history records stored by\neach step contain only the job state changes recorded at the time each step ran. When you search for a job from the repository that was\nprocessed by multiple StoreInRepository steps, more than one result is returned. Each result contains only the history information known at\nthe time the step ran.\nNote: Some steps that you can add to your workflows only work at the job level; they are not aware of the documents inside the\njobs. Some of those steps, such as ReversePDFPageOrder, change the order of pages in the job, without consideration for the\ndocument properties that are associated with each page. When the pages are rearranged, the document properties remain associated\nwith their original page locations, even though the content of that page is entirely different. Opening the job in the viewer and\nsearching on document properties results in incorrect search results.\nFor example, you receive a file with 50,000 pages from your customer. The workflow adds barcodes, sorts the job based on postal\ncodes, then reverses the order of the pages so that the last page is printed first.\nIf you store the job in a repository after the IdentifyDocuments, IdentifyPDFDocuments, BuildAFPFromDocuments, or\nBuildPDFFromDocuments steps, and before the ReversePDFPageOrder or ReverseOutputOrder steps, you can retrieve the correct\ndocuments in a job using document properties as search criteria. If you store the job in a repository after the ReversePDFPageOrder or\nReverseOutputOrder steps, searching for a document in a job produces unreliable results.\nAfter you add a StoreInRepository step to a workflow, you can adjust the retention period in the RetainCompletedJobs step. For example,\nyou have set a long retention period in the RetainCompletedJobs step because you might need to reprint a job or document. You can\nreduce the retention period because now you can reprint from the repository.\nRetention periods\nIf you need to retain different jobs or job history for different periods, create a separate repository for each retention period.\nWhen you first set up a repository, you might want to set a short retention period so you can test the information specified in the\nStoreInRepository step. Set a one or two day retention period and send a sample job through the workflow. Then you can check the\nrepository to be sure you stored the correct file, along with its properties and history information. Also verify that the history record\nnotifications you set up are capturing the history information you expect.\nYou cannot delete jobs or documents from a repository or change the properties stored with them, so you must make sure that all of the\ninformation you expect to be retrieved is available. After you complete your testing, you can use the Change Retention Period action on the\nRepositories page to set the value you want to use for your production work.\nAccess\nIf you want to control access to a repository, you can set a value for the Repository location property. Only users who have access to the\nlocation set for the repository can find the documents and jobs stored in it. If different groups of users should have access to different stored\njobs and documents, create a separate repository for each group.\nSystem storage\nIf you want to store files in folders at different places on your computer system, create a separate repository for each folder. You can create a\nrepository on the local system or on a mounted drive anywhere on your network.\nSearch properties\nYou can search for and retrieve jobs, documents, and their history information from a repository based on job or document properties stored\nin the archive.\nFor each StoreInRepository step in each workflow, identify the properties that you need to search for stored jobs, documents, or job history.\nFor example, you might search by the Job name and Customer name job properties. You might search for a document by the Member\nnumber document property.\nNote: The Archive feature provides a large number of job and document properties that you can use to search for jobs and\ndocuments in a repository. Examine the values for the Job properties to store and Document properties to store properties on the\nStoreInRepository step template. If you need custom document properties, you can create them when you enhance PDF or AFP files\nfor use with Archive.\nIn a step based on the StoreInRepository step template, you specify the repository to store the job in and the job and document properties\nused to search for jobs and documents in the repository. You can specify the same repository for multiple StoreInRepository steps. You can\nspecify different search properties for each step.\nIf you use different search properties for different jobs, consider creating a separate repository for each set of jobs that use different search\nproperties.\nWe recommend these best practices:\nSpecify the same search properties for each step that stores jobs in the same repository.\nStore jobs with different search properties in different repositories.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:18 PM Planning for retention of job and document data - Jenski - Test portal- RPD Linux\nChoose properties carefully because after a job or document is stored in the repository, you cannot change its properties or remove the job\nor document from the repository.\nWhen the search properties in a repository are consistent, RICOH ProcessDirector displays search results faster and data is simpler for users to\nfind.\nFor example, repository A has 15 search properties. The properties are the same for each step that stores jobs in the repository. Repository B\nhas 10 search properties. Some jobs stored in repository B use five of the ten properties. Other jobs stored in repository B use three of the\nproperties. RICOH ProcessDirector displays search results faster for Repository A. Because the properties used to search for some jobs are\ndifferent from the properties used to search for other jobs, users searching Repository B can become confused about which properties to\nspecify. If a job or document does not have a value for the property that a user searches for, the job or document is not returned in the\nsearch results.\nSearch speed\nHow you set up repositories can affect the speed of repository searches. Keep these points in mind:\nSearches are faster if a repository has only jobs that were stored with the same search properties than if the repository has jobs that were\nstored with a mixture of different search properties.\nIf a repository has only jobs that were stored with the same search properties, searches are faster if fewer search properties were stored.\nSmaller repositories are faster to search than large repositories.\nSearch speed is not affected if you store data files along with properties and history information.\nPreservation of job property values\nYou can store the values of job properties set when a job is processed to preserve them for use when the job (or a document in the job) is\nretrieved from a repository and submitted as a new job. For example, if a job has custom job properties whose values indicate special\nprocessing requirements, you can store those values in an override properties file and submit them with the job or document when you\nretrieve it from the repository.\nParent topic: Setting up the Archive feature\n3 of 3"}]}