{"doc_name": "rcm_credentialsoverview.pdf", "doc_path": "data/raw/RPD-en-US/rcm_credentialsoverview.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1967, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Credentials - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Credentials\nCredentials\nA credential object specifies the user authentication information required to access an SFTP server or another application. You can use credentials\nwith input devices, steps, and data transmitters that need access to other servers or applications.\nIf multiple input devices or steps access the same SFTP site with the same credentials, you can specify the user authentication information once in\nthe Credential object and then select that credential in the step or input device that needs it.\nRICOH ProcessDirector provides support for the following types of credentials:\nCredentials for input devices and steps\nPassword\nPassword credentials use a user name and password for authentication.\nSSH Key\nSSH key credentials require a private key in OpenSSL (traditional SSLeay) or PKCS#8 format. Different utility programs to generate SSH\nkeys are available on each operating system.\nIf the credentials change and you have multiple input devices or steps that use the same ones, you can edit the Credential object and the\nnew values will be used automatically in all of those places.\nCredentials for data transmitters\nStatic\nStatic credentials use an authorization code to connect to an application. A user or application can use the same credential repeatedly.\nSession\nSession credentials use a password to connect to an application and retrieve temporary authentication data, such as a token. The token\nis valid for the current communication session with the application and then it expires.\nRicoh cloud\nRicoh cloud credentials use a one-time code to generate a certificate. When the certificate is obtained, it can be used to connect to\nRicoh cloud applications, such as RICOH Predictive Insight. The RICOH Predictive Insight Connect feature adds support for the Ricoh\ncloud credential type.\nParent topic: System objects\n1 of 1"}]}