{"doc_name": "mail_c_EnhanceAFP.pdf", "doc_path": "data/raw/RPD-en-US/mail_c_EnhanceAFP.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3298, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Enhancing AFP files for Postal Enablement - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Postal Enablement feature / Enhancing AFP files for Postal Enablement\nEnhancing AFP files for Postal Enablement\nMost AFP files that are submitted to RICOH ProcessDirector need to be enhanced before they can be processed for Postal Enablement.\nIf you plan to use AFP Indexer to enhance AFP files, you must purchase and install the AFP Support feature.\nTo enhance AFP files for use with Postal Enablement:\n1. If the AFP file does not have page group triggers (which identify the start of each mail piece in a job) or index tags defined for the mail\npiece data that you want to extract, AFP Indexer to add that information. Do these steps:\n1. Open the AFP file in the RICOH Visual Workbench.\n2. Select IndexAFP.\n3. Define the triggers that identify document boundaries.\n4. Add index tags for the mailing address data that you want to extract.\n2. Use the Document Property Designer (DPD) mode to link each document property that your postal software requires to an index tag in the\nAFP file. Do these steps:\n1. Open the AFP file in the RICOH Visual Workbench and select the DPD mode.\n2. Double-click the document property name at the bottom of the window.\n3. Supply the requested information in the Define link options dialog.\nWhen a document property is linked to an index tag, the value of the document property is the same as the value of the indexed\ndata.\nFor more information, see the topics related to RICOH Visual Workbench and Document Property Designer.\n3. Save the control file created by RICOH Visual Workbench and send it to the RICOH ProcessDirector server in a directory that the RICOH\nProcessDirector system user has access to.\nThe control file contains Document Property Designer definitions.\nNote: When you configure your Postal Enablement workflows, specify the name of the Visual Workbench control file in a step based\non the IdentifyDocuments step template.\n4. Optional: Use the AFP Enhancer mode in RICOH Visual Workbench to edit an Enhance AFP control file if you want to:\nCreate a barcode with the updated mailing address data returned by the postal software.\nReplace the original mailing address data with updated data returned by the postal software.\nHide areas that contain unwanted content.\nFour sample Enhance AFP control files in the /aiw/aiw1/control_files/postal (Linux) or C:\\aiw\\aiw1\\control_files\\postal\n(Windows) directory replace a PostNet barcode with a Datamatrix barcode that identifies the job number and document number:\nPostalAFPReplaceAddr.cfg\nThis control file also replaces any addresses for which the postal software returned updated address data.\nPostalAFPBuildQualify.cfg\nThis control file also adds an Intelligent Mail barcode.\nPostalAFPBuildNonQualify.cfg\nPostalAFPBuildOther.cfg\n5. Click Tools ⇒ Export EnhanceAFP Control File to export the Enhance AFP control file and send it to the RICOH ProcessDirector server in a\ndirectory that the RICOH ProcessDirector system user has access to.\nNote: When you configure your Postal Enablement workflows, specify the name of the Enhance AFP control file in the step based\non the BuildAFPFromDocuments step template.\nParent topic: Setting up the Postal Enablement feature\n1 of 1"}]}