{"doc_name": "cac_DataObjectCreation.pdf", "doc_path": "data/raw/RPD-en-US/cac_DataObjectCreation.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2576, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Data Object Creation and Installation - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Data Objects / Data Object Creation and Installation\nData Object Creation and Installation\nYou can use a wide variety of software applications to create or manipulate images to include in print jobs. If you want to store them in central\nresource repositories, you can use AFP Resource Installer to install them.\nData object creation\nMost types of data objects are images of some kind. Examples include: photographs taken with a digital camera; charts or diagrams generated\nby a software tool; and digital drawings created using graphics software. Regardless of how images are created, you generally need to\nmanipulate them to include them in print jobs.\nThe changes include:\nConvert the image into a file type that is appropriate for printing. For example, the file types that many graphics applications (such as Adobe\nIllustrator, CorelDRAW, and Corel Paint Shop Pro) use to store images while you work on them are not appropriate for printing. To use images\nthat you create from any of those programs, you can save or export those files as a different file type, such as EPS, JPEG, or TIFF.\nMake sure that your image files are associated with an appropriate color space or input profile. Follow the instructions provided with your\ngraphics software to set up color management, including installing and using ICC profiles for digital cameras and monitors, and customizing\ncolor management settings. The instructions should also explain how to change the color profile that an image uses and how to save an image\nwith an embedded profile.\nFollow the tips and best practices provided in the other sections below for creating images and managing them as data object resources.\nData object installation\nYou can use AFP Resource Installer to install your images in a resource library. AFP Resource Installer includes wizards that can guide you through\nthe process of installing an image as a data object. When you install an EPS, JPEG, or TIFF image with an embedded ICC profile by using AFP\nResource Installer, you can choose how you want to handle the profile:\nLeave the profile in the file without creating a CMR.\nLeave the profile in the file, but also copy the profile and create a CMR from the copy. Associate the new CMR with the data object.\nTo reduce the file size, remove the profile from the file and make the profile into a CMR. Associate the new CMR with the data object.\nParent topic: Data Objects\n1 of 1"}]}