{"doc_name": "aiw00c4afp.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c4afp.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4170, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Defining AFP printer devices - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Defining AFP printer devices\nDefining AFP printer devices\nAFP printer devices represent Intelligent Printer Data Stream (IPDS) printers. They print jobs in AFP format, including jobs that have been\nconverted to AFP format.\nTo define an AFP printer device:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Printers.\n3. Click Add ⇒ AFP Printer.\n4. On the General tab, fill in values for all the required fields.\nIf you set up a secondary server that you want to use to drive this AFP printer, set these properties:\nPrinter server: The secondary server name\nCopy to secondary server: Yes\nDestination directory on secondary server: The location on the secondary server file system where you want RICOH ProcessDirector to\nwrite print files.\n5. On the Scheduling tab, set values for the properties that you want to use to schedule jobs to this printer. If you leave values blank, they\nmatch any value that is set in the corresponding job scheduling properties.\nFor example, set these properties to schedule jobs based on media, output bins, and punching and stapling functions of the printer:\nMedia supported\nIf you choose specific media, only jobs that use that media can be scheduled to this printer. If you choose Ready media objects, only jobs\nthat require the media that is currently loaded in the printer can be scheduled to the printer. If you choose All media, all jobs can be\nscheduled to the printer, regardless of what media is actually loaded.\nOutput bins available\nAny output bin that can be installed on the printer is considered available, although on some printers you cannot install all the output\nbins at the same time.\nPunch capable\nStaple capable\nNote: If you use Preset name as a scheduling property:\nThe value is not updated automatically. You must update it manually whenever the preset on the printer changes.\nThe value you set here is not transmitted to the printer.\nJobs that have a value for their Preset name property can be scheduled to this printer, but they do not request the preset when they\narrive at the printer. If your printer supports requesting a preset with the print job, do not use Preset name as a scheduling property.\nLeave this printer property blank.\n6. On all the tabs, fill in values for any of the optional fields.\nNote:\nThe default value for the Inactivity timer property is 300 seconds, so RICOH ProcessDirector releases the connection to the printer\nafter approximately 5 minutes of inactivity. To maintain the connection between RICOH ProcessDirector and the printer even when\nit is not actively printing, change that value to 9999.\nIf the Share printer connection property is Yes, the printer driver component of RICOH ProcessDirector releases control of the printer\nafter a period of inactivity so that the same physical printer can receive jobs from another input source, such as a hot folder. The\nIPDS printer connection timer property determines how long to wait before releasing control. The IPDS printer connection timer\nproperty must be less than the Inactivity timer property. If the IPDS printer connection timer property is greater than the Inactivity\ntimer property, RICOH ProcessDirector drops the connection before it can share the printer.\nThe default is that the printer driver reports status information in the language that you selected when you installed the RICOH\nProcessDirector server. To receive messages from this printer in a different language, set the Printer language property appropriately.\nThe default value for the Font fidelity property is Continue printing. Do not change this default if IPDS resolution is set to Automatic\nat the printer console.\nFor the InfoPrint 3000, 4000, 4100, and 5000, make sure that the SNMP agent is enabled on the printer console and that the Use\nSNMP property is Yes, so that SNMP can configure the printer.\nNote: For migrated printers, Use SNMP is Yes by default.\n7. Click OK.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Defining AFP printer devices - Jenski - Test portal- RPD Linux\nParent topic: Defining printer objects\n2 of 2"}]}