{"doc_name": "aiw00o2.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o2.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4090, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Input file formats - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Input file formats\nInput file formats\nYou can submit several types of input files to RICOH ProcessDirector to process and print.\nThe input file types that can be submitted to RICOH ProcessDirector are:\nAdvanced Function Presentation (AFP)\nA composed format that can contain text, graphics, images, and barcodes. Composition instructions are in the form of Mixed Object\nDocument Content Architecture (MO:DCA) structured fields. AFP resources, such as fonts, can either be stored externally or embedded in\nthe AFP data stream. AFP is the file format RICOH ProcessDirector uses to print jobs on IPDS printers if the AFP Support feature is installed.\nWithout the AFP Support feature, you can view AFP jobs and pass them to other programs.\nABAP\nContains data that is in the SAP Advanced Business Application Programming (ABAP) format.\nDBCS ASCII\nContains data that is encoded in a double-byte character set (DBCS) ASCII code page.\nDBCS EUC\nContains data that is encoded in a double-byte character set (DBCS) Extended UNIX Code (EUC) code page.\nditroff\nContains device-independent troff (ditroff) data preformatted for an AFP device.\nGIF\nContains image data that is in the Graphics Interchange Format (GIF).\nImage data\nContains image data that is in the Image Object Content Architecture (IOCA) format.\nJPEG\nContains image data that is in the Joint Photographic Experts Group (JPEG) format.\nJSON\nContains data that is in the JavaScript Object Notation (JSON) format.\nLCDS\nContains data that is in the Xerox line-conditioned data stream (LCDS) format.\nLine data\nA combination of plain text and formatting controls, such as carriage controls and table reference characters (TRCs) for spacing and font\nselections. You can instruct RICOH ProcessDirector to use a composition product, such as the line2afp transform that it provides, to process\nline data input files.\nMetacode\nContains data that is in the Xerox metacode format.\nMixed mode\nInput files that contain combinations of line data and MO:DCA structured fields. Mixed mode input files can only be processed if the AFP\nSupport feature is installed.\nOTF\nContains data that is in the SAP Output Text Format (OTF).\nPCL\nContains data that is in the Hewlett-Packard Printer Control Language (PCL) format.\nPDF\nContains data that is in the Adobe Portable Document Format (PDF) format.\nWhen RICOH ProcessDirector processes PDF 2.0 input files in a workflow, steps that modify PDF files convert the data to PDF 1.7 format. If\nno steps in the workflow modify the PDF, the input file passes through RICOH ProcessDirector in PDF 2.0 format. PDF 2.0 files that are sent\nto a Ricoh PDF, TASKalfa, or Ricoh TotalFlow printer with banner pages turned on are also converted to PDF 1.7 format.\nPostScript\nContains data that is in the Adobe PostScript format.\nPPML\nContains data that is in the Personalized Print Markup Language (PPML) format.\nTIFF\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:20 PM Input file formats - Jenski - Test portal- RPD Linux\nContains image data that is in the Tagged Image File Format (TIFF).\nXML\nContains data that is in the Extended Markup Language (XML) format.\nDepending on your printers, you may need to use data transforms to convert some of these formats into a format that your printers support.\nSeveral products provide data transforms:\nThe RICOH Transform features can convert these input file formats to AFP:\nGIF, JPEG, and TIFF\nPCL\nPDF and PostScript\nSAP OTF and ABAP\nIt can convert the following input file format to PDF:\nAFP\nYou must install the AFP Support feature to use the RICOH Transform features.\nIf you have RICOH InfoPrint XT installed on the RICOH ProcessDirector primary computer, secondary computer, or on the same computer as an\napplication server, you can also use it to convert Xerox metacode and LCDS data to AFP. To use InfoPrint XT, include a step that runs the\ntransform program in the appropriate workflow and configure the step to run on the computer where InfoPrint XT is installed.\nParent topic: Product overview\n2 of 2"}]}