{"doc_name": "modifyingbarcodes.pdf", "doc_path": "data/raw/RPD-en-US/modifyingbarcodes.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2459, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying barcodes - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Modifying or deleting AFP Editor definitions\n/ Modifying barcodes\nModifying barcodes\nYou can modify the barcodes that were created with AFP Editor. You cannot modify barcodes that are defined in the AFP file itself.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo modify a barcode:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the definitions for the barcodes. Then click Mode ⇒\nAFP Editor.\n2. Click Tools ⇒ Modify Definitions.\n3. Do one of these:\nSelect the barcode that you want to modify and then click Modify.\nDouble-click the barcode that you want to modify.\nYou see the Modify Barcode window.\nNote: identifies barcodes that were not created because of an error. To see the error message, click Modify and then click OK on\nthe Modify Barcode window.\n4. Optional: On the Type tab, type a new name or change the type of barcode.\nSee Type tab for a description of the fields.\n5. Optional: On the Data tab, change the data to be encoded in the barcode symbol.\nSee Data tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code barcodes or Data tab for IMBs for a\ndescription of the fields.\n6. Optional: On the Position tab, change the exact origin and size of the barcode area, the orientation of the barcode symbol within the area,\nand on which pages to place the barcode in each page group.\nSee Position tab for a description of the fields.\n7. Click OK.\nIf the barcode is an IMB, POSTNET, or QR Code barcode, you see the barcode symbol in the AFP file. If the barcode is a Code 39, Data\nMatrix, Interleaved 2-of-5, or PDF417 barcode, you see a box surrounding the barcode area with the title of the barcode area in the\norientation that you selected for the barcode symbol.\nNote: If the IMB is a text IMB and you do not see the barcode symbol, identify the resource directory that contains the AFP IMB font\nto RICOH Visual Workbench (Resources ⇒ Specify Resource Directories).\nThe AFP IMB font is installed in the aiw/aiw1/plugins/EditAFP directory.\n8. To close the Modify and Delete Definitions window, click X in the upper right corner.\nParent topic: Modifying or deleting AFP Editor definitions\n1 of 1"}]}