{"doc_name": "mcc_c_DefineTicketWorkflow.pdf", "doc_path": "data/raw/RPD-en-US/mcc_c_DefineTicketWorkflow.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5768, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Defining a workflow to process MarcomCentral job tickets - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up to process orders from MarcomCentral / Defining a workflow to process MarcomCentral job tickets\nDefining a workflow to process MarcomCentral job tickets\nTo process job tickets retrieved from a store at the MarcomCentral website, copy the MarcomProcessJobTicket workflow supplied with the\nMarcomCentral Connect feature. The CallSOAPService step (inside the MarcomDownloadPrintFile step chain) calls the Job Ticket MarcomCentral\nweb service and retrieves job tickets by order number. Modify that step and others in the workflow by setting their properties to values that work\nwith your MarcomCentral store and RICOH ProcessDirector workflows.\nThe workflow that processes MarcomCentral job tickets receives child jobs from the CreateOrdersFromFile step in the workflow that processes\nMarcomCentral orders.\nBefore you define the workflow:\nPlan how to process the orders, including how to map XML elements in the orders to RICOH ProcessDirector order and job properties using an\norder property mapping object.\nPrepare to call MarcomCentral web services.\nDefine a SOAP web service input device.\nDefine the workflow that processes MarcomCentral orders.\nFor more information, see the related tasks.\nTo define a workflow to process MarcomCentral job tickets:\n1. Click the Workflow tab.\n2. Right-click the MarcomProcessJobTicket workflow and select Copy.\n3. Name the copy of the workflow, fill in or edit other values that you need, and click Continue.\n4. Check the conditions specified for the (1) Warehouse connector and adjust as required for your MarcomCentral store.\nThe three conditions on the connector in the sample MarcomProcessJobTicket workflow specify MarcomCentral product types JobDirect,\nVariable, and Versioned. Jobs with those product types do not go through the 1 Warehouse connector. Instead, those jobs go through the\n(2) Print shop connector.\n5. Open the MarcomDownloadPrintFile step chain.\n6. In the step chain editor, find the Wait step and set the Wait for property to a value that makes jobs wait until your MarcomCentral store\nprovides the link to the file to download.\nThe (2) Check for file connector and Wait for property together specify how long a job waits for your MarcomCentral store to provide the\nlink to the file. If the store does not provide the link within the specified time, the job goes to the FailWithMessage step. The Wait for\nproperty specifies a wait of 30 seconds, and the rule on the (2) Check for file connector specifies that the job goes through the branch 9\ntimes. The elapsed time before the job goes to the FailWithMessage step is 5 minutes. If you set the Wait for property to 1 minute, the\nelapsed time is 10 minutes. If you then set the rule on the connector to Custom count 1 < 20, the elapsed time is 20 minutes.\n7. For the CallSOAPService step:\n1. Set the Use proxy property to the proxy server (if any) that you use to communicate with the web service.\n2. Set the Password property to your MarcomCentral order token.\n3. Set the SOAP request property to the GetJobTicketByLineItem SOAP request that you imported.\n4. If you prepended MyStore to the names of the SOAP requests when you imported them, set the property to MyStore-\nGetJobTicketByLineItem.\n8. Update the ApplyXSLTransform2 step, if needed.\nIn the ApplyXSLTransform2 step, the XSLT file property is set to use the downloadOverrides.xslt file provided with the feature. This file\nretrieves the URL of the print file and copies the URL into the Custom 3 job property. The DownloadFile step uses that value to retrieve the\nprint file.\nYou can use the downloadOverrides.xslt file as it is. If you want to retrieve additional information from MarcomCentral, create a new\nXSLT file and update this property.\n9. For the DownloadFile step, set the Use proxy property to the proxy server (if any) that you use to communicate with the web service.\n10. Close the step chain editor.\n11. For the RetainCompletedJobs step, set the Retention period property to an appropriate value for your site.\n12. In the Printable branch, modify the four steps in the Print phase or replace them with your steps for processing and printing PDF jobs.\n13. Modify the Warehouse branch:\nIf your workflows process only print items, delete the branch.\nIf your workflows process both print and non-print items, you can keep the ManualStepWithAutoStart step or replace it with other steps.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Defining a workflow to process MarcomCentral job tickets - Jenski - Test portal- RPD Linux\nIf the warehouse staff has access to RICOH ProcessDirector, they can complete the ManualStepWithAutoStart step when they add a\nnon-print item to the order.\nIf the warehouse staff does not have access to RICOH ProcessDirector, you can use other steps to communicate with them.\nFor example, you can add a SendEmail step that sends an email message to the warehouse staff when the non-print item enters the\nWarehouse branch. If your business uses an application with a web service interface to handle pick and pack operations, you can add a\nCallSOAPService step to the Warehouse branch. The step sends the data in the job to the application.\n14. Save the workflow.\n15. Connect the workflow to the workflow that you defined to process MarcomCentral orders:\n1. In the workflow editor, open the workflow that you defined to process MarcomCentral orders.\n2. For the CreateOrdersFromFile step, set the Workflow for new jobs property to the name of the job ticket workflow.\nNow you are ready to add the information required to process the items in an order to your job ticket workflow.\nParent topic: Setting up to process orders from MarcomCentral\n2 of 2"}]}