{"doc_name": "dt_c_settingestimateddurations.pdf", "doc_path": "data/raw/RPD-en-US/dt_c_settingestimateddurations.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4513, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Setting estimated durations for steps in a workflow - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up Deadline Tracker / Setting estimated durations for steps in a workflow\nSetting estimated durations for steps in a workflow\nYou can set the estimated durations for each step in a workflow and use these values to track the progress of jobs through the workflow. Using\nthe estimated durations, the system provides a predicted completion time. The system also provides a predicted path of the job.\nBefore you do this procedure:\nDecide which steps need estimated durations. We recommend that you set estimated durations for all the steps in a workflow through the last\nstep that you want to track. You can set an estimated duration of 1 second for a step like DetectInputDataStream, which takes almost no time\nto complete. You should always specify estimated durations for steps like RunExternalProgram and PrintJobs, which can take a long time to\nprocess. In general, steps that process PDF documents, like ReversePDFPageOrder and PreparePDFOutputForFinishing, can take a long time. You\nshould also set estimated durations for manual steps.\nNote:\nIf you are tracking to a schedule and a deadline, we recommend that you give the step that you select as the Deadline step an\nestimated duration. The estimated duration helps RICOH ProcessDirector track the Predicted outcome for the jobs in the workflow.\nMake sure you account for the total time required by a step. For example, you have a 100-page per minute printer. You can estimate the\nduration of the PrintJobs step for that printer in pages per minute. When you account for paper and toner changes, the actual print speed in\nyour environment might be 50 pages per minute. Set the estimated duration to the actual print speed: 50 pages per minute.\nTo determine how long a step takes to process, you can look at the start and stop times for the step in the job log. Filter on state changes to\nsee each job’s processing time.\nThe last time-sensitive step in your workflow should be the last step with an estimated duration. If the last time-sensitive step is PrintJobs, make\nthat the last step with an estimated duration. Do not set an estimated duration for a step like RetainCompletedJobs.\nTo set estimated durations for the steps in a workflow:\n1. Click the Workflow tab.\n2. Click the name of the workflow you want to modify.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Right-click in the workflow editor and select Estimated durations.\n5. Select one or more steps that you want to set an estimated duration for. Do these steps:\n1. For the Volume and Volume unit properties, specify the number of jobs or pages that are used to calculate the estimated duration.\nIf the estimated duration is for one job, type 1 and select Job(s). If the estimated duration is for 100 pages, type 100 and select\nPage(s).\n2. For the Time and Time unit properties, specify the estimated duration.\nIf the estimated duration is five minutes, type 5 and select minutes. If the estimated duration is two hours, type 2 and select hours.\n3. Set the value for the Include property to Yes.\nIf you do not want to include the estimated duration for the step in the calculation of the estimated duration for the job, set the\nproperty to No.\n4. If you updated the property values for multiple steps using Edit Multiple, click Apply to Selected to apply the changes.\n5. Repeat for these steps for each step that you want to set an estimated duration for.\nIf you have multiple copies of a long-running step in a workflow and you want their estimates to be the same, sort the table by the\nStep template column so that all those steps are together. Select the steps and use the Edit multiple area to set the properties for all\nthe steps at once.\n6. When you finish, click OK.\n6. Save the workflow.\nAfter you have set estimated durations for steps, you can you can set up one or more email notifications that watch for the Tracking status or\nPredicted outcome properties for a job to Behind schedule or May miss and send an email to one or more users to alert them that a job is in\ndanger of missing its schedule.\nParent topic: Setting up Deadline Tracker\n1 of 1"}]}