{"doc_name": "aiw00c12.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c12.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3587, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Grouping child jobs - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Grouping child jobs\nGrouping child jobs\nHot folder input devices can generate child jobs if they are configured to use a batching method. LPD input devices can receive multiple input\nfiles on a print command. However, LPD input devices with a Linux parent server cannot create parent jobs with multiple children. As a result,\none parent job and one child job are created for each input file. If the AFP Support feature is installed, Download input devices can create child\njobs from multi-dataset jobs received from Download for z/OS and AFP Download Plus, or the input devices can merge the jobs into a single job.\nChild jobs created by any of these methods are independent of one another and they do not process in any particular order. To treat these jobs\nas a group of dependent jobs, you can configure a workflow and an input device that keep child jobs together as they progress through the\nworkflow.\nRICOH ProcessDirector provides the WaitForGroup step template to support this function.\nTo group child jobs:\n1. Click the Workflow tab.\n2. Create or update a workflow to use as the child workflow.\n3. If there are any processing steps where all the jobs in the group must be present, such as when the group of jobs requires manual\nprocessing, include a step that is based on the WaitForGroup step template. Put this step immediately before the step that requires all the\njobs in the group.\nFor example, put this step immediately before the PrintJobs step. RICOH ProcessDirector does not move the jobs to the next step until all\nthe jobs in the group have completed the previous step. You can include as many WaitForGroup steps as required.\n4. Save and enable the workflow.\n5. Click the Main tab.\n6. In the Input Devices portlet, click the name of the input device that you want to use for this task.\n7. In the left pane, click Show all tabs to fully expand the notebook.\n8. Set the Workflow property to ParentNoPrint.\n9. Set the Child workflow property to the workflow that includes the step that is based on the WaitForGroup step template.\n10. Set the Submit step property to SubmitInputFiles.\n11. If the input device is a Hot folder device, set the Batching method property to a value other than None, and set values for other properties\nas required.\n12. Verify that the values of the pattern properties in the Advanced area meet the requirements of the jobs.\n13. Click OK.\nNote: If the input device is enabled and connected, you see a message that asks if you want to disable and disconnect the device.\n14. Select the input device and click Enable, then select it again and click Connect.\nWhen the SubmitInputFiles step creates the child jobs, it assigns a process group ID and a number that represents the position of the job within\nthe group. To see all jobs that belong to a specific process group, select one of the child jobs and click Actions ⇒ Groups ⇒ Show Group. RICOH\nProcessDirector updates the jobs table to show all the jobs that are members of the same group as the selected job. This action is only available\nin the legacy user interface.\nWhen you select an action to do on one or more jobs in a group, RICOH ProcessDirector prompts you to include the other files in the group as\nwell.\nYou can also remove jobs from a group through Actions ⇒ Groups ⇒ Remove from Group and add jobs to a group with Actions ⇒ Groups ⇒\nAdd to Group. This action is only available in the legacy user interface.\nParent topic: Preparing to use workflows\n1 of 1"}]}