{"doc_name": "aiw00omedia.pdf", "doc_path": "data/raw/RPD-en-US/aiw00omedia.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1970, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Media objects - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / System objects / Media objects\nMedia objects\nMedia objects represent the paper, forms, or envelopes that jobs are printed on. RICOH ProcessDirector uses them to determine the media that\njobs request and to schedule jobs to printers.\nRICOH ProcessDirector has two types of media objects:\nSystem media\nRepresents the media that is specified for jobs and that can be used for all printers.\nPrinter media\nRepresents the media that is used with a specific printer.\nSystem media and printer media might have different names for the same physical media. If the media names are different, you can create a\nmedia mapping to indicate that they represent the same physical media.\nA media object includes various properties that describe the physical media that can be loaded in a cut sheet printer. Properties for media objects\ninclude size, color, weight, and other characteristics. RICOH ProcessDirector provides several predefined system media objects that you can use.\nYou can also define your own media objects or have RICOH ProcessDirector create them for you.\nIf you have the Preprinted Forms Replacement feature, media objects include properties for electronic forms. A step in your workflow can add an\nelectronic form to job data to create a print file that can be printed on plain paper.\nRICOH ProcessDirector distinguishes between the media that a printer supports and the media that are currently loaded in a printer.\nIf a media object is supported, the printer can print on that media. However, the media is not necessarily loaded in any input tray.\nIf a media object is ready, it is currently loaded in an input tray.\nWhen you load new media in the input trays on a printer, you might need to update the media ready for the printer device. To see if the media\nwas updated automatically, use the Show Trays action on the printer.\nParent topic: System objects\n1 of 1"}]}