{"doc_name": "pdfw_c_plugin_pagegroupdef.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_pagegroupdef.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3144, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Page groups - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / PDF Document Support / RICOH ProcessDirector Plug-in for Adobe Acrobat\n/ Page groups\nPage groups\nA page group is a set of pages that make up a single document, such as a mailpiece or customer statement, within a PDF file. In RICOH\nProcessDirector Plug-in for Adobe Acrobat, a document is a page group. A single PDF file can contain many documents. If an entire PDF file is\ntreated as a single page group, the PDF file represents one document.\nYou should define a page group before you add markup. After you define a page group, you can apply markup to specific pages in each\ndocument. For example, you can add a barcode to the first page of each document, an image to all front-facing pages of each document, or text\nto the first back-facing page of each document.\nYou can define a page group in these ways:\nAs the entire PDF file.\nAs a fixed number of pages.\nBased on text you select that is in the same location on the first page of each page group.\nRICOH ProcessDirector Plug-in for Adobe Acrobat uses the repeated text to determine the first page of each page group. For example, you have\n100,000 customer statements in one PDF file. Each statement has three or more pages. To define a page group, you select Page 1 of, which is\nin the same location on the first page of each statement.\nNote: If you are using a sample PDF file to define page groups, make sure that the content and location of the text you select are\nconsistent among the production PDF files.\nBased on a specific key word or phrase that appears on the first page of a document within a region of text. The surrounding text might\nchange, but the key word or phrase remains the same.\nBased on text you specify that is on the first page of each page group. When you type the text, you can include wildcard characters. RICOH\nProcessDirector Plug-in for Adobe Acrobat interprets the wildcard characters as any character.\nBased on Java regular expressions that you define to specify text on the first page of each page group.\nFor example, you define a Java regular expression so that RICOH ProcessDirector Plug-in for Adobe Acrobat starts a new page group each time\nit finds the English text Page 1 of or the Spanish text Página 1 de.\nWhen text in a selected area changes.\nFor example, you draw a box around the account name on a statement in a PDF file. Whenever the text in the box changes, that page becomes\nthe first page of a new page group. The location of the box on every page must encompass only the text to evaluate or white space (no text).\nUse the Page Group Navigator to see a list of the pages in each page group. After you verify that the page groups are correct, save your control\nfile, which contains your new page group definition. If you define document properties, save them in the same control file. You then add the\nname and location of the control file to a RICOH ProcessDirector step based on the IdentifyPDFDocuments step template.\nParent topic: RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}