{"doc_name": "pdfw_t_plugin_addmultidocprops.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addmultidocprops.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 11345, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Defining multiple document properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with document properties\n/ Defining multiple document properties\nDefining multiple document properties\nYou can define multiple document properties in a block of data in a PDF file. A block of data can be text, DataMatrix barcodes encoded as\nimages, or both.\nNote:\nRead the document property overview section to ensure you understand how document properties are used in RICOH ProcessDirector so\nyou can take full advantage of your RICOH ProcessDirector feature.\nBefore you begin this procedure, verify that the most recent RICOH ProcessDirectordefinitions.zip file is loaded.\nTo define multiple document properties:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains a page group definition or define a page group.\n2. Left-click just above the top left corner of the block of data that you want to capture. Drag the mouse to draw a box around the block of\ndata. You can later view the extracted values to verify your selection.\nNote:\nMake the box you draw big enough to capture the longest occurrence with the most lines of data in your PDF files. Some\ncharacters in a PDF file have a larger white space buffer than other characters. For example, the left edge of a large capital letter\nmight have up to a tenth of an inch of white space buffer that you might need to select in order to capture that letter or line.\n3. Select Define Multiple Properties from the popup menu.\n4. Type a Name for the block of multiple document properties. Do not use spaces or special characters (such as @, #, $, %, or - (dash)) in the\nname. You can use periods and underscores.\n5. Define which type of data to extract values from.\nIf you selected an area that only contains text, select Text under Select from.\nIf you selected an area that only contains barcodes, select Barcode image under Select from.\nIf you selected an area that contains both text and barcodes, select both Text and Barcode image.\nThe text data is placed before the barcode data in the extracted string without an indicator of where the text data ends and the barcode\ndata begins.\n6. Specify the page in each document from which document property data will be extracted. Do either of these steps:\nSelect Pages based on a rule, and then select a rule from the list. The default rule is First Front Only. You can also:\nClick the icon to define a new rule.\nClick the icon to go to the Rules Manager.\nImportant:\nThe Last Back, Last Front, and Last Page rules do not work with the extraction of document property data.\nSelect Specific pages and type the page in each document that you want.\nIf you specify multiple pages, RICOH ProcessDirector Plug-in for Adobe Acrobat extracts the document property data from the last\nspecified page in each document. Examples:\nYou specify pages 2–4. If a document has four or more pages, the document property data is extracted from page 4. If a document has\nthree pages, the document property data is extracted from page 3. If a document has two pages, the document property data is\nextracted from page 2.\nYou specify pages 2,4. If a document has four or more pages, the document property data is extracted from page 4. If a document has\n2–3 pages, the document property data is extracted from page 2.\nYou specify pages 2–n. Because n represents the last page, the document property data is extracted from the last page if the document\nhas two or more pages.\nImportant:\nIf you specify only page n, RICOH ProcessDirector Plug-in for Adobe Acrobat does not extract the document property data from\nany page in a document.\n7. Use the Document Properties section of the definition window to select a document property and define the property extraction rule. This\nsection contains the full text of the first line of the text data you selected. If you choose to edit an existing text block, this section contains\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:17 PM Defining multiple document properties - Jenski - Test portal- RPD Linux\nall of the document properties you have defined for the text block. Follow these steps to define a new document property and the modifier\nextraction rule for it.\n1. Click the add icon ( ) to add a new document property definition row.\n2. Select a RICOH ProcessDirector document property from the Property list. You can define your own document property by typing in a\ndocument property name; however, you cannot use that document property in RICOH ProcessDirector. You should only define your\nown document properties when you are only using RICOH ProcessDirector Plug-in for Adobe Acrobat to export document property\nvalues to a text file.\nNote:\nIf you do not see the RICOH ProcessDirector document property that you want to use, reload the definitions.zip file.\n3. Select the Line of the text block from which you want to extract the selected document property. You can select the line using a top-\ndown or a bottom-up reference. To select a line using a top-down reference, select 1 through n (where n is a positive whole number).\nTo select a bottom-up reference, select Last or select Last - x (where x is the number of rows up from the last row). Instead of\nselecting the row value from the list, you can enter the row number directly into the Line field.\n4. Select the edit icon ( ) to display a Modify Text window where you define one or more modifier extraction rules to extract the exact\ndocument property you need.\n5. Choose one of the following modifiers:\nContent modifiers\nModifier Action\nRemove Character Type one character or a blank character (use the space bar to type a blank character) that\nyou want to remove from the value. The character is case-sensitive. Then select one of\nthese buttons:\nRemove all instances of the character\nThe specified character is removed from all positions in the value.\nFor example, an account number is: 324-1443255-11. You can type a - to remove all -\ncharacters from the value, producing 324144325511.\nRemove leading characters\nThe specified character is removed from the beginning of the value. For example, if you\ntype a blank character, all blank characters are removed from the beginning of the value.\nRemove trailing characters\nThe specified character is removed from the end of the value. For example, if you type a\nblank character, all blank characters are removed from the end of the value.\nRemove leading and trailing characters\nThe specified character is removed from the beginning and end of the value. For\nexample, if you type a blank character, all blank characters are removed from the\nbeginning and end of the value.\nSubstring by Position Select Beginning of Line or End of Line from the Starting From list. Select a number for\nFirst Position to indicate the location of the first character in the text value. Select a\nnumber for Number to Retain to indicate how many characters are retained.\nSubstring by Delimiter Type a character or a blank character in the Delimiter field to indicate where the text value\nis split into separate string segments. The character and the text string are case-sensitive.\nSelect Beginning of Line or End of Line from the Starting From drop-down menu.\nSelect a number for First Position to define the position of the delimiter in the text string.\nSelect a number for Number to Retain to define the number of text string segments to\nretain.\nThese examples show how to select text string segments by specifying a delimiter:\nFor the account number 324-1443255-11, you can use - as the delimiter to split the\nvalue into these three text strings: 324, 1443255, and 11. Select Beginning of Line. To\nselect the second and third text strings (1443255 and 11), select 2 for both First Position\nand Number to Retain.\nFor the mailing address Eldorado Springs CO 80025, you can use a blank\ncharacter as the delimiter to split the value into these four text strings: Eldorado, Springs,\nCO, and 80025. Select End of Line.\nTo select the zip code, select 1 for both First Position and Number to Retain.\nTo select the state, select 2 for First Position and 1 for Number to Retain.\nTo select the city, select 3 for First Position and 10 for Number to Retain. By specifying\n10 for Number to Retain, you can select city names with up to ten words.\nPad with Character Select Beginning of Line or End of Line from the Padding Location list. Enter a character or\na blank character as the padding character into the Character to Pad with field.\nEnter a number in the Minimum Padded Text Length field to define the minimum length of\nthe text string. If the number of characters in the text string is less than this minimum\nlength, padding characters are added until the text string equals the minimum length.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:17 PM Defining multiple document properties - Jenski - Test portal- RPD Linux\nWhen you use a modifier to define a text extraction rule, the Text to Modify field at the top of the Modify Text window contains the\nselected line plus any edits you make to the line. The Modified Value field to the right of a modifier displays the text that results when\nthat modifier is applied to the text it received from either the modifier above it or the Text to Modify field (if you are defining the first\nmodifier).\n6. Continue to apply modifiers until you extract the value you want from the selected line. Click the icon to add a new modifier. The\nFinal Text field below the list of modifiers displays the final modified value, after all modifier extraction rules are applied.\nFor the selected modifier, the Modifier Initial Text field at the bottom of the window displays the value before the modifier is applied.\nThe Modified Text field displays the value after the modifier is applied.\n7. Use the modifier management icons near the top of the window to delete and reorder the modifier extraction rules. Use the icon\nto delete the selected modifier extraction rules. Use the up and down arrow icons to reorder the rules. The rules are applied to the\nline in order from top to bottom.\n8. Click the OK button to save the line extraction rule.\n8. Continue to define the other document properties you need to extract from a line in the block. You can select the same line that you used\nin another document property. If you need to delete a document property or want to rearrange their order, place a check mark in the box\nin front of a document property, and use the icon and the up down arrow icons.\n9. When you have finished defining document properties, click OK.\n10. Click Ricoh ⇒ View Document Property Values to verify that the properties have the content you want.\n11. Optional: You can edit the text block definition by double-clicking its box or by right-clicking the box and selecting Edit.\n12. When you are ready to save all your enhancements to the PDF file, including the new document properties definition, click Ricoh ⇒ Save\nControl File.\n13. Move the control file to a directory location used by a RICOH ProcessDirector server and include its name and location in a RICOH\nProcessDirector IdentifyPDFDocuments step. This control file must also contain the page group definition that defines the documents in the\nPDF files processed by that step.\nParent topic: Working with document properties\n3 of 3"}]}