{"doc_name": "aiw00exprint.pdf", "doc_path": "data/raw/RPD-en-US/aiw00exprint.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4517, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Exporting objects - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Exporting objects\nExporting objects\nTo reuse objects on another RICOH ProcessDirector system, you can export them for use on the other system. On the other system, you then\nimport the objects. Examples of objects are input devices and printers.\nIf you are using the Preprinted Forms Replacement feature, follow the instructions in the help system for exporting media objects with electronic\nforms.\nTo export objects:\n1. Click the Administration tab.\n2. Disable all pop-up blockers in your browser because the export file opens in a pop-up window.\nIf a pop-up blocker is running, you cannot save the export file.\n3. In the left pane, click Utilities ⇒ Export Objects.\nNote:\nTo export all the objects in the system, click the Settings menu ( ) and select Export all system objects.\nTo export specific objects in the system, continue to the next step.\n4. Select the type of object to export from the Add objects by type list.\n5. Select the objects to export and click Add to export list.\n6. Optional: In the Objects to Export table, select the objects you want to add references to and click Add references.\nImportant: Even with the Add references option selected, these items are not added to the export list:\nStep resources referenced by other objects\nAdd step resources to the export list or recreate them on the new system.\nSample files used to define order property mapping objects\nManually copy the sample files to the new system. Sample XML files are stored in: /aiw/aiw1/mapping/proprty_mapping_object\n7. Repeat these steps for any other objects you want to export.\n8. Optional: To remove one or more objects from the Objects to Export table, select the objects you want to remove and click Remove from\nlist.\n9. In the Objects to Export table, select the objects you want to export and click Export.\nNote:\nWhen you export custom document properties and import them into Version 3.10 or higher, copy the\nC:\\aiw\\aiw1\\config\\docCustomDefinitions.xml file to the new RICOH ProcessDirector system.\nWhen you export objects, include all objects that are referenced in workflows in the export file. For example, workflows may include a\nPrintJobs step template that specifies the name of a printer requested for the job in the Requested Printer job property. If that printer\nobject is not included in the export file, the import on the new RICOH ProcessDirector fails.\nYou can only export Password, Session, and Static credentials. RICOH Cloud and Private Key credentials must be generated on the\ncomputers where they are used, so they cannot exported.\nWhen you export objects that reference credential objects, the credential objects are included in the export file.\nIf you created a custom portlet on a RICOH ProcessDirector system prior to version 3.10.1, you cannot import it to a system with RICOH\nProcessDirector version 3.10.1 or later. Create the custom portlet again.\nWhen you export step resources, the files that they refer to are not included in the export package. Copy the files referenced in the step\nresources from the export system to the import system manually. You must copy the files to the import system before you import the step\nresource objects.\nTo export all the step resources, copy the contents of /aiw/aiw1/StepResources from the export system into the same directory on\nthe import system.\nTo export specific step resources, open the XML file that you exported. Find the entry for each step resource that you exported and\nlocate the StepResource.File property. In that value, find the name of the RSC file associated with that step resource. For example, in\nthis value:\n<property name=\"StepResource.File\" value=\"{&quot;fileName&quot; :\n&quot;/aiw/aiw1/StepResources/1992052c6ef44a229b8b43d77232bf53.rsc&quot;,&quot;displayName&quot; :\n&quot;Ricoh_Export-2019-08-26_13-30-04.xml&quot;}\"/>\nThe file name is: 1992052c6ef44a229b8b43d77232bf53.rsc\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:19 PM Exporting objects - Jenski - Test portal- RPD Linux\nFind the file on the export system and copy it into the same directory on the import system.\nIn this section:\nExporting media with electronic forms\nTo reuse media objects with electronic forms on another RICOH ProcessDirector system, you can export them by copying the media.zip file to\nanother system. The Export Objects function exports media objects but does not export the electronic forms defined for media objects.\nParent topic: Managing system objects\n2 of 2"}]}