{"doc_name": "pdfw_t_plugin_loaddocprops.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_loaddocprops.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3001, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Loading RICOH ProcessDirector document properties - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n/ Loading RICOH ProcessDirector document properties\nLoading RICOH ProcessDirector document properties\nTo use RICOH ProcessDirector Plug-in for Adobe Acrobat to define text in a PDF file as a RICOH ProcessDirector document property, you must\nimport the list of RICOH ProcessDirector document properties.\nYou must do this task:\nAfter changes are made to property definition files, you have run the docCustom utility, and you have installed or upgraded the Custom\nDocument Properties feature.\nAfter you define new document properties in RICOH ProcessDirector.\nNote:\nA sample set of document properties are loaded at installation. If you install any RICOH ProcessDirector document processing features, do\nthis procedure to load the full list of document properties supported by your system.\nTo load document properties:\n1. Close Adobe Acrobat Professional.\n2. Retrieve the definitions.zip file from this directory on the RICOH ProcessDirector server that processes your PDF files:\nLinux: /aiw/aiw1/share\nWindows: C:\\aiw\\aiw1\\share\nThis file is generated when you install one of the document processing features and is updated when you create a custom document\nproperty, run the docCustom utility and install or upgrade the Custom Document Properties feature.\nThe definitions.zip file is downloaded when you download the plug-in installer from the Administration tab, but is not loaded\nautomatically. After you make any changes to your custom document properties, you must manually download the definitions.zip file.\n3. On the system where you installed RICOH ProcessDirector Plug-in for Adobe Acrobat, place the definitions.zip file in the\n<user_home_directory\\AppData>\\Roaming\\InfoPrint\\InfoPrintPlugin\\ directory.\nFor <user_home_directory\\AppData>, substitute the name of the home directory application data directory for the current user.\nNote:\nYou can view the application data directory location for the current user by typing %appdata% in the Windows Run command line\nand clicking OK.\n4. Restart Adobe Acrobat Professional and click Ricoh ⇒ Select to activate RICOH ProcessDirector Plug-in for Adobe Acrobat. The list of\nRICOH ProcessDirector document properties in the definitions.zip file is automatically imported into the areas of the plug-in that use\ndocument properties.\nThe definitions.zip file contains document properties and limited document properties. Limited document properties are not saved to a\ndatabase; they are stored in the document properties file that contains the property. For more information about both types of properties, see\nthe topics related to document properties in the information center. For example, see the topic on editing the sample document properties\ntemplate.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}