{"doc_name": "aiw_sdk_overrides.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_overrides.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2568, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM Overrides files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / Overrides files\nOverrides files\nWhen you create a workflow, you can set default values for many job properties. However, those default values might not be appropriate for\nevery job. If you want to send different values with a print job, you can use an overrides file.\nAn overrides file is a text file that contains property and value pairs for job properties; it can be submitted with a print file. When the job is sent\nto a workflow, the SetJobPropsFromTextFile step can use the information in the overrides file to replace the default values.\nThe overrides file must meet these criteria:\nThe overrides file must arrive in the hot folder or SFTP input device after the print file.\nYou must create a separate overrides file for each print file in the job.\nThe file name must match the pattern specified in the Overrides patterns property. The default pattern matches files that have the extension\n.oth.\nEach property and value pair must be on a separate line.\nFor hot folder or SFTP input devices, each pair must be expressed as: database property name=value, with no spaces before or after the equal\nsign (=).\nNote: Overrides files that are used with Download input devices follow a different format and requires the AFP Support feature to be\ninstalled.\nYou can use either of these formats for an overrides file:\nUse the RICOH ProcessDirector database names for the properties, and list each property and value on a separate line. For example:\nJob.Duplex=Yes\nJob.CustomerName=BankName\nJob.Location=Boulder\nIf the AFP Support feature is installed and the overrides arrive in JCL format from a Download input device, the receive_jcl_jobtype.cfg file\nis configured to interpret JCL format. The mainframe program creates the overrides file in JCL format.\nTo submit one or more print files and their accompanying overrides files in the same job, you must use the List batching method and submit a list\nfile with the job. The list file contains the name of each print and overrides file; a print file must be listed before the associated overrides file. The\nlist file might look like this:\ninput1.pdf\nvalues.oth\ninput2.pdf\nmorevalues.oth\ninput3.pdf\nvalues3.oth\ninputfile.pdf\ninputfile.oth\nUse the RICOH ProcessDirector database names for the properties, and list each property and value on a separate line. For example:\nJob.Duplex=Yes\nJob.CustomerName=BankName\nParent topic: Batching methods\n1 of 1"}]}