{"doc_name": "aiw_o_afpsupport_featov.pdf", "doc_path": "data/raw/RPD-en-US/aiw_o_afpsupport_featov.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7171, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM AFP Support - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / AFP datastream support / AFP Support\nAFP Support\nThe AFP Support feature lets you control and track jobs and individual documents in Advanced Function Presentation (AFP) format.\nAFP is a set of formal information presentation architectures, including Mixed Object Document Content Architecture (MO:DCA) and Intelligent\nPrinter Data Stream (IPDS) protocol. The printer driver component converts a device-independent AFP data stream into IPDS for input to printers.\nAFP provides:\nA transaction-oriented data stream that guarantees integrity between the RICOH ProcessDirector server and its printers because the printers can\ndeliver the exact status of every page as it is received, printed, and stacked.\nSupport for open, industry-standard data formats.\nSecure central management of resources. Resources do not need to reside on each printer. They can be loaded once, processed as raster\nimages, and then reused. Confidential resources like digital signatures can be downloaded on demand and deleted at the end of a job.\nWhen processing documents within jobs, AFP carries the information that defines the documents within the data stream for the job. A separate\ncontrol file is not required to define the documents in the data stream.\nThe AFP Support feature has these major parts:\nA new type of input device with supplied examples\nTwo new types of printer devices\nNew scheduling properties\nNew step templates\nNew workflows\nResources\nDocument processing functions\nDownload input device type\nYou can send jobs to download input devices from a z/OS host using Download for z/OS or AFP Download Plus. The DownloadAFP input device\naccepts AFP data sets. The DownloadLineData input device accepts line data or mixed-mode data.\nAFP and PCLOut printer device types\nAFP printer devices represent Intelligent Printer Data Stream (IPDS) printers. They print jobs in AFP format, including jobs that have been\nconverted to AFP format by Transform features. AFP printer devices include many additional printer properties that control data formatting,\nresource and color management, and communication between the RICOH ProcessDirector server and its printers.\nPCLOut printer devices represent Printer Command Language (PCL) printers. They print jobs that are submitted in AFP format and automatically\nconverted to PCL format by the AFP print driver component of RICOH ProcessDirector. You specify the command that sends the jobs to the\nprinter. PCLOut printer devices include some of the additional printer properties provided with AFP printer devices.\nNew scheduling properties\nThe AFP Support feature adds these scheduling properties for jobs: Job class, Job destination, and Job form.\nThe feature adds these scheduling properties for printers: Printer class, Printer destination, and Printer form.\nNew step templates\nThe feature adds several step templates for processing AFP jobs within workflows. For example:\nA step based on the ConvertLineDataJobIntoAFP step template converts a line-data job into the AFP format and sets a variety of job properties\nthat control the conversion process.\nA step based on the EnableRepositioning step template locates the beginning of each page in an AFP or PDF job for use with the RICOH\nProcessDirector viewer component. The step lets you select individual documents to print again or jump to if a printer error occurs.\nA step based on the InsertCMR step template inserts an AFP color management resource (CMR) into a job.\nNew workflows\nThe feature supplies several workflows that you can use as templates for creating your own workflows. For example:\nThe AFP workflow processes AFP input files that are submitted to a hot folder input device or with the LPD protocol.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:21 PM AFP Support - Jenski - Test portal- RPD Linux\nThe PreviewPrintWithColorManagement workflow prints two samples of a job to an InfoPrint® 5000 using different AFP CMRs. You can then\nprint the entire job using the CMRs you choose.\nThe OutputPDF workflow uses Transform Features to convert jobs in different data streams (such as AFP, PCL, PostScript, and SAP) to PDF files.\nFor example, you can use the workflow to copy PDF files into a hot folder that is associated with your printer. The AFP Support feature is a\nprerequisite for the Transform Features.\nThe Transform workflow calls a RICOH ProcessDirector Transform or InfoPrint Transform Manager to convert the input files to the AFP format.\nResources\nThe feature supplies these resources:\nForm definitions that describe the characteristics of a form: overlays required (if any), the paper source (for cut-sheet printers), duplexed\nprinting, text suppression, and the position of the composed-text data on the form.\nAFP color management resources (CMRs) that provide all the color management information, such as ICC profiles and halftones, that an AFP\nsystem needs to process a print job and maintain consistent color from one device to another.\nAFP Compatibility Fonts, including both uniformly spaced and mixed-pitch type families.\nAFP page definition resources that contain a set of formatting controls, including: the number of lines per sheet, font selection, print direction,\nand mappings for individual data fields to positions on the composed page.\nConfiguration files for banner pages to print on AFP printers, including the separator page that prints between copies of a multi-copy AFP job.\nDocument processing functions\nTo process individual documents within AFP jobs, the AFP Support feature adds:\nRICOH Visual Workbench\nThe AFP Indexer mode of RICOH Visual Workbench lets you identify documents and create index tags in AFP files. When you view an AFP file\nthat contains documents and index tags in RICOH ProcessDirector, you can navigate in the file to find pages containing specific values for the\nindex tags. You can also reprint all the pages in one or more documents.\nThe Document Property Designer mode lets you customize document and job properties for AFP files. A customized property can contain the\nvalue of any index tag in an AFP document.\nThe AFP Enhancer mode lets you create barcodes and text, and hide areas that contain unwanted content, such as obsolete barcodes.\nNew step templates\nSteps based on the IdentifyDocuments and BuildAFPFromDocuments step templates identify documents, extract document data values for\nindex tags, and apply document changes made with RICOH Visual Workbench to AFP jobs.\nSteps based on the SortDocuments, SplitDocuments, and GroupDocuments step templates let you manipulate documents within a single file\nand output the documents as one or more new jobs.\nA step based on the SetDocPropsFromList step template lets you set the value of a document property from a list file that is external to RICOH\nProcessDirector. You can use the value of the document property to group documents in a job for common processing.\nIf you convert AFP documents to PDF, a step based on the EmailDocuments step template lets you email each PDF document in a job as an\nattachment to an individual email address.\nParent topic: AFP datastream support\n2 of 2"}]}