{"doc_name": "pdfw_c_plugin_controlfiles.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_plugin_controlfiles.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 5785, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Working with control files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with control files\nWorking with control files\nAs you use RICOH ProcessDirector Plug-in for Adobe Acrobat to mark up a PDF file, instead of saving markup in the PDF file itself, you save\nmarkup to one or more control files. RICOH ProcessDirector Plug-in for Adobe Acrobat uses a control file to extract data, and RICOH\nProcessDirector uses control files in the different stages of preparing a PDF file for printing.\nYou use the Ricoh menu options Load Control File and Save Control File to manage control files. You can only have one control file loaded at a\ntime. When you finish marking up a PDF file, you save the control file to a directory accessed by RICOH ProcessDirector. You configure RICOH\nProcessDirector workflows with one or more step templates that use RICOH ProcessDirector Plug-in for Adobe Acrobat control files.\nImportant:\nDo not manually edit RICOH ProcessDirector Plug-in for Adobe Acrobat control files without advice from a Ricoh support representative.\nRICOH ProcessDirector Plug-in for Adobe Acrobat Version 3.6 includes an improved PDF processing library. For most PDF files, the new\nlibrary improves performance, reduces processing time, and uses less memory.\nWhen you open a control file created in a previous release, RICOH ProcessDirector Plug-in for Adobe Acrobat prompts: Do you want\nto update your control file to use an improved PDF processing library?\nIf you click No, the message appears the next time that you open the control file.\nIf you click Yes, RICOH ProcessDirector Plug-in for Adobe Acrobat updates the control file, and the message never appears again.\nWhen you update a control file, make sure that it produces the same results. Slight differences between libraries could result in slightly\ndifferent text selection boxes. A smaller box could exclude text that you want to select, and a larger box could include text that you do\nnot want. Using the improved library also could change the position of markup slightly.\nNo other changes are required on the RICOH ProcessDirector server to use the improved PDF library.\nTo use a control file built for a PDF 1.7 file with a PDF 2.0 file, you must update the control file to use the new library.\nYou must save any page group definitions and document properties to a single control file. You can add markup, media, and finishing definitions\nto that single control file, or you can separate the definitions into different control files. You specify the control file that defines page groups and\ndocument properties in a step based on the IdentifyPDFDocuments step template. The control files that define markup, media, and finishing\nmust be specified in a step based on the BuildPDFFromDocuments step. When you decide whether to create one or more control files, take your\nprint environment into account: the complexity of your changes, how you want to differentiate your markup, and what PDF file enhancements\nchange most often.\nIn a repetitive print environment where your PDF workflow does not change often, you could choose to create only one control file. When you\npreview a PDF file to verify where markup is going to print and which pages have media and finishing options, you can view all markup, media,\nand finishing in one view. You move the single control file to a directory accessed by RICOH ProcessDirector. You define the control file name and\nlocation in both the IdentifyPDFDocuments and the BuildPDFFromDocuments steps.\nYou could also use one control file when you want to preview the PDF file to make sure that all markup, media, and finishing are applied\ncorrectly. When you preview a file, RICOH ProcessDirector Plug-in for Adobe Acrobat renders markup and applies media and finishing options\nthat are defined in the active PDF file. You cannot use preview to verify markup, media, and finishing definitions in a control file that is not\nloaded.\nYou could choose to use more than one control file in an environment that changes frequently or unexpectedly. By using different types of\ncontrol files, you can mitigate the risk of change or adapt to it quickly. For example:\nThe page group definition is less likely to change than other definitions in your PDF files. You can put the page group and document property\ndefinitions in the control file that you add to the IdentifyPDFDocuments step.\nYou have installed the Inserter feature, and you switch between inserters. You do not have to edit your workflow each time you switch. Instead,\nyou save the barcode markup for each inserter in a separate control file with a name that identifies the inserter. In the BuildPDFFromDocuments\nstep, you specify the name and location of one control file, using symbol notation that matches the value of a job property. During print\nprocessing, you set the value of that job property to the name of the control file that matches the inserter you want to use for the job.\nSymbolic notation also lets you use the same workflow for input files that need different RICOH ProcessDirector Plug-in for Adobe Acrobat\ncontrol files. For example, you have two input files, File1.pdf and File2.pdf, with corresponding control files, File1.ctl and File2.ctl.\nYou want to use the same workflow for both files. You can use ${Job.InputFile}.ctl as the control file name that you specify in the\nBuildPDFFromDocuments step. ${Job.InputFile}.ctl causes RICOH ProcessDirector to set the value of the RICOH ProcessDirector Plug-in for\nAdobe Acrobat control file property to the name of the input file plus the .ctl extension.\nParent topic: Using RICOH ProcessDirector Plug-in for Adobe Acrobat\n1 of 1"}]}