{"doc_name": "doc_o_scen_pull_flood.pdf", "doc_path": "data/raw/RPD-en-US/doc_o_scen_pull_flood.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 8662, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Usage scenario for pulling policies based on addresses in a disaster area - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Usage scenarios for processing documents\n/ Usage scenarios for pulling documents from a job / Usage scenario for pulling policies based on addresses in a disaster area\nUsage scenario for pulling policies based on addresses in a disaster area\nIn this scenario, a service bureau prints policies in a PDF print job. Because severe flooding has made mail delivery impossible in two postal codes,\nthe service bureau suppresses the printing of policies with customer addresses in those postal codes. It removes those policies from the print job\nand emails them to customers.\nThe workflow in this scenario does not have a step that waits for receipt of a pull list. Jobs move through the workflow without waiting. As soon\nas the service bureau provides a pull list of postal codes in a disaster area, RICOH ProcessDirector removes documents with those postal codes\nfrom each print job that enters the SetDocPropsFromList step. When mail delivery resumes to all postal codes in the pull list, the service bureau\nremoves the pull list, and RICOH ProcessDirector does not remove documents from print jobs that enter the SetDocPropsFromList step. The step\nremains in the workflow and can be used whenever documents need to be pulled from a job.\nThe service bureau uses RICOH ProcessDirector Plug-in for Adobe Acrobat to identify the policies as individual documents in the production PDF\nfile for each job. The data in each policy includes the customer name, customer email address, and postal code.\nTo change the workflow so that it pulls policies for customers in the disaster area, an administrator at the service bureau configures RICOH\nProcessDirector to support the new process.\nThe administrator:\nDefines two custom document properties, Doc.Custom.CustomerName and Doc.Custom.PostalCode, in the docCustomDefinitions.xml file.\nRuns the docCustom utility and updates the Custom Document Properties feature.\nLoads the updated RICOH ProcessDirector document properties to RICOH ProcessDirector Plug-in for Adobe Acrobat.\nUses the Define Document Property function in the plug-in to define three document properties:\nDoc.Custom.PostalCode specifies the postal code data.\nDoc.Custom.CustomerName specifies the customer name data.\nDoc.EmailAddress specifies the customer email address data.\nThis document property is supplied with all document processing features.\nThe IdentifyPDFDocuments step in the workflow is going to extract the data for the three document properties from each document in the PDF\nfile for the job. RICOH ProcessDirector is going to use the values of the Doc.Custom.PostalCode document property to determine which\ndocuments to pull from the job. RICOH ProcessDirector is going to use the values of the Doc.Custom.CustomerName and Doc.EmailAddress\ndocument properties in the step that emails pulled documents.\nUses the Save control file function in the plug-in to save the document property definitions in the control file that identifies the policies as\nindividual documents.\nSends the control file to the RICOH ProcessDirector server.\nSpecifies the name of the control file as the value of the Identify PDF control file property for the IdentifyPDFDocuments step.\nAdds a SetDocPropsFromList step to the workflow and sets values for the step properties:\nThe value of List file directory is /aiw/aiw1/clientfiles/pull.\nThe value of Delimiter is New Line.\nThe value of Columns in list file is Doc.Custom.PostalCode.\nThe value of Document property to set is Pull document. Pull document is the user interface name of the Doc.Pull document property.\nThe Doc.Pull property is supplied with all document processing features. It is a convenient choice for the value of the Document property to\nset document property. As an alternative, the administrator could create a custom document property and use it as the value of Document\nproperty to set.\nThe value of Value for matching documents is YES.\nThe value of Value for other documents is NO.\nAdds a Group Documents step to the workflow after the SetDocPropsFromList step and sets the value of the Group first property to Pull\ndocument.\nAdds a CreateJobsFromDocuments step to the workflow after the Group Documents step and sets the value of the Child workflow property to\nthe name of the current workflow.\nAdds conditional processing near the start of the workflow to process parent and child jobs differently. The new branch for child jobs lets them\nbypass the document identification steps.\nAdds a SetDocPropsFromConditions step at the start of the branch for child jobs.\nThe step assigns a value to a job property based on the value of the Pull document document property. The property conditions file sets the\nvalue of the Custom 1 job property to Pull or Print.\nCreates two workflow branches, one for child jobs with documents to be printed, and the other for child jobs with pulled documents. The rules\nfor the branches are:\nCustom 1 = Pull\nCustom 1 = Print\nAdds an EmailDocuments step to the branch for child jobs with pulled documents. The step sends each document as a PDF file to the email\naddress for the customer.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:23 PM Usage scenario for pulling policies based on addresses in a disaster area - Jenski - Test portal- RPD Linux\nThe value of Recipient address is ${Doc.EmailAddress}.\nThe value of Subject line is Policy for ${Doc.Custom.CustomerName}.\nThe value of Message is Because mail service to postal code ${Doc.Custom.PostalCode} has been interrupted,\nwe have attached a PDF copy of your policy.\nThe value of Attach document is Yes.\nThe value of Name of attachment is ${Doc.Custom.CustomerName}.pdf.\nRejoins the two branches by connecting them to a WaitForRelatedJobs step.\nCreates a pull list and uploads it to the /aiw/aiw1/clientfiles/pull directory. The pull list contains two postal codes:\n8045580540\nThe administrator enables the workflow and submits a job to it.\nThe job goes through the workflow branch for parent jobs and moves to the SetDocPropsFromList step. RICOH ProcessDirector :\nRetrieves the pull list from the /aiw/aiw1/clientfiles/pull directory.\nExamines the values for the Doc.Custom.PostalCode property in the document properties file in the spool file for the job.\nCreates a column of values for the Doc.Pull property in the document properties file.\nWhen the value of the Doc.Custom.PostalCode property matches one of the two postal codes in the pull list, RICOH ProcessDirector sets the\nvalue of the Doc.Pull property to YES.\nIt sets the value of the Doc.Pull property for all other documents in the document properties file to NO.\nThe job moves to the Group Documents step, which places each document in one of two groups based on the value of the Doc.Pull property.\nThe job moves to the CreateJobsFromDocuments step, which creates a child job for each group of documents and submits the child jobs to the\nsame workflow.\nThe child jobs go through the workflow branch for child jobs.\nWhen the child jobs reach the SetDocPropsFromConditions step, RICOH ProcessDirector sets the value of the Custom 1 job property:\nFor the child job with the Doc.Pull property set to Yes, the Custom 1 job property is set to Pull.\nFor the child job with the Doc.Pull property set to No, the Custom 1 job property is set to Print.\nRICOH ProcessDirector sends the child jobs to the print branch or pull branch of the workflow based on the value of the Custom 1 job property.\nThe child job with pulled documents moves to the EmailDocuments step, and RICOH ProcessDirector emails each policy as a PDF file to the\ncustomer. A customer named John Doe receives this email:\nTo: John.Doe@mymail.comSubject: Policy for John Doe\nAttachment: John Doe.pdf__________________________________________________Because mail service to postal code 80455 has been\ninterrupted,we have attached a PDF copy of your policy.\nThe child job then moves to the WaitForRelatedJobs step.\nThe child job with documents to be printed moves to the WaitForRelatedJobs step after the PrintJobs step.\nWhen both child jobs arrive at the WaitForRelatedJobs step, RICOH ProcessDirector sends them to the RetainCompletedJobs step.\nAfter mail delivery resumes to postal codes in the pull list, the administrator removes the pull list from the /aiw/aiw1/clientfiles/pull\ndirectory.\nRICOH ProcessDirector prints all documents in the jobs that go through the workflow until the administrator places another pull list in the pull\ndirectory.\nParent topic: Usage scenarios for pulling documents from a job\n2 of 2"}]}