{"doc_name": "aiw00bannerpcpm.pdf", "doc_path": "data/raw/RPD-en-US/aiw00bannerpcpm.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2461, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Updating the coded font and code page mappings for AFP banner pages - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Banner pages / AFP banner pages / Updating the coded font and code page mappings for AFP banner pages\nUpdating the coded font and code page mappings for AFP banner pages\nFor jobs sent to AFP printers, you can update the banner_page_code_page_mapping.cfg configuration file to add custom coded font and code\npage mappings to use with banner pages. If you create your own coded fonts, you specify them in this file so that RICOH ProcessDirector can use\nthem. A sample banner_page_code_page_mapping.cfg file is installed in /aiw/aiw1/samples/banner_pages/ (Linux) or\nC:\\aiw\\aiw1\\samples\\banner_pages\\ (Windows) and in /aiw/aiw1/control_files/banner_pages/ (Linux) or\nC:\\aiw\\aiw1\\control_files\\banner_pages\\ (Windows).\nNote: Updates might overwrite files in the /aiw/aiw1/samples/banner_pages/ directory, but they do not overwrite files in the\n/aiw/aiw1/control_files/banner_pages/ directory. We recommend copying sample files into the\n/aiw/aiw1/control_files/banner_pages/ directory and making all your changes in the copied file.\nAny coded fonts that you create must be in one of these directories so that RICOH ProcessDirector can locate and use them:\nThe directory that the AFP resource path property for the job associated with the banner page specifies\n/aiw/aiw1/resources\n/usr/lpp/psf/reslib\nTo update coded font and code page mappings for AFP banner pages:\n1. Log in to the primary computer as the RICOH ProcessDirector system user ( aiw1 is the default).\n2. Navigate to /aiw/aiw1/control_files/banner_pages/.\n3. Open the banner_page_code_page_mapping.cfg file with a text editor.\nLines that begin with a number sign (#) are comments that contain information and instructions.\n4. Add your custom coded font and code page mappings to the section near the top of the file for user-defined information. Use this format:\nAFPCodedFontName=JavaCodePage\n5. Save the configuration file. You can now use your custom coded fonts with banner pages.\nNote: Make sure that any coded fonts that you define in the configuration file support the Intelligent Printer Data Stream (IPDS) resolution\nof the printer that will print the banner page. Depending on the printer model, you can also set the resolution at the printer to AUTO. For\nmore information, see the documentation for the printer.\nParent topic: AFP banner pages\n1 of 1"}]}