{"doc_name": "mail_o_RunningGroupDocsPrintAndProcessWorkflows.pdf", "doc_path": "data/raw/RPD-en-US/mail_o_RunningGroupDocsPrintAndProcessWorkflows.pdf", "num_pages": 4, "nonempty_pages": 4, "total_chars": 12620, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Running the sample workflows for qualified/non-qualified mail - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up the Postal Enablement feature / Running the sample workflows for qualified/non-qualified mail\nRunning the sample workflows for qualified/non-qualified mail\nThe sample workflows for qualified and non-qualified mail include GroupDocsForPostalProcess, PrintForPostalProcess, and ProcessQualifiedDocuments. By\nsubmitting the sample print job into the GroupDocsForPostalProcess workflow and simulating the results obtained from postal software, you can see\nthree child jobs get created corresponding to different postal categories-- Qualified, Non-Qualified, and Other.\nThe GroupDocsForPostalProcess workflow collects document data for the postal software, updates the document data based on the output from the\npostal software, and produces child jobs for each type of mail identified by the postal software. The sample uses results produced by TEC Mailing's\nMailPreparer software to send documents to two other workflows based on what additional postal processing can be performed to optimize the postal\nsavings.\nIf the child jobs do not qualify for additional postal processing, they are sent to the PrintForPostalProcess workflow where the PostNet barcode on the\noriginal job is removed and a 2D barcode is added for mail piece tracking. Documents classified as Other are sorted by number of sheets and documents\nclassified as Non-qualified are sorted in zip code order but not using postal software.\nIf the child jobs from GroupDocsForPostalProcess qualify for additional postal processing, the jobs are sent to the ProcessQualifiedDocuments workflow. In\nthe ProcessQualifiedDocuments workflow, the job is processed again by postal software to sort the documents according to postal rules. An Intelligent\nMail barcode and a 2D datamatrix barcode is also added to these Qualified documents.\nThe sample objects used in this workflow include:\nHot folder input device: PostalFolder\nWorkflow: GroupDocsForPostalProcess\nWorkflow: PrintForPostalProcess\nWorkflow: ProcessQualifiedDocuments\nThe sample files provided for use with these workflows are summarized in the table below.\nFilename File Specified in Used by Workflow Used by Step Description\nLocation property\nPostalPDFBuildQualify.ctl /aiw/aiw Build PDF PrintForPostalProcess BuildPDFFromDocuments Builds a PDF file with the\n1/contro control file PostNet barcode\nl_files/ 1 replaced with a\npostal Datamatrix barcode that\n(Linux) or identifies the job\nnumber and document\nC:\\aiw\\a\nnumber and adds an\niw1\\cont\nIntelligent Mail barcode.\nrol_file\ns\\postal\n(Windows)\nPostalPDFBuildOther.ctl /aiw/aiw Build PDF PrintForPostalProcess BuildPDFFromDocumentsOther Builds a PDF file with the\n1/contro control file PostNet barcode\nl_files/ 1 replaced with a\npostal Datamatrix barcode that\n(Linux) or identifies the job\nnumber and document\nC:\\aiw\\a\nnumber.\niw1\\cont\nrol_file\ns\\postal\n(Windows)\nPostalPDFBuildNonQualify.ctl /aiw/aiw Build PDF PrintForPostalProcess BuildPDFFromDocumentsNonQualified Builds a PDF file with the\n1/contro control file PostNet barcode\nl_files/ 1 replaced with a\npostal Datamatrix barcode that\n(Linux) or identifies the job\nnumber and document\nC:\\aiw\\a\nnumber.\niw1\\cont\nrol_file\ns\\postal\n(Windows)\n1 of 4"}, {"page": 2, "text": "2/4/26, 2:16 PM Running the sample workflows for qualified/non-qualified mail - Jenski - Test portal- RPD Linux\nFilename File Specified in Used by Workflow Used by Step Description\nLocation property\nPostalPDF.ctl /aiw/aiw Identify GroupDocsForPostalProcess IdentifyPDFDocuments Identifies the page\n1/contro PDF control groups in the sample\nl_files/ file PDF print file and defines\npostal the data to be extracted\n(Linux) or in document properties.\nC:\\aiw\\a\niw1\\cont\nrol_file\ns\\postal\n(Windows)\npostal_doc_qualified.csv /aiw/aiw Property ProcessQualifiedDocuments SetDocPropsFromConditions Sets the workflow for\n1/contro conditions the documents in the\nl_files/ file job to\npostal PrintForPostalProcess.\n(Linux) or Sets sequence numbers\nfor documents according\nC:\\aiw\\a\nto the presort sequence\niw1\\cont\nreturned by the postal\nrol_file\nsortation software.\ns\\postal\n(Windows)\npostal_doc_print_afp.csv /aiw/aiw Property PrintForPostalProcess SetDocPropsFromConditionsAFP Sets the child job names\n1/contro conditions to reflect the Processing\nl_files/ file category. Sets the\npostal EnhanceAFP control file\n(Linux) or name for the child job in\neach Processing\nC:\\aiw\\a\ncategory.\niw1\\cont\nrol_file\ns\\postal\n(Windows)\npostal_doc_print.csv /aiw/aiw Property PrintForPostalProcess SetDocPropsFromConditions Sets the child job names\n1/contro conditions to reflect the Processing\nl_files/ file category.\npostal\n(Linux) or\nC:\\aiw\\a\niw1\\cont\nrol_file\ns\\postal\n(Windows)\npostal_doc.csv /aiw/aiw Property GroupDocsForPostalProcess SetDocPropsFromConditions Maps MailPreparer\n1/contro conditions return codes for each\nl_files/ file document to Processing\npostal category values ( Non-\n(Linux) or qualified, Qualified, and\nOther). Sets the\nC:\\aiw\\a\nworkflow name for the\niw1\\cont\nchild jobs that are\nrol_file\ncreated based on the\ns\\postal\nGroupDocuments step.\n(Windows)\nPostal.pdf /aiw/aiw Job name The sample PDF print\n1/testfi file.\nles\n(Linux) or\nC:\\aiw\\a\niw1\\test\nfiles\n(Windows)\n2 of 4"}, {"page": 3, "text": "2/4/26, 2:16 PM Running the sample workflows for qualified/non-qualified mail - Jenski - Test portal- RPD Linux\nFilename File Specified in Used by Workflow Used by Step Description\nLocation property\nPostal.afp /aiw/aiw Job name The sample AFP print\n1/testfi file.\nles\n(Linux) or\nC:\\aiw\\a\niw1\\test\nfiles\n(Windows)\njobid.qualified_doc.csv /aiw/aiw Retrieval ProcessQualifiedDocuments RunHotFolderAppplication A sample external results\n1/testfi pattern file from MailPreparer\nles based on processing the\n(Linux) or child job created for only\nC:\\aiw\\a documents that\nMailPreparer determined\niw1\\test\nwere qualified for postal\nfiles\nsortation. Can be used\n(Windows)\nto move the sample job\nthrough the\nRunHotFolderApplication\nstep to simulate the\nresponse from postal\nsoftware.\njobid.group_doc.csv /aiw/aiw Retrieval GroupDocsForPostalProcess RunHotFolderAppplication A sample external results\n1/testfi pattern file from MailPreparer\nles based on processing of\n(Linux) or the sample print file.\nC:\\aiw\\a Can be used to move\nthe sample job through\niw1\\test\nthe\nfiles\nRunHotFolderApplication\n(Windows)\nstep to simulate the\nresponse from postal\nsoftware.\nPostalAFPBuildQualify.cfg /aiw/aiw Enhance PrintForPostalProcess BuildAFPFromDocuments Builds an AFP file with\n1/contro AFP control the PostNet barcode\nl_files/ replaced with a\npostal Datamatrix barcode that\n(Linux) or identifies theJob number\nand Document number\nC:\\aiw\\a\nand adds an Intelligent\niw1\\cont\nMail barcode.\nrol_file\ns\\postal\n(Windows)\nPostalAFPBuildOther.cfg /aiw/aiw Enhance PrintForPostalProcess BuildAFPFromDocumentsOther Builds an AFP file with\n1/contro AFP control the PostNet barcode\nl_files/ replaced with a\npostal Datamatrix barcode that\n(Linux) or identifies the Job\nnumber and Document\nC:\\aiw\\a\nnumber.\niw1\\cont\nrol_file\ns\\postal\n(Windows)\nPostalAFPBuildNonQualify.cfg /aiw/aiw Enhance PrintForPostalProcess BuildAFPFromDocumentsNonQualify Builds an AFP file with\n1/contro AFP control the PostNet barcode\nl_files/ replaced with a\npostal Datamatrix barcode that\n(Linux) or identifies the Job\nnumber and Document\nC:\\aiw\\a\nnumber.\niw1\\cont\nrol_file\ns\\postal\n(Windows)\n3 of 4"}, {"page": 4, "text": "2/4/26, 2:16 PM Running the sample workflows for qualified/non-qualified mail - Jenski - Test portal- RPD Linux\nFilename File Specified in Used by Workflow Used by Step Description\nLocation property\nPostalAFP.ctl /aiw/aiw Visual GroupDocsForPostalProcess IdentifyDocuments Identifies the page\n1/contro Workbench groups in the sample\nl_files/ control file AFP print file and links\npostal the index tags in the AFP\n(Linux) or file with the\ncorresponding\nC:\\aiw\\a\ndocument properties.\niw1\\cont\nrol_file\ns\\postal\n(Windows)\nTo run the sample workflow:\n1. Log in to RICOH ProcessDirector.\n2. Click the Main tab.\n3. In the Printers portlet, select the Sample printer and click Actions →Enable.\n4. In the Input Devices portlet, select the PostalFolder hot folder input device and click Actions → Enable and Connect.\nThe first time you run this procedure, RICOH ProcessDirector immediately submits the Postal.pdf job to the GroupDocsForPostalProcess workflow.\nThe system starts processing the job through the GroupDocsForPostalProcess workflow. When the job reaches the RunHotFolderApplication step, it\nwaits for results to come from the postal software. The job state changes to Waiting.\n5. To simulate results being returned by the postal software, navigate to /aiw/aiw1/testfiles (Linux) or C:\\aiw\\aiw1\\testfiles (Windows) and\ncopy jobid.group_doc.csv into/aiw/aiw1/postal/receive (Linux) or C:\\aiw\\aiw1\\postal\\receive (Windows).\n6. Navigate to /aiw/aiw1/postal/receive (Linux) or C:\\aiw\\aiw1\\postal\\receive (Windows) and rename jobid.group_doc.csv, replacing\njobid with the Job Number of the sample job you submitted. For example, if the Job number for the sample job is 10000067, rename the file to\n10000067.group_doc.csv.\n7. The job moves on to the SetDocPropsFromConditions step where the sample property conditions file sets the Processing category for each\ndocument ( Qualified, Non-qualified or Other). The value of the Processing category property determines the next workflow for the document. The\nCreateJobsFromDocuments step creates the child jobs based on those document properties.\nDocuments with a Processing category of Non-Qualified are grouped into a child job that is sent to the PrintForPostalProcess workflow. In that\nworkflow, the PostNet barcode is replaced with a 2D barcode that can be used to track the progress of the document through other steps in the\nworkflow. In addition, the documents are sorted in ascending order of zip code.\nDocuments with a Processing category of Other are grouped into a child job that is sent to the PrintForPostalProcess workflow. In that workflow,\nthe PostNet barcode on each document is replaced with a 2D barcode that can be used to track the progress of the document through other steps\nin the workflow. In addition, the documents are sorted in ascending order of the number of sheets.\nDocuments with a Processing category of Qualified are grouped into a child job that is sent to the ProcessQualifiedDocuments workflow. That\nworkflow sends the child job through the postal software again to sort the documents. When the job reaches the RunHotFolderApplication step, it\nwaits for results to come from the postal software. The job state changes to Waiting.\n8. To simulate the results being returned by the postal software for the ProcessQualifiedDocuments workflow, navigate to /aiw/aiw1/testfiles\n(Linux) or C:\\aiw\\aiw1\\testfiles (Windows) and copy jobid.qualified_doc.csv into /aiw/aiw1/postal/receive (Linux) or\nC:\\aiw\\aiw1\\postal\\receive (Windows).\n9. Navigate to /aiw/aiw1/postal/receive (Linux) or C:\\aiw\\aiw1\\postal\\receive (Windows) and rename the file jobid.qualified_doc.csv,\nreplacing jobid with the Job Number of the child job. For example, if the Job number for the child job is 10000067.3, rename the file to\n10000067.3.qualified_doc.csv.\n10. The Qualified child job resumes processing. Because the workflow specifies that each postal container can hold 50 documents, the job is broken\ninto multiple child jobs (grandchild jobs) with a maximum of 50 documents per job. Those child jobs are sent to the PrintForPostalProcess workflow.\nThat workflow adds Intelligent Mail barcodes to the documents.\n11. When each child job from the original job finishes, it is retained for three days and is then deleted. The parent job does not leave the system until all\nof the children (and grandchildren) have completed.\nNote:\nThe sample workflow uses a sample printer that does not print any data. However, the job file can be viewed as it moves through the\nworkflow, so the barcode updates can be observed. For example, you can view the job while it is waiting in the RunHotFolderApplication\nstep to see the PostNet barcode, then view it in the RetainCompletedJob step to see the Datamatrix barcode.\nIf you want to run the example again, you must copy the sample file to the hot folder. The sample file, Postal.pdf, is in\n/aiw/aiw1/testfiles (Linux) or C:\\aiw\\aiw1\\testfiles (Windows).\nIf you want to run the sample AFP file, you must copy the sample file to the hot folder. The sample file, Postal.afp, is in\n/aiw/aiw1/testfiles (Linux) or C:\\aiw\\aiw1\\testfiles (Windows).\nParent topic: Setting up the Postal Enablement feature\n4 of 4"}]}