{"doc_name": "order_runsamplewf.pdf", "doc_path": "data/raw/RPD-en-US/order_runsamplewf.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3927, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Running the Order Management sample workflows - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Configuring to receive orders / Running the Order Management sample workflows\nRunning the Order Management sample workflows\nThe OrderJobSample and OrderSample workflows show how to process orders created from XML input files.\nThis simulation uses these objects and files:\nWorkflows:\nOrderJobSample\nOrderSample\nOrder property mapping: OrderXMLSample\nInput device: OrderHotFolder\nThe input device has a pre-loaded sample order file. It submits the sample file to the OrderSample workflow for processing.\nTo run the Order Management sample workflows:\n1. Click the Main tab.\n2. In the Printers portlet, right-click the Sample printer and select Enable.\n3. In the Input Devices portlet, right-click the OrderHotFolder input device and select Enable and Connect.\nA job named order.xml appears in the Jobs portlet.\n4. The order.xml job goes through the OrderSample workflow to create one order and two jobs.\nThe job contains the sample XML file used for identifying and mapping the orders and jobs based on a property mapping object.\nThe CreateOrdersFromFile step uses the OrderXMLSample property mapping object to identify orders and jobs, then map the values of the\nXML elements in the XML order file to order and job properties.\nNote:\nThis step only runs on the primary server. Do not tune it to run on an application or secondary server, including a local secondary\nserver.\nThe table lists the properties that are set:\nXML element (XPath expression) Object type Property\n/Orders/Order/ID Order Order name (Order.name)\n/Orders/Order/OrderNumber Order External order reference (Order.Reference)\n/Orders/Order/Customer Order Customer name (Order.Customer)\n/Orders/Order/Notes Order Description (Order.Description)\n/Orders/Order/quantity Order Copies (Order.Copies)\n/Orders/Order/DueDate Order Due date (Order.DueDate)\n/Orders/Order/OrderDetails/OrderDet Job Job name (Job.Name)\nail/ID\n/Orders/Order/OrderDetails/OrderDet Job Custom 1 (Job.Info.Attr1)\nail/OrderType\n/Orders/Order/OrderDetails/OrderDet Job Custom 2 (Job.Info.Attr2)\nail/ProductName\n/Orders/Order/OrderDetails/OrderDet Job Custom 3 (Job.Info.Attr3)\nail/PrintFile\n/Orders/Order/OrderDetails/OrderDet Job Media (Job.Media)\nail/PrintFile/@type\nThe step identifies one order with two jobs in it. It creates two jobs and submits the jobs to the OrderJobSample workflow. The Orders\ntable displays one order containing two jobs.\nThe jobs start processing in the OrderJobSample workflow. When the jobs leave the SetJobPropsFromTextFile step:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Running the Order Management sample workflows - Jenski - Test portal- RPD Linux\nIf the item has a printable product type, the workflow sends the job through the Print Shop branch.\nIf the item does not have a printable product type, the workflow sends the job through the Warehouse branch.\nNon-printable jobs go through the ManualStepWithAutoStart step in the Warehouse branch of the workflow. The jobs wait in that step\nuntil the jobs are ready to ship.\nThe WaitForRelatedJobs step holds each job contained in the order until all jobs from the order arrive at the step.\n5. In the jobs table, right-click the job in Manual phase and select Manual Complete.\nThe job moves to the WaitForRelatedJobs step.\nWhen both jobs reach the WaitForRelatedJobs step, the workflow sends all three jobs (the original order job, the non-printable job, and the\nprintable job) to the RetainCompletedJobs step. The state of each job changes to Retained. The state of the order changes to Complete.\nNote:\nYou must refresh the Main page to see a change to the jobs state in the Orders table.\n6. In the Jobs table, right-click the printable job and select View.\nThe viewer displays the PDF file that was printed as part of the order.\nParent topic: Configuring to receive orders\n2 of 2"}]}