{"doc_name": "CreatingInserterBarCodes.pdf", "doc_path": "data/raw/RPD-en-US/CreatingInserterBarCodes.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3524, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating barcodes for insertion - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring the system to use inserters / Enhancing files for insertion / Creating barcodes for insertion\nCreating barcodes for insertion\nYou can place a barcode on each document to control insertion. If the documents have inserter control marks, the barcode supplements or\nreplaces them.\nIn the barcodes, you can include the values of RICOH ProcessDirector job and document properties. In addition, you can include these values:\nNumber of the current sheet (the first sheet in the page group is 1 and so on)\nTotal number of sheets in the document\nProperties to include in a barcode for insertion lists some of the properties that you can include in barcodes.\nProperties to include in a barcode for insertion\nProperty (field\nname) Property (database name) Required Description Length (characters)\nDocument Doc.ID Yes if the inserter does A unique number that identifies the 16\nnumber not write a job-specific document in the system. RICOH\nresults file (such as ProcessDirector assigns this number.\nGunther inserters).\nInsert sequence Doc.Insert.Sequence Yes if the inserter The numeric position of the document 8\nrequires that the in the job. RICOH ProcessDirector\nbarcode contain the assigns this number.\nsequence number of\nthe document in the\njob.\nJob number Job.ID No A unique number that identifies the 8\njob in the system. RICOH\nProcessDirector assigns this number.\nInserter job name Job.Inserter.JobID No The name that the inserter uses for 255\nthe job.\nBin triggers Doc.Insert.BinTriggers No The inserter bins that should deliver 64\ninserts for the document. Y or 1 in a\nbin position can mean that the bin\nshould deliver an insert. N or 0 can\nmean that the bin should not deliver\nan insert.\nTo create barcodes for insertion:\nFor PDF files:\n1. Use the Hide Area function in RICOH ProcessDirector Plug-in for Adobe Acrobat to hide existing inserter control marks.\n2. Use the Add Barcode function to create a barcode.\nFor more information, see the topics related to RICOH ProcessDirector Plug-in for Adobe Acrobat.\nFor AFP files:\n1. Create an Enhance AFP control file.\nYou can use the sample Enhance AFP control file named enhanceAfp.cfg in /opt/infoprint/ippd/extensions/doc/samples (Linux)\nor C:\\Program Files\\Ricoh\\ProcessDirector\\extensions\\doc\\samples (Windows) to create a new control file. You can also use\nthe AFP Enhancer mode in RICOH Visual Workbench to create a new control file.\n2. Edit the Enhance AFP control file to create a barcode.\nNote:\nAFP Editor also creates barcodes. However, it supports values only for the current page in each document and the total number of\npages in each document. If you want to include the values of document properties (such as Document number and Insert\nsequence) in the barcode, you must use Enhance AFP to create the barcode.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating barcodes for insertion - Jenski - Test portal- RPD Linux\nIf you are using the AFP Enhancer mode in RICOH Visual Workbench to edit an existing control file, you must load the RICOH Visual\nWorkbench first.\n3. When you configure your workflows for insertion, specify the name of the Enhance AFP control file in the step based on the\nBuildAFPFromDocuments step template.\nFor information about Enhance AFP, see the White Paper: Using the Enhance AFP Function publication in the RICOH Software\nInformation Center (https://help.ricohsoftware.com/swinfocenter/).\nParent topic: Enhancing files for insertion\n2 of 2"}]}