{"doc_name": "aiw_sdk_jdf.pdf", "doc_path": "data/raw/RPD-en-US/aiw_sdk_jdf.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2169, "pages": [{"page": 1, "text": "2/4/26, 2:13 PM JDF - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing for job submission / Preparing to submit batch jobs / Batching methods / JDF\nJDF\nWhen the batching method is JDF, the hot folder or SFTP input device submits one or more files as a group, based on the contents of the job\nticket.\nThe hot folder or SFTP input device looks for a job ticket containing a list of all the files that make up the job. When the hot folder or SFTP input\ndevice finds a job ticket, it reads the ticket and looks for all the files; as soon as it finds all the files, it submits them as a single job. The files print\nin the order specified in the job ticket.\nThe file name of the job ticket must match the pattern specified in the JDF patterns property. The default pattern matches files that have the\nextension .jdf.\nThe list of files in the job ticket might look like this:\nmyfile1.pdf\nmyfile2.pdf\nmyfile3.pdf\nanother.pdf\nThe job ticket might also contain information that is used to set job properties.\nWhen you use the JDF batching method, set these input device properties as indicated:\nWorkflow: ParentNoPrint\nChild workflow: The workflow that is appropriate for the print files in the job.\nSubmit step: SubmitInputFiles\nCreate .zip file: If this property is set to Yes, all input files that match the value set in the Data patterns property are combined as a ZIP file and\nsubmitted as a single job. If this value is set to No, all input files are submitted as child jobs. If the job ticket specifies different settings for\ndifferent input files and the Create .zip file property is set to Yes, the settings for the first input file name in the job ticket are used for all input\nfiles.\nJDF patterns: A pattern that matches some part of the file name of your job tickets.\nFor all input devices except HotFolderJDF the default value is null. For HotFolderJDF this value is the regular expression .*\\jdf$.\nData patterns: A pattern that matches some part of the file name of your print files. For hot folder or SFTP input devices, the default value is\nthe regular expression: .*$. That pattern matches all file names.\nParent topic: Batching methods\n1 of 1"}]}