{"doc_name": "ws-inputdevice_o_scen_json_orders.pdf", "doc_path": "data/raw/RPD-en-US/ws-inputdevice_o_scen_json_orders.pdf", "num_pages": 5, "nonempty_pages": 5, "total_chars": 20028, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Usage scenario for processing JSON orders with web services - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Advanced workflow features / Web Services Enablement / Usage scenario for processing JSON orders with web services\nUsage scenario for processing JSON orders with web services\nIn this scenario, a printing company wants to process orders retrieved from a website for ordering books. Each order consists of 2 job tickets.\nOne job ticket provides information (including the location of the print file) required to print the book. The other job ticket provides information\nrequired to print the cover for the book. The book and its cover go through different production processes, and the printing company must\nreport when the whole order is completed. The website provides a REST web services interface.\nThe Web Services Enablement feature includes sample objects that show how this scenario works:\nRestfulWebServiceWF workflow\nRestfulWebServiceSample REST web service input device\nJSON orders and job tickets\nXPath expression\nXSLT style sheets\nRICOH ProcessDirector overrides files\nRestfulWebServiceSampleNotify REST web service notification\nTo examine the RestfulWebServiceWF workflow, see the related task topic about running a workflow that processes orders retrieved from REST\nweb services.\nLearning the requirements of the book-ordering website\nThe printing company learns the requirements to communicate with the REST web services for the book-ordering web site. RICOH\nProcessDirector must call 3 web services:\nA call to one web service retrieves JSON information about each book order. If orders are waiting at the website, the web service returns one\nJSON order in response to each GET call. If no orders are waiting, the web service does not respond to the call.\nContents of sample JSON order:\n{\"Order\": {\"orderId\": \"ORD1238875463\", \"customername\": \"Ricoh\"}}\nA call to another web service retrieves JSON information about the job tickets for the book and its cover.\nSample JSON job ticket information:\n{\"JobTicket\": [{ \"itemnumber\": \"1182563839\", \"copies\":\"4\",\"media\" : \"Letter Plain\",\"file\" :\n\"http://localhost:15080/restapi/Brochure.pdf\",\"type\" : \"Brochure\",\"title\" : \"RPDBestSeller\"}, {\n\"itemnumber\": \"1934194376\", \"copies\":\"4\",\"media\" : \"Letter Preprinted\",\"file\" :\n\"http://localhost:15080/restapi/Cover.pdf\",\"type\" : \"Cover\" ,\"title\" : \"RPDBestSeller\" }]}\nA call to a third web service sends the item number of each completed job ticket for an order. When both item numbers for an order have been\nsent, the web service creates a PDF file that lists the job numbers and item numbers. The web service places the PDF file in a directory.\nContents of sample PDF file:\n10000001.2 with item number 1182563839 has been processed10000001.1 with item number 1934194376 has\nbeen processed\nNote:\nThe 3 sample web services simulate web services for a book-ordering website but are available locally as part of the Web Services\nEnablement feature. They return sample data in response to specific requests made by the RestfulWebServiceSample input device, the\nCallRESTService step in the RestfulWebServiceWF workflow, and the RestfulWebServiceSampleNotify notification.\nThe sample web services generate sample orders with different order IDs and sets of sample job tickets with different item numbers. The\nrest of the data in the samples is the same.\nTo make the calls to the web services, the RICOH ProcessDirector administrator learns:\nThe values required to authenticate with the book-ordering website.\nThe values required to request data from each web service.\nThe format of the data provided in the response from each web service.\nThe administrator uses a browser plug-in to run manual tests that request responses from the REST web services. Examples of plug-ins include\nRESTClient for Mozilla Firefox and Boomerang for Google Chrome.\nPreparing to process the JSON\nThe administrator reviews the contents of the JSON orders and job tickets returned by the REST web services and identifies information that\nRICOH ProcessDirector requires. Next, the administrator evaluates the RICOH ProcessDirector capabilities that call web services and process XML\nand JSON. The administrator decides on the RICOH ProcessDirector objects and sets of steps that process the orders and job tickets and extract\n1 of 5"}, {"page": 2, "text": "2/4/26, 2:24 PM Usage scenario for processing JSON orders with web services - Jenski - Test portal- RPD Linux\nrequired information. The administrator then defines the XPath expressions and XSLT style sheets required by the objects and steps.\n1. To process orders and job tickets in RICOH ProcessDirector, the administrator identifies JSON objects that supply required information. The\nadministrator assigns the values of those objects to RICOH ProcessDirector job properties.\nTo call the web service that retrieves JSON information about the job tickets, the administrator must supply the order ID. The\nadministrator also wants to track the customer name in RICOH ProcessDirector.\nTwo members of the JSON order object provide these values: orderId and customername.\nThis table shows the 2 JSON members and the names of the RICOH ProcessDirector job properties that the administrator uses to extract\nthe information.\nJSON member Database name of job property User interface name of job property\norderId Job.Info.Attr3 Custom 3\ncustomername Job.CustomerName Customer name\nTo create separate jobs for each job ticket, the administrator must use the item number. To download and print the PDF files for books\nand covers, the administrator must use the file, copies, and media information in the job ticket. The administrator also wants to track the\nbook type and title in RICOH ProcessDirector.\nSix members of the JSON job ticket object provide these values: file, itemnumber, type, title, copies, and media.\nThis table shows these 6 JSON members and the names of the RICOH ProcessDirector job properties.\nJSON member Database name of job property User interface name of job property\nitemnumber Job.Info.Attr1 Custom 1\nfile Job.Info.Attr2 Custom 2\ntype Job.Info.Attr4 Custom 4\ntitle Job.Info.Attr5 Custom 5\ncopies Job.Copies Job copies requested\nmedia Job.Media Media\n2. Before designing the RICOH ProcessDirector process, the administrator examines the RICOH ProcessDirector objects and step template that\ncall REST web services:\nREST web service input device\nREST web service notification\nCallRESTService step template\nEach of them can make DELETE, GET, PATCH, POST, or PUT calls, and each can process JSON or XML.\nThe input device can create a job from every response, or it can evaluate the response for a JSONPath or XPath expression. If the input\ndevice does an evaluation, it can create a job each time it finds the expression.\n3. The administrator also examines the RICOH ProcessDirector step templates that process XML:\nA step based on the ApplyXSLTransform step template can convert input in one format into output in another format. For example, the\nstep can convert XML into this output:\nA text file containing Ricoh ProcessDirector job or document properties.\nA file with XML in another format for input to the CreateJobsFromXML step.\nA step based on the CreateJobsFromXML step template can create one or more XML jobs by evaluating the contents of an XML input file.\nThe step can submit the jobs as independent jobs or child jobs to a specified workflow.\nBecause ApplyXSLTransform and CreateJobsFromXML do not process JSON, a step based on the ConvertJSONToXML step template can\nconvert JSON to XML for input to those steps.\n4. The administrator decides on the basic components of the RICOH ProcessDirector process.\nTo retrieve JSON orders from the book-ordering website, the administrator chooses a REST web service input device.\nBecause each response contains a single order, the administrator sets up the input device to create a job from every response.\nTo retrieve JSON job tickets for each order, the administrator chooses 3 steps:\nA ConvertJSONToXML step converts the JSON orders into XML for input to an ApplyXSLTransform step.\nThe ApplyXSLTransform step converts order ID and customer name values in the XML orders into RICOH ProcessDirector Custom 3 and\nCustomer name job properties.\nUsing the value of the Custom 3 property, a CallRESTService step retrieves the JSON job tickets.\nTo create a job for each job ticket, the administrator chooses 2 steps:\nA ConvertJSONToXML step converts the JSON job tickets into XML for input to a CreateJobsFromXML step.\nThe CreateJobsFromXML step creates a separate job for each job ticket by evaluating the response using an XPath expression.\nTo extract information from the job tickets and use it to download PDF print files, the administrator chooses 3 steps:\nAn ApplyXSLTransform step converts values in the XML job tickets into RICOH ProcessDirector job properties. For example, the URL of\nthe file to download is converted to the value of the Custom 2 job property.\nUsing the value of the Custom 2 job property, a DownloadFile step downloads the PDF print files.\nAn AssignJobValues step sets the input data stream to PDF to tell the other steps in the workflow the type of file that they are\nprocessing.\nWhen both PDF jobs in an order are printed, the administrator wants to notify the book-ordering website that the order is ready to ship.\nBecause the website uses REST, the administrator chooses a REST web service notification.\n5. For the CreateJobsFromXML step, the administrator needs an XML Path Language (XPath) expression that identifies the job tickets. To\ndefine the expression, the administrator examines the XML for the job tickets.\n2 of 5"}, {"page": 3, "text": "2/4/26, 2:24 PM Usage scenario for processing JSON orders with web services - Jenski - Test portal- RPD Linux\n6. For each ApplyXSLTransform step, the administrator needs an XSLT style sheet to convert XML elements into job properties. The\nadministrator uses an XSLT tool (such as Altova MapForce) to create 2 XSLT style sheets:\nAn order-to-overrides-file XSLT style sheet converts the order ID and customer name elements of the order into job properties.\nA job-ticket-to-overrides-file XSLT style sheet converts the file, item number, type, title, copies, and media elements of the job ticket into\njob properties.\nEach ApplyXSLTransform step outputs the job properties in a text file. The value of each Output file property specifies an overrides file in\nthe spool directory for the job.\nRICOH ProcessDirector uses the values in the overrides file to set the values of the properties for the job. Values from the orders are used to\nretrieve job tickets. Values from the job tickets are used to download and process print files.\nSetting up the workflow\nThe administrator sets up a workflow with 2 branches.\n1. The administrator creates a workflow named ProcessBookOrders and sets the properties of the SetJobPropsFromTextFile step.\n2. The administrator adds 10 steps to the workflow in this order:\nDetectInputDataStream\nThis step sets the Input data stream property to JSON.\nConvertJSONToXML\nThis step uses the default values for the JSON input file and XML output file.\nApplyXSLTransform\nThis step uses the order-to-overrides-file XSLT style sheet to create a text file that sets values for the Custom 3 and Customer name\nproperties. The step outputs the text file as an overrides file in the spool directory for the job. RICOH ProcessDirector uses the overrides\nfile to set the Custom 3 and Customer name property values for the job.\nAssignJobValues\nThis step sets the value of the Job name property to ORDER-order ID.\nCallRESTService\nThis step makes a GET call to another web service for the book-ordering website. The step specifies order ID as the value of the Request\nparameters property:\norderId:${Job.Info.Attr3}\nThe web service returns JSON job ticket information.\nConvertJSONToXML\nThis step uses the default values for the JSON input file and XML output file.\nCreateJobsFromXML\nThe administrator sets the value of the XPath expression to //JobTicket and the value of the workflow for new jobs to\nProcessBookOrders. To keep the new jobs connected to the original job for the order, the administrator sets the value of the Create child\njobs property to Yes. To specify order ID as the job name, the administrator sets the value of the Name for new job property property to\n${Job.Info.Attr3}.\nThe XML jobs that enter the step go to the next step, while the new child jobs are sent down a separate branch of the workflow.\nRunHotFolderApplication\nThe administrator adds this step to communicate with the web service that creates PDF files and puts them in a hot folder. First, the web\nservice polls a hot folder for order jobs. After the web service receives 2 requests per order from the RestfulWebServiceSampleNotify\nnotification, the web service puts a PDF file in another hot folder. The RunHotFolderApplication step specifies the hot folder for order jobs\nas the value of the Sending folder property. The step specifies the hot folder with the PDF files as the value of the Retrieval folder\nproperty.\nNote:\nThis scenario includes a RunHotFolderApplication step because the sample RestfulWebServiceWF workflow uses this step to\nexchange data with the sample web service. Instead of returning a PDF file when an order is complete, the web service could do a\ndifferent function. For example, the web service could send an email message to notify the packing department that the order is\nready to pick up.\nAssignJobValues\nThis step sets the value of the Input data stream property to PDF so that the PDF files created by the web service can be viewed in the\nworkflow.\nRetainCompletedJobs\n3. The administrator connects the RetainCompletedJobs step to the RemoveJobs step.\n4. The administrator creates a second branch to process the child jobs for the books and their covers.\nThe administrator sets a rule on the connector between the SetJobPropsFromTextFile and DetectInputDataStream steps:\nRule name: Parent\nOrder of execution: 1\nProperty: Job number\nComparison: Unlike\nValue: *.*\nThe rule sends JSON jobs that the input device retrieves to the DetectInputDataStream step.\nThe administrator adds an ApplyXSLTransform2 step in the Receive phase and connects it to the SetJobPropsFromTextFile step.\nThe step uses the job-ticket-to-overrides-file XSLT style sheet to create an overrides file that sets values for the Custom 2, Custom 1,\nCustom 4, Custom 5, Job copies requested, and Media properties. Custom 2, Custom 1, Custom 4, and Custom 5 are file, item number,\ntype, and title, respectively.\nThe administrator sets a rule on the connector between the SetJobPropsFromTextFile and ApplyXSLTransform2 steps:\nRule name: Child\nOrder of execution: 2\n3 of 5"}, {"page": 4, "text": "2/4/26, 2:24 PM Usage scenario for processing JSON orders with web services - Jenski - Test portal- RPD Linux\nProperty: Job number\nComparison: Like\nValue: *.*\nThe rule sends child jobs that the CreateJobsFromXML step creates to the ApplyXSLTransform2 step.\nBecause the focus of this scenario is web services, the printing portion is simple. A production process could send the books and their\ncovers through different steps in different workflows or branches to different printers.\n5. The administrator adds 6 steps to the workflow in this order:\nDownloadFile\nThis step downloads PDF files for the book and its cover from a website. The step sets the value of the URL for download file property to\nCustom 2, which contains the file download information from the job ticket.\nAssignJobValues\nThis step sets the value of 3 job properties:\nRequested printer\nInput data stream\nJob name\nThe value of Job name is ${Job.Info.Attr5}-${Job.Info.Attr4}: the book title, a hyphen, and the type of print job (book or\ncover).\nOptimizePDF\nCountPages\nCreatePageRanges\nPrintJobs\nNote:\nBecause the focus of this scenario is web services, the printing portion of the workflow has only 4 steps. A production process\ncould send the books and their covers through many more steps in separate branches (or separate workflows) to different\nprinters.\n6. The administrator completes the workflow by connecting the PrintJobs step to the RetainCompletedJobs step.\nThis figure shows the input device, workflow, and notification. The black line indicates that the CreateJobsFromXML step submits the child jobs\nto the ProcessBookOrders workflow.\nSetting up the input device\nOn the General tab of the REST web service input device, the administrator sets the value of the child workflow property to ProcessBookOrders.\nThe input device submits JSON orders retrieved from the web service for the book-ordering website to that workflow. The administrator sets the\npolling interval to 30 seconds to retrieve orders quickly when several of them are waiting at the website. Other properties are set to match the\nenvironment of the printing company.\nOn the Request tab, the administrator specifies the values required to retrieve JSON orders from the REST web service. Because each response\ncontains one JSON order, the administrator sets the value of the Create jobs from response property to Always. The network at the printing\ncompany does not require a proxy server.\n4 of 5"}, {"page": 5, "text": "2/4/26, 2:24 PM Usage scenario for processing JSON orders with web services - Jenski - Test portal- RPD Linux\nNote:\nTo use a proxy server, set the Use proxy server property to Yes. Proxy server properties are set on the Proxy server tab of the System\nSettings page.\nOn the Authentication tab, the administrator specifies the values required to authenticate with the REST web service.\nNote:\nThe supplied RestfulWebServiceSample input device shows how to set up a REST web service input device for this scenario. The input\ndevice calls a web service that does not require authentication. For information about authenticating with a REST web service, see the\nrelated task topic.\nSetting up the notification\nOn the Request tab of the REST web service notification, the administrator specifies the values required by the REST web service that receives the\nnotification. The network at the printing company does not require a proxy server.\nNote:\nTo use a proxy server, set the Use proxy server property to Yes.\nOn the Authentication tab, the administrator specifies the values required to authenticate with the REST web service.\nNote:\nThe supplied RestfulWebServiceSampleNotify notification shows how to set up a REST web service notification for this scenario. The\nnotification calls a web service that does not require authentication. For information about authenticating with a REST web service, see\nthe related task topic.\nOn the Event tab, the administrator specifies the notification event information:\nEvent type: Job\nProperty: Current job state\nAction: Changes to\nValue: Retained\nOn the Conditions tab, the administrator specifies the notification conditions information:\nApply any or all of the following conditions = All\nProperty 1: Workflow\nComparison 1: =\nValue 1: ProcessBookOrders\nProperty 2: Job number\nComparison 2: like\nValue 2: *.*\nThe summary of the conditions statement is:\nJob.JobType = 'RestfulWebServiceWF' AND Job.ID like '*.*'\nWhen all the child jobs for an order reach the RetainCompletedJobs step, the notification calls the web service. The web service creates a PDF file\ncontaining the item number of each job ticket in the order. The web service puts the file in a hot folder monitored by the\nRunHotFolderApplication step. The PDF file appears in the jobs table. Employees at the printing company can view the PDF file to confirm that\nthe book and cover for the order have been printed.\nProcessing jobs through the workflow\nThe RestfulWebServiceWF workflow supplied with the Web Services Enablement feature is similar to the ProcessBookOrders workflow. To see\nhow jobs are processed through the ProcessBookOrders workflow, run the RestfulWebServiceWF workflow. For more information, see the related\ntask topic about running a workflow that processes orders retrieved from REST web services.\nParent topic: Web Services Enablement\n5 of 5"}]}