{"doc_name": "aiw00ojobsjdf.pdf", "doc_path": "data/raw/RPD-en-US/aiw00ojobsjdf.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5625, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Jobs with JDF job tickets - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Jobs with JDF job tickets\nJobs with JDF job tickets\nWhen you submit a job to an input device, you can submit a JDF job ticket with it. RICOH ProcessDirector can set many job properties from\nvalues in the job ticket. Jobs with JDF tickets work best when configured with Ricoh PDF printers.\nRICOH ProcessDirector supports functions defined in the JDF Specification that the system requires, including a subset of the JDF Integrated\nDigital Printing Interoperability Conformance Specification (IDP ICS) and the associated Application Note. The IDP ICS is based on the JDF\ncombined digital printing process, which is intended for integrated digital printers.\nRICOH ProcessDirector does not support all possible values in the JDF job ticket. If RICOH ProcessDirector cannot use a value to set a job\nproperty, it will remove unsupported values from the job ticket.\nNote:\nThe IdentifyPDFDocuments step can receive multiple sets of PDF files and job tickets. The step combines them into a single PDF file and a\nsingle job ticket. When the step creates the combined job ticket, it includes only values that RICOH ProcessDirector supports. It does not\ninclude unsupported values in the combined job ticket. The IdentifyPDFDocuments step is provided by the PDF Document Support\nfeature.\nRICOH ProcessDirector synchronizes the job ticket and the job properties notebook to the extent possible whenever the job ticket is requested. If\nthe workflow contains a step based on the RunExternalProgram step template that submits the job to another application, it can submit the JDF\njob ticket too. The step compares the property values in the job property notebook with the values in the job ticket and updates the values as\nneeded. If the other application changes values that RICOH ProcessDirector supports in the job ticket, RICOH ProcessDirector updates the job\nproperties after the other application processes the job and returns the updated job ticket.\nThe value of the Media property is a special case, because it depends on the setting for Media Matching:\nIf Media Matching is set to Use media product ID or media name, RICOH ProcessDirector uses one of these media names as the value of the\nMedia property for a job:\nThe name of the media object with the matching product ID specified in the job ticket.\nThe name of the media specified in the job ticket.\nRICOH ProcessDirector first checks whether the job ticket specifies a media product ID. If it does, RICOH ProcessDirector looks for a system\nmedia object with the same product ID. If RICOH ProcessDirector finds a match, it puts the name of the matching media object in the Media\nproperty for the job. If RICOH ProcessDirector does not find a match, it looks for a media object with the media name specified in the JDF job\nticket. If RICOH ProcessDirector finds a match, it puts the name of the matching media object in the Media property for the job.\nIf Media Matching is set to Use the properties selected below, RICOH ProcessDirector uses the media properties (such as size) listed in the job\nticket to search the existing system media objects and find one that matches. When it finds an appropriate media object, the name of that\nobject is set as the value of the Media property for the job.\nYou can choose the properties that are used for Media Matching based on the needs of your installation.\nIf more than one media object matches, RICOH ProcessDirector tries to determine which one is the best match based on the rest of the media\nproperties in the job ticket, including the name of the media. If the system cannot determine the best match or if no media objects match, the\njob goes to Error state. You can use the Correct Media action on the job to select the media and move the job out of Error state.\nIf a job ticket specifies values for media and stapling, you can view and change them in the job properties notebook. On the Scheduling tab, the\nMedia required property lists the media values for both the job and any page exceptions. The Stapling required property shows whether stapling\nis required. You can set the job values in the Media and Staple properties on the Scheduling tab. You can change the page values on the Page\nException tab using the Page exceptions action.\nIf a job ticket specifies values for sides exceptions, you can view them using the Page Exceptions action on the job in the user interface. You\ncannot change the Sides page exceptions.\nIf you have the PDF Document Support feature, do not modify any media settings when a job is between the IdentifyPDFDocuments step and the\nBuildPDFFromDocuments step in a workflow.\nNote:\nMedia and stapling values for page exceptions are only applied to PDF jobs with JDF job tickets sent to Ricoh PDF, TASKalfa, or\nPassthrough printers.\nOnly media values for page exceptions are applied to jobs sent to Kodak PDF printers and Xerox PDF printers. Stapling is not supported\nfor these printers.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:20 PM Jobs with JDF job tickets - Jenski - Test portal- RPD Linux\nThe JDF job ticket is stored in the spool directory for the job with the data files. The job ticket is named jobID.overrides.jdf\nIn this section:\nUnderstanding page counts in PDF jobs\nWhen a PDF job with a JDF job ticket that specifies a mixture of duplex and simplex pages is processed by the CountPages step, the blank sides\nof the simplex sheets are not counted in the Total pages property. Some printer controllers cannot process job tickets with these Sides page\nexceptions.\nParent topic: Product overview\n2 of 2"}]}