{"doc_name": "aiw00o1.pdf", "doc_path": "data/raw/RPD-en-US/aiw00o1.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 7048, "pages": [{"page": 1, "text": "2/4/26, 2:20 PM Product overview - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview\nProduct overview\nRICOH ProcessDirector is a print manufacturing system architecture that lets you manage all aspects of your printing processes. Whether your\nprinting environment is small, with a single printer, or large, with many printers, RICOH ProcessDirector can grow as your business needs grow.\nThe modular design of RICOH ProcessDirector provides flexibility, while the comprehensive user interface provides consistency in how you\nmanage all aspects of your printing environment:\nThe open framework of RICOH ProcessDirector lets you make the most of your existing software investment. You can use third-party programs,\nor create your own command-line programs and incorporate them in your RICOH ProcessDirector processing tasks.\nRICOH ProcessDirector provides seamless connections to your sources of data. You can copy or move files into hot folders and configure RICOH\nProcessDirector so that it continually monitors those directories, then automatically creates and processes jobs. You can submit jobs using the\nLPD protocol from anywhere in your network, and have RICOH ProcessDirector automatically process those jobs. If you have the AFP Support\nfeature installed, you can send jobs from a z/OS host using Download for z/OS or AFP Download Plus.\nRICOH ProcessDirector accepts jobs in various data streams and can send them to a wide variety of printers from different vendors.\nThe extensive RICOH ProcessDirector database includes detailed audit information about your printing workload and tasks, and lets you\nmanage your business more efficiently.\nRICOH ProcessDirector runs as a web application, so you can access it from a browser running on any Microsoft Windows or Linux computer on\nyour network. You do not need to install RICOH ProcessDirector on those computers, only on the primary computer.\nIn this section:\nRICOH ProcessDirector subscription\nYou can purchase a RICOH ProcessDirector subscription for different periods of time, ranging from 1 to 5 years.\nSystem objects\nA RICOH ProcessDirector system is made up of several objects.\nInput file formats\nYou can submit several types of input files to RICOH ProcessDirector to process and print.\nOutput formats\nRICOH ProcessDirector can send jobs to Ricoh TotalFlow printers, Ricoh PDF printers, TASKalfa printers, Custom PDF printers, and to any printer\nthat can receive jobs submitted using the LPD protocol. With the AFP Support feature installed, it can also send jobs to IPDS printers. It can copy\nprint jobs to the hot folders that some printers, such as the InfoPrint 5000 printer, use to receive non-IPDS jobs.\nJob submission methods\nYou can submit jobs to RICOH ProcessDirector from other systems using RICOH ProcessDirector user interface, FTP, web services, other file\ncopying methods, or a command that uses the LPD protocol. If you have the AFP Support feature installed, you can submit jobs to RICOH\nProcessDirector from host systems using Download for z/OS and AFP Download Plus.\nJobs with JDF job tickets\nWhen you submit a job to an input device, you can submit a JDF job ticket with it. RICOH ProcessDirector can set many job properties from\nvalues in the job ticket. Jobs with JDF tickets work best when configured with Ricoh PDF printers.\nJobs with XML files\nRICOH ProcessDirector can process jobs submitted as XML files. You can submit XML files to a hot folder input device or place an XML file at a\nlocation from which the RICOH ProcessDirector server retrieves it.\nJobs with JSON files\nRICOH ProcessDirector can process jobs submitted as JSON files. You can submit JSON files to an input device or place a JSON file at a location\nfrom which the RICOH ProcessDirector server retrieves it. You can use REST web service input device to retrieve JSON files that become jobs.\nJobs with encrypted PDF files\nRICOH ProcessDirector can receive encrypted PDF files, but must decrypt the files to process the jobs. It can also encrypt PDF files to be sent\noutside the system if needed.\nWorkflow phases\nRICOH ProcessDirector has several distinct workflow phases. These phases help to organize the path that jobs take through the system. Jobs can\nflow through all the phases or through a few of the phases. The addition of features to the base RICOH ProcessDirector product might add\nadditional phases to the workflow. The default phase names can be changed to better match the functions that you perform in that phase.\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:20 PM Product overview - Jenski - Test portal- RPD Linux\nDocument properties file\nThe document properties file (DPF) can contain properties of documents in a job. The file is stored in the spool directory for the job.\nDocument database\nThe document database is an internally managed database that stores and manages the properties of individual documents in the system. You\ndo not do actions directly on the document database, but on the documents that it contains.\nDocument properties configuration file\nThe document properties configuration file defines custom document properties to use with document processing features. The file is named\ndocCustomDefinitions.xml.\nDocument properties names file\nThe document properties names file is an optional file that defines caption information for custom document properties for display in the user\ninterface. The file is named docCustomDefinitions.properties. It is associated with custom document properties that you define in the\ndocCustomDefinitions.xml file.\nDocument properties template file\nThe document properties template file determines which properties go into the document properties file for a job. The template file lets you\ncontrol the number of document properties to be used, as well as the order of the columns in the document properties file.\nProperties\nRICOH ProcessDirector uses properties to define the characteristics of all its objects, such as input devices, workflows, and jobs. It stores the\nproperties and their corresponding values in database tables.\nInput device, job and printer event notifications\nYou can configure the system to send an email when certain input device, job or printer events happen. The emails can go to one or more\npeople, or to all the members of a group.\nMedia\nRICOH ProcessDirector uses media objects to represent physical media. Like printer objects, media objects are representations of physical objects\noutside of the system. Each media object represents a type of paper, envelope or other material that your printers can print on.\nWeb services in RICOH ProcessDirector\nRICOH ProcessDirector provides web services that use Representational State Transfer (REST) software architecture principles so you can access its\nfunctions from other applications.\nFeatures\nRICOH ProcessDirector features provide more functions or let you add support for devices like inserters to the system. The modular design of\nRICOH ProcessDirector lets you add features to the base product as your business needs change.\nParent topic: Overview\n2 of 2"}]}