{"doc_name": "cac_ResInst.pdf", "doc_path": "data/raw/RPD-en-US/cac_ResInst.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2459, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM RICOH AFP Resource Installer - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / RICOH AFP color and grayscale products / RICOH AFP Resource Installer\nRICOH AFP Resource Installer\nRICOH AFP Resource Installer is a key element of an AFP color management system when resources are stored in central libraries. You can use it\nto create, install, and manage color management resources (CMRs) and data objects for use in your system.\nAFP Resource Installer is a Java application that you install on a Windows workstation. You can use it to install and work with fonts in addition to\nCMRs and data objects.\nYou can use AFP Resource Installer to:\nCreate CMRs from existing data, including ICC profiles.\nYou can use a wizard to guide you through the process.\nInstall CMRs, fonts, and data objects in resource libraries on the local system or on any system that you can access with FTP.\nAssociate CMRs with data objects, so data objects can be reproduced accurately on different printers.\nIn some cases, you can reduce the file size of your images by removing the embedded color profile from the file and using an associated CMR.\nMark resources as capturable.\nCapturable resources can be captured and saved in the printer for use with other print jobs, which can help improve system performance. The\nprint server queries the printer before it sends any resources; if the printer already has the resource, the print server does not have to send it.\nMark resources as private.\nPrivate resources cannot be captured in the printer and must be downloaded with every print job that uses them. For example, you can mark\nsignature files used for company checks as private for security reasons.\nWhen you use AFP Resource Installer to install a color conversion CMR, the software automatically creates link (LK) CMRs between the new color\nconversion CMR and the existing color conversion CMRs. When a print file references the new CMR, the print server automatically downloads\nthe link CMRs that match the target device type and model and sends them to the printer with the print job. If one of those link CMRs is\nappropriate, the printer can use it instead of having to spend extra time creating a link CMR.\nTo let a print server use resources installed by AFP Resource Installer, you must add the path to the resource libraries to the AFP resource path in\nthe server.\nParent topic: RICOH AFP color and grayscale products\n1 of 1"}]}