{"doc_name": "changingfonts.pdf", "doc_path": "data/raw/RPD-en-US/changingfonts.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3121, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Mapping fonts for AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Mapping fonts for AFP files\nMapping fonts for AFP files\nIf RICOH Visual Workbench does not display a custom AFP font correctly in the sample AFP file, you can map the font to a comparable Java font\nof the same point size and style, and you can change how particular code points map to Unicode code points.\nYou can also change the default code page that RICOH Visual Workbench uses to another encoding.\nWhen you are creating or editing index tags and you cannot read the text, you can change the code page mapping so the index value is\nreadable. When you want to change the way the text is displayed in RICOH Visual Workbench, you can change the character set mapping.\nAFP font mappings can be located in multiple places. RICOH Visual Workbench looks for font mappings in this order:\n1. Job font mappings in the Visual Workbench control file\n2. Installation font mappings in font-mapping files\n3. System font mappings\nYou cannot change system font mappings, but you can create job font mappings for an AFP file that are saved in the control file, and you can\nedit installation font mappings in one or more of these font-mapping files that are shipped with RICOH Visual Workbench:\nCharacterSets.properties: Maps an AFP character set to corresponding font attributes or a AFP font global identifier (FGID) to a corresponding\nJava font name and style.\nCodedFonts.properties: Maps an AFP coded font to an AFP character set and AFP code page.\nCodePages.properties: Maps an AFP code page or a Java charset encoding to an AFP code page global identifier (CPGID).\nSampleCodePointMap.cp: Maps a code point to a Unicode code point. Use this file to create a code point map file for each AFP code page that\ndoes not use standard Unicode code-point mapping. The name of the file must contain the name of the AFP code page.\nYou can change the default Java font that RICOH Visual Workbench uses by defining the font in the control file or in the font-mapping files. The\ndefault Java font, unless you change it, is an 11-point font with an EBCDIC code page.\nIn this section:\nUsing font-mapping files to map fonts\nTo map a custom AFP font to a Java font, edit one or more of the sample font-mapping files that RICOH Visual Workbench provides in directory\n/aiw/aiw1/lib/AVE/resources.\nCreating font mappings from text blocks\nWhen RICOH Visual Workbench cannot display text in an AFP file correctly, you can use text blocks in the file to create font mappings.\nModifying font mappings from text blocks\nAfter you create character set, coded font, or code page mappings from text blocks in an AFP file, you can modify or delete the font mappings.\nChanging the default code page encoding\nIf the sample AFP file refers to AFP fonts that are based on a code page that is different from the default code page and you have not mapped\nthe fonts to Java fonts, the default code page can cause the text to be unreadable.\nParent topic: Working with sample AFP files\n1 of 1"}]}