{"doc_name": "kdk_c_Define_KodakPDF.pdf", "doc_path": "data/raw/RPD-en-US/kdk_c_Define_KodakPDF.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2061, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Defining Kodak PDF printer devices - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Defining Kodak PDF printer devices\nDefining Kodak PDF printer devices\nKodak PDF printer devices represent specific models of Kodak printers that can print PDF or Postscript files. Jobs are assigned to Kodak PDF\nprinters using scheduling properties.\nBoth Kodak PDF printer devices and Passthrough printer devices can print jobs in PDF or Postscript format. Kodak PDF printer devices support\nmore functions such as sending values for media and finishing to the printer. If Kodak PDF printer devices support your printer model, we\nrecommend that you define a Kodak PDF printer device rather than a Passthrough printer device.\nTo define a Kodak PDF printer device:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Printers.\n3. Click Add ⇒ Kodak PDF Printer.\n4. On the General tab, fill in values for all the required fields.\nNote:\nThe printer driver reports status information in the language that you selected when you installed the RICOH ProcessDirector server.\nTo receive messages from this printer in a different language, set the Printer language property appropriately.\n5. On the Scheduling tab, enter the values that you want RICOH ProcessDirector to use to assign jobs to this printer. Leave the values blank or\nNot set for any properties that should not be used for scheduling. Those values match any values specified by the corresponding job\nscheduling properties.\nIf you want to schedule jobs to a printer based on media, keep these items in mind when you set the Media supported property:\nIf you choose specific media, only jobs that use that media can be scheduled to this printer.\nIf you choose Ready media objects, only jobs that require the media that is currently loaded in the printer can be scheduled to the printer.\nIf you choose All media, all jobs can be scheduled to the printer, regardless of what media is actually loaded.\n6. Click OK.\nParent topic: Defining printer objects\n1 of 1"}]}