{"doc_name": "aiw02cmtsrcgrp.pdf", "doc_path": "data/raw/RPD-en-US/aiw02cmtsrcgrp.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2265, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Using source groups - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / AFP resources in RICOH ProcessDirector / Color mapping table source and output files / Parts of a color mapping table / Using source groups\nUsing source groups\nEach source group has an identification (ID) number from 1 through 127, which is used to match the source group with a corresponding target\ngroup.\nYou can have unique ID numbers; or, if you want to map several source groups to a single target group, you can use the same ID number for\nmultiple source groups. The cmt utility generates pairs of sources and targets, then assigns increasing, sequential IDs to each pair.\nYou must classify each source group as one of these input color spaces:\nHighlight color\nUse highlight color when your existing documents describe color in terms of the percent to be covered and the percent to be shaded for a\ncolor number. The colors are device-dependent. For example, if your printer allows the use of three colors for highlighting, specify percent\ncoverage and percent shading for colors 1, 2, or 3. The printer setup determines the actual colors.\nStandard Object Content Architecture (OCA)\nStandard OCA uses defined combinations of red, green, and blue to create blue, red, pink, magenta, green, turquoise (cyan), and yellow.\nStandard OCA also defines several defaults such as white on a black medium, black on a white medium, and the same color as the medium.\nThe medium could be, for example, paper or a display.\nGOCA pattern fill\nGOCA pattern fill defines patterns for filling areas that you might want to map to colors with a color mapping table.\nFor more information about these color spaces, see Mixed Object Document Content Architecture Reference.\nYou can use a color mapping table to choose specific object types to map, such as:\nObject area\nIM image data\nPTOCA data\nPage presentation space\nGOCA data\nOverlay presentation space\nBCOCA data\nIOCA data (bi-level, FS10)\nAll PTOCA, GOCA, BCOCA, IOCA, FS10, and IM object data\nAll objects, object areas, and presentation spaces\nAfter you choose the color spaces and object types that you want to map, you can specify exact values for the fields that you want to map.\nParent topic: Parts of a color mapping table\n1 of 1"}]}