{"doc_name": "cac_CMRLink.pdf", "doc_path": "data/raw/RPD-en-US/cac_CMRLink.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3815, "pages": [{"page": 1, "text": "2/4/26, 2:21 PM Link Color Conversion CMRs - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Color Management Resources / Types of CMRs / Link Color Conversion CMRs\nLink Color Conversion CMRs\nLink color conversion CMRs combine the processing information required to convert an image directly from the color space of an input device to\nthe color space of the output device. Essentially, link color conversion CMRs replace a pair of color conversion CMRs.\nConverting color images to and from the PCS takes a significant amount of processing resources, in part because the process includes two\nconversions. Link color conversion CMRs combine the two conversions and make them more efficient. The printer can use the link color\nconversion CMR to convert colors directly from the color space of the input device to the color space of the output device with the same color\nfidelity they would have if the printer did both of the conversions. As a result, link color conversion CMRs can improve system performance.\nThe two types of link color conversion CMRs are:\nLink CMRs\nLink (LK) CMRs are unique. You cannot create a link CMR yourself and you do not include references to link CMRs in your print jobs. The\nprint system creates and uses link CMRs automatically.\nIf you use AFP Resource Installer, link CMRs are generated automatically when you create or install a color conversion CMR. As a result, your\nresource library always contains link CMRs for every combination of color conversion CMRs in audit (input) and instruction (output)\nprocessing modes. When link CMRs are created, AFP Resource Installer marks them as capturable, so the printer can save them to be used in\nother print jobs.\nIf you do not use AFP Resource Installer, some printers can create link CMRs when they process print jobs. For example, if you send a print\njob to an InfoPrint 5000, the printer controller looks at the audit color conversion CMRs that are specified. Then, the print controller looks at\nthe link CMRs that it has available to find one that combines the audit color conversion CMR with the appropriate instruction color\nconversion CMR. If it does not find one, the print controller creates the link CMR and uses it. The print controller can be configured to save\nthe link CMRs that it creates. However, the link CMRs are sometimes removed during normal operation, for example, if the printer runs out\nof storage or is shut down. If the link is removed, the printer must create a new link CMR the next time it is needed.\nWhen a link CMR is created, the print system evaluates the conversion algorithms to and from the PCS. The system then combines the\nalgorithms, so a data object can be converted directly from one color space to the other without actually being converted to the PCS.\nDevice link CMRs\nDevice link (DL) CMRs use an ICC device link profile to convert directly from an input color space to an output color space without reference\nto an audit-mode or instruction-mode CMR. An ICC device link profile is a special kind of ICC profile that is used to convert the input device\ncolor space to the color space of an output or display device. ICC device link profiles are not embedded in images.\nYou can create, install, and uninstall device link CMRs yourself. Device link CMRs are referenced in the MO:DCA data stream and take\nprecedence over audit color conversion CMRs. A device link CMR specifies its own rendering intent, which is indicated in the header of the\nICC device link profile. This rendering intent overrides any other rendering intent that is active.\nThe biggest advantage of using device link CMRs is that they preserve the black channel (K component) of the input color space when\nconverting from CMYK to CMYK.\nParent topic: Types of CMRs\n1 of 1"}]}