{"doc_name": "pdfw_t_plugin_addcontrigger.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addcontrigger.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2490, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Defining a conditional trigger - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with rules\n/ Defining a conditional trigger\nDefining a conditional trigger\nYou can define text in a PDF file as a trigger to control whether markup is applied to a page when RICOH ProcessDirector processes a PDF file.\nThe text can also control whether media and finishing options are applied to a page and whether document properties are extracted from a\npage.\nNote: If you are experimenting to determine which text to use as a conditional trigger, you do not have to save the conditional trigger in a\ncontrol file before you use preview mode. For preview mode, RICOH ProcessDirector Plug-in for Adobe Acrobat generates a temporary\ncontrol file.\nTo define a conditional trigger:\n1. Open a PDF file in Adobe Acrobat Professional and load a control file that contains the page group definition.\n2. Left-click slightly above and to the left of the text that you want to use as a conditional trigger. Drag the mouse to draw a box around the\ntext.\nNote:\nIf you draw a box around an area with no text, the conditional trigger determines that its condition is met whenever the area has\nno text. The condition is also met when the area has an image or other markup but no text.\n3. Select Define Conditional Trigger.\n4. Verify that the Trigger box has the text that you selected. If not, click Cancel and select the text again.\n5. Type a Name for the trigger. Do not use spaces or special characters (such as @, #, $, or %) in the name. You can use periods and\nunderscores.\n6. Click OK to create the trigger.\nThe conditional trigger is now available on the drop-down list for specifying conditions when defining rules.\nExample\nYou want to extract a customer account number for every page group. Each invoice in your PDF file contains the word Account near the upper\nleft of the first or second page of every document. Each customer account number is printed to the right of that word. The longer invoices also\nhave the customer account number on the third page.You draw a box around the first occurrence of the word Account in the PDF file you are\nenhancing, and you name the trigger acct_trg.\nNext, you create a rule with a condition that specifies the trigger: acct_trg = Account.\nFinally, you define a document property that applies the rule.\nParent topic: Working with rules\n1 of 1"}]}