{"doc_name": "modfiyinghiddenareas.pdf", "doc_path": "data/raw/RPD-en-US/modfiyinghiddenareas.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3278, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Modifying hidden areas - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Modifying or deleting AFP Editor definitions\n/ Modifying hidden areas\nModifying hidden areas\nYou can modify the hidden areas that were created with AFP Editor.\nNote: In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click\nView ⇒ Units.\nTo modify a hidden area:\n1. In RICOH Visual Workbench, open a sample AFP file and the control file that contains the definitions for the hidden areas. Then click Mode\n⇒ AFP Editor.\n2. Click Tools ⇒ Modify Definitions.\n3. Do one of these:\nSelect the hidden area that you want to modify and then click Modify.\nDouble-click the hidden area that you want to modify.\nYou see the Modify Hidden Area window.\nNote: identifies barcodes that were not created because of an error. To see the error message, click Modify and then click OK on\nthe Modify Barcode window.\n4. To change the descriptive name of the hidden area, type the new name in the Hidden area name field.\n5. To change the origin (top-left corner) of the hidden area, type new values in these fields.\nX position\nThe horizontal distance of the left side of the hidden area measured from the left side of the logical page (not the physical sheet of\npaper). Decimal values (such as 2.5) are allowed. The X position cannot be greater than the width of the page.\nY position\nThe vertical distance of the top of the hidden area measured from the top of the logical page (not the physical sheet of paper).\nDecimal values (such as 2.5) are allowed. The Y position cannot be greater than the height of the page.\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the page in the unrotated view.\n6. To change the size of the hidden area, type new values in these fields.\nWidth\nThe horizontal width of the hidden area. Decimal values (such as 2.5) are allowed. The width of the area cannot be greater than the\nwidth of the page.\nHeight\nThe vertical height of the hidden area. Decimal values (such as 2.5) are allowed. The height of the area cannot be greater than the\nheight of the page.\nNote: Measure the width and height from the origin of the hidden area in the unrotated view.\n7. To change the placement of the hidden area, select one of these options:\nPage n: Place the hidden area on page n of each page group (n is the page where you drew the box for the hidden area). You cannot\nchange this page number. If the page number is incorrect, click Cancel and draw the box for the hidden area on the correct page.\nMultiple pages: Place the hidden area on:\nAll pages\nAll pages in each page group\nEven pages\nThe even pages in each page group (pages 2, 4, 6,...)\nOdd pages\nThe odd pages in each page group (pages 1, 3, 5,...)\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Modifying hidden areas - Jenski - Test portal- RPD Linux\n8. Click OK.\nYou do not see any text or image data in the hidden area in each page group.\n9. To close the Modify and Delete Definitions window, click X in the upper right corner.\nParent topic: Modifying or deleting AFP Editor definitions\n2 of 2"}]}