{"doc_name": "designingproperties.pdf", "doc_path": "data/raw/RPD-en-US/designingproperties.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2200, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Customizing properties for AFP files - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Customizing properties for AFP files\nCustomizing properties for AFP files\nYou can use Document Property Designer to customize document and job properties for AFP files by linking the properties to index tags. Index\ntags are also called Tagged Logical Elements (TLEs). In addition, you can define link options for the properties and edit the index tag values.\nIf you want to manipulate documents or jobs using only the standard properties provided in all document processing features- for example, if\nyou want to split a job based on the number of sheets in each document–you do not need to link custom document properties to index tags.\nHowever, in most cases you will have custom document or job properties that you want to use. For example, if you have a custom document\nproperty representing a postal code and you link it to its corresponding index tag, then you can sort, split, or group documents by their postal\ncode.\nIn this section:\nLinking custom properties to index tags\nYou can use RICOH Visual Workbench to link document or job properties to index tags in a sample AFP file.\nDefining link options for properties\nWhen you link document or job properties to index tags, you can define options for each property. These options apply to the property only\nwhen it is linked to the index tag.\nEditing text for index tags linked to properties\nYou can edit the text value for an index tag so that the document or job property contains only part of the index tag value. You might want to\nedit the text value to remove any leading or trailing blanks, or to remove unwanted special characters.\nConfiguring steps to identify documents in AFP files\nAfter you have linked document or job properties to index tags in a sample AFP file, you must configure the step that determines values for\ndocument or job properties in production AFP files. The step names the Visual Workbench control file that contains information about how\nproperties are linked to index tags.\nParent topic: Working with sample AFP files\n1 of 1"}]}