{"doc_name": "InserterReprintMethods.pdf", "doc_path": "data/raw/RPD-en-US/InserterReprintMethods.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2078, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Inserter reprint methods - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Inserter and Quadient Inserter Express / Inserter reprint methods\nInserter reprint methods\nThe inserter reprint method is how RICOH ProcessDirector reprints documents that are damaged during insertion.\nSome inserter controllers support only one type of reprint method. Other inserter controllers are configurable, so you can select the reprint\nmethod that you prefer.\nWhen you configure the inserter controller object, you select the reprint method in the Reprint method property.\nThere are two reprint methods:\nOpen loop\nRICOH ProcessDirector reprocesses the documents and creates a child job that contains the documents to be reprinted. The job number of\nthe child job is the original job number with a numeric suffix (for example, 1000001.1).\nThe child job starts processing from the first step in the current workflow. If the workflow contains a step that writes barcodes for insertion,\nthe barcodes are rewritten to include the new job number of the child job and the new insert sequence number of the document.\nRICOH ProcessDirector creates an inserter control file for the child job and sends it to the inserter controller. The inserter control file contains\na record for each document in the child job. If the record specifies the sequence number of the document, the sequence number is the new\nsequence number of the document in the child job.\nAfter the child job is created, the original job moves to the next step in the workflow. The original job is not removed from the system until\nthe child job is printed, inserted, and reconciled, and the retention time for the original job expires.\nClosed loop\nRICOH ProcessDirector does not reprocess the documents. It reprints the documents in the same job with the same job number. After all\ndocuments in the job have been reprinted, inserted, and reconciled, the job moves to the next step in the workflow.\nParent topic: Inserter and Quadient Inserter Express\n1 of 1"}]}