{"doc_name": "editingtext.pdf", "doc_path": "data/raw/RPD-en-US/editingtext.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 4042, "pages": [{"page": 1, "text": "2/4/26, 2:15 PM Editing text for triggers and index tags - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Editing text for triggers and index tags\nEditing text for triggers and index tags\nWhen you create or modify a trigger or an index tag, you can edit the text value. You can also edit the text value for existing index tags that are\ndefined in the AFP file or the Visual Workbench control file.\nYou might want to edit the text value to remove any leading or trailing blanks, or to remove unwanted special characters. When you edit a text\nvalue, make sure that you edit it so that it is appropriate for all page groups because the text values can be different in each page group.\nTo edit the text for a trigger or index tag:\n1. In RICOH Visual Workbench, open a sample AFP file. Then click Mode ⇒ AFP Indexer.\n2. Do one of these to open the Edit Value window:\nClick Tools ⇒ Index Tools ⇒ Edit Existing Indexes. Select an index tag from the drop-down list and click Edit.\nWhen creating or modifying a trigger or index tag, click one of these: Edit index value, Edit trigger, or Edit value.\n3. Select On for one or more of these options:\nType one character or a blank that you want to remove from the value. Remember that the character is case-sensitive.\nThen, select one of these buttons:\nStrip leading characters\nThe specified character is removed from the beginning of the value. For example, if you type a blank character, all\nblanks are removed from the beginning of the value.\nStrip trailing characters\nThe specified character is removed from the end of the value. For example, if you type a blank character, all blanks\nEdit by stripping\nare removed from the end of the value.\ncharacters\nStrip leading and trailing characters\nThe specified character is removed from the beginning and end of the value. For example, if you type a blank\ncharacter, all blanks are removed from the beginning and end of the value.\nStrip all characters\nThe specified character is removed from all positions in the value. For example, an account number is: 324-\n1443255-11. You can type a - to strip all - characters from the value.\nType a text string of one or more characters or blanks in the Specify delimiter string field to indicate where the text value\nis split into separate strings. Remember that the text is case-sensitive. Then select numbers for Select first string and\nEdit on Select number of strings to mark the beginning and end of the edited text.\ndelimiter For example, an account number is: 324-1443255-11. You can use - as the delimiter to split the value into these three\nstrings: 324, 1443255, and 11. To select the second and third strings, 1443255-11, select 2 for both Select first string\nand Select number of strings.\nEdit on Select numbers for Select first character position and Select number of characters to indicate the first character in the\ncharacter text value and how many characters are included.\nWhen you select the options in the window, the text value for the current page group, page in a page group, or supplemental page is\nedited based on your selections and the new value is displayed in the Edited text field.\nNote: The edit options are done in this order:\n1. Edit by stripping characters\n2. Edit on delimiter\n3. Edit on character\n4. Click OK.\nYou see one of these:\nIf you are creating or modifying a trigger or index tag, the new value is displayed in one of these fields: Edited index value, Edited trigger,\nor Edited value.\nIf you are editing an existing index tag, you see an asterisk (*) next to the index tag that you edited. You also see that Delete is now\ndisplayed in the window.\nDo this:\n1. Optional: To undo the edit you did to the index tag, click Delete. The index tag reverts to the original text and the asterisk (*) is\nremoved from the drop-down list. Delete is not displayed in the window if the drop-down list does not have any asterisks.\n2. Click OK.\nParent topic: Indexing AFP files\n1 of 1"}]}