{"doc_name": "pdfw_t_plugin_addaddress.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addaddress.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4989, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Defining an address block - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with document properties\n/ Defining an address block\nDefining an address block\nYou can define document properties in an address block in each document in a PDF file. After you define the document properties, you can\nextract and view them or save them in a text file.\nNote: Use the Define Multiple Properties function to define document properties for addresses if:\nThe address components are not in block form.\nYou want to give the document properties your own names.\nThe Define Address Block function assigns one or more components of the address text to the wrong document property.\nTo define an address block:\n1. Open a PDF file in Adobe Acrobat Professional and either load a control file that contains a page group definition or define a page group.\nTip:\nBefore you select an address block, look for the most complicated and longest example addresses in the PDF files that you are\ngoing to process. Include at least one complicated address in your sample file.\nFor example, the first document in your PDF file contains an address with three rows and the twenty-fifth document contains an\naddress with five rows. Draw the box around the five-row address, so you can work with the most complicated address. When you\nview document property values, you can verify that each document property in shorter address blocks has the proper value.\n2. Left-click just above the top left corner of an address area and drag the mouse to capture all rows of the address.\n3. Select Define Address Block from the popup menu.\n4. Examine the Selected Address section of the Define Address Block window. If you have not captured all the lines in the address block, click\nCancel and draw the box around the address again. Repeat this step until the address you want is displayed in the rows of the Selected\nAddress table.\n5. Type a Name for the address block.\n6. Use the Extraction Conditions section to specify the page in each document from which address block data will be extracted. Do either of\nthese:\nSelect Pages based on a rule, and then select a rule from the drop-down list. The default rule is First Front Only. You can also:\nClick the icon to define a new rule.\nClick the icon to go to the Rules Manager.\nImportant: The Last Back, Last Front, and Last Page rules do not work with address block extraction.\nSelect Specific pages and type the page in each document that you want.\nIf you specify multiple pages, RICOH ProcessDirector Plug-in for Adobe Acrobat extracts the address block from the last specified page in\neach document. Examples:\nYou specify pages 2–4. If a document has four or more pages, the address block is extracted from page 4. If a document has three\npages, the address block is extracted from page 3. If a document has two pages, the address block is extracted from page 2.\nYou specify pages 2,4. If a document has four or more pages, the address block is extracted from page 4. If a document has 2–3 pages,\nthe address block is extracted from page 2.\nYou specify pages 2–n. Because n represents the last page, the address block is extracted from the last page if the document has two or\nmore pages.\nImportant: If you specify only page n, RICOH ProcessDirector Plug-in for Adobe Acrobat does not extract the address block from\nany page in a document.\n7. Select an address type:\nAddress lines 1–7\nThis option defines seven document properties (Doc.Address.1 through Doc.Address.7) based on the first seven lines in the address block.\nSubsequent lines are ignored.\nU.S. addresses\nThis option defines eight document properties:\nDoc.Address.FullName\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Defining an address block - Jenski - Test portal- RPD Linux\nDoc.Address.Primary\nDoc.Address.Secondary\nDoc.Address.Other\nDoc.Address.City\nDoc.Address.State\nDoc.Address.ZipCode\nDoc.Address.CityStateZip\nEach component of address text in the Selected Address becomes a value for a document property in the Address Document Properties\narea.\n8. Check to make sure that each document property has the proper value.\n9. Click OK to create the document properties for the address block.\n10. Click Ricoh ⇒ View Document Property Values to verify the properties have the content you want.\n11. Optional: You can edit the address block definition by double-clicking its box or by right-clicking the box and selecting Edit.\n12. When you are ready to save all your enhancements to the PDF file, including the new document properties for the address block, click\nRicoh ⇒ Save Control File.\n13. Make the control file accessible by your RICOH ProcessDirector server and include its name and location in an IdentifyPDFDocuments step.\nThis control file must also contain the page group definition that defines the documents in the PDF files processed by that step.\nParent topic: Working with document properties\n2 of 2"}]}