{"doc_name": "pdfw_t_plugin_addrule.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_t_plugin_addrule.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 4919, "pages": [{"page": 1, "text": "2/4/26, 2:17 PM Defining a rule - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat / Working with rules / Defining a rule\nDefining a rule\nYou can define rules that specify conditions for markup. You can also define rules to set media and finishing options, or to extract data.\nBefore you define a rule, make sure you have defined each custom rule, document property, and conditional trigger that you want to use as\nconditions in the rule.\nTo define a rule:\n1. Click Ricoh ⇒ Manage Rules.\n2. Click the icon.\nRules are shown alphabetically by name.\nTip: In a markup dialog, you can define a rule by clicking the icon and edit a rule by clicking the icon.\n3. Type a Name for the rule. You can use alphanumeric characters, periods, underscores, spaces, and special characters (such as @, #, $, or\n%).\n4. Optional: Type a Description.\n5. Specify whether RICOH ProcessDirector Plug-in for Adobe Acrobat should apply the rule when any or all of its conditions are met.\n6. Specify the first condition.\n1. Click the down arrow for the Not set drop-down list.\n2. Click the + icon next to Predefined Rule, Custom Rule, Trigger, Job Property, Document Property, or Statistic and select the item you\nwant for the first part of the condition.\nIf a choice (such as custom rules, conditional triggers, or document properties) does not have any items, the choice is grayed out.\nNote: To display all items with a word in their names, type the word and press the down arrow key on your keyboard. You can\nalso type the word and click the down arrow for the drop-down list.\n3. Select a mathematical symbol, such as = (equals) or ≠ (does not equal), to compare the two parts of the condition.\n4. Specify the second part of the condition:\nFor a rule, select True or False.\nFor a conditional trigger, verify that the condition has the value you want. If not, select a new conditional trigger.\nFor a job property, document property, or statistic, type a value. You can also select any job property, document property, or\nstatistic.\n7. For a rule with multiple conditions, click the icon and specify the next condition.\nRepeat this step until you have defined all the conditions in the rule.\n8. Click OK to create the rule and add it to the Rules Manager.\nExamples\nRule with one condition: a pre-defined rule\nTo place markup on the first front page of each document, define a rule with a pre-defined rule as its only condition: First Front Only\n= True\nThree rules that each have one condition: a document property\nA job contains sales statements for members at three different levels based on sales performance: Bronze, Silver, and Gold. You want to\nidentify each membership level.\nIn RICOH ProcessDirector, define a document property: doc.member.level.\nIn RICOH ProcessDirector Plug-in for Adobe Acrobat, define three rules:\nGold Level\ndoc.member.level = GOLD\nSilver Level\ndoc.member.level = SILVER\nBronze Level\ndoc.member.level = BRONZE\nRule with multiple conditions\nA job contains sales statements for members at three different levels based on sales performance: Bronze, Silver, and Gold. You want to\nprint a reward coupon on the first page of each statement for Gold and Silver members. This example uses three rules defined in the\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:17 PM Defining a rule - Jenski - Test portal- RPD Linux\nprevious examples:\nFirst Front Only\nGold Level\nSilver Level\nFirst, define a Top Sales rule with two conditions, which you apply when any condition is met:\nGold Level = True\nSilver Level = True\nNext, define a Top Sales — First Front rule with two conditions, which you apply when all conditions are met.\nFirst Front Only = True\nTop Sales = True\nFinally, select the Add Image option. Apply settings by clicking Pages/documents based on conditions and selecting the Top Sales — First\nFront rule. Specify the path to the image.\nRule with one condition: a job property\nTo print VOID: DO NOT MAIL on each page of a test job:\nDefine a Test Job rule with a job property as its only condition: Job.TestJob = Yes\nSelect the Add Text option. Apply settings by clicking Pages/documents based on conditions and selecting the Test Job rule. Select Text as\nthe Content Type and type VOID: DO NOT MAIL for the value.\nRule with a condition that uses dynamic data\nWhen a statement has different addresses for billing and shipping, you want to print Order sent to shipping address on the statement:\nDefine two document properties: doc.shipping.address and doc.billing.address.\nDefine a Sent to Shipping Address rule with this condition: doc.shipping.address ≠ doc.billing.address\nSelect the Add Text option. Apply settings by clicking Pages/documents based on conditions and selecting the Sent to Shipping Address\nrule. Select Text as the Content Type and type Order shipped to shipping address for the value.\nParent topic: Working with rules\n2 of 2"}]}