{"doc_name": "aiw00p7.pdf", "doc_path": "data/raw/RPD-en-US/aiw00p7.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2493, "pages": [{"page": 1, "text": "2/4/26, 2:19 PM Viewing object logs - Jenski - Test portal- RPD Linux\nManaging objects\nManaging system objects / Viewing object logs\nViewing object logs\nYou can view the log for an object to see messages about its operations, such as property or state changes. Objects include servers, notifications,\nmedia, and devices such as input devices and printers. Features might add other kinds of objects as well.\nObject logs contain messages issued in the last 3 days. After 3 days, the log information is moved to audit files in the /aiw/aiw1/audit/object\ntype directory. However, job logs remain in the system as long as the job does. When the job is deleted, the log information is moved to the\naudit files.\nAudit files remain in the system for 28 days and then are automatically deleted. There is no size limit for logs.\nLog entries are sorted by the Time column, from the newest to the oldest entry.\nThe timestamp in an exported log is displayed in Greenwich Mean Time (GMT) followed by a plus sign (+) or a minus sign (−) and an offset\nrepresenting the number of hours that the local time of the issuing system is ahead (+) or behind (−) GMT. However, the timestamp in an object\nlog being viewed in RICOH ProcessDirector is displayed in the time zone of the browser that you are using.\nTo view the log for an object:\n1. Do one of these:\nFrom the Main page:\n1. Find the object in its portal or table.\n2. Right-click the object and select View Log.\nFrom the Administration page:\n1. In the left pane, click the object type.\n2. In the table, right-click the object and select View Log.\n2. You see the messages that were issued. All the message times are displayed in the time zone of the browser that you are using. If the text\nof a message is truncated, click the message entry. You see the complete text of the message at the bottom of the window.\n3. To sort the messages by message type or by another column, click the column heading.\nClick once to sort in ascending order; click twice to sort in descending order.\n4. To change what you see in the log, change the value of the Type and Range properties:\nType\nBy default, you see messages of all types. To only show certain types of messages, choose a value from the list.\nRange\nSelect All to see all of the messages in the log, filtered by the Type setting. Select Custom to limit the number of messages to a certain\nnumber of days or hours. Specify the days and hours in the Issued within property.\nParent topic: Managing system objects\n1 of 1"}]}