{"doc_name": "aiwtunesteptemplate.pdf", "doc_path": "data/raw/RPD-en-US/aiwtunesteptemplate.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 3474, "pages": [{"page": 1, "text": "2/4/26, 2:12 PM Tuning step templates - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows / Tuning step templates\nTuning step templates\nTuning a step template lets you specify how much system resource the step requires for processing. You can also specify which computers can\nrun the steps created from the step template.\nBefore you do this procedure, make sure that any application or secondary servers that you want to use for step processing are enabled and\nconnected. Note whether your computers are general-usage or restricted-usage computers.\nStep templates that let RICOH ProcessDirector access applications on other computers must be tuned to run on the server that those applications\nare installed on.\nThe RunExternalProgram and RunHotFolderApplication step templates (and any copies of them) can be tuned to run on the primary server, an\napplication server, or a secondary server.\nIf the RICOH ProcessDirector primary computer is a Linux system, step templates installed by some features must be tuned to run on application\nservers. These step templates (and any copies of them) must be tuned to run on application servers:\nRunPitStopOnJob\nRunFusionPro\nRunImpostripOnJob\nSome step templates installed by features (including document processing features) can only run on the primary server. If your environment\nincludes RICOH ProcessDirector application or secondary servers, you must tune these step templates to run only on the primary server:\nCreateInserterReprints\nCreateJobsFromDocuments\nCreateOrdersFromFile\nCreateReprints\nGroupDocuments\nInsertJobs\nReadBarcodeData\nReadDocumentsFromDatabase\nReadDocumentsFromParent\nSendInserterControlFile\nSetDocPropsFromConditions\nSetInsertProperties\nSetJobPropsFromOriginal\nUpdateDocumentsInDatabase\nWaitForDocumentCompletion\nWriteDocumentsToDatabase\nWriteInserterControlFile\nWritePropsToReportsDatabase\nThe BuildPDFFormDocuments step has unique tuning properties. If you use this step, review Optimizing BuildPDFFromDocuments steps topic\nfor information about optimizing it.\nTo tune a step template:\n1. Click the Workflow tab.\n2. In the left pane, click Step Templates.\n3. Click the name of the step template that you want to tune.\n4. Click the Tuning tab.\n5. In the Servers to use section, specify whether steps based on this step template run on any available server in the general pool, or if the\nsteps are restricted to selected servers.\nNote:\nDepending on the step template that you selected, you might be able to further classify where the step runs by operating system\ntype. The available operating systems are displayed in the Server operating systems list.\nFor example, you might have an external program that runs only on a specific operating system such as Windows. However, you\nhave a combination of a Linux primary server and Windows RICOH ProcessDirector application servers in the general-usage server\npool. This causes RICOH ProcessDirector to display both Linux and Windows in the operating system list. In this case, click Run on\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:12 PM Tuning step templates - Jenski - Test portal- RPD Linux\nservers in general server pool, deselect Linux, and select Windows.\nThe operating system list lets you select more than one operating system.\n6. In the Concurrent step limit section, specify where the limits are set for the number of steps created from the step template that can run at\nthe same time.\n7. Click OK.\nParent topic: Preparing to use workflows\n2 of 2"}]}