{"doc_name": "aiw00c34.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c34.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 11443, "pages": [{"page": 1, "text": "2/4/26, 2:10 PM Preparing to use workflows - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Preparing to use workflows\nPreparing to use workflows\nA workflow defines a set of steps that a job follows through the system. When you define a workflow, you specify what phases and, within\nthose phases, what steps the job passes through during processing.\nIn this section:\nCreating a workflow\nRICOH ProcessDirector provides several sample workflows. To create a workflow, you can modify one of these workflows or, to create a\nworkflow that is similar to an existing workflow, you can copy the existing workflow and edit it. Also, you can create a new workflow that has\nonly two steps, SetJobPropsFromTextFile and RemoveJobs, with a connector between them.\nAdding conditional processing to a workflow\nYou can add conditional processing to a workflow by specifying rules for the connectors between steps. For example, a rule might specify jobs\nwith fewer than 20 pages. The connector with that rule sends jobs to steps that request a cut sheet printer. Another connector sends all other\njobs to steps that request a continuous forms printer.\nRenaming a step in a workflow\nYou can rename a step in a workflow if needed.\nCreating a step chain\nIf you use the same set of connected steps in many of your workflows, you can create a step chain with those steps to use in your workflows.\nCopying step templates\nRICOH ProcessDirector provides step templates that you can use to create custom step templates. You can then use the custom step templates to\ndefine steps that you can add to workflows.\nSetting job defaults in a workflow\nWhen RICOH ProcessDirector assigns a workflow to a job, the SetJobPropsFromTextFIle step processes all of the steps in the workflow and\nassigns values to job properties set by those steps. Those values are used throughout the workflow unless an AssignJobValues step or a step that\ncan set job properties from a file changes them, such as SetDocPropsFromConditions.\nTuning step templates\nTuning a step template lets you specify how much system resource the step requires for processing. You can also specify which computers can\nrun the steps created from the step template.\nUsing workflow annotations\nYou can create annotations to write comments or reminders directly in your workflow. Add descriptions or comments to the steps, step chains,\nor connectors by using the annotations.\nCreating step resources\nA step resource identifies a file that is used by a workflow step for its processing. Some step templates allow you to specify a file for the step to\nuse when processing jobs. Some of these files might be created on your workstation but need to be available to the workflow when it processes\njobs. You can view, retrieve, and replace the file by editing the step resource object.\nHints for using step templates\nThese hints for using step templates help you choose the steps to place in a workflow, order the steps in the correct sequence, and take\nadvantage of conditional processing capabilities. The Workflow Editor does not validate workflows to make sure that steps are in the correct\nsequence or that conditional processing rules work.\nAdding a step that makes a job wait\nYou can add a step based on the Wait step template to a workflow to cause a job to wait a set amount of time or until a specified time to\ncontinue processing.\nAssigning workflows\nWhen an input file enters the RICOH ProcessDirector system, one of the first actions that the input device does is to assign a workflow to it. After\nthe input device assigns the workflow, the job can begin to move through the processing steps. There are several methods through which the\ninput device can assign the workflow. You configure the method to meet the requirements of the installation.\nComparing workflows\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:10 PM Preparing to use workflows - Jenski - Test portal- RPD Linux\nThe workflows comparison feature helps you analyze differences and similarities between two workflows directly from the Workflow Editor. You\ncan easily identify changes and similarities between steps, step chains, connectors, branches, or annotations in the workflows.\nAssociating service policies with workflows\nYou can associate a service policy with one or more workflows. The service policy calculates the planned checkpoints and the SLA deadline for all\njobs that use the workflow. Each workflow can have one associated service policy. To measure the performance of jobs using an SLA deadline,\nyou must also identify an SLA target step for the workflow.\nReplacing your control files with the sample files\nWhen you install a new version of RICOH ProcessDirector, the installer automatically adds new sample control files to the /aiw/aiw1/samples\ndirectory and copies them to your control files directory, /aiw/aiw1/control_files. It does not overwrite any of your customized control files\nin /aiw/aiw1/control_files. You can use the copyConfigurationFiles script to install the default control files or to overwrite your customized\ncontrol files.\nWorkflows for printing\nYou can define a workflow that lets you track a job that contains PDF data through the system.\nHolding jobs\nIf you do not want jobs to move through their workflow without human intervention, you can configure the workflows to hold jobs at a given\npoint. You can then have the operators do an action to release the jobs.\nExternal steps\nRICOH ProcessDirector lets you add steps that run a program outside of RICOH ProcessDirector. The external program can do special job-\nprocessing tasks and it can run on the same computer that has the RICOH ProcessDirector base product installed. It can also run on a Linux\nsystem that has a RICOH ProcessDirector secondary server feature installed, or on a Windows system that has an application server installed on it.\nDefining a workflow with preview printing\nTo print sample pages from a job so you can verify the output before you print the entire job, you must define a workflow that includes one or\nmore steps based on the PreviewPrint step template.\nSetting up a workflow that uses a Reformat step restart type\nTo move jobs from one printer to another, you might need to reformat the jobs. For example, a job is formatted to print 2-up on a continuous\nforms printer, but you need to move the job to a cut sheet printer where the data should be formatted 1-up. Scheduling the job to the printer is\nnot enough because the data in the job must be reformatted to print correctly on the printer. You must set up the workflow to reformat the job\nfor the printer.\nAdding steps to process deleted jobs\nYou can add steps to your workflow that process deleted jobs before removing them from the system.\nAdding steps to encrypt PDF files\nYou can add steps to your workflow that add password protection to PDF files and that restrict the actions that can be done to the PDF files.\nAdding steps to decrypt PDF files\nWhen RICOH ProcessDirector receives an encrypted PDF file, the file must be decrypted before it can be processed.\nDefining workflows to process XML\nTo process XML jobs, you define one or more workflows that manipulate the XML.\nDefining an error path in a workflow\nYou can add a branch in your workflow so that if a job goes into error state, the job continues processing in another path in the workflow\ninstead of staying in the Error state. You can define a branch out of any step in the workflow.\nCalling a REST web service from a workflow\nTo call a REST web service, identify the parameters used to call the REST web service. Test the exchange of data between RICOH ProcessDirector\nand the application. Then add a step based on the CallRESTService step template to the workflow.\nCalling a SOAP web service from a workflow\nTo call a SOAP web service, identify the parameters used to call the SOAP web service. Test the exchange of data between RICOH ProcessDirector\nand the application. Then add a step based on the CallSOAPService step template to the workflow.\nDefining a workflow that sends jobs to be transformed\nTo send print jobs to the RICOH ProcessDirector Transforms or the Advanced Transforms to be converted to a different data stream, you must\ndefine a workflow that includes one or more data stream conversion steps.\nDefining workflows or printers that use a color mapping table\nYou can specify the color mapping table used to print jobs at the job level or at the printer level.\nDefining a workflow to print AFP data to a PCL printer\nYou can define a workflow that accepts a print job in AFP format and sends it to a PCLOut printer. You cannot send PCL data to a PCLOut\nprinter; you must send PCL print jobs to Passthrough printers.\nWorkflow to print jobs created in the Documents table\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:10 PM Preparing to use workflows - Jenski - Test portal- RPD Linux\nTo print jobs that you create from documents in the Documents table, define a workflow that contains steps to create a job from the document,\nprint the job, and do any other processing steps required. You select the workflow in the Workflow field on the Create a Job page when you use\nthe Create Job action.\nAdding a step to convert XML elements into document properties\nYou can add a step based on the ApplyXSLTransform step template to a workflow to convert XML elements and their attributes into RICOH\nProcessDirector document properties.\nGrouping child jobs\nHot folder input devices can generate child jobs if they are configured to use a batching method. LPD input devices can receive multiple input\nfiles on a print command. However, LPD input devices with a Linux parent server cannot create parent jobs with multiple children. As a result,\none parent job and one child job are created for each input file. If the AFP Support feature is installed, Download input devices can create child\njobs from multi-dataset jobs received from Download for z/OS and AFP Download Plus, or the input devices can merge the jobs into a single job.\nConfiguring steps to identify documents in AFP files\nAfter you have linked document or job properties to index tags in a sample AFP file, you must configure the step that determines values for\ndocument or job properties in production AFP files. The step names the Visual Workbench control file that contains information about how\nproperties are linked to index tags.\nAdding steps to index AFP files\nAfter you create page groups and index tags in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more workflows\nto create page groups and index tags in production AFP files that use the workflows. The step names the Visual Workbench control file that\ncontains definitions for the page groups and index tags.\nAdding steps to edit AFP files\nAfter you create barcodes, text, or hidden areas in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more\nworkflows to create barcodes, text, or hidden areas in production AFP files that use the workflows. The step names the Visual Workbench\ncontrol file that contains the definitions for the barcodes, text, or hidden areas.\nAdding steps to fill white space in AFP files\nAfter you define white space in a sample AFP file using RICOH Visual Workbench, you must add a step to one or more workflows to fill the white\nspace with content in production AFP files that use the workflows. The step names the Visual Workbench control file that contains the\ndefinitions for the white space.\nParent topic: Configuring\n3 of 3"}]}