{"doc_name": "aiw00c4pass.pdf", "doc_path": "data/raw/RPD-en-US/aiw00c4pass.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5737, "pages": [{"page": 1, "text": "2/4/26, 2:11 PM Defining Passthrough printer objects - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Defining printer objects / Defining Passthrough printer objects\nDefining Passthrough printer objects\nPassthrough printer objects represent printers that can print jobs in formats such as PCL, PostScript, and PDF. Jobs are assigned to Passthrough\nprinters using these scheduling properties: Customer name, Job size, Location, Media, Output bin, Output format, Punch, Folding, Binding, and\nStaple. The AFP Support feature adds Class, Destination, and Form to the scheduling properties. Other scheduling properties may be defined in a\nconfiguration file. For Passthrough printers, RICOH ProcessDirector runs a command that is defined for the printer. RICOH ProcessDirector\nmonitors the response to the command, but cannot report status of the job that it sent.\nTo define a Passthrough printer object:\n1. Click the Administration tab.\n2. In the left pane, click Devices ⇒ Printers.\n3. Click Add ⇒ Passthrough Printer.\n4. On the General tab, fill in values for all the required fields.\nNote:\nThe value of the Printer command property depends on the print commands that are available on your system. Use the value of the\nPrinter name property as the value of the printer option of the command.\nBecause Passthrough printers cannot automatically determine the values of job properties, you must pass them to the printer. You\ncan pass the values of job properties in either of these ways:\nBy using symbols or RICOH ProcessDirector methods in the value of the required Printer command property, or in a script named\nin that value\nIn a file that you specify as the value of the optional Control file template property, only if the printer command uses a control file.\n5. On the Scheduling tab, enter the values that you want RICOH ProcessDirector to use to assign jobs to this printer. Leave the values blank or\nNot set for any properties that should not be used for scheduling. Those values match any values specified by the corresponding job\nscheduling properties.\nIf you want to schedule jobs to a printer based on media, keep these items in mind when you set the Media supported property:\nIf you choose specific media, only jobs that use that media can be scheduled to this printer.\nIf you choose Ready media objects, only jobs that require the media that is currently loaded in the printer can be scheduled to the printer.\nIf you choose All media, all jobs can be scheduled to the printer, regardless of what media is loaded.\n6. Click OK.\n7. If the parent server of the Passthrough printer runs a Red Hat-derived operating system, create a print queue with the same name as the\nPassthrough printer:\nNote:\nMake sure you meet these pre-requisites:\nYou have configured CUPS.\nYou have permissions in CUPS to manage printers.\n1. Log in as the root user.\n2. Use a browser and access https://hostname:631/admin/, where hostname is the host name or IP address.\n3. Click Add printer.\n4. Go to Other Network Printers and select LPD/LPR Host or Printer.\n5. In the connection field, type the hostname or IP address of the system where the LPD input device is defined. For example:\nlpd://hostname/queue\nwhere hostname is the host name or IP address and queue is the queue name.\n6. Click Continue.\n7. In the Add Printer dialog, enter the name, description, and location of the printer.\n8. Click Continue to select the printer make and model.\n9. Click Add Printer.\n10. Set the default options in the next dialog and click Set Default Options.\n8. If the parent server of the Passthrough printer runs SLES 12.0, create a print queue with the same name as the Passthrough printer:\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:11 PM Defining Passthrough printer objects - Jenski - Test portal- RPD Linux\n1. Log in to the operating system as the root user.\n2. Start YaST.\n3. Click Hardware ⇒ Printer. With Printer Configurations highlighted, click Add. Click Connection Wizard, and then select Line Printer\nDaemon (LPD) Protocol.\n4. In the IP Address or Host Name field, type the host name or IP address of the physical printer.\n5. Type PASS in the Queue Name field. Select the printer manufacturer, and click OK.\n6. In the Set Arbitrary Name field, type the name of the Passthrough printer. This name must be unique on this Linux system. Although\nprinter names are case-sensitive, Linux does not allow you to define multiple printer names that are alike except for case. For\nexample, you cannot define one printer object called OfficePrinter and another called officeprinter.\n7. Select a printer driver, then click OK.\nExamples of the Printer command property\nYou can set the Printer command property of a Passthrough printer to use an lpr command. These commands set the value of the -# flag to the\nvalue of the Job.Copies property of the job that is being printed. Both use the getCurrentFile method to return the file name and path of the file\nin the job spool directory that is in the specified data format. Substitute the name of the printer for printerName.\nlpr -P printerName -#${Job.Copies} ${getCurrentFile(pdf)}\nlprpdf -pprinterName -#${Job.Copies} ${getCurrentFile(pdf)}}\nIf the requested data format is PDF, and if the spool ID for the job is 1000006, the file name resolves to\n/aiw/aiw1/spool/default/1000006/1000006.print.pdf. If the name of the printer is officeprinter and the value of the Job.Copies property\nfor this job is 2, the printer command resolves to:\nlpr -P officeprinter -#2 /aiw/aiw1/spool/default/1000006/1000006.print.pdf\nOr\nlprpdf -pofficeprinter -#2 /aiw/aiw1/spool/default/1000006/1000006.print.pdf\nNote:\nPrinters support different lpr options, so the printer might not honor all options requested.\nParent topic: Defining printer objects\n2 of 2"}]}