{"doc_name": "ppfrsample_o_scen_PFRjobs.pdf", "doc_path": "data/raw/RPD-en-US/ppfrsample_o_scen_PFRjobs.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 2993, "pages": [{"page": 1, "text": "2/4/26, 2:23 PM Usage scenario for printing jobs on plain paper instead of preprinted paper - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / Document processing features / Preprinted Forms Replacement\n/ Usage scenario for printing jobs on plain paper instead of preprinted paper\nUsage scenario for printing jobs on plain paper instead of preprinted paper\nIn this scenario, a printing company wants to replace their preprinted paper with electronic forms that print on plain paper. They want to make\nthe replacements on a client-by-client basis, and they start by replacing the preprinted paper for Client A. They continue to print the jobs for all\ntheir other clients on preprinted paper.\nAn application at Client A submits jobs to the input device for the workflow that processes PDF jobs. The jobs specify Form For Client A as the\nmedia. The printing company already has a RICOH ProcessDirector media object named Form For Client A.\nTo replace the preprinted paper, the printing company creates a PDF file that uses the same page size as the preprinted paper and has the same\ncontent. The printing company adds the PDF file as an electronic form to the Form For Client A media object. While adding the form to the\nmedia object, the printing company selects None as the value of the Media name for printing property.\nThe printing company then adds a step based on the CombinePDFWithForm step template to the PDF workflow after the OptimizePDF step and\nbefore the CountPages step.\nBecause the printing company processes jobs for many different clients through the PDF workflow, they add a branch from the OptimizePDF step\nto the CountPages step. That branch bypasses the CombinePDFWithForm step.\nTo route the jobs for Client A through the CombinePDFWithForm step, the printing company sets this rule on the connector from the\nOptimizePDF step to the CombinePDFWithForm step: Job.CustomerName = 'Client A'. The value of the Order of execution property for\nthe rule is 1.\nAfter the printing company modifies the PDF workflow, the jobs from Client A move through the CombinePDFWithForm step. The step combines\nthe electronic forms defined for the Form For Client A media object with the job data and checks the value of the Media name for printing\nproperty. Because the value is None, the step removes all instances of the media name Form For Client A from the job. As a result, the job prints\non the printer default media. The jobs for all the other clients bypass the CombinePDFWithForm step and print on preprinted paper.\nThe PDF workflow modified by the printing company is similar to the ElectronicFormJobSample workflow supplied with the Preprinted Forms\nReplacement feature. The biggest difference between the workflows is the rule on the connector from the OptimizePDF step to the\nCombinePDFWithForm step. For more information about the ElectronicFormJobSample workflow, refer to the Information Center.\nParent topic: Preprinted Forms Replacement\n1 of 1"}]}