{"doc_name": "creatingindexesinaddressarea.pdf", "doc_path": "data/raw/RPD-en-US/creatingindexesinaddressarea.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 9715, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating index tags in address areas - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Indexing AFP files / Creating index tags\n/ Creating index tags in address areas\nCreating index tags in address areas\nYou can create index tags for mailing addresses in an address area.\nThe area must occur in a consistent location in each page group; however, it can consist of a variable number of lines. In the area, you can create\nan index tag for a ZIP Code that is in the U.S. Postal Service format.\nFor example, a customer address might consist of either 3 or 4 lines, with the ZIP Code always on the last line. First you identify the location and\nsize of the address area by drawing a box around an address that contains the maximum lines in the address: in this example, 4 lines. If the\nsample AFP file does not have an address with the maximum number of lines, draw a box large enough to include all possible lines in the address\narea. If you know the exact position and size of the address area, you can adjust the size of the box you drew by specifying the exact X offset, Y\noffset, height, and width of the address area. (X and Y offsets are from the origin of the logical page, not the physical sheet of paper.)\nNotes:\n1. If the AFP file does not contain page groups, create page groups. Otherwise, to create an index tag for an address area on a page outside a\npage group, see Creating index tags on supplemental pages.\n2. In RICOH Visual Workbench you can display measurement units in inches or millimeters. To change the measurement unit, click View ⇒\nUnits.\nNext you can create index tags for text on specific lines: the customer name on the first line, the city on the last line, and the state on the last\nline. Then you can create multiple index tags for the intermediate lines that contain the street address. Intermediate lines are the lines between\nthe specific lines that you indexed. The address area can contain a variable number of intermediate lines, as shown:\nJOHN SMITH <-- first line\n123 MAIN STREET <-- intermediate line 1\nSUITE 100 <-- intermediate line 2 (optional line)\nDENVER, CO 12345-6789 <-- last line\nIf the ZIP Code is in the U.S. Postal Service format (nnnnn or nnnnn-nnnn), AFP Indexer can automatically extract the ZIP Code on a line and\ncreate an index tag for it.\nNote: In an address area, you can create one or more index tags. For example, you can create an index tag for the ZIP Code without\ncreating index tags for any other text in the address area.\nTo create index tags in an address area:\n1. In RICOH Visual Workbench, open a sample AFP file that contains the addresses that you want to index in the format that you want to\nindex. Then click Mode ⇒ AFP Indexer.\n2. Navigate to an address that contains the maximum number of lines.\nIf you cannot find an address with the maximum number of lines, in the next steps either draw a larger area or specify the exact size of the\naddress area on the Position tab to include the maximum number of lines.\n3. To create the address area, position your cursor at a corner of the area that contains the entire address. While pressing the left mouse\nbutton, draw a box that includes all the lines in the address.\nThe address area must include the first character in the AFP text blocks that you want to index; however, it does not need to include all the\ntext because text blocks can contain text of variable length in different page groups. For example, a text block that contains a customer\nname might contain a short name in one page group and a long name in another page group.\n4. Right-click anywhere on the page and click Create Index Tags for an Address.\nYou see the Create Index Tags in an Address Area window.\n5. Check that the text you want to index is shown in the Index tags for intermediate lines field. If the text is not shown, click Cancel and\nredraw the area on the page, or click the Position tab to adjust the origin and size of the address area.\nNote: If the text displays correctly in the AFP file but incorrectly in the Index tags for intermediate lines field, try changing the default\ncode page (Resources ⇒ Modify Default Encoding). If the text still does not display correctly, this usually indicates that the code page\ndoes not use standard Unicode mapping. In this case, use the SampleCodePointMap.cp font-mapping file to create a code point\nmap file before proceeding.\n6. Optional: On the Position tab, change the origin (top-left corner) and size of the address area in these fields. Decimal values (such as 2.5)\nare allowed. Specify the values in inches or millimeters.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating index tags in address areas - Jenski - Test portal- RPD Linux\nX position\nThe horizontal distance of the left side of the area measured from the left side of the logical page (not the physical sheet of paper).\nY position\nThe vertical distance of the top of the area measured from the top of the logical page (not the physical sheet of paper).\nWidth\nThe horizontal width of the area.\nHeight\nThe vertical height of the area.\nNote: If you rotated the AFP file using the Rotate by 90o option on the View menu, measure the X and Y positions from the top-left\ncorner of the logical page in the unrotated view.\n7. On the Index Tags tab, type a descriptive name for the area in the Index area name field.\nFor example, if the area contains the customer's address, the name could be “Customer address area”.\n8. Specify the character or characters that you want to use to separate text blocks in the Character between text blocks field.\nThe default character that separates text blocks is one blank. If you want to concatenate the text in multiple text blocks, delete the blank\nfrom the field.\nIn the Index tags for intermediate lines field you see the text with the character that you specified, if any, shown between the text blocks.\n9. Optional: To create an index tag for a specific line in the area:\n1. Click Add.\n2. Use the default code page encoding or select an encoding from the drop-down list if the text displays incorrectly.\n3. Type a descriptive name for the index tag.\nFor example, if the line contains the customer name, the name could be “Customer”.\n4. Select the line that contains the text you want to index:\nTo select the first line or a line relative to the first line, click First line. Then use the drop-down list for this field to select a relative\nline. For example, select First line plus 1.\nTo select the last line or a line relative to the last line, click Last line. Then use the drop-down list for this field to select a relative line.\nFor example, select Last line minus 1.\n5. Decide whether you want to use the entire text value to create the index tag or only part of the text. To select part of the text as the\nindex tag, click Edit index value. Edit the index value in the Edit Value window and click OK.\nYou see the value of the index tag in the Edited value field.\n6. Clear the Create tag for an empty value field if you do not want AFP Indexer to create index tags with null values.\nOtherwise, an index tag contains the value “null” if the text that you indexed does not exist in a particular page group. For example,\nif a page group has an address that does not contain a country name, the index tag for country name is “null” for that page group.\n7. Click OK.\nYou see the index tag and the index tag value in the Index tags for specific lines field.\n10. Optional: To create another index tag with text on the same line or on a different line, click Add again.\nYou can create as many index tags for specific lines as you want in the area.\n11. Optional: To create index tags for the lines that are shown in the Index tags for intermediate lines field:\n1. Click Index intermediate lines.\n2. Specify the name for the index tags in the Index tag name field. For example, the name could be “Street”.\n3. Use the drop-down box next to the Index tag name field to select the number to append to the index tag for the first intermediate\nline.\n4. Use the default code page encoding or select an encoding from the drop-down list.\nAFP Indexer creates index tags for each intermediate line in the area; for example: “Street1” and “Street2”. AFP Indexer does not create\nindex tags for intermediate lines that do not exist in a page group. For example, if the address in a particular page group does not contain\nthe second intermediate line in the street address, AFP Indexer only creates index tag “Street1”.\n12. Optional: To create an index tag for a ZIP Code in the U.S. Postal Service format (nnnnn or nnnnn-nnnn):\n1. Click the ZIP Code tab.\nYou see the ZIP Code in the ZIP Code field.\n2. Type a descriptive name for the index tag.\nFor example, the name could be “ZIP Code”.\n3. Use the default code page encoding or select an encoding from the drop-down list.\n4. Clear the Create tag for an empty value field if you do not want AFP Indexer to create an index tag with a “null” value. Otherwise, if\nthe ZIP Code does not exist in a particular page group, the index tag for that page group contains the value “null”.\n13. Click OK.\nYou see the index tags listed in the bottom pane for each page group.\n14. Verify that the correct index tags have been created:\n1. Double-click the index tags in the bottom pane and verify that the correct pages in the page groups are displayed.\n2. If an index tag is incorrect, click Tools ⇒ Modify Definitions to modify or delete the tag.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:14 PM Creating index tags in address areas - Jenski - Test portal- RPD Linux\nThe index tag is listed under Page Group Definition ⇒ Page Group Indexes ⇒ Address Indexes.\nParent topic: Creating index tags\n3 of 3"}]}