{"doc_name": "tf_activate_appe.pdf", "doc_path": "data/raw/RPD-en-US/tf_activate_appe.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1807, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Activating the Adobe PDF Print Engine conversion program - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up datastream transforms / Activating the Adobe PDF Print Engine conversion program\nActivating the Adobe PDF Print Engine conversion program\nYou can use either the Adobe PDF Print Engine (APPE) or Configurable PostScript Interpreter (CPSI) conversion program to transform PDF data to\nAFP.\nWe recommend using APPE for these reasons:\nDirect conversion of PDF data to AFP.\nCPSI first converts PDF data to PostScript, and then converts PostScript data to AFP.\nSupport for modern PDF capabilities such as transparency and drop shadows.\nBetter performance for color jobs.\nBy default, the TransformJobIntoAFP step uses CPSI to convert PDF data to AFP.\nTo activate the Adobe PDF Print Engine conversion program:\n1. Click the Workflow tab.\n2. Click the name of a workflow that includes the TransformJobIntoAFP step.\n3. Optional: Disable the workflow by clicking the switch to the left of the workflow name.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n4. Click the name of the workflow.\n5. Right-click the TransformJobIntoAFP step and select Properties.\n6. On the External tab, find the External control file template property.\n7. Change the value of the property from /aiw/aiw1/control_files/external_programs/prepare_transform.cfg to\n/aiw/aiw1/control_files/external_programs/prepare_transform_APPE.cfg.\nBoth control files convert PostScript, PCL, and SAP data to AFP.\n8. Click OK.\n9. Save and enable the workflow.\nParent topic: Setting up datastream transforms\n1 of 1"}]}