{"doc_name": "slaassociatingwithjobtype2.pdf", "doc_path": "data/raw/RPD-en-US/slaassociatingwithjobtype2.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3611, "pages": [{"page": 1, "text": "2/4/26, 2:18 PM Associating service policies with workflows - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Setting up Deadline Tracker / Setting up service policies / Associating service policies with workflows\nAssociating service policies with workflows\nYou can associate a service policy with one or more workflows. The service policy calculates the planned checkpoints and the SLA deadline for all\njobs that use the workflow. Each workflow can have one associated service policy. To measure the performance of jobs using an SLA deadline,\nyou must also identify an SLA target step for the workflow.\nIf more than one service policy applies to a workflow, you might need to create additional workflows. For example, if you have created two\nservice policies – one for jobs from client ABC and another for jobs from client XYZ – and both clients use workflow PDF, you could create\nanother PDF workflow. The workflows can have identical properties except for the associated service policy. You might, for example, name the\ntwo workflows PDF.ABC and PDF.XYZ.\nIf you change which service policy is associated with a workflow, RICOH ProcessDirector uses the new service policy to set the checkpoints and\ndeadline for new jobs that arrive in the system. It does not use the new service policy for existing jobs unless you use the Process Again action to\nreprocess a job from the first step.\nIf you delete a no-service period, checkpoint and deadline times for jobs that are already in the system do not change, even if they were set using\nthat no-service period. To reset the checkpoint times, you must reprocess the job from the beginning.\nIf a workflow or an authorized user changes the Adjusted arrival time property for a job, RICOH ProcessDirector recalculates the checkpoints for\nthe job. Depending on the service policy, sometimes the checkpoints and the deadline change:\nIf the service policy specifies the Cutoff adjustment method and a start time that is later than the old adjusted arrival time and earlier than the\nnew adjusted arrival time, the checkpoints change from the day of the old adjusted arrival time to the day after the new adjusted arrival time.\nIf the service policy specifies the Cutoff adjustment method and a start time that is later than both the old and new adjusted arrival times, the\ncheckpoints remain the same.\nIf the service policy specifies Elapsed time as the Deadline calculation method, the SLA deadline is recalculated from the Adjusted arrival time.\nIf the service policy specifies Specific time as the Deadline calculation method, the SLA deadline is not recalculated.\nTo associate a service policy with a workflow:\n1. Click the Workflow tab.\n2. Optional: Right-click the name of the workflow and select Disable.\nIf you do not disable the workflow while you edit it, jobs that use this workflow continue to move through steps. When you save, the\nworkflow is momentarily disabled then enabled again. Jobs that are processing in the workflow could move into error.\n3. Right-click the name of the workflow and select Properties.\n4. In the Service policy property, select the service policy.\n5. In the SLA target step property, select the step that represents the ultimate goal of the SLA.\nFor example, if the SLA relies on printing the job by a given time, select the PrintJobs step. If the SLA relies on delivering the printed output\nto another department for inserting, you can create a manual step called DeliverToInserter and select that step as the SLA target step.\n6. Click OK.\n7. Save and enable the workflow.\nParent topic: Setting up service policies\n1 of 1"}]}