{"doc_name": "pdfw_c_enhancingpdffiles.pdf", "doc_path": "data/raw/RPD-en-US/pdfw_c_enhancingpdffiles.pdf", "num_pages": 2, "nonempty_pages": 2, "total_chars": 5779, "pages": [{"page": 1, "text": "2/4/26, 2:16 PM Using RICOH ProcessDirector Plug-in for Adobe Acrobat - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Using RICOH ProcessDirector Plug-in for Adobe Acrobat\nUsing RICOH ProcessDirector Plug-in for Adobe Acrobat\nYou use this software to enhance a PDF file by adding markup, such as barcodes, and by defining document properties using data in the PDF file.\nIn the RICOH ProcessDirector IdentifyPDFDocuments and BuildPDFFromDocuments steps, you specify the RICOH ProcessDirector Plug-in for\nAdobe Acrobat control files that contain the markup and document properties definitions, to apply the same enhancements in PDF files that you\nprocess on RICOH ProcessDirector.\nIn this section:\nRICOH ProcessDirector Plug-in for Adobe Acrobat\nRICOH ProcessDirector Plug-in for Adobe Acrobat is an Adobe Acrobat Professional plug-in that you use to define and display enhancements in a\nPDF file that represents the PDF files that are processed by the steps in your workflows.\nAdding the plug-in icon to the Acrobat quick launch bar\nBefore you can mark up a PDF file, you must make the plug-in the active tool in Adobe Acrobat. Clicking the plug-in icon is a convenient\nalternative to clicking Ricoh ⇒ Select in the menu bar. You can permanently place the RICOH ProcessDirector Plug-in for Adobe Acrobat icon on\nthe Adobe Acrobat quick launch bar.\nPreferences\nYou can set preferences for RICOH ProcessDirector Plug-in for Adobe Acrobat to customize it for the way that you process PDF files.\nUnits of measure\nRICOH ProcessDirector Plug-in for Adobe Acrobat uses the units of measure from the Pages & Ruler Units you set in Adobe Acrobat preferences.\nLoading RICOH ProcessDirector document properties\nTo use RICOH ProcessDirector Plug-in for Adobe Acrobat to define text in a PDF file as a RICOH ProcessDirector document property, you must\nimport the list of RICOH ProcessDirector document properties.\nLoading media objects\nAfter installing RICOH ProcessDirector Plug-in for Adobe Acrobat, load RICOH ProcessDirector media objects. After you load them, you can use\nthem to define media and finishing options for specific pages in a PDF file.\nUser interface\nThe plug-in user interface consists of the Ricoh menu added to Adobe Acrobat, a right mouse button popup menu, a left mouse button popup\nmenu, and windows that you use to perform RICOH ProcessDirector Plug-in for Adobe Acrobat functions.\nPreviewing markup\nAfter you add markup to a sample PDF file, you can preview markup placement. Previewing lets you verify that PDF files are going to print as\nexpected when RICOH ProcessDirector applies the markup that you saved to a control file. Preview also lets you verify that media and finishing\noptions are going to be applied to the intended pages.\nWorking with control files\nAs you use RICOH ProcessDirector Plug-in for Adobe Acrobat to mark up a PDF file, instead of saving markup in the PDF file itself, you save\nmarkup to one or more control files. RICOH ProcessDirector Plug-in for Adobe Acrobat uses a control file to extract data, and RICOH\nProcessDirector uses control files in the different stages of preparing a PDF file for printing.\nModifying markup definitions\nAfter you add markup to a PDF file, you might need to delete the markup, move it to a new location, or modify its properties. RICOH\nProcessDirector Plug-in for Adobe Acrobat provides several ways to edit and delete markup, document properties, and a page group definition.\nDefining a page group\nA page group defines the pages ranges for each document in your PDF file. You save one page group definition to the control file that you\nspecify in a RICOH ProcessDirector IdentifyPDFDocuments step. We recommend that you define a page group before you add markup.\nWorking with document properties\nYou can define document properties from data in your PDF file that you want to use for later print processing. When RICOH ProcessDirector\nprocesses PDF files with document property definitions, it extracts, or mines, values from each page group in a PDF file. For example, you can\ncreate document properties to extract data in each page group in a PDF file and define that data as the content of a barcode that prints on a\npage in the same page group.\nWorking with rules\n1 of 2"}, {"page": 2, "text": "2/4/26, 2:16 PM Using RICOH ProcessDirector Plug-in for Adobe Acrobat - Jenski - Test portal- RPD Linux\nA rule is a set of one or more conditions. You can apply the conditions specified by a rule to place markup, extract data, or specify media and\nfinishing options. You can also include a rule as a condition within another rule.\nAdding markup to a PDF file\nYou use RICOH ProcessDirector Plug-in for Adobe Acrobat to add markup to a PDF file that represents your production PDF files. You mark up a\nPDF file by drawing a box around existing content or by drawing a box to add new markup. You can preview the PDF file as you add markup to\nverify its content and placement on specific pages. When you are done enhancing the sample PDF file, you save your changes to one or more\ncontrol files and make them accessible by a RICOH ProcessDirector server so it can apply the control files to production PDF files.\nWorking with page inserts\nThe Inserts Manager dialog shows information about page inserts from other PDF files. You can add, edit, and delete page inserts. You also can\nset the order in which RICOH ProcessDirector adds the inserts to the documents in a job when the BuildPDFFromDocuments step runs.\nMedia and finishing\nYou can specify media and finishing options for your sample PDF file and apply them as page exceptions to the job-level media and finishing\noptions specified for RICOH ProcessDirector jobs.\nParent topic: Configuring document processing features\n2 of 2"}]}