{"doc_name": "creatingfontmappings.pdf", "doc_path": "data/raw/RPD-en-US/creatingfontmappings.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 6012, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Creating font mappings from text blocks - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Mapping fonts for AFP files / Creating font mappings from text blocks\nCreating font mappings from text blocks\nWhen RICOH Visual Workbench cannot display text in an AFP file correctly, you can use text blocks in the file to create font mappings.\nThe font mapping can be for a character set, code page, or coded font. You can map an AFP character set to a Java font, an AFP code page to a\nJava character set, or an AFP coded font to an AFP character set and AFP code page.\nNote:\nCode page mappings make text readable, while character set mappings change how text is displayed in RICOH Visual Workbench.\nTo create a font mapping from a text block:\n1. In RICOH Visual Workbench, open a sample AFP file.\n2. Click Mode and a feature.\n3. Click a text block.\nYou see a red box around the text you selected.\nThe text blocks you can select are defined in the AFP file, from one character to the entire line of text. For example, the text “Account\nSummary” might be defined as two text blocks. You can click either the “Account” or “Summary” text block.\n4. Right-click anywhere on the page and click Create Font Mapping.\nYou see the Create Font Mapping window.\n5. Click one of these for the font mapping type:\nCharacter Set (default)\nCoded Font (only available if the text block references a coded font)\nCode Page\nThe fields and buttons on the window change depending on which font mapping type you select. Font mapping fields and buttons\ndescribes the fields and buttons that are displayed for font mapping.\nFont mapping fields and buttons\nField or button Font Mapping Type Description\nAdd Character Set The action for adding a new global\nidentifier to the drop-down list for the\ncharacter set.\nCharacter Set Name Character Set Identifies one of these:\nCode Page The name of a defined set of characters\nCoded Font for AFP. The name usually begins with\n\"C\". The second character in standard\nAFP character set names indicates the\ncharacter rotation. A question mark (?) is\nused as a wildcard character for the\nsecond character of the character set\nname and means that the identifier\napplies to all rotations.\nNote: DEFAULT is used for the\nidentifier of the AFP character set\nwhen RICOH Visual Workbench\ncannot locate the resource for a\ncoded font.\nThe name of a defined Java character set\nencoding.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:14 PM Creating font mappings from text blocks - Jenski - Test portal- RPD Linux\nField or button Font Mapping Type Description\nCoded Font Name Coded Font The name of the AFP coded font that\nassociates an AFP code page and an AFP\ncharacter set. For double-byte fonts, a\ncoded font associates multiple pairs of code\npages and font character sets.\nCode Page Name Code Page The name of the AFP code page that\nCoded Font assigns code points to graphic characters.\nThe name usually begins with “T1”.\nNote: DEFAULT is used for the\nidentifier of the AFP code page when\nRICOH Visual Workbench cannot\nlocate the resource for a coded font.\nDBCS Code Page The code page is a double-byte character\nset in which each character is represented\nby two bytes. You cannot change this field.\nText Example Character Set The text block you selected in the AFP file.\nCode Page\nFamily Name Character Set The name of the Java font family.\nGlobal Identifier Character Set A 1- to 5-digit decimal global character set\nCode Page graphic identifier (GCSGID) or code page\nglobal identifier (CPGID). The values are\n00001 to 65534.\nPoint Size Character Set The height of the characters in a font. One\ntenth of the value is the point size. For\nexample, a value of 90 represents a 9-point\nfont. Valid values are whole numbers from\n1 to 990.\nSBCS Code Page The code page is a single-byte character set\nin which each character is represented by a\n1-byte code point. You cannot change this\nfield.\nShow CharSets Character Set The action for viewing which character sets\ncurrently use the global identifier displayed\nin the Global Identifier field.\nShow Common Character Set The action for viewing which character sets\nCode Page or code pages currently use the global\nidentifier displayed in the Global Identifier\nfield.\nStyle Character Set The style of the Java font. Valid values are:\nBOLD, BOLD|ITALIC, ITALIC, and PLAIN.\n6. Do one of these, depending on which font mapping type you selected:\nFor Character Set, do one of these:\nSelect a different global identifier from the drop-down list. You can click Show Common to view which character sets currently use the\nselected global identifier and then click X in the upper right corner to close the window.\nClick Add to create a new global identifier:\n1. Type a 1- to 5- digit identifer in the Global Identifier field.\n2. Click Show CharSets to view which character sets currently use the selected global identifier. Click X in the upper right corner to\nclose the window.\n3. Type a point size.\n4. Select a family name and style for the Java font from the drop-down lists.\n5. Click OK.\nThe family name and style for the Java font are updated. The example of the text block you selected in the AFP file is also updated.\nFor Coded Font:\n1. Type an AFP character set name. The name usually begins with \"C\".\n2. Type an AFP code page name. The name usually begins with \"T1\".\nFor Code Page:\n1. Select a different global identifier from the drop-down list.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:14 PM Creating font mappings from text blocks - Jenski - Test portal- RPD Linux\n2. Click Show Common to view which code pages currently use the selected global identifier. Click X in the upper right corner to close\nthe window.\nThe Java character set name is updated. The example of the text block you selected in the AFP file is also updated.\n7. Click OK.\nThe font mapping is created in the control file. To keep the font mappings, be sure to save the control file before exiting the AFP file.\nParent topic: Mapping fonts for AFP files\n3 of 3"}]}