{"doc_name": "cac_CMRModeLink.pdf", "doc_path": "data/raw/RPD-en-US/cac_CMRModeLink.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 1975, "pages": [{"page": 1, "text": "2/4/26, 2:22 PM Link Processing Mode - Jenski - Test portal- RPD Linux\nOverview\nOverview / Color and Grayscale Printing / AFP Color Management / Color Management Resources / CMR Processing Modes / Link Processing Mode\nLink Processing Mode\nCMRs with the link processing mode are used to link an input color space in the presentation data (sometimes defined by an audit CMR) to the\noutput color space of the presentation device (sometimes defined by an instruction CMR). Only link (LK) and device link (DL) CMRs can be used\nin link processing mode.\nWhenever you install or uninstall audit or instruction color conversion CMRs in your resource library by using AFP Resource Installer or a similar\nsoftware product, the AFP Resource Installer automatically creates or deletes link (LK) CMRs for every combination of audit and instruction color\nconversion CMR.\nWhen a print job calls for a given audit-instruction combination, the print server checks the resource library for a link (LK) CMR for that\ncombination. If the print server finds an appropriate link CMR, it sends the CMR to the printer with the print job. Your printer can use the link\n(LK) CMRs whenever a print job indicates that it uses a particular combination of audit and instruction CMRs.\nIf you do not use AFP Resource Installer or a similar program to install your resources, your color printer must either create link (LK) CMRs while it\nprocesses your print jobs or convert the colors in your jobs twice, first from the original color space to the PCS and then from the PCS to the\ncolor space of the printer.\nAn InfoPrint 5000 printer creates link (LK) CMRs so it only has to do one conversion, and saves them so they can be used with other print jobs.\nHowever, the link (LK) CMRs are sometimes removed during normal operation, such as if the printer runs out of storage or is shut down.\nOther topics in this section:\nAudit Processing Mode\nInstruction Processing Mode\nParent topic: CMR Processing Modes\n1 of 1"}]}