{"doc_name": "reportsPostgresql_o_scen_Reports.pdf", "doc_path": "data/raw/RPD-en-US/reportsPostgresql_o_scen_Reports.pdf", "num_pages": 1, "nonempty_pages": 1, "total_chars": 3312, "pages": [{"page": 1, "text": "2/4/26, 2:24 PM Usage scenario for Reports - Jenski - Test portal- RPD Linux\nOverview\nOverview / Product overview / Features / No-charge product enhancement features / Reports / Usage scenario for Reports\nUsage scenario for Reports\nIn this scenario, a printing company wants to generate daily reports that show the pages printed on each printer and the jobs printed by each\ncustomer. They want to create a reporting dashboard with the two reports and publish the dashboard to a server that company management\ncan access.\nThe printing company installs the Reports feature on their RICOH ProcessDirector for Windows primary server, which includes the PostgreSQL\ndatabase program. Then, they open the Administration page and select Reports ⇒ Database Settings to create the reports database.\nThe printing company wants to generate two reports: Pages printed by printer and Jobs printed by customer. They can collect that data for both\nof those reports using the Job Print Progress data collector. For the first report, they need to capture the Pages stacked and Previous Printer job\nproperties; for the second report, they need to capture the Job number and the Customer name properties.\nThe user selects Reports ⇒ Data Collectors and opens the Job Print Progress data collector. On the data collector property notebook, the user\nfinds the Job properties to capture list and selects these properties:\nPages stacked\nPrevious Printer\nJob number\nCustomer name\nThe user names the table job_printing and enables data collection for the data collector.\nAfter the user clicks OK, RICOH ProcessDirector captures the values of the properties in the PostgreSQL database each time that a job starts or\nstops printing.\nAfter enabling data collection for the job_printing table and populating it with data, the printing company installs the Tableau business\nintelligence (BI) tool on a remote server. They configure RICOH ProcessDirector to let Tableau connect to the PostgreSQL database remotely.\nUsing Tableau, the printing company connects to the job_printing table in the PostgreSQL database. They choose to update the data in Tableau\nautomatically when the data is captured in PostgreSQL.\nTo prepare the Pages printed by printer report, the printing company:\nCreates a worksheet named Pages printed by printer.\nPopulates the worksheet with the values of the Job.PreviousPrinter and Job.PagesStacked properties.\nRenames Job.PreviousPrinter to Printer and Job.PagesStacked to Pages.\nChooses a pie chart to visualize the data.\nWhen the printing company finishes preparing the report, they save the worksheet as a Tableau workbook (TWB) file.\nTo set up the Jobs printed by customer report, the printing company:\nCreates a worksheet named Jobs printed by customer.\nPopulates the worksheet with the values of the Job.ID and Job.CustomerName properties.\nRenames Job.ID to Job and Job.CustomerName to Customer.\nChooses a bar chart to visualize the data.\nWhen the printing company finishes preparing the report, they save the worksheet as a Tableau workbook (TWB) file.\nThe printing company creates a reporting dashboard with the two reports and saves the dashboard as a Tableau workbook (TWB) file. The\nworkbook is then published to a server that company management can access to display the dashboard.\nParent topic: Reports\n1 of 1"}]}