{"doc_name": "barcode_type_tab.pdf", "doc_path": "data/raw/RPD-en-US/barcode_type_tab.pdf", "num_pages": 3, "nonempty_pages": 3, "total_chars": 5257, "pages": [{"page": 1, "text": "2/4/26, 2:14 PM Type tab - Jenski - Test portal- RPD Linux\nConfiguring\nConfiguring / Configuring document processing features / Working with sample AFP files / Editing AFP files / Creating barcodes / Type tab\nType tab\nOn the Type tab, you specify the name of the barcode area, the type of barcode that you want to create, and the properties of the barcode.\nFields on the Type tab\nField Value Description\nBarcode name Any combination of a-z, The name of the barcode area. For example, if the barcode is an Intelligent Mail\nA-Z, 0–9, special barcode (IMB), you could name the barcode “IMB”.\ncharacters, and blanks.\nBarcode type Code 39 (3-of-9 Code) A low-density barcode that can encode uppercase letters, numbers, and some\nspecial characters.\nData Matrix A two-dimensional (2D) barcode consisting of black and white square modules\narranged in either a square or rectangular pattern. This barcode uses the\nSolomon-Reed error correction algorithm (ECC 200) to ensure data reliability.\nIntelligent Mail (IMB) A barcode defined by the United States Postal Service (USPS) that is used to\ndirect and track mail. This barcode was previously called a USPS Four-State\nbarcode.\nInterleaved 2-of-5 A high-density barcode that can encode numbers.\nPDF417 A two-dimensional (2D) barcode that consists of several rows, each of which is\nlike a small linear barcode. The barcode can detect and correct errors.\nPOSTNET A barcode defined by the USPS that is used to direct mail.\nQR Code A two-dimensional (2D) matrix barcode that consists of black and white square\nmodules arranged in a square pattern. The contents of this “Quick Response”\ncode can be decoded at high speed. This barcode uses the Solomon-Reed error\ncorrection algorithm (ECC 200) to ensure data reliability.\n1 of 3"}, {"page": 2, "text": "2/4/26, 2:14 PM Type tab - Jenski - Test portal- RPD Linux\nField Value Description\nBarcode representation Output type\nBCOCA object AFP Editor creates barcode objects using Bar Code Object Content Architecture\n(BCOCA) structured fields. In general, BCOCA barcodes are preferred to text\nbarcodes. However, some older printers cannot process newer barcode types. For\nexample, IBM 3900 printers cannot process IMBs. In this case, text barcodes are\nrequired.\nThis is the default.\nText barcode AFP Editor creates text barcodes that use the AFP barcode font.\nNotes:\n1. This option is currently available only for IMBs.\n2. AFP Editor uses the 300 dpi AFP IMB font (US23), which produces a\nstandard height barcode: character set C0XMUS23 and code page\nT100USPS.\nOutput size\nOptimal Size AFP Editor creates BCOCA barcodes so they are displayed in the best size for\nviewing and printing. This is the default.\nNote: This option is currently available only for IMBs.\nCompact Size AFP Editor creates BCOCA barcodes so they are displayed in a compact size.\nNote: This option is currently available only for IMBs.\nThis table describes the fields on the Type tab that let you specify barcode properties. The fields differ for each barcode type.\nFields on the Type tab for barcode properties\nBarcode type Field Description\nCode 39 (3-of-9 Code) Include check digit A check digit ensures data integrity during the bar coding reading process. If you\nselect Yes, a check digit is included in the barcode symbol.\nData Matrix Number of rows The number of rows in the barcode including the finder pattern. If you select Auto,\nan appropriate number of rows is used for the amount of data in the barcode\nsymbol.\nRow size The number of modules in each row including the finder pattern. The row sizes you\ncan select depend on the number of rows. If you select Auto, an appropriate row\nsize is used for the amount of data in the barcode symbol.\nIntelligent Mail (IMB) None None\nInterleaved 2-of-5 Include check digit A check digit ensures data integrity during the bar coding reading process. If you\nselect Yes, check digit is included in the barcode symbol.\nPDF417 Row size The number of data symbol characters in each row. The printer creates the minimum\nnumber of rows necessary for the amount of data in the barcode symbol.\nPOSTNET ZIP Code barcode The barcode symbol consists of a leading frame bar, the encoded ZIP Code data, a\ncorrection digit, and a trailing frame bar. The ZIP Code data is a 5-digit number.\nZIP Code+4 barcode The barcode symbol consists of a leading frame bar, the encoded ZIP+4 data, a\ncorrection digit, and a trailing frame bar. The ZIP+4 data is a 9-digit number.\nAdvanced Bar Code (ABC) The barcode symbol consists of a leading frame bar, the encoded ABC data, a\ncorrection digit, and a trailing frame bar. The ABC data is an 11-digit number.\nVariable-length barcode The barcode symbol consists of a leading frame bar, the encoded data, a correction\ndigit, and a trailing frame bar. The encoded data is variable length.\nQR Code Size The size of the barcode symbol, represented by the number of modules in each row\nand column. The values are 21x21 to 177x177, or “smallest”, which indicates the\nsmallest size that can include all data.\n2 of 3"}, {"page": 3, "text": "2/4/26, 2:14 PM Type tab - Jenski - Test portal- RPD Linux\nOther topics in this section:\nData tab for Code 39, Data Matrix, Interleaved 2-of-5, PDF417, POSTNET, and QR Code barcodes\nData tab for IMBs\nPosition tab\nParent topic: Creating barcodes\n3 of 3"}]}